[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T23:01:23.014198+00:00",
        "description": "Indian teenager Gukesh Dommaraju made history by defeating China's Ding Liren to become the youngest world chess champion at 18, sealing a dramatic 7.5-6.5 victory in the 14-game match. The Guardian reports: The 18-year-old from Chennai dramatically snatched the decisive victory from a dead-drawn position in the final contest of their best-of-14-games showdown when Ding made one of the worst blunders in the 138-year history of world championship matchplay. The 32-year-old defending champion resigned moments later after a game that lasted 58 moves and just over four hours, sealing Gukesh's 7.5-6.5 win in the three-week match and rendering moot the widely expected prospect of tiebreaker matches on Friday afternoon.\n \nIn doing so, Gukesh shattered the age record held by Garry Kasparov, who was 22 when he toppled Anatoly Karpov in 1985. Gukesh admitted he didn't initially recognize Ding's rook move (55 Rf2??) as a blunder, saying it took a few seconds to spot that his opponent's bishop w",
        "id": 1699821,
        "language": null,
        "link": "https://games.slashdot.org/story/24/12/12/2111251/gukesh-dommaraju-becomes-youngest-world-chess-champion?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Gukesh Dommaraju Becomes Youngest World Chess Champion",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T23:01:22.928943+00:00",
        "description": "An anonymous reader quotes a report from Tom's Hardware, written by Avram Piltch: Microsoft's Recall feature recently made its way back to Windows Insiders after having been pulled from test builds back in June, due to security and privacy concerns. The new version of Recall encrypts the screens it captures and, by default, it has a \"Filter sensitive information,\" setting enabled, which is supposed to prevent it from recording any app or website that is showing credit card numbers, social security numbers, or other important financial / personal info. In my tests, however, this filter only worked in some situations (on two e-commerce sites), leaving a gaping hole in the protection it promises.\n \nWhen I entered a credit card number and a random username / password into a Windows Notepad window, Recall captured it, despite the fact that I had text such as \"Capital One Visa\" right next to the numbers. Similarly, when I filled out a loan application PDF in Microsoft Edge, entering a soci",
        "id": 1699820,
        "language": null,
        "link": "https://slashdot.org/story/24/12/12/2121238/microsoft-recall-screenshots-credit-cards-social-security-numbers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Recall Screenshots Credit Cards, Social Security Numbers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T21:55:25.972245+00:00",
        "description": "An anonymous reader shares a report: Deep in the Canadian Arctic, scientists and entrepreneurs brave sub-zero temperatures, whipping winds and snowstorms to drill holes through the sea ice to pump out the seawater below and freeze it on the surface. The group from the UK start-up Real Ice is in Cambridge Bay, a tiny coastal village in Nunavut, to try to prove they can grow and restore Arctic sea ice. \n\nTheir ultimate plan is to thicken ice over more than 386,000 square miles of the Arctic -- an area more than twice the size of California -- with the aim of slowing down or even reversing summer ice loss and, in doing so, help to tackle the human-caused climate crisis. It's a bold plan, and one of many controversial geo-engineering proposals to save the planet's vulnerable polar regions that range from installing a giant underwater \"curtain\" to protect ice sheets, to sprinkling tiny glass beads to reflect away sunlight. \n\nSome Arctic scientists and experts have criticized Real Ice's me",
        "id": 1699479,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/12/2056223/a-controversial-plan-to-refreeze-the-arctic-is-seeing-promising-results?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "A Controversial Plan To Refreeze the Arctic is Seeing Promising Results",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T21:55:25.721418+00:00",
        "description": "Yahoo laid off around 25% of its cybersecurity team -- known as The Paranoids -- over the last year, TechCrunch has learned. From the report: Overall, the company has laid off or lost through attrition 40 to 50 people from a total of 200 employees in the cybersecurity team since the start of 2024, according to multiple current and former Yahoo employees who spoke to TechCrunch on condition of anonymity. (Yahoo is TechCrunch's parent company.) \n\nThe Paranoids are not the only team affected by the layoffs. Valeri Liborski, who was appointed Yahoo's chief technology officer in September, sent an email this week to employees announcing changes across the broader technology unit, including enterprise productivity and core services. The email to staff, which was obtained by TechCrunch, said: \"This was a very difficult decision and one I have not taken lightly.\" \n\nThe Paranoids' so-called red team, or offensive security team -- which conducts cyberattack simulations to identify weaknesses i",
        "id": 1699478,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/12/210234/yahoo-cybersecurity-team-sees-layoffs-outsourcing-of-red-team-under-new-cto?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Yahoo Cybersecurity Team Sees Layoffs, Outsourcing of 'Red Team,' Under New CTO",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T20:51:01.494975+00:00",
        "description": "Apple's ambitious plan to create in-house components for its devices will include switching to a homegrown chip for Bluetooth and Wi-Fi connections starting next year, a move that will replace some parts currently provided by Broadcom. From a report: The chip, code-named Proxima, has been in development for several years and is now slated to go into the first products in 2025, according to people familiar with the matter. Like Apple's other in-house chips, Proxima will be produced by partner Taiwan Semiconductor Manufacturing Co. \n\nThe transition is separate from Apple's highly anticipated shift from Qualcomm cellular modems -- details of which Bloomberg News reported last week -- but the two parts will eventually work together. Apple's goal is to develop an end-to-end wireless approach that is tightly integrated with its other components and more energy-efficient, said the people, who asked not to be identified because the initiative hasn't been announced. Representatives for Cupert",
        "id": 1699043,
        "language": null,
        "link": "https://apple.slashdot.org/story/24/12/12/2013233/apple-nears-switch-to-in-house-bluetooth-and-wi-fi-chip-for-iphone-smart-home?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Nears Switch To In-House Bluetooth and Wi-Fi Chip for iPhone, Smart Home",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T17:35:07.679378+00:00",
        "description": "An anonymous reader shares a report: Copilot has gone native for Windows Insiders and commandeered a popular keyboard shortcut in the process. The move from a Progressive Web App (PWA) to a native binary -- although most of it appears to still be a website, just not running as a PWA -- will be welcomed. Microsoft noted that once the app update has been installed, Copilot will appear in the system tray. \n\nHowever, the assistant's quick view feature has been given the Alt+Space keyboard shortcut. This is already used by many other applications, including Microsoft's own PowerToys. PowerToys Run, for example, uses Alt+Space to open a launcher into which users can type in the name of the service they are seeking. Alt+Space is also used to show the context menu of the active window. Therefore, Microsoft's decision to hand the shortcut over to Copilot is unlikely to please keyboard warriors who are used to their shortcuts working in a particular way. \n\nThe Windows vendor acknowledged that ",
        "id": 1697676,
        "language": null,
        "link": "https://it.slashdot.org/story/24/12/12/1655213/microsoft-hijacks-keyboard-shortcut-to-bring-copilot-to-your-attention?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Hijacks Keyboard Shortcut To Bring Copilot To Your Attention",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T17:35:07.581564+00:00",
        "description": "Social media giants confronted a familiar dilemma over user content moderation after murder suspect Luigi Mangione's arrest in the killing of UnitedHealthcare's CEO on Monday, highlighting the platforms' varied approaches to managing digital footprints of criminal suspects. \n\nMeta quickly removed Mangione's Facebook and Instagram accounts under its \"dangerous organizations and individuals\" policy, while his account on X underwent a brief suspension before being reinstated with a premium subscription. LinkedIn maintained his profile, stating it did not violate platform policies. His Reddit account was suspended in line with the platform's policy on high-profile criminal suspects, while his Goodreads profile fluctuated between public and private status. \n\nThe New York Times adds: When someone goes from having a private life to getting public attention, online accounts they intended for a small circle of friends or acquaintances are scrutinized by curious strangers -- and journalists. \n",
        "id": 1697675,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/12/1722245/tech-platforms-diverge-on-erasing-criminal-suspects-digital-footprints?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tech Platforms Diverge on Erasing Criminal Suspects' Digital Footprints",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T16:28:17.565933+00:00",
        "description": "Amazon has postponed implementing Microsoft's cloud-based Office suite for its workforce by one year, citing security concerns following a Russian cyber attack on Microsoft's systems. The delay affects a $1 billion, five-year contract signed last year to provide Microsoft 365 to Amazon's 1.5 million employees, making the e-commerce giant one of the largest customers of Microsoft's cloud productivity suite. \n\nThe decision came after Microsoft revealed that Midnight Blizzard, a Russia-linked hacking group, had breached several employee email accounts, including those of senior executives and cybersecurity staff. Amazon subsequently conducted its own security review and requested enhanced protection measures from Microsoft.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Paused+Rollout+of+Microsoft+Office+for+a+Year+After+Hacks%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F12%2F12%2F1523248%2F%3Futm_source%3Dt",
        "id": 1697124,
        "language": null,
        "link": "https://it.slashdot.org/story/24/12/12/1523248/amazon-paused-rollout-of-microsoft-office-for-a-year-after-hacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Paused Rollout of Microsoft Office for a Year After Hacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T16:28:17.481590+00:00",
        "description": "An anonymous reader shares a report: BeReal, the in the moment social media platform, is far from its 2022 heyday, but that hasn't stopped one organization from going after it. Austrian advocacy group Noyb has filed a complaint surrounding the platform's data consent banner practices. The organization claims that the banner disappears if users accept that their personal data can inform advertising practices, but if they click reject then the banner appears daily. \n\nNoyb filed its complaint with the French data protection authority (CNIL) as Voodoo, a French company, bought BeReal in June -- the practice in question started in July. \"BeReal's daily attempt to pressure its users into accepting the tracking for personalised advertising has a significant impact on user behaviour. Consent given under these circumstances is not freely given, which means it doesn't meet the requirements established in Article 4(11) GDPR,\" Noyb argued in its complaint. It asked the CNIL to fine BeReal and fo",
        "id": 1697123,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/12/169256/bereal-accused-of-annoying-users-into-sharing-their-data?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "BeReal Accused of Annoying Users Into Sharing Their Data",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T15:22:51.605833+00:00",
        "description": "BrianFagioli writes: In a move sure to rattle some subscribers, YouTube TV has announced a price increase for its Base Plan. Starting January 13, 2025, the monthly subscription cost will jump from $72.99 to $82.99. The search giant cites the rising costs of content and investments in service quality as the primary reasons for this adjustment.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=YouTube+TV+Price+Hike+Coming+January+2025%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F12%2F1443205%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F12%2F12%2F1443205%2Fyoutube-tv-price-hike-coming-january-2025%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https:/",
        "id": 1696555,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/12/1443205/youtube-tv-price-hike-coming-january-2025?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "YouTube TV Price Hike Coming January 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T12:06:23.624607+00:00",
        "description": "An anonymous reader shares a report: Former Intel chief Pat Gelsinger, who stepped down from his leadership post a week ago, is inviting people to join him in prayer and fasting for the struggling chipmaker's employees. \n\n\"Every Thursday I do a 24 hour prayer and fasting day,\" Gelsinger wrote on X on Sunday morning. \"This week I'd invite you to join me in praying and fasting for the 100K Intel employees as they navigate this difficult period. Intel and its team is of seminal importance to the future of the industry and US.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Former+Intel+CEO+Calls+For+Prayer+and+Fasting+For+Employees%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F12%2F124214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F12%2F124",
        "id": 1695341,
        "language": null,
        "link": "https://slashdot.org/story/24/12/12/124214/former-intel-ceo-calls-for-prayer-and-fasting-for-employees?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Former Intel CEO Calls For Prayer and Fasting For Employees",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T11:01:31.227793+00:00",
        "description": "FlatpanelsHD: LG has discontinued all Blu-ray players, including the UBK80 and UBK90 UHD Blu-ray players, with remaining units only available while stocks last. \n\nThe announcement echoes similar moves from Oppo in 2018 and Samsung in 2019, when both companies exited the optical disc player market. LG has now officially discontinued its Blu-ray and UHD Blu-ray players, as reflected on LG's online portals and confirmed by multiple sources to FlatpanelsHD.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=LG+Discontinues+Blu-ray+Players%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F12%2F0957229%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F12%2F0957229%2Flg-discontinues-blu-ray-players%3Futm_source%3Dslashdot%26utm_medium%3Dfac",
        "id": 1694920,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/12/0957229/lg-discontinues-blu-ray-players?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "LG Discontinues Blu-ray Players",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T07:47:45.382338+00:00",
        "description": "Harvard University announced Thursday it's releasing a high-quality dataset of nearly one million public-domain books that could be used by anyone to train large language models and other AI tools. From a report: The dataset was created by Harvard's newly formed Institutional Data Initiative with funding from both Microsoft and OpenAI. It contains books scanned as part of the Google Books project that are no longer protected by copyright. \n\nAround five times the size of the notorious Books3 dataset that was used to train AI models like Meta's Llama, the Institutional Data Initiative's database spans genres, decades, and languages, with classics from Shakespeare, Charles Dickens, and Dante included alongside obscure Czech math textbooks and Welsh pocket dictionaries. Greg Leppert, executive director of the Institutional Data Initiative, says the project is an attempt to \"level the playing field\" by giving the general public, including small players in the AI industry and individual re",
        "id": 1694187,
        "language": null,
        "link": "https://slashdot.org/story/24/12/12/0734228/harvard-is-releasing-a-massive-free-ai-training-dataset-funded-by-openai-and-microsoft?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Harvard Is Releasing a Massive Free AI Training Dataset Funded by OpenAI and Microsoft",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T04:34:44.794678+00:00",
        "description": "An anonymous reader shares a report: Amazon Web Services said in a post earlier this month that developers report spending an average of \"just one hour per day\" on actual coding. But that doesn't mean these workers twiddle their thumbs the remaining seven hours per day. Instead, developers spend the majority of their time on \"tedious, undifferentiated tasks such as learning codebases, writing and reviewing documentation, testing, managing deployments, troubleshooting issues or finding and fixing vulnerabilities,\" according to Amazon Web Services.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Says+Developers+Spend+'Just+One+Hour+Per+Day'+on+Actual+Coding%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F12%2F0414226%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2",
        "id": 1693547,
        "language": null,
        "link": "https://developers.slashdot.org/story/24/12/12/0414226/amazon-says-developers-spend-just-one-hour-per-day-on-actual-coding?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Says Developers Spend 'Just One Hour Per Day' on Actual Coding",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T02:26:15.036830+00:00",
        "description": "Startup Embodied is closing down, and its product, an $800 robot for kids ages 5 to 10, will soon be bricked. From a report: Embodied blamed its closure on a failed \"critical funding round.\" On its website, it explained: \"We had secured a lead investor who was prepared to close the round. However, at the last minute, they withdrew, leaving us with no viable options to continue operations. Despite our best efforts to secure alternative funding, we were unable to find a replacement in time to sustain operations.\" \n\nThe company didn't provide further details about the pulled funding. Embodied's previous backers have included Intel Capital, Toyota AI Ventures, Amazon Alexa Fund, Sony Innovation Fund, and Vulcan Capital, but we don't know who the lead investor mentioned above is. When it first announced Moxie in April 2020, Embodied described the robot as a \"safe and engaging animate companion for children designed to help promote social, emotional, and cognitive development.\"<p><div clas",
        "id": 1693186,
        "language": null,
        "link": "https://it.slashdot.org/story/24/12/11/1854238/startup-will-brick-800-emotional-support-robot-for-kids-without-refunds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Startup Will Brick $800 Emotional Support Robot For Kids Without Refunds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T00:04:25.573682+00:00",
        "description": "Photobucket was sued Wednesday after a recent privacy policy update revealed plans to sell users' photos -- including biometric identifiers like face and iris scans -- to companies training generative AI models. From a report: The proposed class action seeks to stop Photobucket from selling users' data without first obtaining written consent, alleging that Photobucket either intentionally or negligently failed to comply with strict privacy laws in states like Illinois, New York, and California by claiming it can't reliably determine users' geolocation. \n\nTwo separate classes could be protected by the litigation. The first includes anyone who ever uploaded a photo between 2003 -- when Photobucket was founded -- and May 1, 2024. Another potentially even larger class includes any non-users depicted in photographs uploaded to Photobucket, whose biometric data has also allegedly been sold without consent. \n\nPhotobucket risks huge fines if a jury agrees with Photobucket users that the phot",
        "id": 1692601,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/11/2330207/photobucket-sued-over-plans-to-sell-user-photos-biometric-identifiers-to-ai-companies?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Photobucket Sued Over Plans To Sell User Photos, Biometric Identifiers To AI Companies",
        "vote": 0
    }
]