[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T15:30:14+00:00",
        "description": "Resident Evil has enjoyed consistent and widespread critical acclaim with games like Resident Evil 2 Remake, Resident Evil 7 and Resident Evil Village. But what does the future hold for the survival horror franchise? That there will be many more Resident Evil games in the future is obvious, but what exactly can fans look forward to? \n\nA Resident Evil 9 following up on 2021’s Resident Evil Village is a given, while more remakes are also obviously going to release, and in this feature, we talk about all of that and more, as we dive into rumours and leaks to discuss the inevitably exciting future of the Resident Evil franchise.",
        "id": 1697176,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ifNCDdUjERE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ifNCDdUjERE/hqdefault.jpg",
        "title": "What’s Next for Resident Evil? - Upcoming Games And What We Know So Far",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-12T09:30:08+00:00",
        "description": "Despite knowing officially that The Elder Scrolls VI is in development – and it’s been in the works for numerous years now – we don’t actually know an awful lot else. There’s no official word on release date, no story content confirmation, we don’t even know which region of Tamriel it’ll be set in. \n\nHowever, since the game’s announcement trailer back in 2018 there have been numerous interviews and previews undertaken, with official word coming directly from Bethesda director Todd Howard. \n\nWhilst nothing stated is set in stone, it’s exciting to use this information to speculate on The Elder Scrolls 6's content. This video includes some of the most substantial rumours, some with weight behind them, some tenuous at best.",
        "id": 1694631,
        "language": null,
        "link": "https://www.youtube.com/watch?v=DYyu1HH9VZI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/DYyu1HH9VZI/hqdefault.jpg",
        "title": "15 BIGGEST THE ELDER SCROLLS 6 RUMORS And Confirmed Features You Need To Know",
        "vote": 0
    }
]