[{"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T23:20:21.238370+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "Julia v1.10 Improves Performance, and Gnuplot Gets Pie Charts", "page_rating_contents": 0, "age": null, "description": "Julia 1.0 was released in 2018 &mdash; after a six-year wait. \n\nAnd there's now another update. LWN.net gets you up to speed, calling Julia \"a general-purpose, open-source programming language with a focus on high-performance scientific computing.\"\n\nSome of Julia's unusual features: \n- Lisp-inspired metaprogramming\n- The ability to examine compiled representations of code in the REPL or in a \"reactive notebook\"\n- An advanced type and dispatch system\n- A sophisticated, built-in package manager. \n\nVersion 1.10 brings big increases in speed and developer convenience, especially improvements in code precompilation and loading times. It also features a new parser written in Julia... [I]t is faster, it produces more useful syntax-error messages, and it provides better source-code mapping, which associates locations in compiled code to their corresponding lines in the source. That last improvement also leads to better error messages and makes it possible to write more sophisticated ", "link": "https://developers.slashdot.org/story/24/02/25/1916251/julia-v110-improves-performance-and-gnuplot-gets-pie-charts?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T22:14:09.637404+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "Scientists Create DVD-Sized Disk Storing 1 Petabit (125,000 Gigabytes) of Data", "page_rating_contents": 0, "age": null, "description": "Popular Science points out that for encoding data, \"optical disks almost always offer just a single, 2D layer &mdash; that reflective, silver underside.\" \n\n\"If you could boost a disk's number of available, encodable layers, however, you could hypothetically gain a massive amount of extra space...\"\nResearchers at the University of Shanghai for Science and Technology recently set out to do just that, and published the results earlier this week in the journal, Nature. Using a 54-nanometer laser, the team managed to record a 100 layers of data onto an optical disk, with each tier separated by just 1 micrometer. The final result is an optical disk with a three-dimensional stack of data layers capable of holding a whopping 1 petabit (Pb) of information &mdash; that's equivalent to 125,000 gigabytes of data... \n\nAs Gizmodo offers for reference, that same petabit of information would require roughly a six-and-a-half foot tall stack of HHD drives &mdash; if you tried to encode the sam", "link": "https://hardware.slashdot.org/story/24/02/25/2026232/scientists-create-dvd-sized-disk-storing-1-petabit-125000-gigabytes-of-data?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T21:09:39.172938+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "Texas Just Got a New 1.1-Million-Panel Solar Farm", "page_rating_contents": 0, "age": null, "description": "An anonymous reader shared this report from Electrek:\n\nRenewable developer Clearway Energy Group has completed a 452-megawatt (MW) solar farm in West Texas &mdash; and it's huge... It's built on around 5,000 acres of land and features over 1.1 million solar panels... Texas Solar Nova will generate enough electricity to power over 190,000 homes annually. \n\nIt's got an offtake agreement with telecoms giant Verizon, and agreements with auto component maker Toyota Boshoku and Swedish bearing and seal maker SKF to purchase renewable energy certificates (RECs). Both Toyota Boshoku and SKF have 12-year agreements for RECs. \n\nThe $660 million facility will \"contribute significantly to the local tax base,\" the company said in a statement, \"starting with an estimated $5.4 million in property taxes and wages to be paid in the first year.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Texas+Just+Got+a+New+1.1-Million-Panel+Solar+Farm%3A+https%3", "link": "https://hardware.slashdot.org/story/24/02/24/2344243/texas-just-got-a-new-11-million-panel-solar-farm?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T21:09:35.634702+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "In Netflix's New Sci-Fi Movie 'Spaceman', an Introverted Astronaut Confronts Isolation", "page_rating_contents": 0, "age": null, "description": "Netflix's new sci-fi drama Spaceman centers on Czech astronaut Jakub Proch&aacute;zk, described by Polygon as \"painfully introverted, emotionally repressed, and above all, quiet... so muted and compressed, he seems like a trauma victim.\"\n\nThe film, adapted from the 2017 novel Spaceman of Bohemia written by Czech author Jaroslav Kalfa&#197;(TM), is a solemn drama in the mold of Andrei Tarkovsky's Solaris, or to some degree, Christopher Nolan's Interstellar. The story revolves around Jakub's disintegrating frame of mind after eight months alone in space as he investigates a glowing cosmic phenomenon that's become visible from Earth. Meanwhile, his wife Lenka (Carey Mulligan), heavily pregnant and going through her own breakdown back home, decides to leave Jakub, and his handlers (Isabella Rossellini among them) work to keep him from finding out. And then the giant spider appears, and Jakub worries that he's losing his mind.\n \n\nCNN says Sandler's deal with Netflix \"means pretty ", "link": "https://entertainment.slashdot.org/story/24/02/24/1955259/in-netflixs-new-sci-fi-movie-spaceman-an-introverted-astronaut-confronts-isolation?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T21:09:33.338803+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "Remembering How Plan 9 Evolved at Bell Labs", "page_rating_contents": 0, "age": null, "description": "jd (Slashdot reader #1,658) writes: The Register has been running a series of articles about the evolution of Unix, from humble beginnings to the transition to Plan9. There is a short discussion of why Plan9 and its successors never really took off (despite being vastly superior to microkernels), along with the ongoing development of 9Front. \n\n\n\nFrom the article:\n\nPlan 9 was in some way a second implementation of the core concepts of Unix and C, but reconsidered for a world of networked graphical workstations. It took many of the trendy ideas of late-1980s computing, both of academic theories and of the computer industry of the time, and it reinterpreted them through the jaded eyes of two great gurus, Kenneth Thompson and Dennis Ritchie (and their students) &mdash; arguably, design geniuses who saw their previous good ideas misunderstood and misinterpreted.\n\n In Plan 9, networking is front and center. There are good reasons why this wasn't the case with Unix &mdash; it was be", "link": "https://tech.slashdot.org/story/24/02/25/1620222/remembering-how-plan-9-evolved-at-bell-labs?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T21:09:30.722548+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "AT&amp;T Will Issue $5 Reimbursements For 12-Hour Outage", "page_rating_contents": 0, "age": null, "description": "CNN reports:\n\nAT&amp;T is reimbursing customers for the nearly 12-hour network outage on Thursday, the company announced in a news release. The mobile network will issue a $5 credit to \"potentially impacted\" AT&amp;T Wireless customers, which it says is the \"average cost of a full day of service.\"\n \nThe credit will be applied automatically \"within 2 bill cycles,\" according to an announcement at the URL att.com/makeitright. \"We recognize the frustration this outage has caused and know we let many of our customers down.\" \n\nIn a much smaller font, they note that the credit \"does not apply to AT&amp;T Business, AT&amp;T Prepaid or Cricket. \n\nMore from CNN:\n\nAT&amp;T had encountered sporadic service interruptions in the days leading up to the outage, including a temporary 911 outage in some parts of the southeast. While regional disruptions to wireless service happen occasionally, prolonged nationwide outages are rare. The Federal Communications Commission confirmed Thursday it wa", "link": "https://slashdot.org/story/24/02/25/1758242/att-will-issue-5-reimbursements-for-12-hour-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T21:09:27.564819+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "The Companies Helping Governments Hack Citizens' Phones: a 'Thriving' Industry", "page_rating_contents": 0, "age": null, "description": "Fast Company notes that \"the deadly impacts of Pegasus and other cyberweapons &mdash; wielded by governments from Spain to Saudi Arabia against human rights defenders, journalists, lawyers and others &mdash; is by now well documented. A wave of scrutiny and sanctions have helped expose the secretive, quasi-legal industry behind these tools, and put financial strain on firms like Israel's NSO Group, which builds Pegasus. \n\n\"And yet business is booming.\"\n\nNew research published this month by Google and Meta suggest that despite new restrictions, the cyberattack market is growing, and growing more dangerous, aiding government violence and repression and eroding democracy around the globe. \n\n\"The industry is thriving,\" says Maddie Stone, a researcher at Google's Threat Analysis Group (TAG) who hunts zero-day exploits, the software bugs that have yet to be fixed and are worth potentially hundreds of millions to spyware sellers. \"More companies keep popping up, and their government", "link": "https://yro.slashdot.org/story/24/02/25/1845220/the-companies-helping-governments-hack-citizens-phones-a-thriving-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T16:12:59.645074+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "Oklahoma Man Hacked US Government Site To Buy Cars At Auction For $1", "page_rating_contents": 0, "age": null, "description": "A U.S. government auction site was breached by an Oklahoma man, reports NBC News. So when it came time to pay up on his winning bids, he \"falsified the true auction price to $1,\" according to the U.S. attorney's office. \n\nHe defrauded the government out of more than $150,000 between Jan. 31 and March 21, 2019, the indictment alleges. Included in the $1-buys were a 2010 Ford Escape Hybrid, for which Coker submitted a bid of $8,327; a Ford F550 pickup, with a bid of $9,000; and a Chevrolet C4500 box truck, bid $22,700; the U.S. attorney's office said... \n\nNineteen items in all were bought through the auctions, according to prosecutors. Coker used eight accounts and pre-paid debit cards with very little balances to make the purchases, the indictment says. \n\n\"Coker was indicted on three counts of wire fraud in March 2023 and pleaded guilty to one count Wednesday, according to court records.\" \nThanks to Slashdot reader Thelasko for sharing the news.<p><div class=\"share_submission\"", "link": "https://yro.slashdot.org/story/24/02/25/0153221/oklahoma-man-hacked-us-government-site-to-buy-cars-at-auction-for-1?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T13:26:56.756839+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "Moon Landing's Payloads Include Archive of Human Knowledge, Lunar Data Center Test, NFTs", "page_rating_contents": 0, "age": null, "description": "In 2019 a SpaceX Falcon 9 rocket launched an Israeli spacecraft carrying a 30-million page archive of human civilization to the moon. Unfortunately, that spacecraft crashed.\n\nBut thanks to this week's moon landing by the Odysseus, there's now a 30-million page \"Lunar Library\" on the moon &mdash; according to a Medium post by the Arch Mission Foundation. \n\n\n\"This historic moment secures humanity's cultural heritage and knowledge in an indestructible archive built to last for up to billions of years.\"\n\nEtched onto thin sheets of nickel, called NanoFiche, the Lunar Library is practically indestructible and can withstand the harsh conditions of space... Some of the notable content includes: \n\n The Wikipedia. The entire English Wikipedia containing over 6 million articles on every branch of knowledge.\n Project Gutenberg. Portions of Project Gutenberg's library of over 70,000 free eBooks containing some of our most treasured literature.\n The Long Now Foundation's Rosetta Project ar", "link": "https://science.slashdot.org/story/24/02/25/0125230/moon-landings-payloads-include-archive-of-human-knowledge-lunar-data-center-test-nfts?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T09:25:45.537117+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "What Happened After Peter Thiel Paid 271 Students to Drop Out of College?", "page_rating_contents": 0, "age": null, "description": "Since 2010, billionaire tech investor Peter Thiel has offered to pay about 20 students $100,000 to drop out of school each year \"to start companies or nonprofits,\" reports the Wall Street Journal. His program has now backed 271 people, and this year the applicant pool \"is bigger than ever.\" \n\nSo how's it going?\n\nSome big successes include Vitalik Buterin, co-founder of Ethereum, the blockchain network; Laura Deming, a key figure in venture investing in aging and longevity; Austin Russell, who runs self-driving technologies company Luminar Technologies; and Paul Gu, co-founder of consumer lending company Upstart... \n\nThiel and executives of the fellowship acknowledge they have learned painful lessons along the way. Some applicants pursued ambitious ideas that turned out to be unrealistic, for example. \"Asteroid mining is great for press releases but maybe we should have pushed back early on,\" he says. Others were better at applying to be Thiel fellows than they were starting b", "link": "https://news.slashdot.org/story/24/02/24/2311221/what-happened-after-peter-thiel-paid-271-students-to-drop-out-of-college?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T08:21:28.624082+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "License Plate-Scanning Company Violates Privacy of Millions of California Drivers, Argues Class Action", "page_rating_contents": 0, "age": null, "description": "\"If you drive a car in California, you may be in for a payday thanks to a lawsuit alleging privacy violations by a Texas company,\" report SFGate:\n\nThe 2021 lawsuit, given class-action status in September, alleges that Digital Recognition Network is breaking a California law meant to regulate the use of automatic license plate readers. DRN, a Fort Worth-based company, uses plate-scanning cameras to create location data for people's vehicles, then sells that data to marketers, car repossessors and insurers. \n\nWhat's particularly notable about the case is the size of the class. The court has established that if you're a California resident whose license plate data was collected by DRN at least 15 times since June 2017, you're a class member. The plaintiff's legal team estimates that the tally includes about 23 million people, alleging that DRN cameras were mounted to cars on public roads. The case website lets Californians check whether their plates were scanned. \n\nBarring a set", "link": "https://yro.slashdot.org/story/24/02/24/2126233/license-plate-scanning-company-violates-privacy-of-millions-of-california-drivers-argues-class-action?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T08:21:26.719741+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "Scientists Pursue Cancer Vaccines Tailored to the Genetic Makeup of an Individual's Tumor", "page_rating_contents": 0, "age": null, "description": "\"The Royal Swedish Academy of Sciences, which selects Nobel laureates in chemistry and physics, last week awarded Dr. Wu its Sj&ouml;berg Prize in honor of 'decisive contributions' to cancer research,\" reports CNN. \n\nTheir profile of the oncologist from Boston's Dana-Farber Cancer Institute notes Dr. Wu's research \"has laid the scientific foundation for the development of cancer vaccines tailored to the genetic makeup of an individual's tumor.\"\n\nIt's a strategy looking increasingly promising for some hard-to-treat cancers such as melanoma and pancreatic cancer, according to the results of early-stage trials, and may ultimately be widely applicable to many of the 200 or so forms of cancer... \n\nThe most common treatments for cancer &mdash; radiation therapy and chemotherapy &mdash; are like sledgehammers, striking all cells and often damaging healthy tissue. Since the 1950s, cancer researchers have been seeking a way to dial up the body's immune system, which naturally tries to", "link": "https://science.slashdot.org/story/24/02/24/2050240/scientists-pursue-cancer-vaccines-tailored-to-the-genetic-makeup-of-an-individuals-tumor?utm_source=rss1.0mainlinkanon&utm_medium=feed"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": "en-us", "bookmarked": false, "source_obj__id": 607, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "artist": "help@slashdot.org", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T08:21:25.051409+00:00", "thumbnail": null, "tags": [], "album": "", "comments": [], "title": "How 'Smart Keys' Have Fueled a New Wave of Car Thefts", "page_rating_contents": 0, "age": null, "description": "\"One London resident watched on CCTV as a thief walked up to his &pound;40,000 car and drove away,\" reports the Observer. \"Now manufacturers say they are being drawn in to a hi-tech 'arms race' with criminals.\"\n\n\n[H]i-tech devices disguised as handheld games consoles are being traded online for thousands of pounds and are used by organised crime gangs to mimic the electronic key on an Ioniq 5, opening the doors and starting the engine. The device, known as an \"emulator\", works by intercepting a signal from the car, which is scanning for the presence of a legitimate key, and sending back a signal to gain access to the vehicle... \n\nHyundai says it is looking at measures to prevent the use of emulators \"as a priority\". But it is not the only carmaker whose vehicles appear to be vulnerable. An Observer investigation found that models by Toyota, Lexus and Kia have also been targeted... British motorists now face an increase in the number of thefts and rising insurance premiums... ", "link": "https://it.slashdot.org/story/24/02/24/2148203/how-smart-keys-have-fueled-a-new-wave-of-car-thefts?utm_source=rss1.0mainlinkanon&utm_medium=feed"}]