[{"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": null, "bookmarked": false, "source_obj__id": 208, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "artist": "GamingBolt", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T16:45:00+00:00", "thumbnail": "https://i2.ytimg.com/vi/9B0Ppu0Vy6Y/hqdefault.jpg", "tags": [], "album": "", "comments": [], "title": "15 Challenging Survival Games of 2024 And Beyond That Will Test Your Mettle", "page_rating_contents": 0, "age": null, "description": "There's a distinct fun to be had in optimizing available resources and trying to figure out new strategies for overcoming overwhelming odds, and the best survival games play on those elements to craft a compelling experience where you learn through your mistakes and grow stronger with time. \n\n2024 and beyond is primed to see the release of plenty of great survival games right from Sons of The Forest to Pacific Drive, and a ton of great games that put an interesting spin on the genre. With this video, we will be counting down 15 of the best survival games that are worth looking out for.", "link": "https://www.youtube.com/watch?v=9B0Ppu0Vy6Y"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": null, "bookmarked": false, "source_obj__id": 208, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "artist": "GamingBolt", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T14:00:12+00:00", "thumbnail": "https://i1.ytimg.com/vi/P5hwKRMfYOY/hqdefault.jpg", "tags": [], "album": "", "comments": [], "title": "Brothers: A Tale of Two Sons REMAKE - 14 Things You ABSOLUTELY Need to Know Before You Buy", "page_rating_contents": 0, "age": null, "description": "505 Games' Brothers: A Tale of Two Sons, directed by Josef Fares of It Takes Two fame, is the latest game to get the remake treatment. Developed by Avantgarden, it's out on February 28th for PS5, PC and Xbox Series X/S and completely overhauls the visuals while re-recording the soundtrack with a live orchestra.\n\nThe story of two brothers embarking on a journey to find a cure for their father's illness is still ostensibly the same. Gameplay still involves controlling both characters simultaneously, solving puzzles and exploring the fairy tale-esque world.\n\nHowever, the remake promises smoother controls, improved cutscenes and boss fights, new secrets to discover and a local co-op mode for two players to work together. Check out everything you should know about Brothers: A Tale of Two Sons Remake before launch.", "link": "https://www.youtube.com/watch?v=P5hwKRMfYOY"}, {"page_rating_votes": 0, "page_rating": 0, "vote": 0, "permanent": false, "language": null, "bookmarked": false, "source_obj__id": 208, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "artist": "GamingBolt", "user": null, "page_rating_visits": 0, "dead": false, "date_published": "2024-02-25T09:30:03+00:00", "thumbnail": "https://i2.ytimg.com/vi/9EoteBdjpqA/hqdefault.jpg", "tags": [], "album": "", "comments": [], "title": "Nintendo Switch 2 Specs - What Would The Console Look Like?", "page_rating_contents": 0, "age": null, "description": "Nintendo launched the Switch in 2017, and it's safe to say that it has been a smash hit with dozens of quality games and well over a hundred million units sold. It's almost 7 years old at this point, and fans are obviously stoked to hear more about Nintendo's next console. \n\nAccording to multiple reports and general sense of traditional console cycles, the Switch 2 (or whatever it ends up being called) should release sometime soon, but the bigger question is what would it look like in terms of its technical specifications? \n\nWith this video, we try to answer this very question as we scrape through numerous reports and rumors to bring to you a rough estimate of the Nintendo Switch 2’s specs right from the CPU to the RAM and its media format.", "link": "https://www.youtube.com/watch?v=9EoteBdjpqA"}]