[{"user": null, "thumbnail": null, "page_rating_visits": 0, "source": "https://www.grimdarkmagazine.com/feed", "permanent": false, "bookmarked": false, "source_obj__id": 137, "title": "The 2024 short fiction submission window is open!", "language": "en-AU", "tags": [], "age": null, "date_published": "2024-03-02T09:18:48+00:00", "artist": null, "description": "<p>Last Updated on March 2, 2024 The 2024 Grimdark Magazine open window for short fiction is here! You have just under two weeks to get your short fiction submitted to our team to review for placement in one of our 2024/25 issues. THE 2024 GRIMDARK MAGAZINE OPEN WINDOW Our submissions email address will be open for two weeks until 23:59 14th March. We are looking for short stories of up to 4,000 words for original fiction, and up to 12,000 words for reprints. Anything submitted over the word limit, or outside of the open window timeframes will be auto-rejected. We will be looking for grimdark fantasy, as well as the darker grittier side of sci-fantasy and science fiction. We are also after horror in either of those aforementioned settings (eg. with a fantastical or SF aspect that’s key to the story), through a grimdark lens. We encourage diverse authors and those from underrepresented backgrounds to submit stories. Contemporary settings will be a very hard sell. We do not wan", "page_rating_votes": 0, "page_rating": 0, "vote": 0, "album": "", "comments": [], "page_rating_contents": 0, "dead": false, "link": "https://www.grimdarkmagazine.com/the-2024-short-fiction-submission-window-is-open"}, {"user": null, "thumbnail": null, "page_rating_visits": 0, "source": "https://www.grimdarkmagazine.com/feed", "permanent": false, "bookmarked": false, "source_obj__id": 137, "title": "REVIEW: Prince of the City by Keith Herber", "language": "en-AU", "tags": [], "age": null, "date_published": "2024-03-02T04:25:29+00:00", "artist": null, "description": "<p>Prince of the City by Keith Herber is both a prequel as well as sequel to the book Dark Prince by the same author. It is one of the early Vampire: The Masquerade novels that is set in the World of Darkness where supernatural entities live among us, hiding their existence so they can prey upon us better. Dark Prince was a fantastic novel with a hard gritty street-crime edge and a loathsome protagonist that, nevertheless, manages to undergo serious character development. It introduced the character of Vannevar Thomas, and I was interested in seeing where this book would take him as Prince of the City stars said supporting character. Prince of the City is a very different book from Dark Prince despite so many crossover characters and including Vannevar’s perception of the events in the latter. It’s a credit to Keith Herber that he’s so dramatically able to shift his style. If I had to compare it to any other book, I’d say it’s most similar to Interview with a Vampire as it’s ", "page_rating_votes": 0, "page_rating": 0, "vote": 0, "album": "", "comments": [], "page_rating_contents": 0, "dead": false, "link": "https://www.grimdarkmagazine.com/review-prince-of-the-city-by-keith-herber"}]