[{"user": null, "thumbnail": "https://i3.ytimg.com/vi/2xcb5OxdlfE/hqdefault.jpg", "page_rating_visits": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "permanent": false, "bookmarked": false, "source_obj__id": 129, "title": "Star Wars: Dark Forces Remaster Review - The Final Verdict", "language": null, "tags": [], "age": null, "date_published": "2024-03-02T20:30:00+00:00", "artist": "GamingBolt", "description": "Three decades on from its launch, Star Wars: Dark Forces was a standard setter in so many ways, because not only was it a simple classic FPS clone – of which there was no shortage back in those days – it was also one of the very first prominent examples of first-person shooters actually paying attention to storytelling in a meaningful way. \n\nIts remaster, developed by the ever-so-talented Nightdive Studios, captures all of its strengths – its unique aesthetic, its excellent action – while also providing it with a significant glow up thanks to some excellent remastering work. Some notable aspects of the experience have aged poorly, which will likely make the game frustrating for many, but there’s still plenty to like here.", "page_rating_votes": 0, "page_rating": 0, "vote": 0, "album": "", "comments": [], "page_rating_contents": 0, "dead": false, "link": "https://www.youtube.com/watch?v=2xcb5OxdlfE"}, {"user": null, "thumbnail": "https://i3.ytimg.com/vi/RCUj83jAk6o/hqdefault.jpg", "page_rating_visits": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "permanent": false, "bookmarked": false, "source_obj__id": 129, "title": "Rise of the Ronin's Open World - EVERYTHING You Should Know", "language": null, "tags": [], "age": null, "date_published": "2024-03-02T17:00:15+00:00", "artist": "GamingBolt", "description": "Team Ninja’s reputation as a developer of some of the industry’s best and tightest action games is unshakable, but with its next big release, the studio is embarking on an entirely new adventure. \n\nWith its open world structure, upcoming PS5 exclusive action RPG Rise of the Ronin is promising to be a very different kind of experience from Team Ninja’s past works, while the studio is also touting it as its biggest and most ambitious game ever made. \n\nOf course, in today’s day and age, there’s no shortage of open world games, but even amidst that saturation, there’s plenty about Rise of the Ronin’s take on the formula that’s catching the eye, from its grounded, period Japanese setting to its traversal mechanics. Here, we talk about all of that and more.", "page_rating_votes": 0, "page_rating": 0, "vote": 0, "album": "", "comments": [], "page_rating_contents": 0, "dead": false, "link": "https://www.youtube.com/watch?v=RCUj83jAk6o"}, {"user": null, "thumbnail": "https://i4.ytimg.com/vi/GCRSiwd8hZk/hqdefault.jpg", "page_rating_visits": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "permanent": false, "bookmarked": false, "source_obj__id": 129, "title": "15 Games That Can Last OVER 1000 HOURS Without An Inch of Boredom", "language": null, "tags": [], "age": null, "date_published": "2024-03-02T09:30:07+00:00", "artist": "GamingBolt", "description": "There’s just a very distinct sense of satisfaction to be had from playing a game for a very long time, sinking your teeth into it and sticking with just that one product in the long run. \n\nTime is one of the most valuable things that we can spend, so it’s also important that the games we choose to spend the longest amount of time playing have respect for our time either through a constantly evolving gameplay loop or interesting changes to the world or incredibly deep mechanics that require skill and commitment to master. \n\nSuch kinds of games are rare, which is why we have compiled a list of 15 of the best games that you could spend thousands of hours playing without experiencing an inch of boredom.", "page_rating_votes": 0, "page_rating": 0, "vote": 0, "album": "", "comments": [], "page_rating_contents": 0, "dead": false, "link": "https://www.youtube.com/watch?v=GCRSiwd8hZk"}]