[{"artist": "GamingBolt", "page_rating_visits": 0, "dead": false, "page_rating_votes": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "vote": 0, "title": "Foamstars PS5 Review - The Final Verdict", "album": "", "comments": [], "description": "Foamstars is a game where you might feel like it could be a really fun time when you are starting out, but it soon starts to be clear that it is mostly a game with little to no substance to keep you hooked in the long run. \n\nAnd that’s a shame because Foamstars could have captured the Splatoon market in a multiplatform format if it could have spent some more time in the oven. As it stands now, Foamstars is a middling-quality product with some neat ideas, and because it’s free to download through PS Plus, you can try it out with friends but know that chances of you sticking around are pretty slim.", "link": "https://www.youtube.com/watch?v=PF-1NBPctyI", "page_rating_contents": 0, "tags": [], "source_obj__id": 208, "date_published": "2024-02-15T19:00:10+00:00", "bookmarked": false, "permanent": false, "language": null, "user": null, "thumbnail": "https://i1.ytimg.com/vi/PF-1NBPctyI/hqdefault.jpg", "page_rating": 0, "age": null}, {"artist": "GamingBolt", "page_rating_visits": 0, "dead": false, "page_rating_votes": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "vote": 0, "title": "What The Hell Is PHYSINT? - Kojima's NEW Stealth Action Espionage Game", "album": "", "comments": [], "description": "Announced at the latest Sony State of Play, Kojima Productions has a new title in the works. Codenamed Physint, this self-declared next-generation release isn’t just a return to the genre Hideo helped popularise but marks an opportunity for him to explore his love of film too. \n\nThe game is said to transcend the barriers between games and movies, but the specifics of what this might mean are currently elusive. Hideo’s desire to constantly strive for uniqueness puts a lot of speculative ideas in the dustbin before they’ve even fully formed. \n\nDoes this mean Physint will be a sequence of interactive cutscenes, or perhaps two coexisting forms of media? It’s been done, so probably not. What the hell does the word Physint even mean, anyway? This video explores ideas and speculations behind the upcoming game, but the majority is pure guesswork.", "link": "https://www.youtube.com/watch?v=8njyY8PbsdM", "page_rating_contents": 0, "tags": [], "source_obj__id": 208, "date_published": "2024-02-15T15:30:05+00:00", "bookmarked": false, "permanent": false, "language": null, "user": null, "thumbnail": "https://i1.ytimg.com/vi/8njyY8PbsdM/hqdefault.jpg", "page_rating": 0, "age": null}, {"artist": "GamingBolt", "page_rating_visits": 0, "dead": false, "page_rating_votes": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "vote": 0, "title": "15 MOST AMBITIOUS GAMES You Need To Look Forward To", "album": "", "comments": [], "description": "The games industry has become increasingly risk-averse as time has passed, which, given the ballooning costs of game development and the increasing time it requires to get even a single project out the door, isn’t all that surprising. \n\nThankfully, however, it hasn’t been an absolute, cataclysmic change by any means, because those ballooning budgets and advancements in technology have also allowed developers to realize their grand ambitious for games in ways they simply didn’t have the means to before- whether that’s through massive worlds with endless content, through staggering technical accomplishments and polish, through an entirely unique story or storytelling style, or any number of other ways. \n\nHere, we’re going to talk about a few such upcoming games that have caught our eye with how ambitious they’re looking like they’re going to be.", "link": "https://www.youtube.com/watch?v=x8zUSVPi_Cw", "page_rating_contents": 0, "tags": [], "source_obj__id": 208, "date_published": "2024-02-15T09:30:14+00:00", "bookmarked": false, "permanent": false, "language": null, "user": null, "thumbnail": "https://i1.ytimg.com/vi/x8zUSVPi_Cw/hqdefault.jpg", "page_rating": 0, "age": null}]