[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "The Last of Us Part 2: Remastered PS5 vs PS4 Pro Graphics Comparison - A Big Upgrade?", "description": "The Last of Us Part 2 was not just a great game in terms of its mechanics, but also a technical achievement with its clever usage of baked lighting techniques and highly detailed character models. \n\nIt's a game that's ripe for being brought over to the new generation of consoles, and Naughty Dog has done just that with The Last of Us Part 2 Remastered for the PS5. \n\nIt's more of an iterative upgrade over the original as opposed to a radical overhaul, but those incremental upgrades coalesce to create what just might be the best looking and best playing version of the game. With this video, we will be taking a look at the game's technical aspects and break them down individually.", "link": "https://www.youtube.com/watch?v=AS40IIDYbNA", "date_published": "2024-01-16T18:30:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i2.ytimg.com/vi/AS40IIDYbNA/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "The Last of Us Part 2: Remastered PS5 Review - The Final Verdict", "description": "The Last of Us Part 2 is the sort of game that you either love or you hate. I fall in the former category, so any excuse to jump back into Naughty Dog’s masterpiece would have been one I would have snapped up all too eagerly- and The Last of Us Part 2 Remastered is an excellent way to do just that. \n\nThe campaign is, of course, still some of the best content Naughty Dog has ever made, but on top of that, the remaster also delivers a meaty additions like Guitar Free Play and the Lost Levels, and what you get is a surprisingly comprehensive expanded re-release of a masterpiece.", "link": "https://www.youtube.com/watch?v=5VXC_qslwUw", "date_published": "2024-01-16T15:07:46+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i2.ytimg.com/vi/5VXC_qslwUw/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 BIGGEST RUMORED PS5 And Xbox Series X Games You Probably Didn't Know Exist", "description": "The games industry is at a great place right now, with a ton of highly anticipated releases slated to come out in 2024 and beyond. The release calendar already seems packed with a host of great-looking games, but there’s a distinct kind of curiosity to be had in talking about what could be and the many possibilities that arise from the constant churning of the rumor mill. \n\nThere’s no shortage of industry murmurs and reports from reputed sources that talk about games that are potentially in development at a wide array of studios all across the globe. With this video, we will be taking a look at 15 such rumored Xbox Series X/S and PS5 games that might be releasing in the near future.", "link": "https://www.youtube.com/watch?v=SBL2B0gWE9k", "date_published": "2024-01-16T11:45:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i4.ytimg.com/vi/SBL2B0gWE9k/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]