[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T23:59:44.720242+00:00", "description": "BleepingComputer's Lawrence Abrams: Internet Archive's \"The Wayback Machine\" has suffered a data breach after a threat actor compromised the website and stole a user authentication database containing 31 million unique records. News of the breach began circulating Wednesday afternoon after visitors to archive.org began seeing a JavaScript alert created by the hacker, stating that the Internet Archive was breached.\n \n\"Have you ever felt like the Internet Archive runs on sticks and is constantly on the verge of suffering a catastrophic security breach? It just happened. See 31 million of you on HIBP!,\" reads a JavaScript alert shown on the compromised archive.org site. The text \"HIBP\" refers to is the Have I Been Pwned data breach notification service created by Troy Hunt, with whom threat actors commonly share stolen data to be added to the service.\n \nHunt told BleepingComputer that the threat actor shared the Internet Archive's authentication database nine days ago and it is a 6.4GB S", "id": 1298086, "language": null, "link": "https://yro.slashdot.org/story/24/10/09/2247234/internet-archive-suffers-catastrophic-breach-impacting-31-million-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Internet Archive Suffers 'Catastrophic' Breach Impacting 31 Million Users", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T23:59:44.586698+00:00", "description": "Phoronix's Michael Larabel reports: OpenBSD 7.6 is out this evening as another major step forward for this BSD operating system with enhanced hardware support, security improvements, updating various user-space software, and enabling other kernel enhancements. There are a ton of changes to find with the just-released OpenBSD 7.6.\n \nSome of the new OpenBSD 7.6 features include:\n \n- OpenBSD 7.6 provides initial support for Qualcomm Snapdragon X1 Elite (X1E80100) SoCs. The 7.6 release also has initial Samsung Galaxy Book4 Edge boot support in ACPI mode with OpenBSD 7.6.\n- ARM64 has additional CPU security mitigations with Spectre-V4 now in place on ARM64 and adding Spectre-BHB for Cortex-A57 cores.\n- OpenBSD 7.6 on RISC-V now supports the Milk-V Pioneer board.\n- OpenBSD 7.6 on AMD64 has finally implemented support for AVX-512.\n- Various SMP kernel improvements.\n You can view the full list of features and download the OpenBSD 7.6 release via OpenBSD.org.<p><div class=\"share_submission\" st", "id": 1298085, "language": null, "link": "https://bsd.slashdot.org/story/24/10/09/2038229/openbsd-76-released?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenBSD 7.6 Released", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T22:54:47.662433+00:00", "description": "An anonymous reader quotes a report from TechCrunch: Fisker's Chapter 11 bankruptcy has hit a major snag, as the company buying the startup's remaining fleet of electric SUVs says it might not complete the purchase because of a surprising technical issue. The buyer, a New York-area leasing company called American Lease, says in a new filing that Fisker now believes there is no way to transfer the information connected to each SUV to a new server not owned by the bankrupt EV startup. Since American Lease needs that information to operate the vehicles after Fisker is dissolved, the leasing company has filed an emergency objection to the startup's liquidation plan. Fisker was expected to have that plan confirmed in bankruptcy court as early as this Wednesday.\n \nAmerican Lease has already handed over \"tens of millions of dollars\" after the purchase agreement of the 3,000-plus Ocean SUVs was approved in July. These funds have been crucial because Fisker was using them to pay for the bankru", "id": 1297882, "language": null, "link": "https://slashdot.org/story/24/10/09/2024250/bankrupt-fisker-unable-to-port-ev-data-risking-multi-million-dollar-fleet-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Bankrupt Fisker Unable To Port EV Data, Risking Multi-Million Dollar Fleet Deal", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T21:49:47.806367+00:00", "description": "An anonymous reader shares a report: Geoffrey Hinton accepted a Nobel Prize this week, recognizing the foundational work on artificial neural networks that earned him the nickname \"godfather of AI.\" In a speech Tuesday, Professor Hinton praised one student -- alluding to OpenAI's former Chief Scientist, Ilya Sutskever -- for revolting against OpenAI's CEO. \"I was particularly fortunate to have many very clever students -- much cleverer than me -- who actually made things work,\" said Hinton. \"They've gone on to do great things. I'm particularly proud of the fact that one of my students fired Sam Altman.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=After+Winning+Nobel+Prize%2C+Geoffrey+Hinton+Said+He+Was+Proud+Ilya+Sutskever+'Fired+Sam+Altman'%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F10%2F09%2F1949256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n", "id": 1297461, "language": null, "link": "https://slashdot.org/story/24/10/09/1949256/after-winning-nobel-prize-geoffrey-hinton-said-he-was-proud-ilya-sutskever-fired-sam-altman?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "After Winning Nobel Prize, Geoffrey Hinton Said He Was Proud Ilya Sutskever 'Fired Sam Altman'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T21:49:47.721181+00:00", "description": "80% of software engineers will need to upskill by 2027 to keep pace with generative AI's growing demands, according to Gartner. The consultancy predicts AI will transform the industry in three phases. Initially, AI tools will boost productivity, particularly for senior developers. Subsequently, \"AI-native software engineering\" will emerge, with most code generated by AI. Long-term, AI engineering will rise as enterprise adoption increases, requiring a new breed of professionals skilled in software engineering, data science, and machine learning.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=80%25+of+Software+Engineers+Must+Upskill+For+AI+Era+By+2027%2C+Gartner+Warns%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F10%2F09%2F200255%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%", "id": 1297460, "language": null, "link": "https://developers.slashdot.org/story/24/10/09/200255/80-of-software-engineers-must-upskill-for-ai-era-by-2027-gartner-warns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "80% of Software Engineers Must Upskill For AI Era By 2027, Gartner Warns", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T20:44:39.073945+00:00", "description": "An anonymous reader shares a report: Washington blames China's dominance of the solar industry on what are routinely dubbed \"unfair trade practices.\" But that's just a comforting myth. China's edge doesn't come from a conspiratorial plot hatched by an authoritarian government. It hasn't been driven by state-owned manufacturers, subsidized loans to factories, tariffs on imported modules or theft of foreign technological expertise. Instead, it's come from private businesses convinced of a bright future, investing aggressively and luring global talent to a booming industry &#226;\" exactly the entrepreneurial mix that made the US an industrial powerhouse. \n\nThe fall of America as a solar superpower is a tragedy of errors where myopic corporate leadership, timid financing, oligopolistic complacency and policy chaos allowed the US and Europe to neglect their own clean-tech industries. That left a yawning gap that was filled by Chinese start-ups, sprouting like saplings in a forest clearing.", "id": 1297129, "language": null, "link": "https://news.slashdot.org/story/24/10/09/1939254/how-the-us-lost-the-solar-power-race-to-china?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "How the US Lost the Solar Power Race To China", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T19:39:37.041268+00:00", "description": "The man identified as Bitcoin creator Satoshi Nakamoto in a new HBO documentary has something to say: Wrong again, world. From a report: In the just-released HBO film on the history of the world's biggest digital currency -- Money Electric: The Bitcoin Mystery -- documentary filmmaker Cullen Hoback comes to the conclusion that the anonymous creator of Bitcoin was none other than a long-time member of the community and early Bitcoin developer Peter Todd. Todd dismissed the claim in the documentary, released yesterday, and denied it again when asked by The Register. \n\n\"[Hoback's] evidence for me being Satoshi is the same kind of coincidence-based, circumstantial thinking that fuels conspiracies like QAnon,\" Todd told us in an email. \"Which is ironic, given that [Hoback's] previous big project was a documentary on QAnon. He clearly didn't try to debunk his theories either.\" Hoback's previous project -- Q: Into the Storm -- aimed to unmask the person behind QAnon, perhaps giving him an in", "id": 1296761, "language": null, "link": "https://slashdot.org/story/24/10/09/1855240/bitcoin-creator-suspect-says-he-is-not-bitcoin-creator-suspect?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Bitcoin Creator Suspect Says He is Not Bitcoin Creator Suspect", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T19:39:36.956881+00:00", "description": "Cutting calorie intake can lead to a leaner body -- and a longer life, an effect often chalked up to the weight loss and metabolic changes caused by consuming less food. Now, one of the biggest studies of dietary restrictions ever conducted in laboratory animals challenges the conventional wisdom about how dietary restriction boosts longevity. From a report: The study, involving nearly 1,000 mice fed low-calorie diets or subjected to regular bouts of fasting, found that such regimens do indeed cause weight loss and related metabolic changes. But other factors -- including immune health, genetics and physiological indicators of resiliency -- seem to better explain the link between cutting calories and increased lifespan. \"The metabolic changes are important,\" says Gary Churchill, a mouse geneticist at the Jackson Laboratory in Bar Harbor, Maine, who co-led the study. \"But they don't lead to lifespan extension.\" \n\nTo outside investigators, the results drive home the intricate and indivi", "id": 1296760, "language": null, "link": "https://science.slashdot.org/story/24/10/09/1926239/eating-less-can-lead-to-a-longer-life-massive-study-in-mice-shows-why?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Eating Less Can Lead To a Longer Life: Massive Study in Mice Shows Why", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T18:34:27.285317+00:00", "description": "Zoom is getting one step closer to letting AI avatars attend meetings for you. As part of a broader AI expansion, Zoom announced it will soon let you create an AI avatar of yourself that you can use to send brief messages to your team. From a report: To create a digital avatar, you'll need to record an initial video of yourself that Zoom's AI will use to make an avatar that looks -- and even sounds -- like you. From there, you can write the message you want your AI avatar to say and then have it do all the talking for you. This feature will only work with Zoom's Clips feature, allowing you to record brief video updates for your colleagues.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Zoom+Will+Let+AI+Avatars+Talk+To+Your+Team+For+You%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F10%2F09%2F1815214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=", "id": 1296254, "language": null, "link": "https://slashdot.org/story/24/10/09/1815214/zoom-will-let-ai-avatars-talk-to-your-team-for-you?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Zoom Will Let AI Avatars Talk To Your Team For You", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T17:29:27.756904+00:00", "description": "The greatest tennis players in the world will be left to rage against a machine after any tight line calls at Wimbledon next year as the All England Club will break with tradition by removing line judges from all courts during the championships for the first time in its 147-year history. From a report: From 2025 onwards live electronic line calling (ELC) will be used on all courts in both the main draw at the All England Club and the qualifying tournament off-site in Roehampton. The new technology was successfully tested during this year's championships. Wimbledon's chief executive, Sally Bolton, said: \"The decision to introduce Live Electronic Line Calling at the championships was made following a significant period of consideration and consultation.\" \n\nBolton added: \"Having reviewed the results of the testing this year, we consider the technology to be sufficiently robust and the time is right to take this important step in seeking maximum accuracy in our officiating. For the player", "id": 1295768, "language": null, "link": "https://tech.slashdot.org/story/24/10/09/1616223/wimbledon-abolishes-line-judges-in-favor-of-automated-technology-after-147-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Wimbledon Abolishes Line Judges in Favor of Automated Technology After 147 Years", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T17:29:27.670345+00:00", "description": "9to5Mac: Following apparent photos of an M4 MacBook Pro box and a subsequent unboxing video, the unreleased model has now been offered for sale on a Russian classified ads site -- at a highly inflated price, naturally. Multiple units were advertised before the listings were removed, and it does now seem increasingly likely that the leaks are real. \n\nApple Pro tweeted a screengrab of one of the listing, which offered what appears to be the base model 14-inch M4 MacBook Pro, with the previously reported specs of 16GB unified memory, 512GB SSD, and three Thunderbolt 4 ports. We've also seen Geekbench results for a machine identified as \"Mac 16,1\" with performances in line with the reported specs. Rather than a one-off leak, it has been claimed that there are some 200 units out there. The ad on Avito was asking 720,000 rubles, which is around $7,400.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Unreleased+M4+MacBook+P", "id": 1295767, "language": null, "link": "https://apple.slashdot.org/story/24/10/09/1656202/unreleased-m4-macbook-pro-offered-for-sale-on-russian-site?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Unreleased M4 MacBook Pro Offered For Sale on Russian Site", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T16:24:34.969683+00:00", "description": "OpenAI said a group with apparent ties to China tried to carry out a phishing attack on its employees, reigniting concerns that bad actors in Beijing want to steal sensitive information from top US artificial intelligence companies. From a report: The AI startup said Wednesday that a suspected China-based group called SweetSpecter posed as a user of OpenAI's chatbot ChatGPT earlier this year and sent customer support emails to staff. The emails included malware attachments that, if opened, would have allowed SweetSpecter to take screenshots and exfiltrate data, OpenAI said, but the attempt was unsuccessful. \n\n\"OpenAI's security team contacted employees who were believed to have been targeted in this spear phishing campaign and found that existing security controls prevented the emails from ever reaching their corporate emails,\" OpenAI said. The disclosure highlights the potential cybersecurity risks for leading AI companies as the US and China are locked in a high-stakes battle for ar", "id": 1294638, "language": null, "link": "https://it.slashdot.org/story/24/10/09/1515226/openai-says-china-linked-group-tried-to-phish-its-employees?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Says China-Linked Group Tried to Phish Its Employees", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T16:24:34.718053+00:00", "description": "Nintendo has a new piece of game hardware coming in 2024. It's not the Switch 2, it's the Nintendo Sound Clock: Alarmo, a new motion-sensing alarm clock that will rouse you from sleep with the sounds of video games like Super Mario Odyssey, The Legend of Zelda: Breath of the Wild, and more. Polygon adds: The $99.99 alarm clock includes 35 wake-up \"scenes\" from Nintendo Switch games. Users will \"experience immersive sounds and music\" from those scenes, which are styled to match Nintendo's franchises. Alarmo will also track users' sleep and motion; Records will keep track of how much you move around, similar to the Pokemon Go Plus Plus sleep tracker that Nintendo released for Pokemon Go/Pokemon Sleep (and the long-promised, but seemingly abandoned QOL project). \n\nNintendo Sound Clock: Alarmo will feature various alarm settings, Nintendo said in a news release. The clock's Steady Mode features an alarm that will gradually get more intense the longer you stay in bed. Gentle Mode offers \"a", "id": 1294637, "language": null, "link": "https://games.slashdot.org/story/24/10/09/1521230/nintendo-announces-new-hardware-a-100-alarm-clock?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Nintendo Announces New Hardware: a $100 Alarm Clock", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T15:20:13.468486+00:00", "description": "Three scientists won the 2024 Nobel Prize in Chemistry on Wednesday for their groundbreaking work in predicting and designing protein structures, the Royal Swedish Academy of Sciences announced in Stockholm. David Baker of the University of Washington shares the prize with Demis Hassabis and John Jumper of Google DeepMind. Baker pioneered the creation of novel proteins, while Hassabis and Jumper developed AlphaFold, an AI model that predicts protein structures from amino acid sequences. \n\nThe laureates will split the 11 million Swedish kronor ($1 million) award for their contributions to computational protein design and structure prediction. Baker's team has produced proteins with applications in medicine and materials science since his initial breakthrough in 2003. Hassabis and Jumper's AlphaFold, announced in 2020, has predicted structures for nearly all 200 million known proteins. \"We glimpsed at the beginning that it might be possible to create a whole new world of proteins that a", "id": 1294116, "language": null, "link": "https://science.slashdot.org/story/24/10/09/143238/google-deepmind-scientists-win-nobel-chemistry-prize-for-work-on-proteins?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google DeepMind Scientists Win Nobel Chemistry Prize for Work on Proteins", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T15:20:13.373846+00:00", "description": "AmiMoJo writes: A treaty finalized by the UK may bring about the end of the .io domain. Last week, the British government announced that it has agreed to give up ownership of the Chagos Islands, a territory in the Indian Ocean it has controlled since 1814 -- relinquishing the .io domain with it. \n\nThe Internet Assigned Numbers Authority (IANA) has a process for retiring old country code domains within five years (with the possibility for extensions). The IANA established this rule after the Soviet Union's .su domain lingered after its collapse, becoming a domain commonly used among cybercriminals. Since then, IANA has also had to retire the .yu domain previously used for Yugoslavia, but it remained operational for years following the country's breakup while government websites transitioned to new domains. And while the independent Solomon Islands does have the domain name .sb, where 'B' stands for how it used to be a British protectorate, that domain was registered decades after it ac", "id": 1294115, "language": null, "link": "https://news.slashdot.org/story/24/10/09/1440227/how-a-uk-treaty-could-spell-the-end-of-the-io-domain?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "How a UK Treaty Could Spell the End of the<nobr> <wbr></nobr>.io Domain", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T07:40:59.360868+00:00", "description": "In a new 32-page filing (PDF), the Department of Justice indicated that it was considering a possible breakup of Google as an antitrust remedy for its search and advertising monopoly. The remedies necessary to \"prevent and restrain monopoly maintenance could include contract requirements and prohibitions; non-discrimination product requirements; data and interoperability requirements; and structural requirements,\" the department said in the filing. CNBC reports: The DOJ also said it was \"considering behavioral and structural remedies that would prevent Google from using products such as Chrome, Play, and Android to advantage Google search and Google search-related products and features -- including emerging search access points and features, such as artificial intelligence -- over rivals or new entrants.\"\n \nAdditionally, the DOJ suggested limiting or prohibiting default agreements and \"other revenue-sharing arrangements related to search and search-related products.\" That would includ", "id": 1291823, "language": null, "link": "https://yro.slashdot.org/story/24/10/09/0339229/doj-indicates-its-considering-google-breakup-following-monopoly-ruling?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "DOJ Indicates It's Considering Google Breakup Following Monopoly Ruling", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T04:10:56.376302+00:00", "description": "Researchers at BitEnergy AI, Inc. have developed Linear-Complexity Multiplication (L-Mul), a technique that reduces AI model power consumption by up to 95% by replacing energy-intensive floating-point multiplications with simpler integer additions. This method promises significant energy savings without compromising accuracy, but it requires specialized hardware to fully realize its benefits. Decrypt reports: L-Mul tackles the AI energy problem head-on by reimagining how AI models handle calculations. Instead of complex floating-point multiplications, L-Mul approximates these operations using integer additions. So, for example, instead of multiplying 123.45 by 67.89, L-Mul breaks it down into smaller, easier steps using addition. This makes the calculations faster and uses less energy, while still maintaining accuracy. The results seem promising. \"Applying the L-Mul operation in tensor processing hardware can potentially reduce 95% energy cost by element wise floating point tensor mul", "id": 1291260, "language": null, "link": "https://science.slashdot.org/story/24/10/08/2035247/researchers-claim-new-technique-slashes-ai-energy-use-by-95?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Researchers Claim New Technique Slashes AI Energy Use By 95%", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T03:05:55.999788+00:00", "description": "A new HBO documentary claims Canadian developer Peter Todd is Satoshi Nakamoto, the pseudonymous founder of bitcoin. The documentary's director, Emmy-nominated filmmaker Cullen Hoback, \"comes to the conclusion by stitching together old clues and new ones,\" reports Politico. In the film's finale, Hoback confronted Todd and said: \"It seems like you had these deep insights into bitcoin at the time?\" Todd replies: \"Well, yeah, I'm Satoshi Nakamoto.\" From the report: The admission, however, is not necessarily a smoking gun. Todd, who is a vocal backer of Ukraine and Israel on his X feed, is known to invoke the claim \"I am Satoshi\" as an expression of solidarity with the creator's bid for privacy. In an email to CoinDesk prior to the documentary's release, Todd reportedly denied he was the bitcoin creator: \"Of course I'm not Satoshi,\" he said. If Todd is widely accepted as bitcoin's creator, the revelation would end more than a decade of speculation over the identity of a person whose work ", "id": 1291123, "language": null, "link": "https://slashdot.org/story/24/10/09/0157238/bitcoin-creator-is-peter-todd-hbo-film-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Bitcoin Creator Is Peter Todd, HBO Film Says", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T02:01:04.018489+00:00", "description": "Foxconn has chosen Mexico for the site of the world's largest manufacturing facility for Nvidia's GB200 superchips. These chips are a \"key component of the U.S. firm's next-generation Blackwell family computing platform,\" notes Reuters. From the report: \"We're building the largest GB200 production facility on the planet,\" said Benjamin Ting, Foxconn senior vice president for the cloud enterprise solutions business group. Nvidia said in August that it had started shipping Blackwell samples to its partners and customers after tweaking its design, and expected several billion dollars in revenue from these chips in the fourth quarter. Ting said the partnership between his company and Nvidia was very important and everyone was asking for Nvidia's Blackwell platform. \"The demand is awfully huge,\" Ting said at the company's annual tech day in Taipei, standing next to Nvidia's vice president for AI and robotics, Deepu Talla.\n \nSpeaking to reporters later, Foxconn Chairman Young Liu said the p", "id": 1290965, "language": null, "link": "https://slashdot.org/story/24/10/08/2219214/foxconn-building-nvidia-superchip-facility-in-mexico?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Foxconn Building Nvidia Superchip Facility In Mexico", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T00:56:51.900298+00:00", "description": "\"Plasma is a popular desktop (and mobile) environment for GNU/Linux and other UNIX-like operating systems,\" writes longtime Slashdot reader jrepin. \"Among other things, it also powers the desktop mode of the Steam Deck gaming handheld. The KDE community today announced the latest release, Plasma 6.2.\" From the report: Plasma 6.2 includes a smorgasbord of new features for users of drawing tablets. It implements more complete support for the Wayland color management protocol, and enables it by default. There is also improved brightness handling for HDR and ICC profiles, as well as HDR performance. A new tone mapping feature built into Plasma's KWin compositor will help improve the look of images with a brightness or set of colors greater than what the screen can display, thus reducing the \"blown out\" look such images can otherwise exhibit.\n \nYou can now override misbehaving applications that block the system from going to sleep or locking the screen (and thus prevent saving power), and ", "id": 1290795, "language": null, "link": "https://tech.slashdot.org/story/24/10/08/2151217/kde-plasma-62-released?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "KDE Plasma 6.2 Released", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-09T00:56:51.806941+00:00", "description": "\"Alleged photos and videos of an unannounced 14-inch MacBook Pro with an M4 chip continue to surface on social media, in what could be the worst product leak for Apple since an employee accidentally left an iPhone 4 prototype at a bar in California in 2010,\" writes MacRumors' Joe Rossignol. From the report: The latest video of what could be a next-generation MacBook Pro was shared on YouTube Shorts today by Russian channel Romancev768, just one day after another Russian channel shared a similar video. The clip shows a box for a 14-inch MacBook Pro that is apparently configured with an M4 chip with a 10-core CPU and a 10-core GPU, 16GB of RAM, 512GB of storage, three Thunderbolt 4 ports, and a Space Black finish. According to the \"About This Mac\" software menu shown in the video, the MacBook Pro in the video is allegedly an unreleased November 2024 model. [...]\n \nApple is well known for having a culture of secrecy, so this magnitude of leak is rarely seen for its products. As previousl", "id": 1290794, "language": null, "link": "https://mobile.slashdot.org/story/24/10/08/225214/apple-potentially-facing-worst-leak-since-iphone-4-was-left-in-a-bar?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Potentially Facing Worst Leak Since iPhone 4 Was Left In a Bar", "vote": 0}]