[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T23:32:47.831292+00:00", "description": "HarperCollins has partnered with an AI technology company to allow limited use of select nonfiction backlist titles for training AI models, offering authors the choice to opt in for a $2,500 non-negotiable fee. 404 Media reports: On Friday, author Daniel Kibblesmith, who wrote the children's book Santa's Husband and published it with HarperCollins, posted screenshots on Bluesky of an email he received, seemingly from his agent, informing him that the agency was approached by the publisher about the AI deal. \"Let me know what you think, positive or negative, and we can handle the rest of this for you,\" the screenshotted text in an email to Kibblesmith says. The screenshots show the agent telling Kibblesmith that HarperCollins was offering $2,500 (non-negotiable).\n \n\"You are receiving this memo because we have been informed by HarperCollins that they would like permission to include your book in an overall deal that they are making with a large tech company to use a broad swath of nonf", "id": 1539659, "language": null, "link": "https://slashdot.org/story/24/11/18/2142209/harpercollins-confirms-it-has-a-deal-to-sell-authors-work-to-ai-company?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "HarperCollins Confirms It Has a Deal to Sell Authors' Work to AI Company", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T23:32:47.550307+00:00", "description": "An anonymous reader quotes a report from The Register: Framework CEO Nirav Patel had one of the bravest tech demos that we've seen at a conference yet -- modifying a Framework Laptop from x86 to RISC-V live on stage. In the five-minute duration of one of the Ubuntu Summit's Lightning Talks, he opened up a Framework machine, removed its motherboard, installed a RISC-V-powered replacement, reconnected it, and closed the machine up again. All while presenting the talk live, and pretty much without hesitation, deviation, or repetition. It was an impressive performance, and you can watch it yourself at the 8:56:30 mark in the video recording.\n \nNow DeepComputing is taking orders for the DC-ROMA board, at least to those in its early access program. The new main board is powered by a StarFive JH7110 System-on-Chip. (Note: there are two tabs on the page, for both the JH7110 and JH7100, and we can't link directly to the latter.) CNX Software has more details about the SoC. Although the SoC ha", "id": 1539658, "language": null, "link": "https://hardware.slashdot.org/story/24/11/18/2152205/framework-laptops-get-modular-makeover-with-risc-v-main-board?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Framework Laptops Get Modular Makeover With RISC-V Main Board", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T22:27:33.632824+00:00", "description": "An anonymous reader quotes a report from Ars Technica: An AI-generated nude photo scandal has shut down a Pennsylvania private school. On Monday, classes were canceled after parents forced leaders to either resign or face a lawsuit potentially seeking criminal penalties and accusing the school of skipping mandatory reporting of the harmful images. The outcry erupted after a single student created sexually explicit AI images of nearly 50 female classmates at Lancaster Country Day School, Lancaster Online reported. Head of School Matt Micciche seemingly first learned of the problem in November 2023, when a student anonymously reported the explicit deepfakes through a school portal run by the state attorney's general office called \"Safe2Say Something.\" But Micciche allegedly did nothing, allowing more students to be targeted for months until police were tipped off in mid-2024.\n \nCops arrested the student accused of creating the harmful content in August. The student's phone was seized a", "id": 1539349, "language": null, "link": "https://news.slashdot.org/story/24/11/18/2122251/explicit-deepfake-scandal-shuts-down-pennsylvania-school?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Explicit Deepfake Scandal Shuts Down Pennsylvania School", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T22:27:33.545049+00:00", "description": "Google is reportedly working on a multi-year project to migrate Chrome OS into Android, aiming to unify its operating systems and better compete with the iPad. This transition involves incorporating Chrome OS features like extensions and Linux app support into Android, with upcoming updates focused on improving desktop functionality and device compatibility. Android Authority reports: To better compete with the iPad as well as manage engineering resources more effectively, Google wants to unify its operating system efforts. Instead of merging Android and Chrome OS into a new operating system like rumors suggested in the past, however, a source told me that Google is instead working on fully migrating Chrome OS over to Android. While we don't know what this means for the Chrome OS or Chromebook brands, we did hear that Google wants future \"Chromebooks\" to ship with the Android OS in the future. That's why I believe that Google's rumored new Pixel Laptop will run a new version of deskt", "id": 1539348, "language": null, "link": "https://tech.slashdot.org/story/24/11/18/2131201/google-is-turning-chrome-os-into-android-to-compete-with-the-ipad?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Is Turning Chrome OS Into Android To Compete With the iPad", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T20:17:50.835986+00:00", "description": "India's competition watchdog has ordered WhatsApp to stop sharing user data with other Meta units for advertising purposes for five years and also levied a fine of $25.4 million for antitrust violations related to WhatsApp's controversial 2021 privacy policy. From a report: The Competition Commission of India, which began the investigation in 2021, found that WhatsApp's \"take-it-or-leave-it\" privacy update constituted an abuse of Meta's dominant position by forcing users to accept expanded data collection without an opt-out option. \n\nWhatsApp's 2021 privacy policy update required users to share their data with Meta companies in order to continue using the messaging service, removing a previous opt-out option that had existed since 2016. The mandatory data-sharing requirement expanded the scope of data collection and processing by Meta's group companies.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=India+Orders+Me", "id": 1538465, "language": null, "link": "https://yro.slashdot.org/story/24/11/18/1956242/india-orders-meta-to-curb-whatsapp-data-sharing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "India Orders Meta To Curb WhatsApp Data Sharing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T19:11:58.964686+00:00", "description": "Infosys founder Narayana Murthy has tripled down on his previous statements that 70-hour work weeks are what's needed in India and revealed he also thinks weekends were a mistake. From a report: Speaking on Indian TV channel CNBC-TV18 at the Global Leadership Summit in Mumbai last week Murthy once again declared he did not \"believe in work-life balance.\" \"I have not changed my view; I will take this with me to my grave,\" he asserted . \n\nThe argument from Murthy, and like-minded colleagues he quotes, is that India is a poor country that has work to do improving itself. Work-life balance can wait. The Infosys founder held prime minister Narendra Modi and his cabinet up as an example of proper workaholics, claiming the PM toils for 100 hours a week, and suggested that not following suit demonstrates a lack of appreciation. \"Frankly I was a little bit disappointed in 1986 when we moved from a six-day week to a five-day week,\" he added. \n\n\"I was not very happy with that. I think in this c", "id": 1538062, "language": null, "link": "https://slashdot.org/story/24/11/18/1814244/weekends-were-a-mistake-says-infosys-co-founder-narayana-murthy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Weekends Were a Mistake, Says Infosys Co-founder Narayana Murthy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T18:06:35.036763+00:00", "description": "An anonymous reader shares a report: China's population is expected to shrink by 51 million -- more than the size of California -- over the next decade as policymakers struggle to reverse the country's falling birth rate, according to Bloomberg Intelligence. By 2035, the population is expected to drop to 1.36 billion, levels not seen since 2012, down from a peak of 1.41 billion in 2021, BI senior industry analyst Ada Li estimates. \n\nThere could be a temporary spike in births in 2024 as the Year of the Dragon is considered an auspicious time to have children. But past single-year surges in birth rates have been short-lived, and this year may be no exception, especially with marriage rates at an all-time low, Li said. China faces a looming population crisis, with the United Nations projecting it could shrink to half its current size by 2100.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Population+Set+for+51+M", "id": 1537570, "language": null, "link": "https://news.slashdot.org/story/24/11/18/1721232/china-population-set-for-51-million-drop-as-pro-birth-moves-fail?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "China Population Set for 51 Million Drop as Pro-Birth Moves Fail", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T17:01:11.255630+00:00", "description": "An anonymous reader shares a report: Blizzard Entertainment first released World of Warcraft in November 2004, so The New York Times celebrated the anniversary by outlining the many ways we can still see the massively multiplayer online roleplaying game's influence's 20 years later. \n\nFor one thing, while multiplayer games and early social networks such as MySpace already existed, WoW provided a real preview of a future where everyone would connect to friends and strangers online. For another, the game made billions of dollars with a business model combining monthly subscriptions with in-game purchases (including for pets and animals that players could ride), becoming a massive cash cow for Blizzard and pointing the way to future internet business models.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=World+of+Warcraft+Turns+20%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F11%2F18%2F1624212%2F%3Futm_source%3Dt", "id": 1537054, "language": null, "link": "https://games.slashdot.org/story/24/11/18/1624212/world-of-warcraft-turns-20?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "World of Warcraft Turns 20", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T17:01:11.165393+00:00", "description": "The Belgian region of Flanders is rolling out personal data \"pods\" to 7 million citizens in a trial of World Wide Web inventor Tim Berners-Lee's vision for user-controlled data privacy. \n\nFive Belgian hospitals have begun storing patient visit information in the data pods, developed by Berners-Lee's startup Inrupt over the past five years. The system aims to help compliance with European privacy regulations by giving citizens control over their personal information, from medical records to social media posts. \n\nThe initiative counters the current internet landscape dominated by major technology companies like Google and Meta, which store user data across their servers. Berners-Lee, who created the World Wide Web at CERN in 1989, advocates for returning data control to users through decentralized systems rather than leaving it vulnerable to harvesting by tech platforms and governments.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter", "id": 1537053, "language": null, "link": "https://yro.slashdot.org/story/24/11/18/1654250/belgian-region-trials-web-founders-data-privacy-system?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Belgian Region Trials Web Founder's Data Privacy System", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T15:56:37.935891+00:00", "description": "Donald Trump has named FCC Commissioner Brendan Carr to chair the U.S. communications regulator when he takes office in January 2025, citing Carr's stance against what Trump called \"regulatory lawfare.\" Carr, a lawyer and longtime Republican who has served at the FCC under both Trump and Biden administrations, has emerged as a vocal critic of major social media companies' content moderation practices. \n\n\"Humbled and honored\" by the appointment, Carr pledged on X to \"dismantle the censorship cartel.\" As the FCC's senior Republican commissioner, Carr has advocated for stricter oversight of technology companies, pushing for transparency rules on platforms like Google and Facebook, expanded rural broadband access, and tougher restrictions on Chinese-owned TikTok. Trump praised Carr as a \"warrior for free speech\" while announcing the appointment. During his campaign, Trump has said he would seek to revoke licenses of television networks he views as biased.<p><div class=\"share_submission\" ", "id": 1536662, "language": null, "link": "https://news.slashdot.org/story/24/11/18/1445208/trump-picks-carr-to-head-fcc-with-pledge-to-fight-censorship-cartel?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Trump Picks Carr To Head FCC With Pledge To Fight 'Censorship Cartel'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T15:56:37.705174+00:00", "description": "Apple has stopped selling its Lightning-to-3.5mm headphone jack adapter in the U.S. and most countries, with limited stock remaining only in select European markets. The $9 accessory, introduced with iPhone 7 in 2016 (after the \"courageous\" move to stop including the headphone jack in iPhones), allowed users to connect traditional headphones to Lightning port iPhones. The discontinuation comes as Apple transitions to USB-C ports across its iPhone lineup.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Appears+Set+To+Discontinue+Lightning-to-Headphone+Adapter%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F11%2F18%2F150233%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F11%2F18%2F150233%2Fapple-appears-set-to-discontinue-lightning-to-hea", "id": 1536661, "language": null, "link": "https://apple.slashdot.org/story/24/11/18/150233/apple-appears-set-to-discontinue-lightning-to-headphone-adapter?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Appears Set To Discontinue Lightning-to-Headphone Adapter", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T14:52:10.847180+00:00", "description": "Silicon Valley's venture-capital firms are having an easy time finding promising startups to back. The hard part is cashing out. From a report: Last year, U.S. venture firms returned $26 billion worth of shares back to their investors, the lowest amount since 2011, according to the data provider PitchBook. Startup investors say 2024 has continued the trend, with high levels of investment and few acquisition deals or initial public offerings. \"We've raised a lot of money, and we've given very little back,\" Thomas Laffont, co-founder of investment firm Coatue Management, said at a recent conference. \"We are bleeding cash as an industry.\" \n\nLast year, U.S. venture firms invested $60 billion more than they collected, the highest such deficit in PitchBook's 26 years of data. As a result, the investors that back VC firms, such as university endowments and pension funds, aren't seeing the type of profits the industry has long delivered. The decline is particularly notable because the past t", "id": 1536134, "language": null, "link": "https://news.slashdot.org/story/24/11/18/1322218/ai-investments-are-booming-but-venture-firm-profits-are-at-a-historic-low?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Investments Are Booming, but Venture-Firm Profits Are at a Historic Low", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T13:45:36.742072+00:00", "description": "The goal? \"Make C++ and Rust interoperability easily accessible and approachable to the widest possible audience.\" And the Rust Foundation's \"Interop Initiative\" is specifically focused on the goal of interoperability \"within the same executable,\" through either inline embedding that allows \"integrated compilation\", or foreign function interfaces. \n\n\nTo that end, a statement addressing \"the challenges and opportunities in C++ and Rust interoperability\" was announced this week by the Rust Foundation. Pointing out that the \"Interop Initiative\" was launched in February 2024 with a $1M contribution from Google, it now \"proposes a collaborative, problem-space approach engaging key stakeholders from both language communities. \n\n\"Rather than prescribing specific solutions, this problem statement serves as a foundation for community input and participation in shaping both the strategic direction and tactical implementation of improved C++/Rust interoperability.\" \n\nTheir official problem stat", "id": 1535392, "language": null, "link": "https://developers.slashdot.org/story/24/11/18/046228/the-rust-foundation-wants-to-improve-rust-and-c-interoperability?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Rust Foundation Wants to Improve Rust and C++ Interoperability", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T09:16:48.925605+00:00", "description": "Dr. Adam Rodman, a Boston-based internal medicine expert, helped design a study testing 50 licensed physicians to see whether ChatGPT improved their diagnoses, reports the New York TImes. The results? \"Doctors who were given ChatGPT-4 along with conventional resources did only slightly better than doctors who did not have access to the bot. \n\n\"And, to the researchers' surprise, ChatGPT alone outperformed the doctors.\"\n\n[ChatGPT-4] scored an average of 90 percent when diagnosing a medical condition from a case report and explaining its reasoning. Doctors randomly assigned to use the chatbot got an average score of 76 percent. Those randomly assigned not to use it had an average score of 74 percent. \n\nThe study showed more than just the chatbot's superior performance. It unveiled doctors' sometimes unwavering belief in a diagnosis they made, even when a chatbot potentially suggests a better one. \n\nAnd the study illustrated that while doctors are being exposed to the tools of artificial", "id": 1534305, "language": null, "link": "https://science.slashdot.org/story/24/11/18/058208/chatgpt-4-beat-doctors-at-diagnosing-illness-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "ChatGPT-4 Beat Doctors at Diagnosing Illness, Study Finds", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T07:07:17.346626+00:00", "description": "The Tiobe index tries to track the popularity of programming languages by counting the number of search results for the language's name followed by the word \"programming\" (on 25 different search engines). And this month there were some surprises... \n\nBy TIOBE's reckoning, compared to a year ago PHP has now fallen from #7 to #12, while Delphi/Object Pascal shot up five spots from #16 to #11. In that same year, Fortran jumped from #12 to #8 &mdash; while both Visual Basic and SQL dropped down a single rank. Toward the top of the list, C actually fell from the #2 spot over the last 12 months to the #4 spot. \n\nAnd Go just reached the #7 rank on the TIOBE's ranking of programming language popularity &mdash; \"an all time high for Go,\" according to TIOBE CEO Paul Jansen. In this month's note, he explains what he thinks is unusual about this &mdash; starting by saying that Go programs are both fast, and easy in many ways &mdash; easy to deploy, easy to learn, and easy to understand.\n\nPython ", "id": 1533899, "language": null, "link": "https://developers.slashdot.org/story/24/11/18/0615246/on-15th-anniversary-go-programming-languages-rises-in-popularity?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "On 15th Anniversary, Go Programming Languages Rises in Popularity", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T03:44:44.343984+00:00", "description": "A new six-episode Dune series premiers tonight on HBO and Max &mdash; a prequel to the Denis Villeneuve-directed Dune movies set 10,000 years before the birth f Paul Atreides. The Hollywood Reporter writes that it \"draws on source material from the 2012 novel Sisterhood of Dune by Brian Herbert and Kevin J. Anderson, and Frank Herbert's 1965 novel Dune, the origin of the Dune universe.\"\nCord-cutters can stream Dune: Prophecy online without cable on Max, with subscriptions starting at $9.99 per month through both Prime Video and the Max website directly. Amazon offers a seven-day free trial to the Max channel. Those who want to watch Dune: Prophecy online without a traditional cable service can also get Max as an add-on to existing streaming services, including Hulu and DirecTV Stream. \n\n\nThe San Francisco Chronicle describes the series as \"\"&gt;all palace intrigues, agonizing deaths and magical mind games.\"\n\nTaking a further cue from the network's top-rated Game of Thrones, this show", "id": 1533404, "language": null, "link": "https://entertainment.slashdot.org/story/24/11/18/019235/new-dune-prequel-dune-prophecy-premieres-on-hbo-and-max?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "New Dune Prequel 'Dune: Prophecy' Premieres on HBO and Max", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T02:41:33.592760+00:00", "description": "Slashdot unixbhaskar writes: Linus has released a fresh Linux kernel for public consumption. Please give it a try and report any glitches to the maintainers for improvement. Also, please do not forget to express your appreciation to those tireless folks who did all the hard work for you. \n\nThe blog OMG Ubuntu calls it \"one of the most biggest kernel releases for a while,\" joking that it's a \"really real-time kernel.\"\n\nThe headline feature in Linux 6.12 is mainline support for PREEMPT_RT. This patch set dramatically improves the performance of real-time applications by making kernel processes pre-emptible &mdash; effectively enabled proper real-time computing... Meanwhile, Linus Torvalds himself contributes a new method for user-space address masking designed to claw back some of the performance lost due to Spectre-v1 mitigations. \n\nYou might have heard that kernel devs have been working to add QR error codes to Linux's kernel panic BSOD screen (as a waterfall of error text is often c", "id": 1533272, "language": null, "link": "https://linux.slashdot.org/story/24/11/18/0142252/linux-kernel-612-has-been-released?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Linux Kernel 6.12 Has Been Released", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-18T00:29:33.331630+00:00", "description": "This week Alphabet CEO Sundar Picahi assured investors that their long-term AI focus and investment (and a \"commitment to innovation\") \"are paying off,\" reports the Associated Press. Alphabet's stock has already soared 20% this year, and it's \"still thriving\" as the company \"navigates through a pivotal shift to AI and battles regulators...\"\n\nAlphabet earned $26.3 billion, or $2.12 per share during the most recent quarter, a 34% increase from a year ago. Revenue rose 15% from the same time last year to $88.27 billion... The profits would have been even higher if Google wasn't pouring so much money into building up its AI arsenal in a technological arms race that includes other industry heavyweights Microsoft, Amazon, Apple, Facebook parent Meta Platforms and rising star OpenAI. The AI investments are the primary reason Google's capital expenditures in the past quarter soared 62% from the same time last year to $13.1 billion. The AI spending will likely stay at roughly the same level d", "id": 1532904, "language": null, "link": "https://tech.slashdot.org/story/24/11/18/0022217/google-microsoft-are-spending-massively-on-ai-quarterly-earnings-show?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google, Microsoft Are Spending Massively on AI, Quarterly Earnings Show", "vote": 0}]