[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "PLAYSTATION PORTAL - 15 Things You NEED TO KNOW Before You Buy", "description": "This isn’t the PS Vita revival many wanted, but with Sony’s first handheld gaming device in a decade PlayStation Portal Remote Player promises a handheld window into your PS5 collection. \n\nAnnounced back in August, PlayStation Portal has been hyped and derided in equal measure, with a raft of useful features with all the gimmicks of the PS5’s DualSense Controllers offset by the wealth of features Sony’s upcoming handheld doesn’t include. \n\nPlaying your PS5 games on a stable Wi-Fi connection from wherever you are is an enticing prospect but is it worth the asking price? This feature highlights 15 things you need to know before you take the plunge and order one for yourself.", "link": "https://www.youtube.com/watch?v=QVrgrIIb_8k", "date_published": "2023-11-10T17:30:04+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/QVrgrIIb_8k/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "TOP 30 Best PS5 Games of All Time YOU NEED TO PLAY [2023 Edition]", "description": "Sony is no stranger to winning consoles - it's set records since the PlayStation One was released, and the PlayStation 2 continues to be the best-selling console. Of course, it's also known for having some of the best games available on its consoles.\n\nDespite being available for only three years, the PS5 already has a stellar line-up with Returnal, Horizon Forbidden West, Gran Turismo 7, Demon's Souls, The Last of Us Part 1 and many more. \n\nHere are the top 30 best PS5 titles as of 2023. This year has seen some incredible additions, but can they unseat the reigning classics? Find out here.", "link": "https://www.youtube.com/watch?v=8pOQqm5pd4Y", "date_published": "2023-11-10T13:30:04+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/8pOQqm5pd4Y/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]