[{"bookmarked": false, "language": null, "source_obj__id": 208, "title": "Tomb Raider 1-3 Remastered Review - The Final Verdict", "description": "The debut of Lara Croft in 1996 was a massive success for the developers, revolutionizing third-person games as we know them.\n\nNearly three decades later, a remastered collection of the first three games is out now for Xbox One, Xbox Series X/S, PS4, PS5, PC and Nintendo Switch courtesy of Aspyr. Tomb Raider 1-3 Remastered offers Modern controls, revamped visuals in keeping with the original's aesthetic and even Photo Mode.\n\nThe collection retains the original titles' compelling level design but also carries over many of their flaws, particularly with the camera and controls. Unfortunately, Tomb Raider 1-3 Remastered is best suited for the hardest of the hardcore rather than newcomers looking to get into the genre.", "thumbnail": "https://i2.ytimg.com/vi/EhTSflAQhzg/hqdefault.jpg", "page_rating": 0, "permanent": false, "page_rating_visits": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "vote": 0, "age": null, "comments": [], "link": "https://www.youtube.com/watch?v=EhTSflAQhzg", "tags": [], "dead": false, "album": "", "user": null, "date_published": "2024-02-14T18:30:10+00:00", "page_rating_votes": 0, "page_rating_contents": 0, "artist": "GamingBolt"}, {"bookmarked": false, "language": null, "source_obj__id": 208, "title": "Helldivers 2 DESTROYS Suicide Squad: Kill The Justice League", "description": "Helldivers 2 launched recently for PS5 and PC and has been making a splash for several reasons. On top of offering an excellent shooting experience, it's also a rare example of live service done right, wonderfully translating Arrowhead Game Studios' winning formula into third-person.\n\nMeanwhile, about two weeks ago, we had the launch of Suicide Squad: Kill the Justice League, Rocksteady's first new game since Batman: Arkham Knight. Despite some good-looking cutscenes and performances, it stumbles with the combat, level design, mission variety and even live service, perhaps the main reason it exists in the first place. That's even before considering monetization.\n\nJoin us as we compare the two and highlight the stark differences in approach that make Helldivers 2 much more successful.", "thumbnail": "https://i1.ytimg.com/vi/xGY02nBBgoo/hqdefault.jpg", "page_rating": 0, "permanent": false, "page_rating_visits": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "vote": 0, "age": null, "comments": [], "link": "https://www.youtube.com/watch?v=xGY02nBBgoo", "tags": [], "dead": false, "album": "", "user": null, "date_published": "2024-02-14T11:30:31+00:00", "page_rating_votes": 0, "page_rating_contents": 0, "artist": "GamingBolt"}]