[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "10 Best PS Vita Games of All Time - 2023 Edition", "description": "Sony tried to capitalize on the success of PSP with the PS Vita, but that initiative never really took off with the same magnitude. As a result, the PS Vita became one of Sony's biggest disappointments of the last decade. But it would be wrong to state that PS Vita was a bad console by any means, far from it. \n\nThere have been plenty of great games that leverage the power of the PS Vita to render beautiful worlds and incredible experiences that stay with you long after the credits roll. With this feature, we will be taking a look back at the 10 of the best games that represent the best of what the handheld had to offer.", "link": "https://www.youtube.com/watch?v=XOvjGaRwVXA", "date_published": "2023-12-23T15:30:07+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/XOvjGaRwVXA/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 Best Graphics of 2023 [4K]", "description": "As much as 2023 has impressed with its diverse range of settings and gameplay mechanics, its games have offered some of the best graphics. Of course, the most realistic-looking visuals aren't the be-all, end-all. There's also top-notch aesthetics and technical innovation to consider.\n\nWe're talking about Horizon Forbidden West - Burning Shores and how it evolved cloud generation tech to create massive cloud-scapes. Or Alan Wake 2, which effortlessly combines live-action and gameplay almost effortlessly. Attention to detail in environments or facial expressions also can't be discounted, whether you're navigating the treacherous Ishimura in Dead Space or enjoying the various twists and turns of Mortal Kombat 1's story.\n\nCheck out 15 of the best-looking games of 2023 and what made them such visual masterpieces.", "link": "https://www.youtube.com/watch?v=zCFgCKKhKB4", "date_published": "2023-12-23T09:30:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/zCFgCKKhKB4/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]