[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-21T17:30:00+00:00", "description": "The games industry is at a really interesting place right now, thanks to plenty of new developers working on games that are bursting at the seams with creative ideas and unlikely mishmash of contrasting genres. \n\nNovadust Entertainment’s upcoming Europa belongs to this category of games, and a lot of that can be credited to its strong visual aesthetic that’s inspired by Studio Ghibli’s works and an overall relaxing vibe to its open-world offerings. \n\nSet to release on PC sometime in the near future, Europa is brimming with potential. With this feature, we will be taking a look at its mechanics one by one and discussing why it could end up being one of the biggest games of this year.", "language": null, "link": "https://www.youtube.com/watch?v=-V4Kl0Dp5qc", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/-V4Kl0Dp5qc/hqdefault.jpg", "title": "This Beautiful Game Is Blowing My Mind...", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-21T13:30:16+00:00", "description": "The popularity of open world games and epic experiences that can last multiple dozens of hours is increasing by the day, as evidenced by how frequently we see such titles being made, but at the same time, as those long, behemoth games grow more common, so, too, does the demand for a return to shorter games by those who’re growing increasingly weary of longer games. \n\nConcerns with pricing and a general “bang for buck” factor notwithstanding, there’s no denying the instant appeal of a tightly designed, well made linear game that respects your time and within a respectable yet relatively shorter runtime, delivers a full, fulfilling experience. Here, we’ll be going over a few notable upcoming titles that are promising to do just that.", "language": null, "link": "https://www.youtube.com/watch?v=ftQya-TVbDU", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/ftQya-TVbDU/hqdefault.jpg", "title": "15 EXCITING Linear Games To Look Forward To In 2024 And Beyond", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-21T07:30:06+00:00", "description": "It’s been 13 years since Skyrim came out, and by the time The Elder Scrolls 6 launches, it’ll probably be well over a decade and a half. Fallout 4, meanwhile, is already nearly a decade old, and we’re likely still at least another decade away from Fallout 5. \n\nSuch interminably long gaps between mainline releases for franchises that are big and successful as these two are completely unheard of, and yet, the realities of game development and how long it takes to make a game (especially ones as large as Bethesda RPGs) have enforced this schedule on Bethesda Game Studios. \n\nSo how exactly can the company find a way to reduce those massive gaps? Here, we talk about all of that and more.", "language": null, "link": "https://www.youtube.com/watch?v=Pnvo_FLNHSQ", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/Pnvo_FLNHSQ/hqdefault.jpg", "title": "The Wait Between New Fallout And The Elder Scrolls Releases Is Getting Ridiculous", "user": null, "vote": 0}]