[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T23:35:18.690528+00:00", "description": "For the third straight day, \"More than 1,000 US flights have been,\" reports CNN, \"as airlines struggle to recover from a global tech outage that left thousands of passengers stranded at airports.\"\nMore than 1,200 flights into, within or out of the United States were canceled by early Sunday afternoon, while more than 5,000 U.S. flights were delayed, according to the tracking website FlightAware.com... On Saturday, 2,136 US flights were canceled, and more than 21,300 flights were delayed... \n\nUSA Today notes that Friday several U.S. airlines issued ground stops (according to America's Federal Aviation Administration) \"which caused a domino effect into Sunday.\" \n\nThey note that \"most of the cancellations and delays Sunday are likely to be caused by airline crews and equipment being out of place.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Third+Day+of+1%2C000%2B+Cancelled+Flights%2C+Just+in+the+US%2C+After+Crowdstrike+Outage%3A+https%3A%2F%", "id": 905313, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/21/214222/third-day-of-1000-cancelled-flights-just-in-the-us-after-crowdstrike-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Third Day of 1,000+ Cancelled Flights, Just in the US, After Crowdstrike Outage", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T21:25:26.381333+00:00", "description": "The Verge reports that for machines that aren't automatically receiving Crowdstrike's newly-released software fix, Microsoft has released a recovery tool that creates a bootable USB drive.\nSome IT admins have reported rebooting PCs multiple times will get the necessary update, but for others the only route is having to manually boot into Safe Mode and deleting the problematic CrowdStrike update file. Microsoft's recovery tool now makes this recovery process less manual, by booting into its Windows PE environment via USB, accessing the disk of the affected machine, and automatically deleting the problematic CrowdStrike file to allow the machine to boot properly. This avoids having to boot into Safe Mode or a requirement of admin rights on the machine, because the tool is simply accessing the disk without booting into the local copy of Windows. If a disk is protected by BitLocker encryption, the tool will prompt for the BitLocker recovery key and then continue to fix the CrowdStrike upd", "id": 904878, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/21/2043240/microsoft-releases-recovery-tool-for-windows-machines-hit-by-crowdstrike-issue?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Releases Recovery Tool for Windows Machines Hit By Crowdstrike Issue", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T19:15:37.290255+00:00", "description": "Harry R. Lewis has been a Harvard CS professor &mdash; teaching both Bill Gates and Mark Zuckerberg &mdash; and the dean of Harvard college. Born in 1947, Lewis remembers flipping the 18 toggle switches on Harvard's PDP-4 back in 1966 &mdash; up (\"click!\") or down (\"CLACK\"). And he thinks there's a lesson for today from a time when \"Computers were experienced as physical things.\" \n\n\n\n [T]he machine had a personality because it had a body you could feel and listen to. You could tell whether it was running smoothly by the way it sounded... \n\nUnlike the unreliable mechanical contraptions of yore, today's computers &mdash; uninteresting though they may be to look at if you can find them at all &mdash; mostly don't break down, so we have fewer reasons to remember their physicality. Does it matter that the line between humans and the machines we have created has so blurred? Of course it does. We have known for a long time that we would eventually lose the calculation game to our creations; ", "id": 904419, "language": "en-us", "link": "https://slashdot.org/story/24/07/21/1825210/what-can-we-learn-from-the-computers-of-1966?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "What Can We Learn from the Computers of 1966?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T19:15:35.720053+00:00", "description": "\"It has been the greatest honor of my life to serve as your President,\" U.S. President Joe Biden announced today. \" And while it has been my intention to seek reelection, I believe it is in the best interest of my party and the country for me to stand down and to focus solely on fulfilling my duties as President for the remainder of my term.\" \n\nIn an announcement posted on X.com, Biden thanked the American people. (\"Together, we overcame a once in a century pandemic and the worst economic crisis since the Great Depression.\") The short statement also said he would \"speak to the Nation later this week in more detail.\" \n\nThe Associated Press reports that \"His wife, first lady Jill Biden, responded by reposting the president's letter announcing his decision and adding red heart emojis.\" \n\nCNN reports that \"most Biden campaign staff, including some senior staff, found out from the president's post on X.\" \n\nIn a subsequent X post, Biden endorsed Vice President Kamala Harris to be the Democr", "id": 904418, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/21/1848203/us-president-biden-announces-he-will-not-seek-reelection?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US President Biden Announces He Will Not Seek Reelection", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T17:05:29.839203+00:00", "description": "Last year two different tourists &mdash; following GPS directions &mdash; drove their cars straight into the same harbor in Hawaii. \n\nAnd then last weekend &mdash; at the same harbor &mdash; it happened again.\n\n\"This time it was different,\" reports a local news station. \"The driver was a local...\"\n\nMultiple witnesses say the Prius was actually parked at the top of the ramp and that an enforcement officer with the Department of Land and Natural Resources told the owner she had to move it. Witnesses also said that the woman had an issue getting the car started. Eventually, she was able to start the vehicle and called out that the car was running. \nThen the car went down the ramp.... \n\nMore from Hawaii News Now:\nThis follows another viral incident, captured on video in May of last year, showing another SUV sinking in the water with its passengers inside. \"The GPS led them into the water,\" said one witness. Then, a few weeks later, it happened again. Witnesses say the driver, also an out-", "id": 903930, "language": "en-us", "link": "https://idle.slashdot.org/story/24/07/21/0118201/are-you-serious-hawaii-island-mayor-in-disbelief-after-third-vehicle-drives-straight-into-harbor?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Are You Serious?' Hawaii Island Mayor in Disbelief after Third Vehicle Drives Straight Into Harbor", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T16:00:09.029408+00:00", "description": "12 years on Mars &mdash; and NASA's Curiosity rover \"has made its most unusual find to date,\" reports CNN &mdash; rocks made of pure sulfur.\n\n \"And it all began when the 1-ton rover happened to drive over a rock and crack it open, revealing yellowish-green crystals never spotted before on the red planet.\"\n\n\"I think it's the strangest find of the whole mission and the most unexpected,\" said Ashwin Vasavada, Curiosity project scientist at NASA's Jet Propulsion Laboratory in Pasadena, California. \"I have to say, there's a lot of luck involved here. Not every rock has something interesting inside....\" White stones had been visible in the distance, and the mission scientists wanted a closer look. The rover drivers at JPL, who send instructions to Curiosity, did a 90-degree turn to put the robotic explorer in the right position for its cameras to capture a mosaic of the surrounding landscape. On the morning of May 30, Vasavada and his team looked at Curiosity's mosaic and saw a crushed rock", "id": 903747, "language": "en-us", "link": "https://science.slashdot.org/story/24/07/21/0220236/after-12-years-mars-rover-curiosity-makes-most-unusual-find-to-date?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "After 12 Years, Mars Rover Curiosity Makes 'Most Unusual Find to Date'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T14:56:17.532589+00:00", "description": "Who wrote the code for Windows' notorious \"Blue Screen of Death?\n\nIt's \"been a source of some contention,\" writes SFGate:\n\nA Microsoft developer blog post from Raymond Chen in 2014 said that former Microsoft CEO Steve Ballmer wrote the text for the Ctrl+Alt+Del dialog in Windows 3.1. That very benign post led to countless stories from tech media claiming Ballmer was the inventor of the \"Blue Screen of Death.\" That, in turn, prompted a follow-up developer blog post from Chen titled \"Steve Ballmer did not write the text for the blue screen of death....\" \n\nChen then later tried to claim he was responsible for the \"Blue Screen of Death,\" saying he coded it into Windows 95. Problem is, it already existed in previous iterations of Windows, and 95 simply removed it. Chen added it back in, which he sort of cops to, saying: \"And I'm the one who wrote it. Or at least modified it last.\" No one challenged Chen's 2014 self-attribution, until 2021, when former Microsoft developer Dave Plummer stepp", "id": 903504, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/21/0135205/who-wrote-the-code-for-windows-blue-screen-of-death?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Who Wrote the Code for Windows' 'Blue Screen of Death'?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T11:40:02.358586+00:00", "description": "This week the Computer Science Teachers Association conference kicked off Tuesday in Las Vegas, writes long-time Slashdot reader theodp. \nAnd the \"TeachAI\" education initiative teamed with the Computer Science Teachers Association to release three briefs \"arguing that K-12 computer science education is more important than ever in an age of AI.\"\n\n\nFrom the press release: \"As AI becomes increasingly present in the classroom, educators are understandably concerned about how it might disrupt the teaching of core CS skills like programming. With these briefs, TeachAI and CSTA hope to reinforce the idea that learning to program is the cornerstone of computational thinking and an important gateway to the problem-solving, critical thinking, and creative thinking skills necessary to thrive in today's digitally driven world. The rise of AI only makes CS education more important.\"\n\n To help drive home the point to educators, the 39-page Guidance on the Future of Computer Science Education in an ", "id": 902834, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/20/2222246/should-kids-still-learn-to-code-in-the-age-of-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Should Kids Still Learn to Code in the Age of AI?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T08:24:49.630088+00:00", "description": "The pace of China's clean energy transition \"is roughly the equivalent of installing five large-scale nuclear power plants worth of renewables every week,\" according to a report from Australia's national public broadcaster ABC (shared by long-time Slashdot reader AmiMoJo):\n\nA report by Sydney-based think tank Climate Energy Finance (CEF) said China was installing renewables so rapidly it would meet its end-of-2030 target by the end of this month &mdash; or 6.5 years early. \n\nIt's installing at least 10 gigawatts of wind and solar generation capacity every fortnight... \n\nChina accounts for about a third of the world's greenhouse gas emissions. A recent drop in emissions (the first since relaxing COVID-19 restrictions), combined with the decarbonisation of the power grid, may mean the country's emissions have peaked. \"With the power sector going green, emissions are set to plateau and then progressively fall towards 2030 and beyond,\" CEF China energy policy analyst Xuyang Dong said... [", "id": 902331, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/07/20/2124236/china-is-installing-renewables-equivalent-to-five-large-nuclear-plants-per-week?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China Is Installing Renewables Equivalent to Five Large Nuclear Plants Per Week", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T04:04:43.724518+00:00", "description": "Slashdot covered Barrett Brown back in 2011 and 2012. The New York Times calls him \"an activist associated with the hacker group Anonymous, and a political prisoner recently denied asylum in Britain, all of which sounds a bit dreary until we hear tell of it through Brown's unhinged self-regard.\" \nThey're reviewing Brown's \"extraordinary\" new memoir, My Glorious Defeats: Hacktivist, Narcissist, Anonymous,\" a book they call \"deranged, hyperbolic, and true.\"\n\n\nA \"machine\" that focuses attention on little-known social issues, Anonymous has gone after the Church of Scientology, Koch Industries, websites hosting child pornography and the Westboro Baptist Church. The public tends to be confused by nebulous digital activities, so it was, in the collective's heyday, helpful to have Brown act as a translator between the hackers and mainstream journalists. \"The year 2011 ended as it began,\" he writes, \"with a sophisticated hack on a state-affiliated corporation that ostensibly dealt in straightf", "id": 901927, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/20/1838225/former-anonymous-spokespersons-memoir-called-deranged-hyperbolic-and-true?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Former Anonymous Spokesperson's Memoir Called 'Deranged, Hyperbolic, and True'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-21T01:54:45.049336+00:00", "description": "2017 Slashdot headline: \"People Keep Finding Hidden Cameras in Their Airbnbs.\" \n\nNearly seven years later, CNN launched their own investigation of \"Airbnb's hidden camera problem\".\n\n CNN: \"Across North America, police have seized thousands of images from hidden cameras at Airbnb rentals, including people's most intimate moments... It's more than just a few reported cases. And Airbnb knows it's a problem. In this deposition reviewed by CNN, an Airbnb rep said 35,000 customer support tickets about security cameras or recording devices had been documented over a decade. [The deposition estimates \"about\" 35,000 tickets \"within the scope of the security camera and recording devices policy.\"] \n\nAirbnb told CNN a single complaint can involve multiple tickets. \nCNN actually obtained the audio recording of an Airbnb host in Maine admitting to police that he'd photographed a couple having sex using a camera hidden in a clock &mdash; and also photographed other couples. And one Airbnb guest told", "id": 901781, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/19/2025253/cnn-investigates-airbnbs-hidden-camera-problem?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "CNN Investigates 'Airbnb's Hidden Camera Problem'", "user": null, "vote": 0}]