[{"source": "https://www.gamespot.com/feeds/mashup", "title": "The Best Video Game Soundtracks Of 2023", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4237657-bestvideogamesoundtracks2023.jpg\" /><br /><h3><p dir=\"ltr\">The best games of 2023 haven't just been a visual treat; they've been an audio delight as well. Web-slinging adventures across New York City, pulse-pounding battles against dragons, and a journey across the stars have been fun experiences punctuated by soundtracks that have captured the spirit of those games.</p><p dir=\"ltr\">While there's no single video game score to declare as the best of 2023, there's no shortage of great tracks to throw on and listen to long after the credits have rolled on your favorite games.</p><p>We've gathered up a number of the standout examples of this year, so grab your comfiest headset, sit down, and strap yourself in for a tour across the best video game soundtracks of the year. For more of the best games in 2023, you can check out the crème de la crème of the <a href=\"https://www.gamespot.com/gallery/the-best-pc-g", "link": "https://www.gamespot.com/gallery/the-best-video-game-soundtracks-of-2023/2900-5010", "date_published": "2023-12-22T23:00:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GameSpot", "album": "GameSpot", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Where Is Xur Today? (December 22-26) Destiny 2 Exotic Items And Xur Location Guide", "description": "<p>Xur has arrived in the solar system as the Dawning continues to for one more week in <a href=\"https://www.gamespot.com/games/destiny-2/\">Destiny 2</a>. If you're looking for new builds to take advantage of its new weapons (or that <a href=\"https://www.gamespot.com/articles/destiny-2-wish-keeper-exotic-bow-how-to-start-the-starcrossed-exotic-mission/1100-6520043/\">new Exotic Strand bow, Wish-Keeper</a>, from the Warlord's Reign dungeon), you might want to check out Xur's slate of Legendary and Exotic gear. Here's where to find Xur and what he's selling this weekend.</p><p>This week you can find Xur in <strong>The EDZ</strong><strong>, in the Winding Cove area</strong>.</p><p>Xur is offering <strong>Coldheart</strong> for his Exotic weapon this week. Hunters can snag the <strong>Celestial Nighthawk</strong> helmet; Titans have the <strong>Synthoceps </strong>gauntlets; and for Warlocks, Xur offers the <strong>Felwinter's Helm</strong> helmet.</p><a href=\"https://www.gamespot.com/art", "link": "https://www.gamespot.com/articles/where-is-xur-today-december-22-26-destiny-2-exotic-items-and-xur-location-guide/1100-6520067/?ftag=CAD-01-10abi2f", "date_published": "2023-12-22T16:44:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GameSpot", "album": "GameSpot", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "The Marvel Cinematic Universe's Downward Spiral Kicked Into High Gear In 2023", "description": "<p>It's official: The Marvels is the worst-performing MCU movie ever, making even less than Black Adam, DC's similarly poor performer from last fall. Over the last decade and a half, Marvel has proven to be hugely popular, with its biggest movies among the highest earning films of all time. Meanwhile, The Marvels star Brie Larson is a massively popular actor reprising a role from the MCU's Infinity Saga. Yet, this is where we are. So what's going on?</p><p>People throw around the term \"superhero fatigue\" as a reason to dismiss poorly performing comic book movies or TV shows. It's more complicated than that, though. In reality, a combination of factors are at play, including a misunderstanding of why people were so invested in the first arc of MCU movies, things Marvel Studios should've been doing to get viewers ready for the future of the franchise, and a wild miscommunication between the studio and its fans about what matters in these movies and shows.</p><h3 dir=\"ltr\"><strong>Peopl", "link": "https://www.gamespot.com/articles/the-marvel-cinematic-universes-downward-spiral-kicked-into-high-gear-in-2023/1100-6519749/?ftag=CAD-01-10abi2f", "date_published": "2023-12-22T16:00:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GameSpot", "album": "GameSpot", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "The Last Of Us Is GameSpot's 2023 TV Show Of The Year", "description": "<p dir=\"ltr\">It was 2014 when the first adaptation of The Last of Us was announced. Screen Gems, the studio behind all of the Resident Evil movies and also dozens of other horror films, was going to bring The Last of Us to the big screen. Of course, that never happened. Instead, the movie eventually ended up becoming a TV show that landed at HBO, and the rest is excellent storytelling.</p><p dir=\"ltr\">The first season of HBO's The Last of Us is GameSpot's TV show of the year for 2023. Not only did it change the proverbial game by becoming easily the best live-action adaptation of a beloved video game, but it expanded the world in interesting ways and made us fall in love with new versions of Joel and Ellie.</p><p dir=\"ltr\">Played to perfection by Pedro Pascal and Bella Ramsey, respectively, this new living version of Ellie and Joel are an emotionally powerful duo. When you then include the characters who were greatly expanded on for the show--Bill, Frank, Sam, Henry, and Riley, for i", "link": "https://www.gamespot.com/articles/the-last-of-us-is-gamespots-2023-tv-show-of-the-year/1100-6520049/?ftag=CAD-01-10abi2f", "date_published": "2023-12-22T14:00:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GameSpot", "album": "GameSpot", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Remedy's Greatest Hits: The Music That Made The Games", "description": "<p>More than just the way they approach narrative, level design, and gunplay, there is one constant throughout every single one of Remedy's titles: they will always have the perfect song for the perfect occasion. While Alan Wake 2 is certainly their magnum opus in that regard among several contenders, it's about time we took a look back at the best needle drops in the studio's long history.</p><h3><strong>Max Payne Theme - Kärtsy Hatakka/Kimmo Kajasto (Max Payne)</strong></h3><div>          </div><p> </p><p>The original Max Payne's legacy is very much tied to the time of its release. It was the first video game to fully implement the slo-mo gunplay John Woo and the Wachowski Sisters had been trying to make into a Thing. But all that felt rather passe the more other games came and diluted the formula. The bullet-time may have been what got players in the door. But it was the neo-noir graphic novel vibes that have endured over the years. The constant leitmotif of those vibes is that th", "link": "https://www.gamespot.com/articles/remedys-greatest-hits-the-music-that-made-the-games/1100-6520038/?ftag=CAD-01-10abi2f", "date_published": "2023-12-22T13:00:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GameSpot", "album": "GameSpot", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Aquaman And The Lost Kingdom Ending And Mid-Credits Scene Explained", "description": "<p>Aquaman and the Lost Kingdom is in an exceptionally weird spot, as the final film in the old DC movieverse before James Gunn kicks off a new one in a couple years. It's adrift, in a sense, because it wasn't made to be an ending to anything. It's just a new Aquaman movie. But thanks to all this franchise noise, it's hard to look at it that way.</p><p dir=\"ltr\">But we're going to give it our best shot anyway.</p><p dir=\"ltr\"><strong>Warning: The remainder of this article will include detailed descriptions of the ending of Aquaman and the Lost Kingdom.</strong></p><a href=\"https://www.gamespot.com/articles/aquaman-and-the-lost-kingdom-ending-and-mid-credits-scene-explained/1100-6520065/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>", "link": "https://www.gamespot.com/articles/aquaman-and-the-lost-kingdom-ending-and-mid-credits-scene-explained/1100-6520065/?ftag=CAD-01-10abi2f", "date_published": "2023-12-22T00:00:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GameSpot", "album": "GameSpot", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]