[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T23:21:55.222330+00:00", "description": "An anonymous reader quotes a report from NPR : For the first time, internal TikTok communications have been made public that show a company unconcerned with the harms the app poses for American teenagers. This is despite its own research validating many child safety concerns. The confidential material was part of a more than two-year investigation into TikTok by 14 attorneys general that led to state officials suing the company on Tuesday. The lawsuit alleges that TikTok was designed with the express intention of addicting young people to the app. The states argue the multi-billion-dollar company deceived the public about the risks. In each of the separate lawsuits state regulators filed, dozens of internal communications, documents and research data were redacted -- blacked-out from public view -- since authorities entered into confidentiality agreements with TikTok.\n \nBut in one of the lawsuits, filed by the Kentucky Attorney General's Office, the redactions were faulty. This was re", "id": 1310217, "language": null, "link": "https://tech.slashdot.org/story/24/10/11/2021246/tiktok-execs-know-about-apps-effect-on-teens-lawsuit-documents-allege?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "TikTok Execs Know About App's Effect On Teens, Lawsuit Documents Allege", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T23:21:55.117077+00:00", "description": "Casio confirmed it suffered a ransomware attack earlier this month, resulting in the theft of personal and confidential data from employees, job candidates, business partners, and some customers. Although customer payment data was not compromised, Casio warns the impact may broaden as the investigation continues. BleepingComputer reports: The attack was disclosed Monday when Casio warned that it was facing system disruption and service outages due to unauthorized access to its networks during the weekend. Yesterday, the Underground ransomware group claimed responsibility for the attack, leaking various documents allegedly stolen from the Japanese tech giant's systems. Today, after the data was leaked, Casio published a new statement that admits that sensitive data was stolen during the attack on its network.\n \nAs to the current results of its ongoing investigation, Casio says the following information has been confirmed as likely compromised:\n \n- Personal data of both permanent and te", "id": 1310216, "language": null, "link": "https://yro.slashdot.org/story/24/10/11/2033213/casio-confirms-customer-data-stolen-in-ransomware-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Casio Confirms Customer Data Stolen In Ransomware Attack", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T22:04:56.615062+00:00", "description": "Ecovacs robot vacuums have been hacked across the U.S. to shout racial slurs at unsuspecting people. VICE News reports: The issue is specifically with Ecovacs' Deebot X2 model. The hackers gained control of the devices and used the onboard speakers to blast racial slurs at anyone within earshot. One such person was a lawyer from Minnesota named Daniel Swenson. He was watching TV when he heard some odd noises coming from the direction of his vacuum. He changed the password and restarted it. But then the odd sounds started up again. And then it started shouting racial slurs at him like a surly disgruntled maid.\n \nThere were multiple reports of similar incidents across the United States and around the same time. One of them happened in Los Angeles, where a vacuum chased a dog while spewing hate. Another happened in El Paso, where the vac spewed slurs until it's owner turned it off. The attacks are apparently quite easy to pull off thanks to several known security vulnerabilities in Ecova", "id": 1309917, "language": null, "link": "https://hardware.slashdot.org/story/24/10/11/2011249/robot-vacuums-hacked-to-shout-slurs-at-their-owners?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Robot Vacuums Hacked To Shout Slurs At Their Owners", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T20:59:31.631990+00:00", "description": "An anonymous reader quotes a report from TechCrunch: In late September, Shield AI cofounder Brandon Tseng swore that weapons in the U.S. would never be fully autonomous -- meaning an AI algorithm would make the final decision to kill someone. \"Congress doesn't want that,\" the defense tech founder told TechCrunch. \"No one wants that.\" But Tseng spoke too soon. Five days later, Anduril cofounder Palmer Luckey expressed an openness to autonomous weapons -- or at least a heavy skepticism of arguments against them. The U.S.'s adversaries \"use phrases that sound really good in a sound bite: Well, can't you agree that a robot should never be able to decide who lives and dies?\" Luckey said during a talk earlier this month at Pepperdine University. \"And my point to them is, where's the moral high ground in a landmine that can't tell the difference between a school bus full of kids and a Russian tank?\"\n \nWhen asked for further comment, Shannon Prior, a spokesperson for Anduril said that Luckey ", "id": 1309449, "language": null, "link": "https://tech.slashdot.org/story/24/10/11/1954252/silicon-valley-is-debating-if-ai-weapons-should-be-allowed-to-decide-to-kill?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Silicon Valley Is Debating If AI Weapons Should Be Allowed To Decide To Kill", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T20:59:31.393649+00:00", "description": "In response to California's new law targeting \"false advertising\" of \"digital goods,\" Valve has added the following language to its checkout page: \"A purchase of a digital product grants a license for the product on Steam.\" Ars Technica reports: California's AB2426 law, signed by Gov. Gavin Newsom Sept. 26, excludes subscription-only services, free games, and digital goods that offer \"permanent offline download to an external storage source to be used without a connection to the internet.\" Otherwise, sellers of digital goods cannot use the terms \"buy, purchase,\" or related terms that would \"confer an unrestricted ownership interest in the digital good.\" And they must explain, conspicuously, in plain language, that \"the digital good is a license\" and link to terms and conditions.\n \nWhich is what Valve has now added to its cart page before enforcement of these terms was due to start next year. The company has long made it clear, deeper inside its End User License Agreement (EULA), that ", "id": 1309448, "language": null, "link": "https://games.slashdot.org/story/24/10/11/202239/steam-adds-the-harsh-truth-that-youre-buying-a-license-not-the-game-itself?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Steam Adds the Harsh Truth That You're Buying 'A License,' Not the Game Itself", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T19:51:52.683076+00:00", "description": "U.S. officials are racing to understand the full scope of a China-linked hack of major U.S. broadband providers, as concerns mount from members of Congress that the breach could amount to a devastating counterintelligence failure. From a report: Federal authorities and cybersecurity investigators are probing the breaches of Verizon Communications, AT&amp;T and Lumen Technologies. A stealthy hacking group known as Salt Typhoon tied to Chinese intelligence is believed to be responsible. The compromises may have allowed hackers to access information from systems the federal government uses for court-authorized network wiretapping requests, The Wall Street Journal reported last week. \n\nAmong the concerns are that the hackers may have essentially been able to spy on the U.S. government's efforts to surveil Chinese threats, including the FBI's investigations. The House Select Committee on China sent letters Thursday asking the three companies to describe when they became aware of the breach", "id": 1308423, "language": null, "link": "https://news.slashdot.org/story/24/10/11/1445231/us-officials-race-to-understand-severity-of-chinas-salt-typhoon-hacks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Officials Race To Understand Severity of China's Salt Typhoon Hacks", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T19:51:52.594954+00:00", "description": "Microsoft will offer direct game purchases through its Xbox app for Android starting November, following a U.S. court ruling against Google's app store monopoly. The move allows Microsoft to circumvent Google's revenue cut on in-app purchases and signals renewed focus on mobile gaming, bolstered by its recent $75.4 billion Activision Blizzard acquisition.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+To+Sell+Xbox+Games+Directly+Through+Android+App%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F10%2F11%2F1457249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F10%2F11%2F1457249%2Fmicrosoft-to-sell-xbox-games-directly-through-android-app%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_la", "id": 1308422, "language": null, "link": "https://games.slashdot.org/story/24/10/11/1457249/microsoft-to-sell-xbox-games-directly-through-android-app?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft To Sell Xbox Games Directly Through Android App", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T19:51:52.503508+00:00", "description": "A group of Wikipedia editors have formed WikiProject AI Cleanup, \"a collaboration to combat the increasing problem of unsourced, poorly-written AI-generated content on Wikipedia.\" From a report: The group's goal is to protect one of the world's largest repositories of information from the same kind of misleading AI-generated information that has plagued Google search results, books sold on Amazon, and academic journals. \"A few of us had noticed the prevalence of unnatural writing that showed clear signs of being AI-generated, and we managed to replicate similar 'styles' using ChatGPT,\" Ilyas Lebleu, a founding member of WikiProject AI Cleanup, told me in an email. \"Discovering some common AI catchphrases allowed us to quickly spot some of the most egregious examples of generated articles, which we quickly wanted to formalize into an organized project to compile our findings and techniques.\" \n\nIn many cases, WikiProject AI Cleanup finds AI-generated content on Wikipedia with the same m", "id": 1308421, "language": null, "link": "https://news.slashdot.org/story/24/10/11/1554202/the-editors-protecting-wikipedia-from-ai-hoaxes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Editors Protecting Wikipedia from AI Hoaxes", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T19:51:52.406637+00:00", "description": "Former Google CEO Eric Schmidt urged prioritizing AI infrastructure over climate goals at a Washington AI summit this week. Schmidt, who led Google until 2011, argued that AI's rapid growth will outpace environmental mitigation efforts. \"We're not going to hit the climate goals anyway because we're not organized to do it,\" Schmidt told attendees, addressing concerns about AI's surging energy demands. \n\nData centers powering AI are projected to consume 35 gigawatts annually by 2030, up from 17 gigawatts in 2023, according to McKinsey. Schmidt, now heading AI drone company White Stork, suggested AI could ultimately solve climate issues, stating, \"I'd rather bet on AI solving the problem than constraining it.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Former+Google+Chief+Urges+AI+Investment+Over+Climate+Targets%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F10%2F11%2F1637248%2F%3Futm_source%3Dtwitter%26utm_medi", "id": 1308420, "language": null, "link": "https://tech.slashdot.org/story/24/10/11/1637248/former-google-chief-urges-ai-investment-over-climate-targets?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Former Google Chief Urges AI Investment Over Climate Targets", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T19:51:52.314177+00:00", "description": "penciling_in writes: Ukrainian authorities have arrested a 28-year-old man in Khmelnytskyi for running an illegal VPN service that allowed users to bypass Ukrainian sanctions and access the Russian internet (Runet). The VPN, active since Russia's invasion, enabled Russian sympathizers and people in occupied territories to reach blocked Russian government sites, social media, and news. \n\nHandling over 100GB of data daily and linking to 48 million Russian IP addresses, the VPN may have been exploited by Russian intelligence. Ukrainian cyber police, in collaboration with the National Security Service, seized servers and equipment in multiple locations. The suspect faces charges under Part 5 of Article 361 of Ukraine's Criminal Code, which could lead to a 15-year prison sentence. Investigations are ongoing into further connections and funding sources. The case highlights the growing role of VPNs in the ongoing cyberwar between Ukraine and Russia.<p><div class=\"share_submission\" style=\"pos", "id": 1308419, "language": null, "link": "https://tech.slashdot.org/story/24/10/11/171243/ukraine-arrests-vpn-operator-facilitating-access-to-russian-internet?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Ukraine Arrests VPN Operator Facilitating Access to Russian Internet", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T19:51:52.216812+00:00", "description": "An APT hacking group known as GoldenJackal has successfully breached air-gapped government systems in Europe using two custom toolsets to steal sensitive data, like emails, encryption keys, images, archives, and documents. From a report: According to an ESET report, this happened at least two times, one against the embassy of a South Asian country in Belarus in September 2019 and again in July 2021, and another against a European government organization between May 2022 and March 2024. In May 2023, Kaspersky warned about GoldenJackal's activities, noting that the threat actors focus on government and diplomatic entities for purposes of espionage. Although their use of custom tools spread over USB pen drives, like the 'JackalWorm,' was known, cases of a successful compromise of air-gapped systems were not previously confirmed.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=European+Govt+Air-Gapped+Systems+Breached+Us", "id": 1308418, "language": null, "link": "https://it.slashdot.org/story/24/10/11/1811217/european-govt-air-gapped-systems-breached-using-custom-malware?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "European Govt Air-Gapped Systems Breached Using Custom Malware", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T19:51:52.119486+00:00", "description": "The oldest human on record, Jeanne Calment of France, lived to the age of 122. What are the odds that the rest of us get there, too? Not high, barring a transformative medical breakthrough, according to research published this week in the journal Nature Aging. From a report: The study looked at data on life expectancy at birth collected between 1990 and 2019 from some of the places where people typically live the longest: Australia, France, Italy, Hong Kong, Japan, South Korea, Spain, Sweden and Switzerland. Data from the United States was also included, though the country's life expectancy is lower. \n\nThe researchers found that while average life expectancies increased during that time in all of the locations, the rates at which they rose slowed down. The one exception was Hong Kong, where life expectancy did not decelerate. The data suggests that after decades of life expectancy marching upward thanks to medical and technological advancements, humans could be closing in on the limit", "id": 1308417, "language": null, "link": "https://science.slashdot.org/story/24/10/11/1934240/have-we-reached-peak-human-life-span?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Have We Reached Peak Human Life Span?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T14:27:11.060208+00:00", "description": "OpenAI's GPT Store, launched in January 2024, has failed to deliver on promised revenue-sharing for most small developers. Despite CEO Sam Altman's earlier statements about paying creators, only a select few have been invited to a pilot program, Wired is reporting. \n\nDevelopers like Josh Brent Villocido, whose Books GPT was featured at launch, remain excluded from monetization opportunities. Many GPT creators report lack of analytics and unclear performance metrics. Some have devised workarounds, placing affiliate links or ads within their GPTs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI's+GPT+Store+has+Left+Some+Developers+in+the+Lurch%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F10%2F11%2F1033247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org", "id": 1307403, "language": null, "link": "https://tech.slashdot.org/story/24/10/11/1033247/openais-gpt-store-has-left-some-developers-in-the-lurch?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI's GPT Store has Left Some Developers in the Lurch", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T12:09:22.713715+00:00", "description": "An anonymous reader quotes a report from Liliputing: The Fedora Asahi Remix GNU/Linux distribution is now shipping with alpha versions of OpenGL, OpenCL, and Vulkan graphics drivers that allow you to play some games on Macs with M1 or M2 series processors. But there are a few things to keep in mind. One is that most of the PC games you're likely going to want to play are designed to run on Windows PCs with DirectX drivers and x86 processors. So there's some emulation required to get them to run on Macs with ARM-based processors, a Linux-based operating system, and Vulkan drivers.\n \nSome of the work was also made possible by the folks at Valve, who developed the Proton software that allows many PC games to run on Linux. And during a live demo at XDC 2024, developer Alyssa Rosenzweig demonstrated the Steam game client loading and running on an Apple Silicon Mac running Asahi Linux. For that reason, it takes a lot of RAM -- according to the Asahi team, \"most games require 16GB of memory ", "id": 1306512, "language": null, "link": "https://linux.slashdot.org/story/24/10/11/0426252/asahi-linux-brings-support-for-aaa-gaming-to-apple-silicon-macs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Asahi Linux Brings Support For AAA Gaming To Apple Silicon Macs", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T10:02:01.121098+00:00", "description": "In a rare disclosure, the U.S. Space Force announced that its secretive X-37B spaceplane will execute a series of maneuvers before returning back to Earth. SpaceNews reports: The reusable spacecraft, which has been in orbit since December 28, 2023, will perform aerobraking maneuvers to alter its trajectory around Earth, the Space Force said Oct. 10. This technique involves making multiple passes through the planet's upper atmosphere, using atmospheric drag to modify the vehicle's orbit while conserving fuel. These maneuvers also are intended to showcase responsible space operations, the Space Force said. The aerobraking enables the spaceplane to change orbits and comply with space debris mitigation rules by safely discarding the service module.\n \nThe X-37B, manufactured by Boeing, is jointly operated by the U.S. Space Force and the Air Force Rapid Capabilities Office. Since its launch aboard a SpaceX Falcon Heavy rocket from NASA's Kennedy Space Center in Florida, the spaceplane has b", "id": 1305594, "language": null, "link": "https://tech.slashdot.org/story/24/10/11/0414244/us-military-spaceplane-to-perform-orbital-maneuvers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Military Spaceplane To Perform Orbital Maneuvers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T07:34:55.184623+00:00", "description": "A new study suggests game piracy costs publishers 19% of revenue on average when digital rights management (DRM) protections are cracked. Research associate William Volckmann at UNC analyzed 86 games using Denuvo DRM on Steam between 2014-2022. \n\nThe study, published in Entertainment Computing, found cracks appearing in the first week after release led to 20% revenue loss, dropping to 5% for cracks after six weeks. Volckmann used Steam user reviews and player counts as proxies for sales data.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+True+Cost+of+Game+Piracy%3A+20%25+of+Revenue%2C+According+To+a+New+Study%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F10%2F10%2F1846211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F10%2F10%2F184621", "id": 1304866, "language": null, "link": "https://games.slashdot.org/story/24/10/10/1846211/the-true-cost-of-game-piracy-20-of-revenue-according-to-a-new-study?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The True Cost of Game Piracy: 20% of Revenue, According To a New Study", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T07:34:55.015713+00:00", "description": "The FBI created a cryptocurrency as part of an investigation into price manipulation in crypto markets, the government revealed on Wednesday. From a report: The FBI's Ethereum-based token, NexFundAI, was created with the help of \"cooperating witnesses.\" As a result of the investigation, the Securities and Exchange Commission charged three \"market makers\" and nine people for allegedly engaging in schemes to boost the prices of certain crypto assets. The Department of Justice charged 18 people and entities for \"widespread fraud and manipulation\" in crypto markets. \n\nThe defendants allegedly made false claims about their tokens and executed so-called \"wash trades\" to create the impression of an active trading market, prosecutors claim. The three market makers -- ZMQuant, CLS Global, and MyTrade -- allegedly wash traded or conspired to wash trade on behalf of NexFundAI, an Ethereum-based token they didn't realize was created by the FBI. \n\n\"What the FBI uncovered in this case is essentiall", "id": 1304865, "language": null, "link": "https://yro.slashdot.org/story/24/10/10/1857245/the-fbi-secretly-created-a-coin-to-investigate-crypto-pump-and-dump-schemes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The FBI Secretly Created a Coin To Investigate Crypto Pump-and-Dump Schemes", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T07:34:54.846877+00:00", "description": "An anonymous reader quotes a report from Gizmodo: The Internet Archive and Wayback Machine went down on Tuesday following a sustained cyber attack. In addition, the Archive's user data has been compromised. If you've ever logged into the site to pore over its ample archives, it's time to change your passwords. [...] A pro-Palestenian hacktivist group called SN_BLACKMETA has taken responsibility for the hack on X and Telegram. \"They are under attack because the archive belongs to the USA, and as we all know, this horrendous and hypocritical government supports the genocide that is being carried out by the terrorist state of 'Israel,'\" the group said on X when someone asked them why they'd gone after the Archive.\n \nThe group elaborated on its reasoning in a now-deleted post on X. Jason Scott, an archivist at the Archive, screenshotted it and shared it. \"Everyone calls this organization 'non-profit', but if its roots are truly in the United States, as we believe, then every 'free' servic", "id": 1304864, "language": null, "link": "https://tech.slashdot.org/story/24/10/10/2012200/hacktivists-claim-responsibility-for-taking-down-the-internet-archive?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Hacktivists Claim Responsibility For Taking Down the Internet Archive", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T07:34:54.660116+00:00", "description": "Microsoft is enhancing passkey support in Windows 11 with a redesigned Windows Hello experience that allows users to sync passkeys to their Microsoft account or third-party providers like 1Password and Bitwarden. The Verge reports: A new API for third-party password and passkey managers means developers can plug directly into the Windows 11 experience, so you can use the same passkey from your mobile device to authenticate on your PC. Right now it's possible in some apps to do this through QR codes and other ways to authenticate from a mobile device, but Microsoft's full support means the passkeys experience on Windows is about to get a lot better.\n \nMicrosoft is also redesigning the Windows Hello prompt, including the ability to setup syncing of passkeys to your Microsoft account or saving them elsewhere. Once you've completed a one-time setup process you can use facial recognition, fingerprint, or PIN to authenticate with a passkey across multiple Windows 11 devices. Windows Insider", "id": 1304863, "language": null, "link": "https://tech.slashdot.org/story/24/10/10/2019233/windows-11s-new-passkey-design-includes-cloud-syncing-1password-integration?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Windows 11's New Passkey Design Includes Cloud Syncing, 1Password Integration", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T07:34:54.459281+00:00", "description": "Ubuntu 24.10 'Oracular Oriole', the latest version of the popular Linux distro, introduces several enhancements including a revamped GNOME Initial Setup for ARM64 devices, updated file management features, and a more seamless experience with dialog boxes that adjust to aspect ratios. Celebrating Ubuntu's 20th anniversary, this release also \"offers a few touches for those who want to go down memory lane,\" reports Tom's Hardware. \"When the system boots up, you'll see the 20 Years Ubuntu logo right at the bottom of the screen. You can also set the desktop background to the original Ubuntu 4.10 wallpaper, and a Warty Brown accent color is an available option if you want to complete the feel. To round out the experience, Ubuntu 24.10 uses the original startup sound from 4.10, which plays every time you log in.\" From the report: The most significant change, as OMG! Ubuntu notes that ARM64 devices now use GNOME Initial Setup, which offers a cleaner, slicker way of setting up the operating sy", "id": 1304862, "language": null, "link": "https://news.slashdot.org/story/24/10/10/2042240/ubuntu-2410-oracular-oriole-released-celebrating-20-years-of-ubuntu?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Ubuntu 24.10 'Oracular Oriole' Released, Celebrating 20 Years of Ubuntu", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T07:34:54.262348+00:00", "description": "An anonymous reader quotes a report from Wired: Amazon might not have ChatGPT, but it has a roadmap that includes developing even more advanced forms of artificial intelligence -- including AI agents that are hell-bent on helping you buy stuff. The ecommerce company is already sprinkling ChatGPT-like AI over its website and apps -- today announcing, among other enhancements, AI-generated shopping guides for hundreds of different product categories. Executives at the company say its engineers are also exploring more ambitious AI services, including autonomous AI shopping agents that recommend goods to a customer or even add items to their cart.\n \n\"It's on our roadmap. We're working on it, prototyping it, and when we think it's good enough, we'll release it in whatever form makes sense,\" says Trishul Chilimbi, a VP and distinguished scientist at Amazon who works on applying the company's core AI to its products and services. Chilimbi says the first step toward AI agents will likely be c", "id": 1304861, "language": null, "link": "https://slashdot.org/story/24/10/10/215253/amazon-dreams-of-ai-agents-that-do-the-shopping-for-you?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Dreams of AI Agents That Do the Shopping For You", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T07:34:54.063982+00:00", "description": "TechCrunch's Carly Page reports: Fidelity Investments, one of the world's largest asset managers, has confirmed that over 77,000 customers had personal information compromised during an August data breach, including Social Security numbers and driver's licenses. The Boston, Massachusetts-based investment firm said in a filing with Maine's attorney general on Wednesday that an unnamed third party accessed information from its systems between August 17 and August 19 \"using two customer accounts that they had recently established.\"\n \n\"We detected this activity on August 19 and immediately took steps to terminate the access,\" Fidelity said in a letter sent to those affected, adding that the incident did not involve any access to customers' Fidelity accounts. Fidelity confirmed that a total of 77,099 customers were affected by the breach, and its completed review of the compromised data determined that customers' personal information was affected. When reached by TechCrunch, Fidelity did n", "id": 1304860, "language": null, "link": "https://yro.slashdot.org/story/24/10/10/2133224/fidelity-says-data-breach-exposed-personal-data-of-77000-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Fidelity Says Data Breach Exposed Personal Data of 77,000 Customers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T07:34:53.878167+00:00", "description": "AMD is launching a new chip to rival Nvidia's upcoming Blackwell chips, which Nvidia called the \"world's most powerful chip\" for AI when unveiled earlier this year. CNBC reports: The Instinct MI325X, as the chip is called, will start production before the end of 2024, AMD said Thursday during an event announcing the new product. If AMD's AI chips are seen by developers and cloud giants as a close substitute for Nvidia's products, it could put pricing pressure on Nvidia, which has enjoyed roughly 75% gross margins while its GPUs have been in high demand over the past year. In the past few years, Nvidia has dominated the majority of the data center GPU market, but AMD is historically in second place. Now, AMD is aiming to take share from its Silicon Valley rival or at least to capture a big chunk of the market, which it says will be worth $500 billion by 2028.\n \nAMD didn't reveal new major cloud or internet customers for its Instinct GPUs at the event, but the company has previously dis", "id": 1304859, "language": null, "link": "https://tech.slashdot.org/story/24/10/10/2143241/amd-launches-ai-chip-to-rival-nvidias-blackwell?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AMD Launches AI Chip To Rival Nvidia's Blackwell", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T07:34:53.670524+00:00", "description": "At Tesla's \"We, Robot\" event at Warner Bros. Studios tonight, Elon Musk unveiled the Tesla Cybercab, Robovan, and an updated version of the Optimus robot. Slashdot is at the event capturing photos and getting demos of everything announced. You can follow along on X. Below is a summary of each of the offerings. \nTesla Cybercab: The Tesla Cybercab is a futuristic, fully autonomous robotaxi designed without a steering wheel or pedals, positioned to revolutionize mass transit with extremely low operating costs. It features a sleek design with upward-opening butterfly doors and a compact cabin that seats two passengers. Musk said the Cybercab uses inductive charging instead of a traditional plug-in. \"Something we're also doing is and it's really high time we did this is inductive charging. So the robotaxi has no plug it just goes over the inductive charger and charges so yeah, it's kind of how it should be.\" The vehicle is expected to cost under $30,000. Regulatory approval will be needed ", "id": 1304858, "language": null, "link": "https://tech.slashdot.org/story/24/10/11/0328206/elon-musk-unveils-tesla-cybercab-robovan-and-updated-optimus-robot?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Elon Musk Unveils Tesla Cybercab, Robovan and Updated Optimus Robot", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-11T07:34:53.488814+00:00", "description": "An anonymous reader quotes a report from Ars Technica: On Wednesday, NYC-based software developer Nick Spreen received a surprising alert on his iPhone 15 Pro, delivered through an early test version of Apple's upcoming Apple Intelligence text message summary feature. \"No longer in a relationship; wants belongings from the apartment,\" the AI-penned message reads, summing up the content of several separate breakup texts from his girlfriend -- that arrived on his birthday, no less. Spreen shared a screenshot of the AI-generated message in a now-viral tweet on the X social network, writing, \"for anyone who's wondered what an apple intelligence summary of a breakup text looks like.\" Spreen told Ars Technica that the screenshot does not show his ex-girlfriend's full real name, just a nickname.\n \nThis summary feature of Apple Intelligence, announced by the iPhone maker in June, isn't expected to fully ship until an iOS 18.1 update in the fall. However, it has been available in a public beta", "id": 1304857, "language": null, "link": "https://entertainment.slashdot.org/story/24/10/10/228207/man-learns-hes-being-dumped-via-dystopian-ai-summary-of-texts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Man Learns He's Being Dumped Via 'Dystopian' AI Summary of Texts", "vote": 0}]