[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-03-23T20:30:05+00:00", "title": "Lightyear Frontier Early Access Review - A Solid Foundation", "age": null, "user": null, "source_obj__id": 129, "page_rating_visits": 0, "link": "https://www.youtube.com/watch?v=y9n5orBc934", "dead": false, "tags": [], "language": null, "permanent": false, "thumbnail": "https://i2.ytimg.com/vi/y9n5orBc934/hqdefault.jpg", "description": "Lightyear Frontier offers some relatively carefree farming on an alien planet, with the twist being that players use mechs for most of the planting, harvesting, exploration and resource management. It's currently in early access for PC, with the beginning of the first Act available.\n\nThe story seems formulaic (especially when alien artifacts enter the picture), and the characters are decent - not terrible, yet unexceptional. While the gameplay loop can feel a little too samey between regions, as players venture to cleanse them, the progression and gameplay fundamentals are solid and fun to engage with.\n\nAdd in a gorgeous presentation and calming music, and there's a solid foundation for Frame Break and Amplifier Studios to build off. How it will ultimately fare, especially with so much still needed, remains to be seen, but it's a relaxing time.", "album": "", "comments": [], "vote": 0, "page_rating_contents": 94, "artist": null, "bookmarked": false, "page_rating_votes": 0, "page_rating": 94}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-03-23T15:30:10+00:00", "title": "What The HELL Is Going On With Battlefield?", "age": null, "user": null, "source_obj__id": 129, "page_rating_visits": 0, "link": "https://www.youtube.com/watch?v=kfpLTo90Mno", "dead": false, "tags": [], "language": null, "permanent": false, "thumbnail": "https://i4.ytimg.com/vi/kfpLTo90Mno/hqdefault.jpg", "description": "Battlefield has gone through somewhat of a rough phase over the years. Following the disastrous launch (and troubled development) of Battlefield 2042, the publisher announced a new multi-studio approach for the franchise. \n\nHowever, a severe lack of announcements and the recent closure of Ridgeline Games after the mysterious departure of its head, Marcus Lehto, casts further doubt on the franchise. Is there a plan for the future, or is the series doomed?", "album": "", "comments": [], "vote": 0, "page_rating_contents": 94, "artist": null, "bookmarked": false, "page_rating_votes": 0, "page_rating": 94}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-03-23T11:00:00+00:00", "title": "Dragon's Dogma 2's Microtransactions Are Shameless", "age": null, "user": null, "source_obj__id": 129, "page_rating_visits": 0, "link": "https://www.youtube.com/watch?v=-MHEqG9qd2M", "dead": false, "tags": [], "language": null, "permanent": false, "thumbnail": "https://i2.ytimg.com/vi/-MHEqG9qd2M/hqdefault.jpg", "description": "Dragon's Dogma 2 received extensive praise from critics, and while fans are enjoying it, the launch has revealed some of the inherent problems with the title. On PC, it suffered from performance issues, crashes and even the inability to create a new character since there's no New Game option.\n\nHowever, the addition of microtransactions has arguably caused more backlash. Players can purchase items like Wakestones, Portcrystals and Rift Crystals for real money. While these are all earnable in-game, being asked to pay $70 and then unleashing in-game purchases without any prior discussion has attracted some disdain.\n\nThis has resulted in the Steam version dropping to a \"Mixed\" rating, with only 45 percent of reviews positive. While the developer is looking into fixing other issues, its approach to monetization is becoming a point of contention.", "album": "", "comments": [], "vote": 0, "page_rating_contents": 94, "artist": null, "bookmarked": false, "page_rating_votes": 0, "page_rating": 94}]