[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T22:57:11.010934+00:00", "description": "Longtime Slashdot reader DaPhil writes: I taught myself to code at 12 years old in the 90s and I've always liked the back-and-forth with the runtime to achieve the right result. I recently got back from other roles to code again, and when starting a new project last year, I decided to give the new \"AI assistants\" a go.\n \nMy initial surprise at the quality and the speed you can achieve when using ChatGPT and/or Copilot when coding turned sour over the months, as I realized that all the joy I felt about trying to get the result I want -- slowly improving my code by (slowly) thinking, checking the results against the runtime, and finally achieving success -- is, well, gone. What I do now is type English sentences in increasingly desperate attempts to get ChatGPT to output what I want (or provide snippets to Copilot to get the right autocompletion), which -- as they are pretty much black boxes -- is frustrating and non-linear: it either \"just works,\" or it doesn't. There is no measure of", "id": 1524363, "language": null, "link": "https://developers.slashdot.org/story/24/11/15/2138239/ask-slashdot-have-ai-coding-tools-killed-the-joy-of-programming?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Ask Slashdot: Have AI Coding Tools Killed the Joy of Programming?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T21:52:06.422447+00:00", "description": "An anonymous reader quotes a report from The Guardian: This year's Web Summit, in Lisbon, was all about artificial intelligence -- and a robot sorting laundry. Digit, a humanoid built by the US firm Agility Robotics, demonstrated how far AI has come in a few years by responding to voice commands -- filtered through Google's Gemini AI model -- to sift through a pile of colored T-shirts and place them in a basket. It wasn't a seamless demonstration but the enthusiastic response, nearly two years on from the launch of ChatGPT, reflected the excitement about all things AI that pervaded Europe's biggest annual tech conference.\n \n[...] Digit is being used in warehouses by GXO, a US logistics company, to lift boxes and place them on conveyor belts. According to the chief executive of Agility Robotics, Peggy Johnson, a new role could be created managing teams of Digits doing physical work. \"Employees who were previously doing this physical work, appreciate the fact that they can hand that of", "id": 1524045, "language": null, "link": "https://hardware.slashdot.org/story/24/11/15/2133254/laundry-sorting-robot-spurs-ai-hopes-and-fears-at-europes-biggest-tech-event?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Laundry-Sorting Robot Spurs AI Hopes and Fears At Europe's Biggest Tech Event", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T20:47:11.963279+00:00", "description": "The Federal Trade Commission reported Friday that the number of consumer complaints about unwanted telemarketing phone calls has dropped over 50% since 2021, continuing a trend that started three years ago. From a report: This year, the FTC has received 1.1 million reports regarding robocalls, down from 1.2 million one year before 2023 and from more than 3.4 million in 2021. According to this year's National Do Not Call Registry Data Book -- which provides the most recent data on robocall complaints together with a complete state-by-state analysis -- the highest number of consumer complaints targeted unwanted calls about medical and prescription issues, with more than 170,000 reports (most of them robocalls) received until September 30, 2024.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FTC+Reports+50%25+Drop+in+Unwanted+Call+Complaints+Since+2021%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F15%2F193422", "id": 1523787, "language": null, "link": "https://news.slashdot.org/story/24/11/15/1934225/ftc-reports-50-drop-in-unwanted-call-complaints-since-2021?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "FTC Reports 50% Drop in Unwanted Call Complaints Since 2021", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T19:42:13.544685+00:00", "description": "An anonymous reader shares a report: Future UN climate summits should be held only in countries that can show clear support for climate action and have stricter rules on fossil fuel lobbying, according to a group of influential climate policy experts. The group includes former UN secretary-general Ban Ki-moon, the former president of Ireland Mary Robinson, the former UN climate chief Christiana Figueres and the prominent climate scientist Johan Rockstrom. \n\nThey have written to the UN demanding the current complex process of annual \"conferences of the parties\" under the UN framework convention on climate change -- the Paris agreement's parent treaty -- be streamlined, and meetings held more frequently, with more of a voice given to developing countries. \"It is now clear that the Cop is no longer fit for purpose. We need a shift from negotiation to implementation,\" they wrote.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home", "id": 1523479, "language": null, "link": "https://news.slashdot.org/story/24/11/15/1850231/cop-summits-no-longer-fit-for-purpose-say-leading-climate-policy-experts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Cop Summits 'No Longer Fit For Purpose', Say Leading Climate Policy Experts", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T19:42:13.451227+00:00", "description": "Economist: Britain has long been a pioneer in telecoms. In 1837 it built the world's first commercial telegraph; the first transatlantic call was placed from London in 1927; in 1992 a British programmer sent the first text message to a mobile phone. Today it lags rather than leads. According to figures provided to The Economist by Opensignal, a research firm, Britain ranks 46th for download speeds out of the 56 developed and developing countries for which there are data. That gives it the worst mobile service in the rich world. \n\nSome of this is due to demand. Over the past three years data usage on mobile devices has doubled as people stream films and play games. The busiest parts of cities often lack mobile reception because the system is at capacity. But mainly it is an issue of supply. British users of 5G are only on it 11% of the time. That puts Britain 43rd out of the 56 countries. This lacklustre performance is caused by a combination of government U-turns, insufficient invest", "id": 1523478, "language": null, "link": "https://tech.slashdot.org/story/24/11/15/1921227/the-rich-country-with-the-worst-mobile-phone-service?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Rich Country With the Worst Mobile-Phone Service", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T18:37:13.495201+00:00", "description": "Sony faces mounting challenges after a year marked by major setbacks in its gaming and film divisions. The company's $200-400 million gaming project \"Concord\" sold only 25,000 copies before being discontinued, while PlayStation 5 sales targets were cut from 25 million to 21 million units. \n\nSony Pictures struggled with underperforming Spider-Man spin-offs and high-profile departures, including CEO Tony Vinciquerra. Over 1,200 employees were laid off across divisions, and profits fell 39% to $124 million in the latest quarter. Sony's stock dropped 5% over the past year while broader markets rose nearly 40%.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sony's+Had+the+Year+From+Hell%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F15%2F1735220%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=", "id": 1523113, "language": null, "link": "https://slashdot.org/story/24/11/15/1735220/sonys-had-the-year-from-hell?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Sony's Had the Year From Hell", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T18:37:13.385989+00:00", "description": "Classic first-person shooters Unreal (1998) and Unreal Tournament are now available for free on the Internet Archive, with official OK from publisher Epic Games. \n\nAn Epic spokesperson confirmed to PC Gamer that users are permitted to \"independently link to and play these versions.\" Players can download the games directly from the Internet Archive and apply patches from Github for modern Windows compatibility, or use simplified installers through oldunreal.com. Both titles run on current hardware despite their age, though users may need to adjust dated default settings like 640x480 resolution and inverted mouse controls.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Internet+Archive+Now+Hosts+Classic+Unreal+Games%3B+Epic+Games+Gives+Blessing%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F11%2F15%2F181257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"><", "id": 1523112, "language": null, "link": "https://games.slashdot.org/story/24/11/15/181257/internet-archive-now-hosts-classic-unreal-games-epic-games-gives-blessing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Internet Archive Now Hosts Classic Unreal Games; Epic Games Gives Blessing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T17:32:08.734934+00:00", "description": "Server maker Super Micro Computer is facing mounting challenges after EY resigned as its auditor on October 24, citing concerns about management's integrity and ethical values. EY's departure came just months after replacing Deloitte &amp; Touche, which had audited Super Micro for two decades through June 2023. \n\nThe resignation raises questions about potential issues Deloitte may have missed. Super Micro has appointed a special committee and hired legal and forensic accounting firms to investigate, though details remain undisclosed. The company faces a November 16 deadline to submit a compliance plan to Nasdaq regarding delayed financial reports. A former employee's lawsuit alleges improper revenue recognition between 2020-2022 under Deloitte's watch, prompting a Justice Department investigation. WSJ adds: Persuading another major audit firm to sign on under the current circumstances would be an impressive feat. EY in its resignation letter said it was \"unwilling to be associated wi", "id": 1522735, "language": null, "link": "https://slashdot.org/story/24/11/15/1652256/is-anyone-crazy-enough-to-audit-super-micro-computer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Is Anyone Crazy Enough To Audit Super Micro Computer?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T16:26:59.196122+00:00", "description": "British telecom Virgin Media O2 has deployed an AI tool to combat phone scammers by wasting their time with fake conversations, the company said. The AI system, named Daisy, uses voice synthesis to mimic an elderly woman and engages fraudsters in lengthy discussions about fictitious family members or provides false bank details, keeping them occupied for up to 40 minutes per call. \n\nVirgin Media O2 embedded phone numbers connected to Daisy within scammer call lists targeting vulnerable individuals. The system, developed with help from anti-scam YouTuber Jim Browning, automatically transcribes incoming calls and generates responses without human intervention. \n\nFurther reading: Google Rolls Out Call Screening AI To Thwart Phone Fraudsters.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Virgin+Media+O2+Deploys+AI+Decoy+To+Waste+Scammers'+Time%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F15%2F1531244%2F%3Futm_sou", "id": 1522352, "language": null, "link": "https://slashdot.org/story/24/11/15/1531244/virgin-media-o2-deploys-ai-decoy-to-waste-scammers-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Virgin Media O2 Deploys AI Decoy To Waste Scammers' Time", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T16:26:59.069581+00:00", "description": "An anonymous reader shares a report: The cloud migration narrative that powered tech valuations during the pandemic is attempting a comeback, but the underlying data suggests a more complex story. \n\nUBS's new survey of IT services reveals a striking disconnect between industry expectations and customer reality. While executives proclaim \"2025 will be far better than what we've seen in 2024,\" their enterprise clients report having migrated merely 15% of workloads to the cloud, with the remainder presenting increasingly complex challenges. \n\nThe numbers are particularly telling: Growth rates for major cloud providers AWS, Azure, and Google Cloud have declined from pandemic peaks of 40-50% to 10-20%. IT budgets for 2024, meanwhile, are projected to be \"flattish to up very slightly, maybe a couple percent,\" marking a significant departure from the explosive growth of recent years.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/hom", "id": 1522351, "language": null, "link": "https://it.slashdot.org/story/24/11/15/166250/cloud-migration-is-back-if-you-ignore-the-actual-numbers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Cloud Migration Is Back (If You Ignore the Actual Numbers)", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T15:24:45.867698+00:00", "description": "An anonymous reader quotes a report from Bloomberg: The Australian government plans to enact laws requiring big tech firms to protect its citizens online, the latest move by the center-left Labor administration to crack down on social media including through age limits and curbs on misinformation. Communications Minister Michelle Rowland announced the government's plan for a legislated Digital Duty of Care in Australia on Wednesday night, saying it aligned with similar laws in the UK and European Union. \"It is now time for industry to show leadership, and for social media to recognize it has a social responsibility,\" Rowland said in a speech in Sydney announcing the measures. It would \"keep users safe and help prevent online harms.\"\n \nIn response to the laws, Facebook and Instagram operator Meta Platforms Inc. called for the restrictions to be handled by app stores, such as those run by Google and Apple Inc., rather than the platforms themselves. The government has ignored those requ", "id": 1521292, "language": null, "link": "https://yro.slashdot.org/story/24/11/15/0114233/australia-to-make-big-tech-liable-for-citizens-online-safety?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Australia To Make Big Tech Liable For Citizens' Online Safety", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T15:24:45.753690+00:00", "description": "Eighteen Republican state attorneys general have sued the U.S. Securities and Exchange Commission (SEC) and Chair Gary Gensler on Thursday, challenging the agency's authority to regulate cryptocurrency markets. \n\nThe lawsuit, led by Kentucky Attorney General Russell Coleman, alleges the SEC has exceeded its statutory powers by attempting to assume broad regulatory control over digital assets without congressional authorization. The complaint argues the agency's actions infringe on states' rights to develop their own cryptocurrency regulations and harm consumers by imposing ill-fitting federal securities laws on digital assets. \n\nSpeaking at a legal conference Thursday, Gensler defended the agency's approach, citing consistent court support for SEC enforcement actions in cryptocurrency cases. The regulatory landscape appears set for change following President-elect Trump's victory. Trump, who previously dismissed cryptocurrency as a \"scam,\" has pledged to make the U.S. the \"crypto cap", "id": 1521291, "language": null, "link": "https://news.slashdot.org/story/24/11/15/1324221/republican-states-attorneys-general-sue-sec-gensler-over-crypto-overreach?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Republican States' Attorneys General Sue SEC, Gensler Over Crypto 'Overreach'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T15:24:45.599442+00:00", "description": "Brazilian officials are scrambling to control a gambling boom that has led some citizens to take out loans with interest rates as high as 438% to fund their betting habits, sparking concerns about household debt levels. \n\nThe surge in online betting has doubled Brazil's gambling population to 52 million in six months, with the central bank estimating monthly gambling spending between 18-21 billion reais ($3.1-3.6 billion) through August 2024. Central Bank President Roberto Campos Neto said lower-income families are disproportionately affected, with 20% of government social program payments in August directed to online gambling sites. \n\nThe Finance Ministry has accelerated regulatory measures, requiring over 100 betting companies to submit operating paperwork ahead of schedule. New rules starting January 1 will allow authorities to limit bet amounts, block payment systems, and monitor for money laundering. President Luiz Inacio Lula da Silva recently raised concerns at the UN about ga", "id": 1521290, "language": null, "link": "https://news.slashdot.org/story/24/11/15/1450236/brazils-online-betting-surge-sparks-debt-crisis-as-users-turn-to-400-loans?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Brazil's Online Betting Surge Sparks Debt Crisis as Users Turn To 400% Loans", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T10:25:56.985001+00:00", "description": "ZDNet's Steven Vaughan-Nichols reports: [...] At KubeCon North America 2024 this week, CNCF executive director Priyanka Sharma said in her keynote, \"Patent trolls are not contributors or even adopters in our ecosystem. Instead, they prey on cloud-native adopters by abusing the legal system. We are here to tell the world that these patent trolls don't stand a chance because CNCF is uniting the ecosystem to deter them. Like a herd of musk oxen, we will run them off our pasture.\" CNCF CTO Chris Aniszczyk added: \"The reason trolls can make money is that many companies find it too expensive to fight back, so they pay trolls a settlement fee to avoid the even higher cost of litigation. Now, when a whole herd of companies band together like musk oxen to drive a troll off, it changes the cost structure of fighting back. It disrupts their economic model.\"\n \nHow? Jim Zemlin, the Linux Foundation's executive director, said, \"We don't negotiate with trolls. Instead, with United Patents, we go to", "id": 1520743, "language": null, "link": "https://yro.slashdot.org/story/24/11/15/018247/open-source-fights-back-we-wont-get-patent-trolled-again?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Open Source Fights Back: 'We Won't Get Patent-Trolled Again'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T07:45:45.663241+00:00", "description": "Rocket Lab says it has signed the first customer for its Neutron launch vehicle, with a launch planned for mid-2025. SpaceNews reports: The company announced Nov. 12 that it signed a contract with an undisclosed \"commercial satellite constellation operator\" for two launches of Neutron, one in mid-2026 and the other in 2027, a deal that could lead to additional launches for the same customer. \"We see this agreement as an important opportunity that signifies the beginning of a productive collaboration that could see Neutron deploy this particular customer's entire constellation,\" Peter Beck, chief executive of Rocket Lab, said in an earnings call Nov. 12 to discuss the company's third quarter financial results. [...]\n \nBeck said Rocket Lab is \"deep into the qualification testing\" of flight hardware, including vehicle structures and the Archimedes engine, which was hotfired for the first time in August at the Stennis Space Center in Mississippi. \"Our engine test cadence in Mississippi h", "id": 1520154, "language": null, "link": "https://science.slashdot.org/story/24/11/15/011215/rocket-lab-signs-first-neutron-launch-customer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Rocket Lab Signs First Neutron Launch Customer", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T04:21:23.297481+00:00", "description": "Each day leading up through the 16th (the official day Half-Life 2 was launched), Ars Technica will be publishing a new article looking back at the game and its impact. Here's an excerpt from an article published today by Ars Technica's Kyle Orland: When millions of eager gamers first installed Half-Life 2 20 years ago, many, if not most, of them found they needed to install another piece of software alongside it. Few at the time could imagine that piece of companion software -- with the pithy name Steam -- would eventually become the key distribution point and social networking center for the entire PC gaming ecosystem, making the idea of physical PC games an anachronism in the process.\n \nWhile Half-Life 2 wasn't the first Valve game released on Steam, it was the first high-profile title to require the platform, even for players installing the game from physical retail discs. That requirement gave Valve access to millions of gamers with new Steam accounts and helped the company bypa", "id": 1519495, "language": null, "link": "https://games.slashdot.org/story/24/11/14/2230244/half-life-2-celebrates-20th-anniversary?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Half-Life 2 Celebrates 20th Anniversary", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T02:12:01.147324+00:00", "description": "Datacenter operators are increasingly turning to small modular reactors (SMRs) like those developed by Oklo to meet growing energy demands. According to The Register, Oklo has secured commitments from two major datacenter providers for 750 MW of power, pending regulatory approvals. It brings the firm's planned nuclear build-out to 2.1 gigawatts. From the report: Oklo's designs are, from what we understand, inspired by the Experimental Breeder Reactor II (EBR-II) and utilize liquid-metal cooling. They are capable of producing between 15MW and 50MW of power, depending on the configuration. That means Oklo's datacenter customers plan to deploy somewhere between 15 and 50 of the reactors to satisfy their thirst for electricity. However, they may be waiting a while.\n \nAccording to Oklo's website, the nuclear startup hopes to bring its first plant online before the end of the decade. Before that can happen, though, Oklo will need to obtain approval from the Nuclear Regulatory Commission --", "id": 1519193, "language": null, "link": "https://hardware.slashdot.org/story/24/11/14/2211204/datacenters-line-up-for-750mw-of-oklos-nuclear-waste-powered-small-reactors?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Datacenters Line Up For 750MW of Oklo's Nuclear-Waste-Powered Small Reactors", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T02:12:00.922425+00:00", "description": "sciencehabit shares a report from Science Magazine: What if, rather than scouring the internet, ChatGPT could search all of the DNA on Earth? That future just got a bit closer with Evo, an AI model reported today in Science. The program -- trained on billions of lines of genetic sequences -- can design new proteins and even whole genomes. Previous AIs could only interpret and predict relatively short sections of DNA, and they could only work with groups of nucleotides -- the A, C, G, T alphabet of DNA -- not individual nucleotides. To take things to the next level, researchers trained Evo on 300 billion nucleotides of sequence information.\n \nIn a first test, Evo bested other AI models on predicting the impact of mutations on protein performance. The team then had Evo design new versions of the CRISPR genome editor; the best designs were as good at cutting DNA as a commercial version. And in what study author Brian Hie, a computational biologist at Stanford University, calls the \"most", "id": 1519192, "language": null, "link": "https://science.slashdot.org/story/24/11/14/2216239/meet-evo-the-dna-trained-ai-that-creates-genomes-from-scratch?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meet Evo, the DNA-trained AI That Creates Genomes From Scratch", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T00:53:25.611384+00:00", "description": "quonset shares a report from CNN: Between August 2022 and January 2024, hundreds of swatting calls were made across the country targeting religious institutions, government offices, schools, and random people. Authorities were finally able to track down the criminal, Alan Fillon, who entered the plea to four counts of making interstate threats to injure the person of another, the US Attorney's Office for the Middle District of Florida said in a news release. He faces up to five years in prison on each count. A sentencing date has not yet been set.\n \nThe US Attorney's Office said Filion made more than 375 swatting and threat calls from August 2022 to January 2024. Those calls included ones in which he claimed to have planted bombs in targeted locations or threatened to detonate bombs and/or conduct mass shootings at those locations, prosecutors said. He targeted religious institutions, high schools, colleges and universities, government officials and people across the United States. F", "id": 1518873, "language": null, "link": "https://yro.slashdot.org/story/24/11/14/2148259/teen-pleads-guilty-to-making-375-swatting-calls-across-us?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Teen Pleads Guilty To Making 375 'Swatting' Calls Across US", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-15T00:53:25.254134+00:00", "description": "Francois Chollet, an AI pioneer and creator of the Keras framework, announced that he's leaving Google to co-found a new company. Neowin reports: In his parting message, Chollet assured that he would still be active with Keras and participate in its development on GitHub. His successor, Jeff Carpenter, will now lead Keras at Google, and Chollet expressed his full confidence in the team's future direction.\n \nKeras has come a long way since Chollet released it in 2015, initially as a high-level neural network API meant for simplicity and accessibility. Keras quickly gained traction in the AI community for its user-friendly Python interface and compatibility with frameworks like TensorFlow, simplifying machine learning model building for developers across various levels. Google published a blog post praising Chollet and reaffirming their commitment to Keras.\n \nLast year, Google lost the \"Godfather of AI,\" Geoffrey Hinton, who left the company after nearly a decade. He said he quit his j", "id": 1518872, "language": null, "link": "https://tech.slashdot.org/story/24/11/14/2156254/google-loses-yet-another-ai-pioneer-as-keras-creator-leaves?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Loses Yet Another AI Pioneer As Keras Creator Leaves", "vote": 0}]