[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-02T20:30:10+00:00", "description": "As a fan of the original, SteamWorld Heist 2 feels like a long time coming. Thunderful Development wasn't content to offer the same setting, instead opting for one where Steambot pirates reign supreme. As Captain Quincy Leeway, players navigate the high seas while investigating a mysterious water crisis.\n\nThe side-scrolling turn-based strategy combat, complete with manual aiming, remains intact and feels as fun as ever. Build variety is also greatly expanded courtesy of the new Job system, allowing players to utilize perks and benefits from other classes. The level design is engaging, offering unique challenges, while the presentation is solid all around (especially the music).\n\nThere are some issues, from the slow progression with Jobs and difficulty spikes to the annoying enemy types and tedious backtracking. However, SteamWorld Heist 2 is another worthwhile addition to the universe with its own signature charm.", "id": 967050, "language": null, "link": "https://www.youtube.com/watch?v=sItzpja1ZTM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/sItzpja1ZTM/hqdefault.jpg", "title": "SteamWorld Heist 2 Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-02T16:00:59+00:00", "description": "The past few days have been a rollercoaster for Bungie and its fans. After the launch of Destiny 2: The Final Shape, which received extensive critical acclaim, it seemed things were looking up for the developer following last year's layoffs and the lackluster Lightfall.\n\nUnfortunately, the failure of last year's expansion and Bungie's reported inability to deliver on internal financial targets continues to wreak havoc on the studio. It announced the termination of 220 roles recently, with an additional 155 integrated within Sony. The focus is on Destiny 2 and Marathon, but reports indicate that SIE joint CEO Herment Hulst is now running the studio.\n\nIf that weren't enough, rumors claim that Bungie will focus on smaller content packs for Destiny 2. Regardless of its path, there's no denying that hard times are ahead for the studio and its ongoing projects.", "id": 965404, "language": null, "link": "https://www.youtube.com/watch?v=wsafTLB1F5I", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/wsafTLB1F5I/hqdefault.jpg", "title": "Destiny 2 And Bungie - What The Hell Is Happening?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-02T10:45:01+00:00", "description": "Game Science's Black Myth: Wukong has taken the gaming world by storm since its announcement in September 2020. The lush visuals and fast-paced action almost seemed unbelievable at first. Of course, more gameplay became available, and after pre-orders opened last June, it's currently Steam's most wish listed title.\n\nBlack Myth: Wukong sees the protagonist exploring various regions and taking on different threats. Armed with an extendable staff and magic, he can also harness the powers of bosses and enemies to change forms. This is in addition to discovering powerful loot and set bonuses.\n\nCheck out several new things you should know about the game before its launch on August 20th for PS5 and PC, from its PC requirements to why the Xbox Series X/S version faced a delay.", "id": 959640, "language": null, "link": "https://www.youtube.com/watch?v=WoG56vBBhtU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/WoG56vBBhtU/hqdefault.jpg", "title": "Black Myth: Wukong - 15 Things You Need To Know Before You Buy", "user": null, "vote": 0}]