[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T23:37:56.788074+00:00", "description": "An anonymous reader quotes a report from Foss Outpost: Systemd lead developer Lennart Poettering has posted on Mastodon about their upcoming v256 release of Systemd, which is expected to include a sudo replacement called \"run0\". The developer talks about the weaknesses of sudo, and how it has a large possible attack surface. For example, sudo supports network access, LDAP configurations, other types of plugins, and much more. But most importantly, its SUID binary provides a large attack service according to Lennart: \"I personally think that the biggest problem with sudo is the fact it's a SUID binary though -- the big attack surface, the plugins, network access and so on that come after it it just make the key problem worse, but are not in themselves the main issue with sudo. SUID processes are weird concepts: they are invoked by unprivileged code and inherit the execution context intended for and controlled by unprivileged code. By execution context I mean the myriad of properties th", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/30/219252/systemd-announces-run0-sudo-alternative?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Systemd Announces 'run0' Sudo Alternative", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T22:32:08.462785+00:00", "description": "After convincing the world to buy open source and give up the Morse Code test for ham radio licenses, Bruce Perens has a new gambit: develop a license that ensures software developers receive compensation from large corporations using their work. The new Post-Open Zero Cost License seeks to address the financial disparities in open source software use and includes provisions against using content to train AI models, aligning its enforcement with non-profit performing rights organizations like ASCAP. Here's an excerpt from an interview The Register conducted with Perens: The license is one component among several -- the paid license needs to be hammered out -- that he hopes will support his proposed Post-Open paradigm to help software developers get paid when their work gets used by large corporations. \"There are two paradigms that you can use for this,\" he explains in an interview. \"One is Spotify and the other is ASCAP, BMI, and SESAC. The difference is that Spotify is a for-profit c", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/30/2036241/bruce-perens-emits-draft-post-open-zero-cost-license?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Bruce Perens Emits Draft Post-Open Zero Cost License", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T22:32:06.842024+00:00", "description": "Binance founder Changpeng Zhao has been sentenced to four months in prison after pleading guilty to charges related to enabling money laundering through his cryptocurrency exchange. CNBC reports: The sentence handed down to Zhao in Seattle federal court was significantly less than the three years that federal prosecutors had been seeking for him. The defense had asked for five months of probation. The sentencing guidelines called for a prison term of 12 to 18 months. In November, Zhao struck a deal with the U.S. government to resolve a multiyear investigation into Binance, the world's largest cryptocurrency exchange. As part of the settlement, Zhao stepped down as the company's CEO.\n \nZhao, who wore a dark navy suit with a light blue tie to court, is accused of willfully failing to implement an effective anti-money laundering program as required by the Bank Secrecy Act, and of allowing Binance to process transactions involving proceeds of unlawful activity, including between Americans", "language": "en-us", "link": "https://slashdot.org/story/24/04/30/2048242/binance-founder-changpeng-zhao-sentenced-to-4-months-in-prison?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Binance Founder Changpeng Zhao Sentenced To 4 Months In Prison", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T21:28:36.643369+00:00", "description": "Large swathes of Asia are sweltering through a heatwave that has topped temperature records from Myanmar to the Philippines and forced millions of children to stay home from school. From a report: In India, record temperatures have triggered a deadly heatwave and concerns about voter turnout in the nation's marathon election. Extreme heat has also forced Bangladesh to close all schools across the country. Extreme temperatures have also been recorded in Myanmar and Thailand, while huge areas of the Philippines are suffering from a drought. Experts say climate change has made heatwaves more frequent, longer and more intense, while the El Nino weather phenomenon is also driving this year's exceptionally warm weather. \n\nApproximate voter turnout data after polls closed on April 26 in India -- when stage two of the nation's seven-stage general election took place -- put voter turnout at 61 per cent. This was lower than the 65 per cent in the first phase, and 68 per cent in the second phase", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/30/1921210/extreme-heat-continues-to-scorch-large-parts-of-asia?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Extreme Heat Continues To Scorch Large Parts of Asia", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T21:28:35.032015+00:00", "description": "An anonymous reader quotes a report from TechCrunch: The ransomware gang that hacked into U.S. health tech giant Change Healthcare used a set of stolen credentials to remotely access the company's systems that weren't protected by multifactor authentication (MFA), according to the chief executive of its parent company, UnitedHealth Group (UHG). UnitedHealth CEO Andrew Witty provided the written testimony ahead of a House subcommittee hearing on Wednesday into the February ransomware attack that caused months of disruption across the U.S. healthcare system. This is the first time the health insurance giant has given an assessment of how hackers broke into Change Healthcare's systems, during which massive amounts of health data were exfiltrated from its systems. UnitedHealth said last week that the hackers stole health data on a \"substantial proportion of people in America.\"\n \nAccording to Witty's testimony, the criminal hackers \"used compromised credentials to remotely access a Change ", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/30/2019222/change-healthcare-hackers-broke-in-using-stolen-credentials-no-mfa?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Change Healthcare Hackers Broke In Using Stolen Credentials, No MFA", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T19:17:36.604661+00:00", "description": "The Biden administration on Tuesday released rules designed to speed up permits for clean energy while requiring federal agencies to more heavily weigh damaging effects on the climate and on low-income communities before approving projects like highways and oil wells. From a report: As part of a deal to raise the country's debt limit last year, Congress required changes to the National Environmental Policy Act, a 54-year-old bedrock law that requires the government to consider environmental effects and to seek public input before approving any project that necessitates federal permits. That bipartisan debt ceiling legislation included reforms to the environmental law designed to streamline the approval process for major construction projects, such as oil pipelines, highways and power lines for wind- and solar-generated electricity. The rules released Tuesday, by the White House Council on Environmental Quality, are intended to guide federal agencies in putting the reforms in place. \n\n", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/30/1826213/biden-administration-moves-to-speed-up-permits-for-clean-energy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Biden Administration Moves To Speed Up Permits for Clean Energy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T19:17:34.868393+00:00", "description": "Maciej Pocwierz, a senior software engineer Semantive, writing on Medium: A few weeks ago, I began working on the PoC of a document indexing system for my client. I created a single S3 bucket in the eu-west-1 region and uploaded some files there for testing. Two days later, I checked my AWS billing page, primarily to make sure that what I was doing was well within the free-tier limits. Apparently, it wasn't. My bill was over $1,300, with the billing console showing nearly 100,000,000 S3 PUT requests executed within just one day! By default, AWS doesn't log requests executed against your S3 buckets. However, such logs can be enabled using AWS CloudTrail or S3 Server Access Logging. After enabling CloudTrail logs, I immediately observed thousands of write requests originating from multiple accounts or entirely outside of AWS. \n\nWas it some kind of DDoS-like attack against my account? Against AWS? As it turns out, one of the popular open-source tools had a default configuration to store ", "language": "en-us", "link": "https://slashdot.org/story/24/04/30/199238/how-an-empty-s3-bucket-can-make-your-aws-bill-explode?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How an Empty S3 Bucket Can Make Your AWS Bill Explode", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T18:12:19.050321+00:00", "description": "Walmart isn't making enough money off its new health centers, so it decided to close up shop. From a report: The retail giant announced today that it'll shutter all 51 health centers it opened up across five states since 2019. Walmart is also getting rid of its virtual care program after acquiring telehealth provider MeMD in 2021. \"We determined there is not a sustainable business model for us to continue,\" Walmart said in an announcement today. \n\n\"This is a difficult decision, and like others, the challenging reimbursement environment and escalating operating costs create a lack of profitability that make the care business unsustainable for us at this time,\" Walmart said today. It's an about-face from last year when Walmart said it planned to double its number of health clinics and expand into two new states in 2024.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Even+Walmart+Thinks+American+Healthcare+Is+Too+Expensive%3A+https%3A%2F%2Fscien", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/30/1653219/even-walmart-thinks-american-healthcare-is-too-expensive?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Even Walmart Thinks American Healthcare Is Too Expensive", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T17:07:06.016218+00:00", "description": "One of Europe's most wanted cyber criminals has been jailed for attempting to blackmail 33,000 people whose confidential therapy notes he stole. From a report: Julius Kivimaki obtained them after breaking into the databases of Finland's largest psychotherapy company, Vastaamo. After his attempt to extort the company failed, he emailed patients directly, threatening to reveal what they had told their therapists. At least one suicide has been linked to the case, which has shocked the country. \n\nKivimaki has been sentenced to six years and three months in prison. In terms of the number of victims, his trial was the biggest criminal case in Finnish history. One of them gave their reaction to the BBC. \"The main thing is that this absolutely empathy-lacking, ruthless criminal gets a prison sentence,\" said Tiina Parrika. \"After this there rise thoughts about how short the conviction is, when reflected against the number of victims,\" she added. \"But, that's the Finnish law and I must accept t", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/30/1415206/cyber-criminal-jailed-for-blackmailing-therapy-patients?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cyber Criminal Jailed For Blackmailing Therapy Patients", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T16:02:15.561778+00:00", "description": "Eight prominent U.S. newspapers owned by investment giant Alden Global Capital are suing OpenAI and Microsoft for copyright infringement, in a complaint filed Tuesday in the Southern District of New York. From a report: Until now, the Times was the only major newspaper to take legal action against AI firms for copyright infringement. Many other news publishers, including the Financial Times, the Associated Press and Axel Springer, have instead opted to strike paid deals with AI companies for millions of dollars annually, undermining the Times' argument that it should be compensated billions of dollars in damages. \n\nThe lawsuit is being filed on behalf of some of the most prominent regional daily newspapers in the Alden portfolio, including the New York Daily News, Chicago Tribune, Orlando Sentinel, South Florida Sun Sentinel, San Jose Mercury News, Denver Post, Orange County Register and St. Paul Pioneer Press.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/30/1513242/major-us-newspapers-sue-openai-microsoft-for-copyright-infringement?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Major US Newspapers Sue OpenAI, Microsoft For Copyright Infringement", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T16:02:14.004776+00:00", "description": "theodp writes: Reports of the death of Bill Gates' influence at Microsoft have been greatly exaggerated: \"Publicly, [Bill] Gates has been almost entirely out of the picture at Microsoft since 2021, following allegations that he had behaved inappropriately toward female employees. In fact, Business Insider has learned, Gates has been quietly orchestrating much of Microsoft's AI revolution from behind the scenes. Current and former executives say Gates remains intimately involved in the company's operations -- advising on strategy, reviewing products, recruiting high-level executives, and nurturing Microsoft's crucial relationship with Sam Altman, the cofounder and CEO of OpenAI. \n\nIn early 2023, when Microsoft debuted a version of its search engine Bing turbocharged by the same technology as ChatGPT, throwing down the gauntlet against competitors like Google, Gates, executives said, was pivotal in setting the plan in motion. While Nadella might be the public face of the company's AI su", "language": "en-us", "link": "https://slashdot.org/story/24/04/30/1523247/bill-gates-is-still-pulling-the-strings-at-microsoft?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Bill Gates Is Still Pulling the Strings At Microsoft", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T14:53:48.657841+00:00", "description": "Apple has poached dozens of AI experts from Google and has created a secretive European laboratory in Zurich, as the tech giant builds a team to battle rivals in developing new AI models and products. From a report: According to a Financial Times analysis of hundreds of LinkedIn profiles as well as public job postings and research papers, the $2.7tn company has undertaken a hiring spree over recent years to expand its global AI and machine learning team. The iPhone maker has particularly targeted workers from Google, attracting at least 36 specialists from its rival since it poached John Giannandrea to be its top AI executive in 2018. \n\nWhile the majority of Apple's AI team work from offices in California and Seattle, the tech group has also expanded a significant outpost in Zurich. Professor Luc Van Gool from Swiss university ETH Zurich said Apple's acquisitions of two local AI start-ups -- virtual reality group FaceShift and image recognition company Fashwell -- led Apple to build a", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/30/142210/apple-targets-google-staff-to-build-ai-team?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Targets Google Staff To Build AI Team", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T14:53:47.039057+00:00", "description": "Apple has confirmed reports [video link] of a software glitch causing some iPhone alarms to fail to play a sound.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Confirms+iPhone+Alarm+Failure+Reports%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F04%2F30%2F1430252%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F04%2F30%2F1430252%2Fapple-confirms-iphone-alarm-failure-reports%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://apple.slashdot.org/story/24/04/30/1430252/apple-confirms-iphone-alarm-failure-reports?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/30/1430252/apple-confirms-iphone-alarm-failure-reports?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Confirms iPhone Alarm Failure Reports", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T13:48:12.059823+00:00", "description": "An anonymous reader quotes a report from TechCrunch: Ahead of its annual GitHub Universe conference in San Francisco early this fall, GitHub announced Copilot Workspace, a dev environment that taps what GitHub describes as \"Copilot-powered agents\" to help developers brainstorm, plan, build, test and run code in natural language. Jonathan Carter, head of GitHub Next, GitHub's software R&amp;D team, pitches Workspace as somewhat of an evolution of GitHub's AI-powered coding assistant Copilot into a more general tool, building on recently introduced capabilities like Copilot Chat, which lets developers ask questions about code in natural language. \"Through research, we found that, for many tasks, the biggest point of friction for developers was in getting started, and in particular knowing how to approach a [coding] problem, knowing which files to edit and knowing how to consider multiple solutions and their trade-offs,\" Carter said. \"So we wanted to build an AI assistant that could meet", "language": "en-us", "link": "https://slashdot.org/story/24/04/30/0119235/copilot-workspace-is-githubs-take-on-ai-powered-software-engineering?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Copilot Workspace Is GitHub's Take On AI-Powered Software Engineering", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T10:33:31.037981+00:00", "description": "Richard Speed reports via The Register: NASA's optical communications demonstration has hit 25 Mbps in a test transmitting engineering data back to Earth from 140 million miles (226 million kilometers) away. The payload is riding aboard the Psyche probe, which is headed for an asteroid of the same name. On December 11, when the spacecraft was 19 million miles (30 million kilometers) away, it reached 267 Mbps, which NASA described as \"comparable to broadband internet download speeds.\"\n \nHowever, as Psyche has continued on its trajectory, the distances have become greater, and the rate at which data can be transmitted and received has tumbled. At 140 million miles, the project's goal was to reach a lofty 1 Mbps. Instead, engineers managed to get 25 Mbps out of the demonstration. Earlier demonstrations tested the technology using preloaded data, such as a cat video. The latest experiment used a copy of engineering data also sent via Psyche's radio transmitter.\n \n\"We downlinked about 10 m", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/30/0053223/nasas-psyche-hits-25-mbps-from-140-miles-away?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA's Psyche Hits 25 Mbps From 140 Miles Away", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T07:18:38.350240+00:00", "description": "Jules Roscoe reports via 404 Media: Russia has replaced Wikipedia with a state-sponsored encyclopedia that is a clone of the original Russian Wikipedia but which conveniently has been edited to omit things that could cast the Russian government in poor light. Real Russian Wikipedia editors used to refer to the real Wikipedia as Ruwiki; the new one is called Ruviki, has \"ruwiki\" in its url, and has copied all Russian-language Wikipedia articles and strictly edited them to comply with Russian laws. The new articles exclude mentions of \"foreign agents,\" the Russian government's designation for any person or entity which expresses opinions about the government and is supported, financially or otherwise, by an outside nation. [...]\n \nWikimedia RU, the Russian-language chapter of the non-profit that runs Wikipedia, was forced to shut down in late 2023 amid political pressure due to the Ukraine war. Vladimir Medeyko, the former head of the chapter who now runs Ruviki, told Novaya Gazeta Euro", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/30/0045208/russia-clones-wikipedia-censors-it-bans-original?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Russia Clones Wikipedia, Censors It, Bans Original", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T04:02:00.953681+00:00", "description": "An anonymous reader quotes a report from Reuters: Energy ministers from the Group of Seven (G7) major democracies reached a deal to shut down their coal-fired power plants in the first half of the 2030s, in a significant step towards the transition away from fossil fuels. \"There is a technical agreement, we will seal the final political deal on Tuesday,\" said Italian energy minister Gilberto Pichetto Fratin, who is chairing the G7 ministerial meeting in Turin. On Tuesday the ministers will issue a final communique detailing the G7 commitments to decarbonize their economies. Pichetto said the ministers were also pondering potential restrictions to Russian imports of liquefied natural gas to Europe which the European Commission is due to propose in the short-term.\n \nThe agreement on coal marks a significant step in the direction indicated last year by the COP28 United Nations climate summit to phase out fossil fuels, of which coal is the most polluting. Italy last year produced 4.7% of ", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/29/2312241/g7-reaches-deal-to-exit-from-coal-by-2035?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "G7 Reaches Deal To Exit From Coal By 2035", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T02:56:42.331045+00:00", "description": "Crypto company Tether announced Monday that it has invested $200 million to acquire a majority stake in brain-computer interface company Blackrock Neurotech via its venture capital division Tether Evo. [The firm is not related to the asset management giant BlackRock.] CoinDesk reports: Blackrock Neurotech develops medical devices that are powered by brain signals and aims to help people impacted by paralysis and neurological disorders. The investment will fund the roll-out and commercialization of the medical devices and also for research and development purposes, the press release said. Tether is the company behind USDT, the largest stablecoin with a market cap of $110 billion. Recently, Tether established four divisions to expand beyond stablecoin issuance. \"Tether has long believed in nurturing emerging technologies that have transformative capabilities, and the Brain-Computer-Interfaces of Blackrock Neurotech have the potential to open new realms of communication, rehabilitation, ", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/29/2335248/tether-buys-200-million-majority-stake-in-brain-computer-interface-company?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Tether Buys $200 Million Majority Stake In Brain-Computer Interface Company", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T01:51:46.653564+00:00", "description": "As reported by Bloomberg (paywalled), Apple's iPadOS will need to abide by EU's DMA rules, as it is now designated as a gatekeeper alongside the Safari web browser, iOS operating system and the App Store. \"Apple now has six months to ensure full compliance of iPadOS with the DMA obligations,\" reads the EU's blog post about the change. Engadget reports: What does Apple have to do to ensure iPadOS compliance? According to the DMA, gatekeepers are prohibited from favoring their own services over rivals and from locking users into the ecosystem. The software must also allow third parties to interoperate with internal services, which is why third-party app stores are becoming a thing on iPhones in Europe. The iPad, presumably, will soon follow suit. In other words, the DMA is lobbing some serious stink bombs into Apple's walled garden. In a statement published by Forbes, Apple said it \"will continue to constructively engage with the European Commission\" to ensure its designated services co", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/29/233244/the-eu-will-force-apple-to-open-up-ipados?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The EU Will Force Apple To Open Up iPadOS", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T01:51:45.047036+00:00", "description": "ReneR writes: A major T2 Linux milestone has been released, shipping with full support for 25 CPU architectures and several C libraries, as well as restored support for Intel IA-64 Itanium. Additionally, many vintage X.org DDX drivers were fixed and tested to work again, as well as complete support for the latest KDE 6 and GNOME 46.\n \nT2 is known for its sophisticated cross compile support and support for nearly all existing CPU architectures: Alpha, Arc, ARM(64), Avr32, HPPA(64), IA64, M68k, MIPS(64), Nios2, PowerPC(64)(le), RISCV(64), s390x, SPARC(64), and SuperH x86(64). T2 is an increasingly popular choice for embedded systems and virtualization. It also still supports the Sony PS3, Sgi, Sun and HP workstations, as well as the latest ARM64 and RISCV64 architectures.\n \nThe release contains a total of 5,140 changesets, including approximately 5,314 package updates, 564 issues fixed, 317 packages or features added and 163 removed, and around 53 improvements. Usually most packages are", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/29/2325210/t2-linux-245-released?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "T2 Linux 24.5 Released", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T00:47:40.773782+00:00", "description": "An anonymous reader quotes a report from Business Insider: WeWork has a new plan to get out of bankruptcy -- and it doesn't involve Adam Neumann, who wants to acquire the flexible office provider he created. WeWork announced Monday that it has raised $450 million in equity funding, which it could use to emerge from Chapter 11. The company also said it has a plan in place to \"eliminate all of its $4 billion of outstanding, prepetition debt obligations.\" A vote on the plan -- which has support from the owners of most of WeWork's debt -- is scheduled for May 30, according to Bloomberg.\n \nThe majority of the funding -- $337 million, to be exact -- would come from Cupar Grimmond, and SoftBank would still own a stake in the company, according to the outlet. But Neumann, who has recently expressed interest in purchasing WeWork for more than $500 million, doesn't plan to go down without a fight. \"After misleading the court for weeks, WeWork finally admitted it is trying to sell the company to", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/29/2159200/wework-rejects-adam-neumanns-acquisition-bid-unveils-restructuring?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "WeWork Rejects Adam Neumann's Acquisition Bid, Unveils Restructuring", "user": null, "vote": 0}]