[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T19:30:03+00:00", "description": "The open-world genre continues to be one of the most beloved in the medium of games, but only a few are actually able to capture the feelings of embarking on a grand adventure through wonderfully realized locales. \n\nBut Yellow Brick Games’ upcoming Eternal Strands is one such game that seems to be fulfilling that criterion through and through, and it impresses with its set of emergent systems and game mechanics that encourage player freedom and player expression. \n\nBrynn’s journey of saving her homeland looks pretty convincing from a gameplay standpoint, and we can’t wait to see what’s in store for the future. With this video, we will be taking a look at the game and trying to understand why it might end up being one of the biggest games of the year.", "language": null, "link": "https://www.youtube.com/watch?v=HuLbJswvoTw", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/HuLbJswvoTw/hqdefault.jpg", "title": "This Unreal Engine 5 Game Is Shaping Up To Be Truly Special", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T17:30:06+00:00", "description": "Resident Evil should embrace open world; a smaller, more intricately robust open world that we’re not used to seeing today. An open world that diverts from traditional open world design and streamlines it into a new era. \n\nThe developer has a golden opportunity to redefine open world games today. Resident Evil on the PS1 redefined exploration in video games, and now Resident Evil 9 can do so with the overpopulated open world genre. So, no, I’m not so worried about the open world formula botching Resident Evil, I’m more concerned about microtransactions infecting it.", "language": null, "link": "https://www.youtube.com/watch?v=QoU6cQs3KoM", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/QoU6cQs3KoM/hqdefault.jpg", "title": "Should Resident Evil 9 Go OPEN WORLD?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-30T13:30:29+00:00", "description": "Summer is nearly here, which means numerous World Premieres and announcements for upcoming titles, be it for this year, the next or the far-flung future. While 2024 still has plenty of big releases left, May could feel like a reprieve without many heavy hitters.\n\nFortunately, that couldn't be further from the truth. This month marks the arrival of Senua's Saga: Hellblade 2, announced in December 2019, for Xbox Series X/S and PC. While PlayStation players don't have any exclusives this month, there are still the likes of System Shock, Braid: Anniversary Edition, F1 24 and more to look forward to.\n\nMeanwhile, PC players have The Rogue Prince of Persia, Homeworld 3, World of Goo 2 and World of Warcraft: Cataclysm Classic. What else does May have to offer? Check out our 15 biggest picks.", "language": null, "link": "https://www.youtube.com/watch?v=hjf3x1VUjeA", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/hjf3x1VUjeA/hqdefault.jpg", "title": "15 UPCOMING New Games of May 2024 You Need To Look Forward To", "user": null, "vote": 0}]