[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-13T15:30:18+00:00", "description": "From its rich cast of companion characters and its high octane combat to its robust character creation and customization toolset and more, there is plenty about Dragon Age: The Veilguard that has caught its eye, and while the game is obviously going to benefit massively from strengths in such areas (assuming, of course, that it sticks the landing the way it is looking like it will), one area where it’s probably going to need that success more than any other is the choice and consequence department. \n\nFor Dragon Age games, for BioWare games, and for western RPGs of its ilk in general, it’s often crucial to let players make their own decisions throughout the course of the story, and for those decisions to have actual, tangible consequences. Here, we’re going to talk about why it’s imperative that BioWare’s upcoming fantasy action RPG doesn’t disappoint in this area.", "id": 1316931, "language": null, "link": "https://www.youtube.com/watch?v=tePEQv1ksc4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/tePEQv1ksc4/hqdefault.jpg", "title": "Dragon Age: The Veilguard NEEDS To Do This", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-13T13:30:07+00:00", "description": "Horror has many shapes, and what scares one person might barely impact the next. From shuffling tension to visceral gore, demonic presences to intergalactic isolation, the horror games on this rundown demonstrate the sheer breadth of ways scary games can frighten us. \n\nWith stellar horror games releasing in the last few weeks, we felt it was time to revisit our list of horror’s greatest games, to try and find some order for the most frightening entries the medium has to offer. \n\nPlus, we’ve attempted to rank them from chilly to downright terrifying. If you’ve an appetite for the macabre, demand horror’s rush of adrenaline, or want to satisfy a curiosity, there’ll be plenty on this rundown to sink your teeth into.", "id": 1316416, "language": null, "link": "https://www.youtube.com/watch?v=GKSj99cPae0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/GKSj99cPae0/hqdefault.jpg", "title": "Top 30 Scariest Horror Games of All Time That Will Frighten You Beyond Belief [2024 Edition]", "vote": 0}]