[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T20:30:05+00:00", "description": "Huge is the task lying ahead of Blackbird Interactive; delivering a worthy threequel some two decades in the making to one of the biggest RTS series of all time is no small feat. In a way which mirrors the scale of their task, the unfathomably widescreen scale of Homeworld 3 is amongst this game’s leading selling point. \n\nTo accomplish an unprecedented level of scale, BBI are incorporating monolithic megastructures into the battlefield – gargantuan megaliths providing topographically rich environments in which to find cover, flank, deceive, and destroy. This feature will discuss BBI’s attempts at upscaling an already indeterminable space combat sim alongside Homeworld 3’s new roguelike game mode War Games. Can Homeworld 3 inspire legions of fans in the same way its predecessors did?", "language": null, "link": "https://www.youtube.com/watch?v=enV_u4LFFB0", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/enV_u4LFFB0/hqdefault.jpg", "title": "Why Homeworld 3 Will Be One of The BIGGEST GAMES of 2024", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T17:30:04+00:00", "description": "Over the last few years, Microsoft has acquired what feels like a quarter of the games industry, and now boasts one of the biggest, most varied, and most impressive stable of first-party studios and beloved gaming properties imaginable. \n\nOf course, it’s no surprise given the sheer number of property’s owned by Microsoft now that a great many of them haven’t actually seen the light of day in quite some time. \n\nFrom old favourites that fans have been hoping to see revivals for years to relatively newer names that have not received the level of success they deserve, to even smaller and more niche properties, there are quite a few Microsoft-owned properties that we’d love to see brought back. Here, we’re going to talk about a few of them.", "language": null, "link": "https://www.youtube.com/watch?v=bNnHZLlxU3I", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/bNnHZLlxU3I/hqdefault.jpg", "title": "10 Dormant First Party Franchises That Xbox Should Be Focusing More On", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T13:30:08+00:00", "description": "When Microsoft announced that it was bringing back the Perfect Dark franchise with a full-fledged AAA reboot, there was every reason to be excited, given the pedigree of the property, and given just how long it had been dormant. \n\nAs time has gone on, however, that excitement has slowly been replaced by confusion and anxiousness over the state of the project. Microsoft and The Initiative have been worryingly silent about Perfect Dark ever since it was announced, and in the nearly four years that have passed since then, we have had a number of reports talking about its troubled development cycle, the many issues it has faced behind the scenes, and how the game is still years away from release. So- just what exactly is going on with Perfect Dark?", "language": null, "link": "https://www.youtube.com/watch?v=K_ONBxmcOSI", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/K_ONBxmcOSI/hqdefault.jpg", "title": "Where The Hell Is Xbox Exclusive Perfect Dark?", "user": null, "vote": 0}]