[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T22:56:24.317563+00:00", "description": "An anonymous reader quotes a report from Ars Technica: In a major shake-up of its chip roadmap, Apple has announced a new M4 processor for today's iPad Pro refresh, barely six months after releasing the first MacBook Pros with the M3 and not even two months after updating the MacBook Air with the M3. Apple says the M4 includes \"up to\" four high-performance CPU cores, six high-efficiency cores, and a 10-core GPU. Apple's high-level performance estimates say that the M4 has 50 percent faster CPU performance and four times as much graphics performance. Like the GPU in the M3, the M4 also supports hardware-accelerated ray-tracing to enable more advanced lighting effects in games and other apps. Due partly to its \"second-generation\" 3 nm manufacturing process, Apple says the M4 can match the performance of the M2 while using just half the power.\n \nAs with so much else in the tech industry right now, the M4 also has an AI focus; Apple says it's beefing up the 16-core Neural Engine (Apple's ", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/07/2029240/apple-announces-m4-with-more-cpu-cores-and-ai-focus?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Announces M4 With More CPU Cores and AI Focus", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T22:56:22.704172+00:00", "description": "For the second time, the disgraced former CEO of Theranos has had her federal prison sentence shortened. In July, it was reduced by two years. Now, 40-year-old Holmes is scheduled for release on August 16, 2032 instead of December 29, 2032 -- a reduction of more than four months. The Guardian reports: People incarcerated in the U.S. can have their sentences shortened for good conduct and for completing rehabilitation programs, such as a substance abuse program. The latest reduction of Holmes's sentence still meets federal sentencing guidelines. Those guidelines mandate that people convicted of federal offenses must serve at least 85% of their sentence, regardless of reductions for good behavior.\n \nIn 2022, Holmes was sentenced to 11 years and three months in prison after being convicted on four counts of defrauding investors. She was also ordered to pay $452m in restitution to those she defrauded, but a judge delayed those payments due to Holmes's \"limited financial resources.\" Holmes", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/07/212206/theranos-fraudster-elizabeth-holmes-has-prison-sentence-reduced-again?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Theranos Fraudster Elizabeth Holmes Has Prison Sentence Reduced Again", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T21:51:45.774480+00:00", "description": "The Pixel 8A is officially here. The 8A gets Google's latest processor, adds a bunch of new AI features, and still starts at $499 in the US. But the very best news is that the 8A adopts the Pixel 8 and 8 Pro's seven years of software support, which is just unheard of in a midrange phone. From a report: The 8A retains the same general shape and size as its predecessor. But its 6.1-inch screen gets a couple of significant updates: the top refresh rate is now 120Hz, up from 90Hz, and the panel gets up to 40 percent brighter, up to 2,000 nits in peak brightness mode. They're important upgrades, especially since the 8A's main competition in the US, the OnePlus 12R, comes with an excellent display. \n\nIt comes with the same generative AI photo and video features that made a splash on the Pixel 8 and 8 Pro, including Best Take, Magic Editor, and Audio Magic Eraser. Circle to Search is also available, and the 8A will be able to run Google's mobile-optimized on-device AI model, Gemini Nano. As ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/07/2010245/googles-pixel-8a-is-a-midrange-phone-that-might-actually-go-the-distance?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's Pixel 8A is a Midrange Phone That Might Actually Go the Distance", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T20:45:39.725531+00:00", "description": "An anonymous reader shares a report: The Federal Aviation Administration is investigating whether Boeing failed to complete required inspections on 787 Dreamliner planes and whether Boeing employees falsified aircraft records, the agency said this week. The investigation was launched after an employee reported the problem to Boeing management, and Boeing informed the FAA. \"The FAA has opened an investigation into Boeing after the company voluntarily informed us in April that it may not have completed required inspections to confirm adequate bonding and grounding where the wings join the fuselage on certain 787 Dreamliner airplanes,\" the FAA said in a statement provided to Ars today. The FAA said it \"is investigating whether Boeing completed the inspections and whether company employees may have falsified aircraft records. At the same time, Boeing is reinspecting all 787 airplanes still within the production system and must also create a plan to address the in-service fleet.\" The agenc", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/07/1954212/boeing-says-workers-skipped-required-tests-on-787-but-recorded-work-as-completed?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Boeing Says Workers Skipped Required Tests on 787 But Recorded Work as Completed", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T20:45:37.531112+00:00", "description": "Nintendo has said it will finally announce its Switch successor console \"within this fiscal year,\" so at some point before March 31, 2025. From a report: In a statement published to X / Twitter, Shuntaro Furukawa, President of Nintendo, confirmed the new console as Nintendo published its financial report for the fiscal year ending March 31, 2024. Furukawa also confirmed a Nintendo Direct for this June, but said there will be no mention of the Switch successor during that presentation. Instead, it will focus on Switch games for the latter half of 2024.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nintendo+Confirms+It+Will+Announce+Switch+Successor+Console+'Within+This+Fiscal+Year'%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F05%2F07%2F203233%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.s", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/07/203233/nintendo-confirms-it-will-announce-switch-successor-console-within-this-fiscal-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Nintendo Confirms It Will Announce Switch Successor Console 'Within This Fiscal Year'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T19:42:15.987846+00:00", "description": "Financial Times Alphaville: Look, we know we write a lot about Jane Street, but it's a fascinating place, and people seem interested in it. So it was hard to resist writing about the trading shop entering the mobile phone game space (kinda). Back in 2013 Jane Street developed a card game called \"Figgie,\" which it made to simulate open outcry trading, teach trading nous, and generally burnish its reputation for quirkiness -- de rigueur in the industry. \n\nAll you need are 40 cards from a normal deck, and the rules have been public for a while. During Covid, Jane Street made a virtual version for remote interns. Now it's a mobile game that's publicly available on the official Apple and Google app stores.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Jane+Street+Gets+Into+Mobile+Gaming%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F05%2F07%2F1839227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_ico", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/07/1839227/jane-street-gets-into-mobile-gaming?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Jane Street Gets Into Mobile Gaming", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T19:42:14.481339+00:00", "description": "Along with introducing a new iPad Air and iPad Pro during its Let Loose event, Apple quietly killed its ninth-gen iPad -- also known as the last iPad with a headphone jack. From a report: The 10th-gen iPad is now the sole entry-level iPad in Apple's official lineup and, as such, has received a $100 price cut. Released in late 2022, the 10th-generation iPad arrived starting at $449, or about $120 more than base entry-level iPads from previous years. Apple justified the price increase with new iPad Air-like features, like a 10.9-inch screen and USB-C support.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Quietly+Kills+the+Old-school+iPad+and+Its+Headphone+Jack%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F05%2F07%2F197221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fsto", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/07/197221/apple-quietly-kills-the-old-school-ipad-and-its-headphone-jack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Quietly Kills the Old-school iPad and Its Headphone Jack", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T18:37:21.300730+00:00", "description": "Motional, the autonomous vehicle startup borne out of a $4 billion joint venture between Hyundai and automotive supplier Aptiv, will pause its commercial operations and delay plans to launch a driverless taxi service as it undergoes a restructuring, TechCrunch reported Tuesday. From a report: The aim is make progress on the core technology and the business model, while preserving capital, according to sources familiar with the changes. Motional has pushed its plan to launch a commercial driverless robotaxi service with its second-generation AV -- the Hyundai Ioniq 5 -- to 2026, two years later than planned. \n\nThe company told employees Tuesday during an all-hands meeting that the changes will include layoffs, but did not provide a figure of how many people would be affected, according to sources who spoke to TechCrunch on condition of anonymity. Motional began notifying employees if they were laid off shortly after the meeting ended. The company employed more than 1,300 people prior t", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/07/183233/motional-delays-commercial-robotaxi-plans-amid-restructuring?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Motional Delays Commercial Robotaxi Plans Amid Restructuring", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T17:31:57.105192+00:00", "description": "Microsoft has deployed a generative AI model entirely divorced from the internet, saying US intelligence agencies can now safely harness the powerful technology to analyze top-secret information. From a report: It's the first time a major large language model has operated fully separated from the internet, a senior executive at the US company said. Most AI models including OpenAI's ChatGPT rely on cloud services to learn and infer patterns from data, but Microsoft wanted to deliver a truly secure system to the US intelligence community. \n\nSpy agencies around the world want generative AI to help them understand and analyze the growing amounts of classified information generated daily, but must balance turning to large language models with the risk that data could leak into the open -- or get deliberately hacked. Microsoft has deployed the GPT4-based model and key elements that support it onto a cloud with an \"air-gapped\" environment that is isolated from the internet, said William Chap", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/07/162220/microsoft-creates-top-secret-generative-ai-service-divorced-from-the-internet-for-us-spies?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Creates Top Secret Generative AI Service Divorced From the Internet for US Spies", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T16:28:13.046205+00:00", "description": "The identity of the leader of one of the most infamous ransomware groups in history has finally been revealed. From a report: On Tuesday, a coalition of law enforcement led by the U.K.'s National Crime Agency announced that Russian national, Dmitry Yuryevich Khoroshev, 31, is the person behind the nickname LockBitSupp, the administrator and developer of the LockBit ransomware. The U.S. Department of Justice also announced the indictment of Khoroshev, accusing him of computer crimes, fraud and extortion. \n\n\"Today we are going a step further, charging the individual who we allege developed and administered this malicious cyber scheme, which has targeted over 2,000 victims and stolen more than $100 million in ransomware payments,\" Attorney General Merrick B. Garland was quoted as saying in the announcement. According to the DOJ, Khoroshev is from Voronezh, a city in Russia around 300 miles south of Moscow. \"Dmitry Khoroshev conceived, developed, and administered Lockbit, the most prolifi", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/07/1538226/us-uk-police-identify-and-charge-russian-leader-of-lockbit-ransomware-gang?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US, UK Police Identify and Charge Russian Leader of LockBit Ransomware Gang", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T16:28:11.338859+00:00", "description": "Less than two weeks after President Biden signed a bill that will force TikTok's Chinese owner, ByteDance, to sell the popular social media app or face a ban in the United States, TikTok said it sued the federal government on Tuesday, arguing the law was unconstitutional. From a report: TikTok said that the law violated the First Amendment by effectively removing an app that millions of Americans use to share their views and communicate freely. It also argued that a divestiture was \"simply not possible,\" especially within the law's 270-day timeline, pointing to difficulties such as Beijing's refusal to sell a key feature that powers TikTok in the United States. \n\n\"For the first time in history, Congress has enacted a law that subjects a single, named speech platform to a permanent, nationwide ban, and bars every American from participating in a unique online community with more than one billion people worldwide,\" the company said in the 67-page petition it provided, which initiates th", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/07/1610237/tiktok-sues-us-government-over-law-forcing-sale-or-ban?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "TikTok Sues US Government Over Law Forcing Sale or Ban", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T15:22:11.429623+00:00", "description": "Apple revealed its refreshed iPad Pro lineup at its \"Let Loose\" virtual event Tuesday, featuring a slimmer design, OLED displays, and the company's latest M4 chip. The new 13-inch and 11-inch models boast enhanced brightness, color saturation, and contrast, with the 13-inch model measuring just 5.1 millimeters thick, making it Apple's thinnest device ever. \n\nThe M4 chip, which powers the new iPad Pros, delivers a 50% faster CPU and improved efficiency compared to the previous-gen M2 chip. Apple has also introduced updated accessories, including a redesigned Magic Keyboard with an aluminum palm rest and function key row, and the Apple Pencil Pro with squeeze gestures, Find My location tracking, and haptic feedback. The switch to OLED technology ensures consistent display quality across both iPad Pro sizes, addressing the previous disparity between the 12.9-inch Mini LED model and the smaller, traditional-screen version. \n\nThe base storage for both models is now 256GB, with prices start", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/07/1441239/apple-unveils-redesigned-ipad-pro-with-oled-display-and-m4-chip?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Unveils Redesigned iPad Pro with OLED Display and M4 Chip", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T15:22:09.448491+00:00", "description": "Disney CEO Bob Iger says the company is shrinking the MCU with a new mission to drop the number of Marvel TV series to two a year and the film output to no more than three movies per year. The comment follows Iger conceding last year that Marvel had diluted audience's focus by making too many TV shows. From a report: Iger said this is part of Disney's overall strategy to reduce output and focus on quality, a strategy \"that's particularly true with Marvel.\" \n\n\"We're slowly going to decrease volume and go to probably about two TV series a year instead of what had become four and reduce our film output from maybe four a year to two, or a maximum of three,\" the Disney CEO said during the company's quarterly earnings call Tuesday. \"And we're working hard on what that path is.\" Iger says Marvel has \"a couple of good films in '25 and then we're heading to more 'Avengers,' which we're extremely excited about,\" adding: \"Overall, I feel great about the slate. It's something that I've committed ", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/05/07/151255/marvel-will-release-no-more-than-three-movies-and-two-shows-per-year-bob-iger-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Marvel Will Release No More Than Three Movies and Two Shows Per Year, Bob Iger Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T14:16:34.512338+00:00", "description": "Wesley Yin-Poole, reporting for IGN: Microsoft has closed a number of Bethesda studios, including Redfall maker Arkane Austin, Hi-Fi Rush and The Evil Within developer Tango Gameworks, and more in devastating cuts at Bethesda, IGN can confirm. Alpha Dog Studios, maker of mobile game Mighty Doom, will also close. Roundhouse Games will be absorbed by The Elder Scrolls Online developer ZeniMax Online Studios. \n\nOn Redfall, the disastrous vampire co-op game will now not receive promised updates as Microsoft has ended all development on the game. Microsoft said Redfall will remain online to play, and it will provide a \"make-good\" offer for those who bought the Hero DLC. In an email to staff sent by Matt Booty, head of Xbox Game Studios, Microsoft blamed the cuts on a \"reprioritization of titles and resources.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Shuts+Down+Arkane+Austin%2C+Tango+Gameworks%2C+and+More+in+Devastating+Cuts+at+Bet", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/07/1336240/microsoft-shuts-down-arkane-austin-tango-gameworks-and-more-in-devastating-cuts-at-bethesda?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Shuts Down Arkane Austin, Tango Gameworks, and More in Devastating Cuts at Bethesda", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T10:05:14.631881+00:00", "description": "The Register provides a retrospective look at how Microsoft \"absorbed the handset division of Nokia\" ten years ago, only to kill the unit two years later and write it off as a tax loss. What went wrong? \"It was a fatal combination of bad management, a market evolving in ways hidebound people didn't predict, and some really (with a few superb exceptions) terrible products,\" reports The Register. From the report: Like Nokia, Windows Mobile's popularity peaked in 2007, then started to drop away. The iPhone was the tech item of choice for fashionistas, Blackberry was seen as essential for serious business, and Android -- with Google as its new owner -- was gaining traction. Microsoft by that time had a new CEO in Steve Ballmer, who completely and famously failed to see the shifting sands in the mobile market. He dismissed the iPhone as a threat to what he thought was Windows Mobile's unassailable market position, and was roundly mocked for it. So the scene was set for a mobile standards w", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/07/0230217/ten-years-ago-microsoft-bought-nokias-phone-unit-then-killed-it-as-a-tax-write-off?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ten Years Ago Microsoft Bought Nokia's Phone Unit, Then Killed It As a Tax Write-Off", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T07:33:10.114905+00:00", "description": "Jack Dorsey is no longer on the board of Bluesky, the Twitter alternative he helped start. The announcement comes shortly after Dorsey unfollowed all but three accounts on X and referred to Elon Musk's platform as \"freedom technology.\" The Verge reports: In two posts today, Bluesky thanked Dorsey while confirming his departure and adding that it's searching for a new board member \"who shares our commitment to building a social network that puts people in control of their experience.\" [...] Neither Bluesky nor Dorsey himself seem to have said how or why he left the board. For now, two board members remain: CEO, Jay Graeber, and Jabber / XMPP inventor Jeremie Miller. Dorsey originally backed Bluesky in 2019 as a project to develop an open-source social media standard that he wanted Twitter to move to. He later joined its board of directors when it split from Twitter in 2022.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Jack+Dorsey+Departs+Blu", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/06/221247/jack-dorsey-departs-bluesky?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Jack Dorsey Departs Bluesky", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T07:33:07.984688+00:00", "description": "An anonymous reader quotes a report from 404 Media: Pokemon Go players are creating a headache for members of the open source map tool OpenStreetMaps by adding fake beaches where they don't exist in hopes of more easily catching Wigletts, a Pokemon that only spawns on beaches. OpenStreetMaps is a free, open source map tool much like Google or Apple maps, but is maintained by a self-governing community of volunteers where anyone is welcome to contribute. An April 27 thread in the OpenStreetMap community forum first spotted the issue, flagging two users in Italy who began marking beaches in all sorts of locations where they don't actually exist.\n \nThe OpenStreetMap user who noticed the fictitious beaches immediately connected the dots: Pokemon Go, the mega popular mobile game where players catch Pokemon and can engage in different activities depending on their geolocation, introduced different \"biomes\" like beach, city, forest, and mountains. Each of these have a different look, and cri", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/06/2113229/pokemon-go-players-are-vandalizing-real-maps-with-fake-data-to-catch-rare-pokemon?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Pokemon Go Players Are Vandalizing Real Maps With Fake Data To Catch Rare Pokemon", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T07:33:05.852491+00:00", "description": "Abner Li reports via 9to5Google: Since the launch of Health Connect in 2022, Google has been winding down the Google Fit developer APIs. Earlier this week, the company fully detailed how the \"Google Fit APIs have been deprecated and will be supported until June 30, 2025.\" Fitness and exercise apps that previously used Google Fit have until the June 2025 deadline to switch to Health Connect, with Google broadly referring to it as the \"Android Health platform.\"\n \nGoogle's migration guide for developers lists what they're supposed to switch to on Android phones and Wear OS. However, there is no replacement for the Goals API that lets Google Fit users set \"how many steps and heart points they want to aim for each day.\" Google says it will \"share more details about what's next for Android Health\" at I/O later this month.\n \nAs of this API shutdown announcement, Google has said nothing about the Google Fit apps on Android, Wear OS, and iOS. They still work to track activity and house your fu", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/07/0051233/google-fit-dev-apis-shutdown-set-fate-of-android-and-wear-os-apps-go-unannounced?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Fit Dev APIs Shutdown Set, Fate of Android and Wear OS Apps Go Unannounced", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T07:33:03.911153+00:00", "description": "Researchers have discovered a new attack that can force VPN applications to route traffic outside the encrypted tunnel, thereby exposing the user's traffic to potential snooping or manipulation. This vulnerability, named TunnelVision, is found in almost all VPNs on non-Linux and non-Android systems. It's believe that the vulnerability \"may have been possible since 2002 and may already have been discovered and used in the wild since then,\" reports Ars Technica. From the report: The effect of TunnelVision is \"the victim's traffic is now decloaked and being routed through the attacker directly,\" a video demonstration explained. \"The attacker can read, drop or modify the leaked traffic and the victim maintains their connection to both the VPN and the Internet.\" The attack works by manipulating the DHCP server that allocates IP addresses to devices trying to connect to the local network. A setting known as option 121 allows the DHCP server to override default routing rules that send VPN tr", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/07/0140212/novel-attack-against-virtually-all-vpn-apps-neuters-their-entire-purpose?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Novel Attack Against Virtually All VPN Apps Neuters Their Entire Purpose", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T07:33:01.965890+00:00", "description": "Swedish energy company Stockholm Exergi and Microsoft have announced a 10-year deal that will provide the tech giant with more than 3.3 million tons of carbon removal certificates through bioenergy with carbon capture and storage. While the value of the deal was not disclosed, it stands as the largest of its kind globally. Carbon Herald reports: Scheduled to commence in 2028 and span a decade, the agreement underscores a pivotal moment in combatting climate change. Anders Egelrud, CEO of Stockholm Exergi, lauded the deal as a \"huge step\" for the company and its BECCS project, emphasizing its profound implications for climate action. \"I believe the agreement will inspire corporations with ambitious climate objectives, and we target to announce more deals with other pioneering companies over the coming months,\" he said. Recognizing the imperative of permanent carbon removals in limiting global warming to 1.5C or below, the deal aligns with Microsoft's ambitious goal of becoming carbon n", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/07/0126256/stockholm-exergi-lands-worlds-largest-permanent-carbon-removal-deal-with-microsoft?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Stockholm Exergi Lands World's Largest Permanent Carbon Removal Deal With Microsoft", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T07:32:59.507925+00:00", "description": "An anonymous reader quotes a report from Wired: In April, Apple sent notifications to iPhone users in 92 countries, warning them they'd been targeted with spyware. \"Apple detected that you are being targeted by a mercenary spyware attack that is trying to remotely compromise the iPhone associated with your Apple ID,\" the notification reads. Users quickly took to social media sites including X, trying to work out what the notification meant. Many of those targeted were based inIndia, but others in Europe also reported receiving Apple's warning. Weeks later, little is still known about the latest iPhone attacks. Former smartphone giant Blackberry, now a security firm, has released research indicating they are linked to a Chinese spyware campaign dubbed \"LightSpy,\" but Apple spokesperson Shane Bauer says this is inaccurate.\n \nWhile Apple says the latest spyware notifications aren't linked to LightSpy, the spyware remains a growing threat, particularly to people who may be targeted in Sou", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/07/0157234/apples-iphone-spyware-problem-is-getting-worse?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple's iPhone Spyware Problem Is Getting Worse", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-07T07:32:57.502987+00:00", "description": "\"Out of an abundance of caution,\" Boeing says its historic Starliner launch has been postponed, citing an issue with the oxygen relief valve on the Atlas V rocket's upper stage. It was expected to launch tonight at 10:34 p.m. ET. TechCrunch reports: There are backup launch opportunities on May 7, 10 and 11. After years of delays and over $1 billion in cost overruns, the mission is set to be Boeing's first attempt to transport astronauts to the International Space Station. Once the issue is resolved with the upper stage, the United Launch Alliance Atlas V will carry the CST-100 Starliner capsule to orbit along with the two onboard astronauts -- Butch Wilmore and Sunny Williams -- from Florida's Cape Canaveral at 10:34 PM local time Monday evening. The mission also marks the first time ULA's Atlas will carry crew. The rocket boasts a success rate of 100% across 99 missions. (ULA is a joint venture of Boeing and Lockheed Martin.)\n \nThe astronauts would now dock at the station at the earl", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/07/0212231/boeing-starliners-first-crewed-mission-scrubbed?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Boeing Starliner's First Crewed Mission Scrubbed", "user": null, "vote": 0}]