[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "10 Stunning Examples of PATH TRACING In Video Games", "description": "Ray tracing is a fairly recent advancement in video game rendering that has enabled developers to craft worlds with complex lighting and realistic reflections, and with consoles now supporting hardware-accelerated ray tracing the technique has been unanimous with current-gen games now. But technology moves at a rapid pace, and we are already seeing path tracing or full ray tracing being incorporated into certain games on the market. \n\nIt’s a computationally expensive technique that requires a ton of graphical grunt to implement, so it’s currently limited to PC games only. With this video, we will be taking a look at 10 of the best path-traced games that you should take a look at.\n\nThumbnail credit: Nvidia GeForce YouTube channel.", "link": "https://www.youtube.com/watch?v=72_nzW_QPYA", "date_published": "2024-01-05T15:30:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/72_nzW_QPYA/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Top 15 Graphically Stunning Open World Games THAT BLEW US AWAY [4K]", "description": "Given how reliant on technology gaming is as a medium, it’s only natural that we all pay special attention to games that push the envelope with stunning visuals, whether that be through chasing photorealism or by combining impressive tech with outstanding art design. \n\nAnd when a game does that across the wide and expansive scope of a massive open world setting, its accomplishments become that much more impressive. Luckily for all of us, there is no shortage of developers who are constantly trying to one up themselves (and each other) on that front, which means there’s a healthy selection of open world graphical stunners out there for players to dive into. \n\nHere, we’re going to talk about the ones that stand out to most more than most.", "link": "https://www.youtube.com/watch?v=niGy87UGRrQ", "date_published": "2024-01-05T09:30:14+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/niGy87UGRrQ/hqdefault.jpg", "age": null, "page_rating_contents": 52, "page_rating_votes": 0, "page_rating_visits": 1, "page_rating": 52, "tags": [], "comments": [], "vote": 0}]