[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-31T15:30:16+00:00", "description": "In today’s day and age, games tend to be a little too concerned about making sure that players find and experience as much of the content they have on offer as possible, and while there’s nothing inherently bad about that particular approach, there’s an undeniable appeal to games that instead decide to be as secretive as possible. \n\nDragon’s Dogma 2 certainly falls in the second category. The action RPG is brimming with secrets and hidden things, from special items to smaller mechanics and gameplay features, to even entire quests, all of which players can easily miss depending on how thoroughly they’re engaging with the game. Here, we’re going to talk about a few such secrets in Dragon’s Dogma 2.", "language": null, "link": "https://www.youtube.com/watch?v=_4nSbtwFAH0", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/_4nSbtwFAH0/hqdefault.jpg", "title": "Dragon's Dogma 2 - 11 COOL Secrets You May Have Missed", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-31T09:30:13+00:00", "description": "Fighting games aren’t exactly a dime a dozen in the modern gaming landscape, but we do get a decent feed of quality games that let us unleash our inner fighter every now and then. \n\nThe year 2024 has been kind to us with recent releases like Tekken 8, but the future is looking even brighter with plenty of fighting games that are trying to bring something new to the table or are just glorious throwbacks to the golden days of fighting games.\n\nWe are talking about releases like Bam Boom Blade, Gladiators Manger, Rivals 2, and much more. With this feature, we will be taking a look at 15 of the best fighting games that you need to look out for in 2024 and beyond.", "language": null, "link": "https://www.youtube.com/watch?v=rH05bxVU-xM", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/rH05bxVU-xM/hqdefault.jpg", "title": "15 New Fighting Games of 2024 And Beyond That Will TEST YOUR SKILLS", "user": null, "vote": 0}]