[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-16T20:30:00+00:00", "description": "Die by the Blade aims to tap into the narrow samurai 1v1 sword fighting market with its single-strike stance system inspired by Nioh. There’s not a whole lot of content to dig into with Die by the Blade, which means the core combat has to stand on its own as an attraction worth the price of admission. \n\nCombat isn’t bad per se, but it’s nothing to write home about. You have a high, mid, and low stance to strategize strikes as you match the opponent’s stance for parries and blocks. The combo system is clunkier than other fighting games on the market due to unintuitive timings and stance locking mid-attack. \n\nThe customization is good in Die by the Blade, with all kinds of weapon skins, character apparel, and more to buy with in-game currency. I was disappointed by the lack of a campaign or proper challenge mode and don’t see players returning to this game after the initial novelty wears off.", "language": null, "link": "https://www.youtube.com/watch?v=8mOEuXDYB8A", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/8mOEuXDYB8A/hqdefault.jpg", "title": "Die By The Blade Review - UNDERWHELMING", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-16T17:30:00+00:00", "description": "Just announced is SECOND-LOOP, an upcoming dystopian sci-fi FPS with not one but two central selling points. First is its bodycam viewpoint, a curious perspective gaining traction amongst developers as a means to incorporate a shade more realism into their games, and second is its creative contraption construction, with gravity-defying telekinetic powers gifting players chance to forge bits of metal and scrap together to create a raft of wacky machines that’ll come in handy to overcome the game’s environmental puzzles and impassable obstacles. \n\nSECOND-LOOP’s first person shooting looks a blast too, with the bodycam affect giving an in-your-face quality to the action. As a bonus, mech combat is also promised by the game’s developer Kakaru, and although we haven’t seen any glimpses of this, it could prove to be a memorable aspect of a game already stuffed with intrigue.", "language": null, "link": "https://www.youtube.com/watch?v=6i2Y0hJj70o", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/6i2Y0hJj70o/hqdefault.jpg", "title": "This Single-Player FPS Action Game Looks STUNNING", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-16T09:30:02+00:00", "description": "With the release of its cinematic trailer, Assassin's Creed Shadows finally offers its first look at the world and characters of the open-world action RPG. Formerly Codename Red, it stars Naoe and Yasuke, a shinobi and samurai who team up during the late Sengoku era.\n\nTheir goals are unknown, but Shadows offers a mix of hack-and-slash combat and stealth-based gameplay. Yasuke's gameplay is more in line with recent stealth titles, focusing more on upfront combat, while Naoe is akin to old-school protagonists with sneaking, assassinations and parkour.\n\nWith seasons that change the layout of the land and a fully dynamic lighting system that affects your infiltrations, Assassin's Creed Shadows looks to be an enticing new experience for the genre. Check out everything you should know before it launches on November 15th for Xbox Series X/S, PS5 and PC.", "language": null, "link": "https://www.youtube.com/watch?v=3Og1m6WbuWg", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/3Og1m6WbuWg/hqdefault.jpg", "title": "Assassin's Creed Shadows - 16 NEW Things You Need To Know Before You PRE-ORDER", "user": null, "vote": 0}]