[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-28T20:30:05+00:00", "description": "Sylvio: Black Waters is a follow-up to Sylvio and Sylvio 2, but this time around, the story leaves behind the more grounded settings of its predecessors in favor of a more abstract experience delivered on a seemingly dying alien planet. The game puts players in a dark world where they have to interact with spirits to figure out the way forward.\n\nThe game makes intense use of its lighting to create an oppressive atmosphere that is further aided by the use of great sound design. Almost completely avoiding jump scares, Sylvio: Black Waters instead focuses on giving the players a horror experience where the story isn't as important as the general mood created by its visuals and audio. Its short length also helps by not having the game overstay its welcome.", "id": 945601, "language": null, "link": "https://www.youtube.com/watch?v=umkn3MSGdeQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/umkn3MSGdeQ/hqdefault.jpg", "title": "Sylvio: Black Waters Review - A Decent Psychological Horror Experience", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-28T15:30:05+00:00", "description": "The tenth expansion to Blizzard’s long-serving MMORPG is almost upon us. World of Warcraft: The War Within will take players to a brand new subterranean realm with 4 distinct zones to explore and battle through. \n\nThe environs aren’t the only thing that’s new though: fresh allies, newfound enemies, end-game activities, dungeons, and raids will all be experienced for the first time. There’s a raft of modifications to existing systems too, such as revamped skill trees, talents, changes to Dragonriding, and quality of life improvements, the latter of which being the rather intriguing alt progression system which – above all else – promises to remove the sometimes agonising decision to switch characters. \n\nThis video outlines all there is to know with The War Within, plus highlights release and pre-order info.", "id": 944597, "language": null, "link": "https://www.youtube.com/watch?v=LzfK4y2KzJc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/LzfK4y2KzJc/hqdefault.jpg", "title": "World of Warcraft: The War Within - 15 Things You ABSOLUTELY NEED TO KNOW Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-28T10:45:02+00:00", "description": "RPGs and shooters alike have popularized the notion that video game bosses are meant to be taken on as a team. But with the recent surge of Soulslike games, uneven scenarios have become much more common. Our list here is comprised of massive things to overcome in general, so not just merely the traditional boss fight. \n\nGames like Shadow of the Colossus emphasise humongous boss fights over intricate level design, while Dark Souls tends to throw giant labyrinthine castles for you to overcome alone. These massive obstacles don’t merely challenge the player with difficulties, but also help establish character arcs for many protagonists facing them as well. So, without further ado, here is our list of 13 massive things in video games you faced alone.\n\nThumbnail credit: imdb", "id": 943485, "language": null, "link": "https://www.youtube.com/watch?v=Z5RBOz3mJ3Y", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/Z5RBOz3mJ3Y/hqdefault.jpg", "title": "13 Massive Things In Video Games You Faced ALONE", "user": null, "vote": 0}]