[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T23:40:43.875665+00:00", "description": "The Register's Brandon Vigliarolo reports: Microsoft's \"acquihire\" of Inflection AI was today cleared by UK authorities on the grounds that the startup isn't big enough for its absorption by Microsoft to affect competition in the enterprise AI space. The Competition and Markets Authority (CMA) confirmed the conclusion of its investigation by publishing a summary of its decision. While the CMA found that Microsoft's recruitment of Inflection co-founders Mustafa Suleyman and Karen Simonyan, along with other Inflection employees, in March 2024 to lead Microsoft's new AI division did create a relevant merger situation, a bit of digging indicated everything was above board.\n \nAs we explained when the CMA kicked off its investigation in July, the agency's definition of relevant merger situations includes instances where two or more enterprises have ceased to be distinct, and when the deal either exceeds 70 million pounds or 25 percent of the national supply of a good or service. In both cas", "id": 1084469, "language": null, "link": "https://news.slashdot.org/story/24/09/04/2047224/microsofts-inflection-acquihire-is-too-small-to-matter-say-uk-regulators?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft's Inflection Acquihire Is Too Small To Matter, Say UK Regulators", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T23:40:43.791107+00:00", "description": "An anonymous reader quotes a report from Wired: Jazmin Jones knowswhat she did. \"If you're online, there's this idea of trolling,\" Jones, the director behindSeeking Mavis Beacon, said during a recent panel for her new documentary. \"For this project, some things we're taking incredibly seriously ... and other things we're trolling. We're trolling this idea of a detective because we're also, like,ACAB.\" Her trolling, though, was for a good reason. Jones and fellow filmmaker Olivia Mckayla Ross did it in hopes of finding the woman behind Mavis Beacon Teaches Typing. The popular teaching tool was released in 1987 by The Software Toolworks, a video game and software company based in California that produced educational chess, reading, and math games. Mavis, essentially the \"mascot\" of the game, is a Black woman donned in professional clothes and a slicked-back bun. Though Mavis Beacon was not an actual person, Jones and Ross say that she is one of the first examples of Black representation", "id": 1084468, "language": null, "link": "https://entertainment.slashdot.org/story/24/09/04/210215/the-search-for-the-face-behind-mavis-beacon-teaches-typing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Search For the Face Behind Mavis Beacon Teaches Typing", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T22:35:41.040514+00:00", "description": "An anonymous reader quotes a report from Wired: You might have a hard time stretching your memory to the Obama era, but back in 2013, Panasonic's plasma TVs were the critical darlings of the US market. They far outperformed their LED/LCD counterparts at a time when OLED was little more than a pipe dream for most. Then suddenly, under enormous pressure from ever-cheaper LED panels, Panasonic halted all plasma TV production. By 2016, the company had left the US TV space entirely. Now, over 10 years after its plasma models reigned supreme in the US, Panasonic TVs are back, baby.\n \nOutside the US, Panasonic has remained a global leader in the OLED era. Rumors about a stateside return have been swirling for nearly as long as the brand has been away, but a global partnership with Amazon announced at CES 2024 kicked things into high gear. Today, Panasonic officially revealed the US launch of three premium TVs powered by Amazon's Fire TV smart interface: the flagship Z95A and \"core\" Z85A OLED", "id": 1084250, "language": null, "link": "https://entertainment.slashdot.org/story/24/09/04/2030201/after-nearly-a-decade-away-panasonic-tvs-are-back-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "After Nearly a Decade Away, Panasonic TVs Are Back In the US", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T22:35:40.956965+00:00", "description": "Acer has announced its first Steam Deck and Asus ROG Ally competitor, the Acer Nitro Blaze 7. The Verge's Sean Hollister reports: Like Asus -- but unlike most rivals -- it features a seven-inch 1080p variable refresh rate IPS screen to keep things smooth, one that refreshes slightly faster at 144Hz. (Acer tells The Verge it's a landscape-native screen.) It's also got a newer Ryzen 7 8840HS chip, albeit with the same Radeon 780M integrated GPU as most other Windows handhelds. With 16GB of 7500 MT/s memory and a 50 watt-hour battery, it's a step ahead of the original Ally's 6400 MT/s memory and 40Wh pack, and it comes with up to 2TB worth of SSD storage. But with 24GB of memory and an 80Wh pack, the $800 Asus ROG Ally X is currently the Windows handheld to beat, so I suspect this Acer will need to cost quite a bit less to compete.\n \nThe Nitro has no touchpads, but it also unusually has no back buttons; most PC handhelds now have at least two macro keys around back. But I suspect some pe", "id": 1084249, "language": null, "link": "https://games.slashdot.org/story/24/09/04/2039239/acers-first-handheld-gaming-pc-is-the-nitro-blaze?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Acer's First Handheld Gaming PC Is the Nitro Blaze", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T21:30:54.642314+00:00", "description": "The latest Windows personal computers with AI features have \"the best specs\" on \"all the benchmarks,\" Microsoft Chief Executive Satya Nadella recently said. There is one problem: The chips inside current models are incompatible with many leading videogames. From a report: Microsoft and its partners this spring rolled out Copilot+ PCs that include functions such as creating AI-generated pictures and video. Under the hood of the new laptops is a hardware change. Instead of the Intel chips that have powered Microsoft Windows PCs for nearly four decades, the initial Copilot+ PCs to hit the market use Qualcomm chips, which in turn rely on designs from U.K.-based Arm. \n\nMost PC games, including popular multiplayer games such as \"League of Legends\" and \"Fortnite,\" are made to work with Intel's x86, a chip architecture that has been the standard for many personal computers for decades. To make some of these programs function on the Qualcomm-Arm system, they must be run through a layer of soft", "id": 1083872, "language": null, "link": "https://tech.slashdot.org/story/24/09/04/1935211/microsoft-rolled-out-ai-pcs-that-cant-play-top-games?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Rolled Out AI PCs That Can't Play Top Games", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T20:26:28.853564+00:00", "description": "Verizon is in advanced talks to acquire Frontier Communications in a deal that would bolster the company's fiber network to compete with rivals including AT&amp;T, WSJ reported Wednesday, citing people familiar with the matter. From the report: An announcement could come this week, granted the talks don't hit any last-minute snags, the people said. A deal would be sizable, given Frontier's market value of over $7 billion. The company, cobbled together by several deals over the years, provides broadband connections to about three million locations across 25 states. \n\nVerizon, the top cellphone carrier by subscribers, has faced increased pressure from competitors and from cable-TV companies that offer discounted wireless service backed by Verizon's own cellular network. Verizon has its Fios-branded fiber network, and AT&amp;T has focused on expanding its fiber network since shedding its WarnerMedia assets in 2022. Fiber M&amp;A has heated up as telecom companies and financial firms pour", "id": 1083479, "language": null, "link": "https://tech.slashdot.org/story/24/09/04/1914253/verizon-nearing-deal-for-frontier-communications?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Verizon Nearing Deal for Frontier Communications", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T20:26:28.549122+00:00", "description": "An anonymous reader shares a report: It would be perfectly reasonable to expect Amazon's digital assistant Alexa to decline to state opinions about the 2024 presidential race, but up until recently, that assumption would have been incorrect. When asked to give reasons to vote for former President Donald Trump, Alexa demurred, according to a video from Fox Business. \"I cannot provide responses that endorse any political party or its leader,\" Alexa responded. When asked the same about Vice President Kamala Harris, the Amazon AI was more than willing to endorse the Democratic candidate. \n\n\"There are many reasons to vote for Kamala Harris,\" Alexa said. Among the reasons given was that Harris has a \"comprehensive plan to address racial injustice,\" that she promises a \"tough on crime approach,\" and that her record on criminal justice and immigration reform make her a \"compelling candidate.\" Harris has been dividing Silicon Valley since she took up the Democratic nomination from President Jo", "id": 1083478, "language": null, "link": "https://politics.slashdot.org/story/24/09/04/1930232/error-causes-alexa-to-endorse-kamala-harris-refuse-to-discuss-trump?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Error' Causes Alexa To Endorse Kamala Harris, Refuse To Discuss Trump", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T19:05:04.996911+00:00", "description": "A pair of devices launching Wednesday highlight a growing trend in consumer hardware: doing one thing well, Axios writes. From the report: The smartphone rendered many formerly standalone devices obsolete, but now some tech with a single purpose can offer an experience that a digital Swiss Army knife can't. GoPro announced its latest cameras on Wednesday. The $199 GoPro Hero is a smaller, simpler camera that presents fewer controls, while this year's flagship -- the $399 Hero 13 Black -- supports a series of add-on lenses without losing its core as a rugged, waterproof action camera. \n\nMeanwhile, the reMarkable tablet company is adding its first color model. ReMarkable's tablets allow creators to write and sketch without the distractions of more full-featured devices.\nReMarkable's paper tablets are similar to Amazon's Kindle Scribe, but with a focus on creating and editing documents rather than reading digital books. In addition to adding color -- the most requested feature -- the Pap", "id": 1083130, "language": null, "link": "https://hardware.slashdot.org/story/24/09/04/189234/in-consumer-hardware-niche-is-the-new-mainstream?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "In Consumer Hardware, Niche is the New Mainstream", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T19:05:04.912056+00:00", "description": "After an initial euphoric rush to the cloud, admins are questioning the value and promise of the tech giant's services. The Register: According to a report published by UK cloud outfit Civo, more than a third of organizations surveyed reckoned that their move to the cloud had failed to live up to promises of cost-effectiveness. Over half reported a rise in their cloud bill. Although the survey, unsurprisingly, paints Civo in a flattering light, some of its figures may make uncomfortable reading for customers sold on the promises from hyperscalers. Like-for-like comparisons for a simple three-node cluster with 200 GB of persistent storage and a 5 TB data transfer showed prices going from $1,278.58 in 2022 to $1,458.68 in 2024 on Microsoft Azure. \n\nFor Google, the price went from $1,107.61 to $1,250.35. According to Civo's figures, the cost at AWS increased from $1,142.46 to $1,234.59. \"The Kubernetes prices were taken from the hyperscalers' very own pricing calculators,\" a Civo spokesp", "id": 1083129, "language": null, "link": "https://slashdot.org/story/24/09/04/1829233/admins-wonder-if-the-cloud-was-such-a-good-idea-after-all?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Admins Wonder If the Cloud Was Such a Good Idea After All", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T17:55:04.328612+00:00", "description": "Snapchat will soon start \"experimenting\" with placing sponsored messages next to chat threads from friends, according to CEO Evan Spiegel. From a report: These \"Sponsored Snaps\" from brands will appear as unread messages in Snapchat's main Chat tab, implying that they'll sit above messages from a person's contacts until they're acted on. This is the first time Snap will show ads in the most used part of its app. In an employee memo also posted on the company's website, Spiegel says that Sponsored Snaps will appear &#226;oewithout a push notification, and opening the message is optional.\" It's unclear how easy it will be to get rid of a Sponsored Snap without opening it, or if doing so will even be possible. \n\n\"Sponsored Snaps empower advertisers to communicate visually with the Snapchat community, making the core functionality of Snapchat accessible to advertisers,\" writes Spiegel, who goes on to note that, \"As always, your conversations with friends are private and are not used for a", "id": 1082661, "language": null, "link": "https://slashdot.org/story/24/09/04/162211/snapchat-is-going-to-put-ads-next-to-messages-from-friends?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Snapchat Is Going To Put Ads Next To Messages From Friends", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T17:55:04.228626+00:00", "description": "Internet Archive's \"controlled digital lending\" system and removal of controls during the pandemic don't qualify as fair use, the Second Circuit affirmed Wednesday. Bloomberg Law:\n Four major book publishers again thwarted the online repository's defense that its one-to-one lending practices mirrored those of traditional libraries, this time at the US Court of Appeals for the Second Circuit. Copying books in their entirety isn't transformative, and lending them for free competes with the publishers own book and ebook offerings, the unanimous panel said. Further reading: Full-text of court opinion [PDF].<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Internet+Archive+Digital+Lending+Isn't+Fair+Use%2C+2nd+Cir.+Says%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F09%2F04%2F1728215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"h", "id": 1082660, "language": null, "link": "https://news.slashdot.org/story/24/09/04/1728215/internet-archive-digital-lending-isnt-fair-use-2nd-cir-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Internet Archive Digital Lending Isn't Fair Use, 2nd Cir. Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T16:50:03.996405+00:00", "description": "Research by the Federal Reserve Bank of New York, published on Tuesday, indicates that professional economic forecasters tend to overestimate their accuracy in long-term predictions while underestimating their short-term precision. \n\nThe study, which analyzed data from the Survey of Professional Forecasters from 1982 to 2022, revealed that for forecasts two to four quarters ahead, actual errors were two to four times greater than the forecasters' estimated uncertainty ranges for both GDP growth and inflation. In contrast, for predictions less than three months out, forecasters typically overestimated potential errors. \n\nThe study's author, Marco Del Negro, highlighted significant differences in uncertainty estimates among individual forecasters, suggesting that these findings challenge the rational expectations theory. Del Negro proposed that these discrepancies might stem from an over-reliance on varying models or priors in making longer-term forecasts.<p><div class=\"share_submission", "id": 1082128, "language": null, "link": "https://science.slashdot.org/story/24/09/04/1545215/are-professional-forecasters-overconfident?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Are Professional Forecasters Overconfident? ", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T16:50:03.889628+00:00", "description": "US job openings fell in July to the lowest since the start of 2021 and layoffs rose, consistent with other signs of slowing demand for workers. From a report: Available positions decreased to 7.67 million from a downwardly revised 7.91 million reading in the prior month, the Bureau of Labor Statistics Job Openings and Labor Turnover Survey, known as JOLTS, showed Wednesday. The figure was lower than all estimates in a Bloomberg survey of economists. The decline in openings coincides with recent data that show the labor market is softening, which has raised concern among Federal Reserve officials. Job growth has been slowing, unemployment is rising and jobseekers are having greater difficulty finding work, fueling fears about a potential recession. \n\nPolicymakers have made it clear they don't want to see further cooling in the labor market and are widely expected to start lowering interest rates at their next meeting in two weeks. After July's disappointing jobs figures and a large dow", "id": 1082127, "language": null, "link": "https://news.slashdot.org/story/24/09/04/1559231/us-job-openings-decline-to-lowest-level-since-january-2021?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Job Openings Decline To Lowest Level Since January 2021", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T15:43:18.492089+00:00", "description": "The Biden-Harris administration's big bet on Intel to lead a US chipmaking renaissance is in grave trouble as a result of the company's mounting financial struggles, creating a potentially damaging setback for the country's most ambitious industrial policy in decades. From a report: Five months after the president traveled to Arizona to unveil a potential $20 billion package of incentives alongside Chief Executive Officer Pat Gelsinger, there are growing questions around when -- or if -- Intel will get its hands on that money. Intel's woes also may jeopardize the government's ability to reach its policy goals, which include establishing a secure supply of cutting-edge chips for the Pentagon and making a fifth of the world's advanced processors by 2030. \n\nIntel is mired in a sales slump worse than anticipated and hemorrhaging cash, forcing its board to consider increasingly drastic actions -- including possibly splitting off its manufacturing division or paring back global factory plan", "id": 1081574, "language": null, "link": "https://news.slashdot.org/story/24/09/04/1430239/intels-money-woes-throw-biden-teams-chip-strategy-into-turmoil?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel's Money Woes Throw Biden Team's Chip Strategy Into Turmoil", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T15:43:18.367567+00:00", "description": "Europe's food and farming lobbies have recognized the need to eat less meat after hammering out a shared vision for the future of agriculture with green groups and other stakeholders. From a report: The wide-ranging report calls for \"urgent, ambitious and feasible\" change in farm and food systems and acknowledges that Europeans eat more animal protein than scientists recommend. It says support is needed to rebalance diets toward plant-based proteins such as better education, stricter marketing and voluntary buyouts of farms in regions that intensively rear livestock. The stakeholders also agreed on the need for a major rethink of subsidies, calling for a \"just transition fund\" to help farmers adopt sustainable practices, and targeted financial support to those who need it most. \n\nThe European Commission president, Ursula von der Leyen, who commissioned the report to quell furious farmer protests at the start of the year, said the results would feed into a planned vision for agricultur", "id": 1081573, "language": null, "link": "https://news.slashdot.org/story/24/09/04/1449256/europes-farming-lobbies-recognize-need-to-eat-less-meat-in-shared-vision-report?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Europe's Farming Lobbies Recognize Need To Eat Less Meat in Shared Vision Report", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T14:39:08.547528+00:00", "description": "Sweden's Enerpoly has opened the world's first zinc-ion battery megafactory near Stockholm, aiming for a 100 MWh annual capacity by 2026. \"According to Enerpoly, this megafactory will serve Europe's needs for safe energy storage, and also utilize an all-European supply chain to boot,\" reports New Atlas. From the report: If you're wondering why Enerpoly is bothering with zinc-ion and not lithium-ion batteries, it's because the former is a better choice for storage in several ways: \n- They use a water-based electrolyte, which makes them non-flammable, and reduces the risk of fires and explosions.\n- They're less expensive, because zinc is far more abundant than lithium (which is difficult and expensive to extract), and easier to handle. They can also operate across a wider temperature range and require less maintenance, making them cheaper than lithium-ion options.\n- They're more eco-friendly for the same reason. In contrast, extracting lithium currently requires extensive mining as well", "id": 1081167, "language": null, "link": "https://hardware.slashdot.org/story/24/09/04/045204/worlds-first-zinc-ion-battery-megafactory-opens-for-business?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "World's First Zinc-Ion Battery Megafactory Opens For Business", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T14:39:08.435405+00:00", "description": "An anonymous reader quotes a report from Axios: The German company says it may close plants in its home country amid what CEO Oliver Blume reportedly called \"a very demanding and serious situation\" for the European automotive industry. That would mark the first-ever German plant closures in the company's nearly nine-decade history. VW is facing a pair of competition-related challenges -- one outside its control, and the other of its own making. Chinese automakers are wresting market share away from VW in China, where it once held the highest share of any automaker. The company's China sales have fallen from 4 million in 2017 to an estimated 2.5 million in 2024, according to Dunne Insights analyst Michael Dunne. And its Chinese competitors are bringing cheap electric vehicles to VW's other critical market: Europe. Another part of the problem is that VW is a bloated company compared with its competitors, meaning it has less margin for error.\n \nThe company had some 684,000 employees in 2", "id": 1081166, "language": null, "link": "https://tech.slashdot.org/story/24/09/04/0443229/vw-could-close-plants-in-germany-warns-of-serious-situation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "VW Could Close Plants In Germany, Warns of 'Serious Situation'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T13:33:49.261507+00:00", "description": "During a 2023 deployment, senior enlisted leaders aboard the Navy ship USS Manchester secretly installed a Starlink Wi-Fi network, allowing them exclusive internet access in violation of Navy regulations. \"Unauthorized Wi-Fi systems like the one [then-Command Senior Chief Grisel Marrero] set up are a massive no-no for a deployed Navy ship, and Marrero's crime occurred as the ship was deploying to the West Pacific, where such security concerns become even more paramount among heightened tensions with the Chinese,\" reports Navy Times. From the report: As the ship prepared for a West Pacific deployment in April 2023, the enlisted leader onboard conspired with the ship's chiefs to install the secret, unauthorized network aboard the ship, for use exclusively by them. So while rank-and-file sailors lived without the level of internet connectivity they enjoyed ashore, the chiefs installed a Starlink satellite internet dish on the top of the ship and used a Wi-Fi network they dubbed \"STINKY\" ", "id": 1080636, "language": null, "link": "https://tech.slashdot.org/story/24/09/04/0424213/navy-chiefs-conspired-to-get-themselves-illegal-warship-wi-fi?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Navy Chiefs Conspired To Get Themselves Illegal Warship Wi-Fi", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T10:58:42.577820+00:00", "description": "Firefox 130 introduces several enhancements, including improved local translation handling, better Android page load performance, and the WebCodecs API for low-level audio/video processing on desktop platforms. Notably, it also supports third-party AI chatbots like ChatGPT and Google Gemini via the new Firefox Labs feature. Phoronix reports: The WebCodecs API is particularly useful for web-based apps like video/audio editors and video conferencing that may want control over individual frames of a video stream or audio chunks. For any web software interested in that low-level audio/video encode/decode handling there is now WebCodecs API working on the Firefox desktop builds. As for the third-party AI chatbots, here's what Mozilla's Ian Carmichael said back in June: \"If you want to use AI, we think you should have the freedom to use (or not use) the tools that best suit your needs. Instead of juggling between tabs or apps for assistance, those who opt-in will have the option to access t", "id": 1079565, "language": null, "link": "https://news.slashdot.org/story/24/09/04/0413210/firefox-130-now-available-with-webcodecs-api-third-party-ai-chatbots?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Firefox 130 Now Available With WebCodecs API, Third-Party AI Chatbots", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T07:19:57.551951+00:00", "description": "Sweden's Enerpoly has opened the world's first zinc-ion battery megafactory near Stockholm, aiming for a 100 MWh annual capacity by 2026. \"According to Enerpoly, this megafactory will serve Europe's needs for safe energy storage, and also utilize an all-European supply chain to boot,\" reports New Atlas. From the report: If you're wondering why Enerpoly is bothering with zinc-ion and not lithium-ion batteries, it's because the former is a better choice for storage in several ways: \n- They use a water-based electrolyte, which makes them non-flammable, and reduces the risk of fires and explosions.\n- They're less expensive, because zinc is far more abundant than lithium (which is difficult and expensive to extract), and easier to handle. They can also operate across a wider temperature range and require less maintenance, making them cheaper than lithium-ion options.\n- They're more eco-friendly for the same reason. In contrast, extracting lithium currently requires extensive mining as well", "id": 1078628, "language": null, "link": "https://hardware.slashdot.org/story/24/09/04/045204/worlds-first-zinc-iron-battery-megafactory-opens-for-business?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "World's First Zinc-Iron Battery Megafactory Opens For Business", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.878987+00:00", "description": "The YubiKey 5, the most widely used hardware token for two-factor authentication based on the FIDO standard, contains a cryptographic flaw that makes the finger-size device vulnerable to cloning when an attacker gains brief physical access to it, researchers said Tuesday. ArsTechnica: The cryptographic flaw, known as a side channel, resides in a small microcontroller that's used in a vast number of other authentication devices, including smartcards used in banking, electronic passports, and the accessing of secure areas. While the researchers have confirmed all YubiKey 5 series models can be cloned, they haven't tested other devices using the microcontroller, which is SLE78 made by Infineon and successor microcontrollers known as the Infineon Optiga Trust M and the Infineon Optiga TPM. The researchers suspect that any device using any of these three microcontrollers and the Infineon cryptographic library contain the same vulnerability. \n\nYubiKey-maker Yubico issued an advisory in coor", "id": 1077380, "language": null, "link": "https://it.slashdot.org/story/24/09/03/1810216/yubikeys-are-vulnerable-to-cloning-attacks-thanks-to-newly-discovered-side-channel?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "YubiKeys Are Vulnerable To Cloning Attacks Thanks To Newly Discovered Side Channel", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.798959+00:00", "description": "Google has released Android 15 for developers, with support for Pixel phones expected in the coming weeks. The update will roll out to compatible devices from Samsung, Motorola, OnePlus, and other manufacturers in the following months. \n\nKey features of Android 15 include single-tap passkeys, theft detection, improved multitasking for large-screen devices, and app access limitations. The update also enhances TalkBack, Android's screen reader, with Gemini AI integration for audio descriptions of images.\nGoogle is expanding its Circle to Search feature with song identification capabilities and extending earthquake alerts to all U.S. states and six territories. The alerts use data from Android devices' accelerometers to detect potential seismic activity, complementing traditional seismometer readings in states with access to the USGS ShakeAlert system.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Releases+Andr", "id": 1077379, "language": null, "link": "https://tech.slashdot.org/story/24/09/03/1840256/google-releases-android-15-to-developers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Releases Android 15 To Developers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.715745+00:00", "description": "PlayStation hero shooter Concord will be taken offline on September 6, 2024 and all players will receive a full refund, Sony announced Tuesday. From a report: Announced on the PlayStation Blog, director Ryan Ellis said \"while many qualities of the experience resonated with players, we also recognize that other aspects of the game and our initial launch didn't land the way we'd intended.\" \n\nConcord will therefore be taken offline so Sony and developer Firewalk Studios can \"explore options, including those that will better reach our players.\" The game will be removed from sale immediately and anyone who purchased on the PlayStation Store or PlayStation Direct will be refunded to their original payment methods. Those who purchased on Steam and the Epic Games Store will be refunded in the coming days. Firewalk Studios' AA shooter was released less than two weeks ago on August 23.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?", "id": 1077378, "language": null, "link": "https://games.slashdot.org/story/24/09/03/193238/sony-pulls-concord-from-sale-after-disastrous-launch?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Sony Pulls Concord From Sale After Disastrous Launch", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.633347+00:00", "description": "An anonymous reader quotes a report from the Associated Press: The Dutch data protection watchdog on Tuesday issued facial recognition startup Clearview AI with a fine of $33.7 million over its creation of what the agency called an \"illegal database\" of billion of photos of faces. The Netherlands' Data Protection Agency, or DPA, also warned Dutch companies that using Clearview's services is also banned. The data agency said that New York-based Clearview \"has not objected to this decision and is therefore unable to appeal against the fine.\"\n \nBut in a statement emailed to The Associated Press, Clearview's chief legal officer, Jack Mulcaire, said that the decision is \"unlawful, devoid of due process and is unenforceable.\" The Dutch agency said that building the database and insufficiently informing people whose images appear in the database amounted to serious breaches of the European Union's General Data Protection Regulation, or GDPR. \"Facial recognition is a highly intrusive technolo", "id": 1077377, "language": null, "link": "https://yro.slashdot.org/story/24/09/03/2059214/clearview-ai-fined-337-million-over-illegal-database-of-faces?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Clearview AI Fined $33.7 Million Over 'Illegal Database' of Faces", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.551689+00:00", "description": "According to Bloomberg (paywalled), Nvidia has received a subpoena from the U.S. Department of Justice as the regulator seeks evidence that the AI computing company violated antitrust laws. \"The antitrust watchdog had previously delivered questionnaires to companies, and is now sending legally binding requests,\" notes Reuters. \"Officials are concerned that the chipmaker is making it harder to switch to other suppliers and penalizes buyers that do not exclusively use its artificial intelligence chips.\"\n \nThe development follows a push by progressive groups last month, who criticized Nvidia's bundling of software and hardware, claiming it stifles innovation and locks in customers. In July, French antitrust regulators announced plans to charge the company for alleged anti-competitive practices.\n \nDeveloping...<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nvidia+Hit+With+DOJ+Subpoena+In+Escalating+Antitrust+Probe%3A+h", "id": 1077376, "language": null, "link": "https://yro.slashdot.org/story/24/09/03/217256/nvidia-hit-with-doj-subpoena-in-escalating-antitrust-probe?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Nvidia Hit With DOJ Subpoena In Escalating Antitrust Probe", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.467757+00:00", "description": "According to Mark Gurman, Apple's upcoming M4 Mac mini will undergo a major redesign, dropping USB-A ports entirely in favor of five USB-C ports. The new design will also feature front ports for the first time, an internal power supply, and retain Ethernet, HDMI, and the headphone jack.\n \n\"As I've been reporting for several months now, the Mac is in for a big transition to M4 chips -- starting around the end of this year and extending into the first half or so of 2025,\" writes Gurman in a newsletter for Bloomberg. \"Apple plans to kick things off soon with a new Mac mini, iMac and MacBook Pro. Of those models, the Mac mini will get the most dramatic new design, its first major overhaul since 2010. Just to put that in perspective: The last time there was a Mac mini redesign, preorders of the iPhone 4 had just began.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=M4+Mac+Mini+Likely+To+Lose+Support+For+USB-A%2C+Keep+In", "id": 1077375, "language": null, "link": "https://apple.slashdot.org/story/24/09/03/2123208/m4-mac-mini-likely-to-lose-support-for-usb-a-keep-internal-power-supply?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "M4 Mac Mini Likely To Lose Support For USB-A, Keep Internal Power Supply", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.386611+00:00", "description": "An anonymous reader quotes a report from Ars Technica: On Thursday, ABC announced an upcoming TV special titled, \"AI and the Future of Us: An Oprah Winfrey Special.\" The one-hour show, set to air on September 12, aims to explore AI's impact on daily life and will feature interviews with figures in the tech industry, like OpenAI CEO Sam Altman and Bill Gates. Soon after the announcement, some AI critics began questioning the guest list and the framing of the show in general. [...] Critics of generative AI ... question the utility of the technology, its perceived environmental impact, and what they see as blatant copyright infringement.\n \n\"Sure is nice of Oprah to host this extended sales pitch for the generative AI industry at a moment when its fortunes are flagging and the AI bubble is threatening to burst,\" tweeted author Brian Merchant, who frequently criticizes generative AI technology in op-eds, social media, and through his \"Blood in the Machine\" AI newsletter. \"The way the exper", "id": 1077374, "language": null, "link": "https://entertainment.slashdot.org/story/24/09/03/2139235/oprahs-upcoming-ai-television-special-sparks-outrage-among-tech-critics?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Oprah's Upcoming AI Television Special Sparks Outrage Among Tech Critics", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.303205+00:00", "description": "In the days following Brazil's shutdown of X, the decentralized social networking startup Bluesky added over 2 million new users, up from just half a million as of Friday. \"This rapid growth led some users to encounter the occasional error that would state there were 'Not Enough Resources' to handle requests, as Bluesky engineers scrambled to keep the servers stable under the influx of new sign-ups,\" reports TechCrunch's Sarah Perez. From the report: As new users downloaded the app, Bluesky jumped to becoming the app to No. 1 in Brazil over the weekend, ahead of Meta's X competitor, Instagram Threads. According to app intelligence firm Appfigures, Bluesky's total downloads soared by 10,584% this weekend compared to last, and its downloads in Brazil were up by a whopping 1,018,952%. The growth seems to be having a halo effect, as downloads outside Brazil also rose by 584%, the firm noted. In part, this is due to Bluesky receiving downloads in 22 countries where it had barely seen any t", "id": 1077373, "language": null, "link": "https://tech.slashdot.org/story/24/09/03/2216217/bluesky-adds-2-million-new-users-after-brazils-x-ban?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Bluesky Adds 2 Million New Users After Brazil's X Ban", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.222406+00:00", "description": "Intel's slumping share price could cost it a spot in the Dow Jones Industrial Average. Reuters reports: Analysts and investors said Intel was likely to be removed from the Dow, pointing to a near 60% decline in the company's shares this year that has made it the worst performer on the index and left it with the lowest stock price on the price-weighted Dow. The chipmaker's shares slid about 7% on Tuesday amid a broader market selloff, with the Philadelphia SE Semiconductor index (.SOX) down nearly 6%, following reports of lower chip sales globally in July.\n \nA removal from the index will hurt Intel's already bruised reputation. The company has missed out on the artificial intelligence boom after passing on an OpenAI investment and losses are mounting at the contract manufacturing unit that the chipmaker has been building out in hopes of challenging TSMC. To fund a turnaround, Intel suspended dividend and announced layoffs affecting 15% of its workforce during its earnings report last m", "id": 1077372, "language": null, "link": "https://slashdot.org/story/24/09/03/2225253/intels-dow-status-under-threat-as-struggling-chipmakers-shares-plunge?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel's Dow Status Under Threat As Struggling Chipmaker's Shares Plunge", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.140543+00:00", "description": "The Verge's Jess Weatherbed reports: The organization behind National Novel Writing Month (NaNoWriMo) is being slammed online after it claimed that opposing the use of AI writing tools is \"classist and ableist.\" On Saturday, NaNoWriMo published its stance on the technology, announcing that it doesn't explicitly support or condemn any approach to writing. \"We believe that to categorically condemn AI would be to ignore classist and ableist issues surrounding the use of the technology, and that questions around the use of AI tie to questions around privilege,\" NaNoWriMo said, arguing that \"not all brains\" have the \"same abilities\" and that AI tools can reduce the financial burden of hiring human writing assistants.\n \nNaNoWriMo's annual creative writing event is the organization's flagship program that challenges participants to create a 50,000-word manuscript every November. Last year, the organization said that it accepts novels written with the help of AI apps like ChatGPT but noted th", "id": 1077371, "language": null, "link": "https://slashdot.org/story/24/09/03/2232245/nanowrimo-is-in-disarray-after-organizers-defend-ai-writing-tools?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NaNoWriMo Is In Disarray After Organizers Defend AI Writing Tools", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:17:52.055495+00:00", "description": "An anonymous reader quotes a Bloomberg article, written by Jason Leopold: The aurora borealis, or northern lights, is a colorful display in the night sky that comes from geomagnetic storms in space. When charged particles from the sun smash into the Earth's upper atmosphere, they create bright, kaleidoscopic ribbons of light, typically in polar regions. Really big solar action can interfere with GPS systems and power grids. That's exactly what happened on May 10, when there were three \"coronal mass ejections\" (my future metal band name) that produced one of the most powerful solar storms in 500 years, hence the dazzling, polychromatic sky visible even from South America. Turns out, the extreme space weather also disrupted life on Earth.\n \nSix days after the northern lights, I filed a Freedom of Information Act request with NOAA. I was curious how the agency reacted to the atmospheric event and whether the public deserved to be concerned. I asked NOAA's Space Weather Prediction Center ", "id": 1077370, "language": null, "link": "https://news.slashdot.org/story/24/09/03/2240242/northern-lights-imperiled-infrastructure-from-power-grids-to-satellites?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Northern Lights Imperiled Infrastructure From Power Grids To Satellites", "user": null, "vote": 0}]