[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T16:00:03+00:00", "description": "Space Marine 2 is an incredible game. Even as someone who never played the original Space Marine, my personal excitement levels for its sequel were high, given how promising it looked with each showing, as well how strongly it was taking cues from Gears of War, a series I cannot get enough of. \n\nAnd happily enough, Space Marine 2 is good enough to not only match those expectations, but easily surpass them. It is, in fact, legitimately one of the best action games to have come out in recent memory. \n\nWith adrenaline-fueled combat, breathtaking scale, unforgettable encounters again hordes of massive sizes, and impressive technical achievements, Space Marine 2 is easily one of 2024’s standout games.", "id": 1081692, "language": null, "link": "https://www.youtube.com/watch?v=3Kgw9rDt2SU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/3Kgw9rDt2SU/hqdefault.jpg", "title": "Warhammer 40,000: Space Marine 2 Review - ONE OF THE BEST ACTION GAMES IN RECENT YEARS", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T15:00:12+00:00", "description": "In the state that it exists right now, however, Test Drive Unlimited Solar Crown is still a good game, if not necessarily a great game. It has its fair share of noticeable flaws, from its performance and technical issues to the occasional frustrations with the driving mechanics, but from its dense and massive open world map to how it allows you to simply exist in the world that it has crafted, there's a lot to like here as well. \n\nPeople will come to different conclusions on whether or not it is worth the long, long wait after the last game in the series, but at the end of the day, there can be no denying that Test Drive Unlimited Solar Crown is, at the minimum, a fun, engaging open world racer.", "id": 1081374, "language": null, "link": "https://www.youtube.com/watch?v=Dh4NSEz7oGM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/Dh4NSEz7oGM/hqdefault.jpg", "title": "Test Drive Unlimited: Solar Crown Review - An Enjoyable, If Noticeably Rough, Open World Racer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-04T06:45:00+00:00", "description": "Concord's launch was marred by several setbacks, from the distinct lack of players causing matchmaking woes, the alleged poor sales, or the lukewarm reaction from critics. While many assumed that Firewalk Studios would carry out its planned roadmap, it's been announced that the competitive shooter will go offline from September 6th.\n\nNot only will it be pulled from sale, but PS5 and PC players will receive refunds. The fact that this decision occurred roughly two weeks after its launch is unprecedented, especially for a live-service title from a major publisher like Sony.\n\nWhile there's a possibility that it returns, as Firewalk explores further options, this may also be the last we see of the shooter for a long time. If it's not an indication that Sony's live-service approach has failed, then it proves the company is better off sticking to single-player titles.", "id": 1078330, "language": null, "link": "https://www.youtube.com/watch?v=CaqGsvaYqPA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/CaqGsvaYqPA/hqdefault.jpg", "title": "We ABSOLUTELY Need to Talk About Concord", "user": null, "vote": 0}]