[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T15:45:01+00:00", "description": "And we tell you all about it! Yes, we are talking about Metro Awakening for the PS5 and PSVR2. The wait for Metro 4 continues, but while 4A Games is plugging away on the sequel to Metro Exodus behind the scenes, fans of the post-apocalyptic franchise do still have other stuff to look forward to.\n\nEnter: Metro Awakening, a spinoff developed by Vertigo Games for VR devices that has looked legitimately promising since the day of its announcement. Now that the game is here, here, we're going to go over a few key details that you should know about it before you decide whether or not you want to dive in.", "id": 1472262, "language": null, "link": "https://www.youtube.com/watch?v=HOrFDazrxOI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/HOrFDazrxOI/hqdefault.jpg", "title": "This Is Secretly One of 2024's Best PS5 Games And You Likely Don't Even Know About It...", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T13:45:00+00:00", "description": "At one point in time, Microsoft's Flight Simulator was just Flight Simulator, and it was the premiere flight simulator. While it went into dormancy for a time, the franchise made a huge comeback with Microsoft Flight Simulator in 2020. The sequel is finally upon us with Microsoft Flight Simulator 2024, which is bigger and hopefully better in every single way.\n\nWhether it's the sheer increase in size and attention to detail, the ability to walk outside and explore 27 different biomes, over 120 available aircraft, new systems, a Flight Planner, and a new Career Mode, there is a mind-boggling amount of stuff to do in Flight Sim 2024. That's not even including the Challenge League or World Photographer modes.\n\nMicrosoft Flight Simulator 2024 launches on November 19th for Xbox Series X/S and PC. Here's what you should know about it, including the hardware required to achieve \"ideal specs\" on PC.", "id": 1471259, "language": null, "link": "https://www.youtube.com/watch?v=074wJYN3MG4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/074wJYN3MG4/hqdefault.jpg", "title": "Microsoft Flight Simulator 2024 - 15 Things You ABSOLUTELY NEED TO KNOW Before You Buy", "vote": 0}]