[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T23:17:24.595841+00:00", "description": "An anonymous reader quotes a report from CBC News: The head of a company specializing in cryptocurrency was kidnapped and held for ransom in downtown Toronto during rush hour Wednesday. Police were called about a kidnapping in the area of University Avenue and Richmond Street W. just before 6 p.m., says a spokesperson with the Toronto Police Service. The suspects forced the victim into a vehicle and made a demand for money, the spokesperson said. The man was later located in Centennial Park in Etobicoke uninjured.\n \nCBC Toronto has learned the victim is Dean Skurka, the president and CEO of Toronto-based financial firm WonderFi. He was released after a ransom of $1 million was paid electronically, a source close to the investigation said. Police say the investigation is ongoing and have not released any further details. [...] The alleged kidnapping happened the same day WonderFi released its third quarter earnings results, showing a 153 per cent increase compared to its third quarter", "id": 1474843, "language": null, "link": "https://yro.slashdot.org/story/24/11/07/2159228/toronto-crypto-company-ceo-kidnapped-held-for-1-million-ransom-before-being-released?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Toronto Crypto Company CEO Kidnapped, Held For $1 Million Ransom Before Being Released", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T23:17:24.162886+00:00", "description": "Microsoft is introducing a feature to Notepad called Rewrite that will let you use AI to \"rephrase sentences, adjust tone, and modify the length of your content.\" The Verge reports: If you're a Windows Insider with early access to the feature, you can try it by highlighting the text you want to adjust in Notepad, right-clicking it, and choosing Rewrite. Notepad will then display a dialogue box where you can decide how they want to change their text -- for example, if it needs to be longer or shorter. Rewrite will then offer three rewritten versions that you can replace your work with.\n \nIt's worth noting that you'll have to sign in to your Microsoft account to use Rewrite, as it's \"powered by a cloud-based service that requires authentication and authorization.\" Microsoft is launching this feature in preview on Windows 11 in the US, France, UK, Canada, Italy, and Germany. In July, Microsoft rolled out spellcheck and autocorrect for Notepad.<p><div class=\"share_submission\" style=\"posi", "id": 1474842, "language": null, "link": "https://tech.slashdot.org/story/24/11/07/224248/even-microsoft-notepad-is-getting-ai-text-editing-now?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Even Microsoft Notepad Is Getting AI Text Editing Now", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T22:12:31.186741+00:00", "description": "I had the opportunity to interview esteemed programmer Steve Yegge for the SourceForge Podcast to ask him all about AI-powered coding assistants and the future of programming. \"We're moving from where you have to write the code to where the LLM will write the code and you're just having a conversation with it about the code,\" said Yegge. \"That is much more accessible to people who are just getting into the industry.\"\n \nSteve has nearly 30 years of programming experience working at Geoworks, Amazon, Google, Grab and now SourceGraph, working to build out the Cody AI assistant platform. He's not shy about sharing his opinions or predictions for the industry, no matter how difficult it may be for some to hear. \"I'm going to make the claim that ... line-oriented programming, which we've done for the last 40, 50 years, ... is going away. It is dying just like assembly language did, and it will be completely dead within five years.\"\n \nYou can watch the episode on YouTube and stream on all m", "id": 1474359, "language": null, "link": "https://developers.slashdot.org/story/24/11/07/1926221/interview-with-programmer-steve-yegge-on-the-future-of-ai-coding?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Interview with Programmer Steve Yegge On the Future of AI Coding", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T21:07:15.054623+00:00", "description": "With October's initial temperature data in, 2024 will rank as the first calendar year in modern record-keeping in which global average surface temperatures exceed the Paris Agreement's aspirational 1.5C guardrail. From a report:Holding long-term warming to the 1.5-degree target compared to the preindustrial era is crucial for lowering the risk of triggering climate change tipping points, beyond which potentially catastrophic impacts have a higher likelihood of occurring, studies show. Holding warming to that target is viewed as necessary for small island states and other extremely vulnerable nations to avoid being wiped out by sea level rise, drought and other threats. \n\nThe data -- and proxy records such as tree rings and ice cores -- shows this year is likely to be the hottest in at least 125,000 years. Right now, the world is on track for as much as 3.1C (5.58F) of warming based on already pledged emissions cuts, assuming they are fulfilled. Copernicus Climate Change Service repor", "id": 1474023, "language": null, "link": "https://news.slashdot.org/story/24/11/07/1838212/global-temperatures-likely-to-exceed-key-limit-for-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Global Temperatures Likely To Exceed Key Limit For First Time", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T21:07:14.576582+00:00", "description": "Apple has confirmed it has no plans to release a 27-inch iMac, ending speculation about a larger successor to its flagship desktop computer. The tech giant will instead focus on its 24-inch M3 iMac and Mac Studio offerings.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Scraps+Plans+for+27-inch+iMac%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F11%2F07%2F1921225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F11%2F07%2F1921225%2Fapple-scraps-plans-for-27-inch-imac%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://apple.slashdot.org/story/24/11/07/1921225/apple-scraps-plans-for-27-inch-imac?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read ", "id": 1474022, "language": null, "link": "https://apple.slashdot.org/story/24/11/07/1921225/apple-scraps-plans-for-27-inch-imac?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Scraps Plans for 27-inch iMac", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T19:58:05.334590+00:00", "description": "An anonymous reader shares a report: In October, video game giant Activision said it had fixed a bug in its anti-cheat system that affected \"a small number of legitimate player accounts,\" who were getting banned because of the bug. In reality, according to the hacker who found the bug and was exploiting it, they were able to ban \"thousands upon thousands\" of Call of Duty players, who they essentially framed as cheaters. The hacker, who goes by Vizor, spoke to TechCrunch about the exploit, and told their side of the story. \n\n\"I could have done this for years and as long as I target random players and no one famous it would have gone without notice,\" said Vizor, who added that it was \"funny to abuse the exploit.\" TechCrunch was introduced to Vizor by a cheat developer called Zebleer, who is familiar with the Call of Duty hacking scene. Zebleer said he had been in touch with Vizor for months, and as such had knowledge of the exploit, which he said he saw Vizor using.<p><div class=\"share", "id": 1473563, "language": null, "link": "https://it.slashdot.org/story/24/11/07/1813235/hacker-says-they-banned-thousands-of-call-of-duty-gamers-by-abusing-anti-cheat-flaw?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Hacker Says They Banned 'Thousands' of Call of Duty Gamers By Abusing Anti-Cheat Flaw", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T19:58:04.967142+00:00", "description": "A federal agency has issued a directive to employees to reduce the use of their phones for work matters due to China's recent hack of U.S. telecommunications infrastructure, WSJ reported on Thursday, citing people familiar with the matter. From the report: In an email to staff sent Thursday, the chief information officer at the Consumer Financial Protection Bureau warned that internal and external work-related meetings and conversations that involve nonpublic data should only be held on platforms like Microsoft Teams and Cisco WebEx and not on work-issued or personal phones. \n\n\"Do NOT conduct CFPB work using mobile voice calls or text messages,\" the email said, while referencing a recent government statement acknowledging the telecommunications infrastructure attack. \"While there is no evidence that CFPB has been targeted by this unauthorized access, I ask for your compliance with these directives so we reduce the risk that we will be compromised,\" said the email, which was sent to a", "id": 1473562, "language": null, "link": "https://news.slashdot.org/story/24/11/07/1910221/us-agency-warns-employees-about-phone-use-amid-ongoing-china-hack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Agency Warns Employees About Phone Use Amid Ongoing China Hack", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T18:53:49.770053+00:00", "description": "Software engineer David Gomes writes in a blog post: I sometimes need to search for a website that will \"convert a PNG to SVG\", or \"remove page from PDF\" or \"resize svg\". And these apps are... okay. I don't really trust most of them with my data, and also a lot of times they just don't work or have too many ads. So, I've been noticing a trend of people just using AI agents to create full blown apps for these simple use cases. \n\nI decided to try it myself for a \"resize SVG\" app since I recently had to go through a bunch of websites to do this. So, I pulled up Replit Agent and even though I've used it before, it doesn't cease to amaze me just how insanely good it is. The level of polish on this product is unlike any other AI agent out there right now. It starts off by drawing up a plan and asking you for feedback on that plan. Then, it'll just go to town and try to build the app. But what's super clever about it is that the agent asks you for feedback along the way. Effectively, the Re", "id": 1473135, "language": null, "link": "https://tech.slashdot.org/story/24/11/07/1724248/just-have-ai-build-an-app-for-that?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'Just Have AI Build an App For That'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T17:49:10.372019+00:00", "description": "Plastic pollution is changing the processes of the entire Earth system, exacerbating climate change, biodiversity loss, ocean acidification, and the use of freshwater and land, according to scientific analysis. From a report: Plastic must not be treated as a waste problem alone, the authors said, but as a product that poses harm to ecosystems and human health. The authors gave their warning in the days before final talks begin in South Korea to agree a legally binding global treaty to cut plastic pollution. Progress towards a treaty on plastic pollution has been hindered by a row over the need to include cuts to the $712bn plastic production industry in the treaty. \n\nAt the last talks in April, developed countries were accused of bowing to pressure from fossil fuel and industry lobbyists to steer clear of any reductions in production. The discussions in South Korea, which start on 25 November, mark a rare opportunity for countries to come to an agreement to tackle the global crisis o", "id": 1472734, "language": null, "link": "https://news.slashdot.org/story/24/11/07/1652216/plastic-pollution-is-changing-entire-earth-system-scientists-find?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Plastic Pollution is Changing Entire Earth System, Scientists Find", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T17:49:09.965022+00:00", "description": "A pre-dawn statewide alert about an officer shooting in Hall County triggered over 4,500 complaints to the Federal Communications Commission. The 4:52 a.m. \"Blue Alert\" on October 4 awakened millions of Texans, many living hundreds of miles from the incident location, to notify them about suspect Seth Altman. Air traffic controllers, healthcare workers, and other professionals reported safety concerns from sleep disruption, according to records obtained by 404 Media. Multiple residents told the FCC they disabled all emergency notifications in response, potentially compromising public safety for future alerts.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=What+Tired+Texans+Wrote+To+the+FCC%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F11%2F07%2F1716210%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/", "id": 1472733, "language": null, "link": "https://tech.slashdot.org/story/24/11/07/1716210/what-tired-texans-wrote-to-the-fcc?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "What Tired Texans Wrote To the FCC", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T16:43:08.250917+00:00", "description": "Malwarebytes, in a blog post: We've acquired AzireVPN, a privacy-focused VPN provider based in Sweden. I wanted to share with you our intentions behind this exciting step, and what this means for our existing users and the family of solutions they rely on to keep them private and secure. \n\nMalwarebytes has long been an advocate for user privacy (think Malwarebytes Privacy VPN and our free web extension Malwarebytes Browser Guard). Now, we're leaning even more on our mission to reimagine consumer cybersecurity to protect devices and data, no matter where users are located, how they work and play, or the size of their wallet. With AzireVPN's infrastructure and intellectual property, Malwarebytes is poised to develop more advanced VPN technologies and features, offering increased flexibility and enhanced security for our users.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Malwarebytes+Acquires+AzireVPN%3A+https%3A%2", "id": 1472189, "language": null, "link": "https://slashdot.org/story/24/11/07/1529211/malwarebytes-acquires-azirevpn?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Malwarebytes Acquires AzireVPN", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T15:38:13.527477+00:00", "description": "Nvidia will impose a 100-hour monthly limit on its GeForce Now cloud gaming service for new subscribers starting January 2025, with existing members facing the same restriction from 2026, the company said on Thursday. \n\nThe gaming giant aims to maintain current subscription prices by implementing the cap, which affects roughly 6% of users. Members can purchase additional 15-hour blocks for $2.99 on Performance tier or $5.99 for Ultimate tier once they exceed the limit. \n\nThe service, which allows users to stream games from remote servers, will also rebrand its Priority membership to Performance tier, adding 1440p streaming and ultrawide resolution support. Subscribers can carry over 15 unused hours monthly or switch to basic servers after reaching the cap, Nvidia said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nvidia+Sets+100-Hour+Monthly+Cap+on+Cloud+Gaming+Service%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2", "id": 1471662, "language": null, "link": "https://tech.slashdot.org/story/24/11/07/1442231/nvidia-sets-100-hour-monthly-cap-on-cloud-gaming-service?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Nvidia Sets 100-Hour Monthly Cap on Cloud Gaming Service", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T15:38:13.412791+00:00", "description": "Over 60 classic Sega games are being delisted from digital stores, including Crazy Taxi, Golden Axe and Jet Set Radio. From a report: Starting on 6th December at 11:59pm PST (so, 7.59am on 7th December, for those of us in the UK), the affected games will no longer be available to purchase. Of course, if you already have a game in your library, it will remain available to download and play as and when. \n\nIn a FAQ, Sega noted select individual classic titles will remain playable for those among us who have a Nintendo Switch Online subscription. No explanation was given for why these changes are being made.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sega+Delisting+Over+60+Classic+Games+From+Virtual+Stores%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F11%2F07%2F1515236%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http:/", "id": 1471661, "language": null, "link": "https://games.slashdot.org/story/24/11/07/1515236/sega-delisting-over-60-classic-games-from-virtual-stores?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Sega Delisting Over 60 Classic Games From Virtual Stores", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T14:31:44.051143+00:00", "description": "Taiwan should pour more resources into advancing chip technology and expanding its supply chain expertise to maintain global leadership, an executive from its most valuable company said hours after Donald Trump was elected to be US president for the second time. From a report: \"We should accelerate research and development to ensure our standing as an indispensable member of the global semiconductor supply chain,\" Taiwan Semiconductor Manufacturing Co. Senior Vice President Cliff Hou said in remarks delivered in his role as chairman of the Taiwan Semiconductor Industry Association on Thursday. \"We are also working with the government to see whether we can attract foreign partners to set up design and materials centers in Taiwan.\" \n\nThe self-governing island, home to the world's biggest contract chipmaker, TSMC, lives with the constant threat of invasion by China, which considers it a breakaway territory. The imminent change in US leadership may alter its standing in global affairs. W", "id": 1471185, "language": null, "link": "https://slashdot.org/story/24/11/07/144213/taiwan-must-improve-its-chip-tech-to-stay-ahead-tsmcs-hou-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Taiwan Must Improve Its Chip Tech to Stay Ahead, TSMC's Hou Says", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T13:24:55.753545+00:00", "description": "AI startup Perplexity demonstrated strong performance in real-time during Tuesday election coverage, while rivals failed by predicting wrong outcomes before polls closed, marking the first major test of AI systems in U.S. election reporting, TechCrunch reports. \n\nPerplexity launched an election hub featuring live maps powered by Associated Press and Democracy Works data, contrasting with major competitors like OpenAI's ChatGPT and Google's Gemini, which declined to provide election information. Despite some minor data display issues and occasional inaccuracies in state-level analysis, Perplexity's coverage largely matched traditional media outlets, potentially intensifying its ongoing legal battle with Dow Jones over audience competition.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Other+Election+Night+Winner%3A+Perplexity%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F11%2F07%2F0330223%2F%3Futm_source%3D", "id": 1470719, "language": null, "link": "https://tech.slashdot.org/story/24/11/07/0330223/the-other-election-night-winner-perplexity?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Other Election Night Winner: Perplexity", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T12:19:25.585251+00:00", "description": "An anonymous reader quotes a report from PCMag: Have I Been Pwned has long been one of the most useful ways to learn if your personal information was exposed in a hack. But a new site offers its own powerful tool to help you check if your data has been leaked to cybercriminals. DataBreach.com is the work of a New Jersey company called Atlas Privacy, which helps consumers remove their personal information from data brokers and people search websites. On Wednesday, the company told us it had launched DataBreach.com as an alternative to Have I Been Pwned, which is mainly searchable via the user's email address. DataBreach.com is designed to do that and more. In addition to your email address, the site features an advanced search function to see whether your full name, physical address, phone number, Social Security number, IP address, or username are in Atlas Privacy's extensive library of recorded breaches. More categories will also be added over time.\n \nAtlas Privacy has been offering", "id": 1470342, "language": null, "link": "https://it.slashdot.org/story/24/11/07/0620237/databreachcom-emerges-as-alternative-to-haveibeenpwned?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "DataBreach.com Emerges As Alternative To HaveIBeenPwned", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T10:08:09.669224+00:00", "description": "A security update mislabeling by Microsoft led to Windows Server 2022 systems unexpectedly upgrading to Windows Server 2025, impacting 7 percent of Heimdal customers and leaving administrators scrambling to manage unexpected licensing and configuration challenges. The Register reports: It took Heimdal a while to trace the problem. According to a post on Reddit: \"Due to the limited initial footprint, identifying the root cause took some time. By 18:05 UTC, we traced the issue to the Windows Update API, where Microsoft had mistakenly labeled the Windows Server 2025 upgrade as KB5044284.\" It added: \"Our team discovered this discrepancy in our patching repository, as the GUID for the Windows Server 2025 upgrade does not match the usual entries for KB5044284 associated with Windows 11. This appears to be an error on Microsoft's side, affecting both the speed of release and the classification of the update. After cross-checking with Microsoft's KB repository, we confirmed that the KB numbe", "id": 1469711, "language": null, "link": "https://tech.slashdot.org/story/24/11/07/0029224/sysadmin-shock-as-windows-server-2025-installs-itself-after-update-labeling-error?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Sysadmin Shock As Windows Server 2025 Installs Itself After Update Labeling Error", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T07:58:15.133824+00:00", "description": "The James Webb Space Telescope has made groundbreaking discoveries, detecting the most distant galaxy yet and capturing an image of the closest directly-imaged exoplanet. \"Judging by astronomers' interest in using Webb, there are many more to come,\" writes Ars Technica's Stephen Clark. With immense demand for observation time, Webb is set to explore a vast array of cosmic targets -- from early galaxies to exoplanet atmospheres -- offering insights that extend far beyond Hubble's reach. From the report: The Space Telescope Science Institute, which operates Webb on behalf of NASA and its international partners, said last week that it received 2,377 unique proposals from science teams seeking observing time on the observatory. The institute released a call for proposals earlier this year for the so-called \"Cycle 4\" series of observations with Webb. This volume of proposals represents around 78,000 hours of observing time with Webb, nine times more than the telescope's available capacity", "id": 1469197, "language": null, "link": "https://science.slashdot.org/story/24/11/07/0041226/nearly-three-years-since-launch-webb-is-a-hit-among-astronomers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Nearly Three Years Since Launch, Webb Is a Hit Among Astronomers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T03:38:49.787750+00:00", "description": "An anonymous reader quotes a report from Reuters: Australia Prime Minister Anthony Albanese said on Thursday the government would legislate for a ban on social media for children under 16, a policy the government says is world-leading. \"Social media is doing harm to our kids and I'm calling time on it,\" Albanese told a news conference. Legislation will be introduced into parliament this year, with the laws coming into effect 12 months after it is ratified by lawmakers, he added. There will be no exemptions for users who have parental consent.\n \n\"The onus will be on social media platforms to demonstrate they are taking reasonable steps to prevent access,\" Albanese said. \"The onus won't be on parents or young people.\" Communications Minister Michelle Rowland said platforms impacted would include Meta Platforms' Instagram and Facebook, as well as Bytedance's TikTok and Elon Musk's X. Alphabet's YouTube would likely also fall within the scope of the legislation, she added.<p><div class=\"", "id": 1468480, "language": null, "link": "https://tech.slashdot.org/story/24/11/07/0019205/australia-proposes-ban-on-social-media-for-those-under-16?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Australia Proposes Ban On Social Media For Those Under 16", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T01:27:45.701526+00:00", "description": "Intel faces a class-action lawsuit alleging its 13th and 14th generation desktop processors from 2022 and 2023 are defective, causing system instability and frequent crashes. The suit claims that Intel knew of the issue but continued marketing the processors anyway. The Register reports: The plaintiff, Mark Vanvalkenburgh of Orchard Park, New York, purchased an Intel Core i7-13700K from Best Buy in January 2023, according to the complaint [PDF]. \"After purchasing the product, Plaintiff learned that the processor was defective, unstable, and crashing at high rates,\" the complaint claims. \"The processor caused issues in his computer, including random screen blackouts and random computer restarts. These issues were not resolved even after he attempted to install a patch issued by Intel for its 13th Generation processors.\"\n \nThe potential class-action lawsuit cites various media reports and social media posts dating back to December 2022 that describe problems with Intel's 13th and 14th ", "id": 1468139, "language": null, "link": "https://yro.slashdot.org/story/24/11/06/2211220/intel-sued-over-raptor-lake-voltage-instability?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Sued Over Raptor Lake Voltage Instability", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T00:23:12.404471+00:00", "description": "OpenAI has acquired the chat.com domain name, likely for well over $10 million. OpenAI CEO Sam Altman posted a one-word tweet this morning, simply stating, \"chat.com.\" Domain Name Wire reports: The chat.com domain name has changed hands for the third time in two years. HubSpot founder Dharmesh Shah kicked off the buying last year, plunking down over $15.5 million for the domain name. He turned around and sold the domain shortly thereafter for a profit.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Acquires+Chat.com%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F11%2F06%2F224243%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F11%2F06%2F224243%2Fopenai-acquires-chatcom%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a", "id": 1467921, "language": null, "link": "https://tech.slashdot.org/story/24/11/06/224243/openai-acquires-chatcom?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Acquires Chat.com", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-07T00:23:11.893837+00:00", "description": "The federal government of Canada has ordered TikTok to shut down its operations in the country, citing national security concerns. However, Canadians will still be able to access the app and use it to create content. \"The decision to use a social media application or platform is a personal choice,\" said Innovation Minister Francois-Philippe Champagne.\n \n\"We came to the conclusion that these activities that were conducted in Canada by TikTok and their offices would be injurious to national security. I'm not at liberty to go into much detail, but I know Canadians would understand when you're saying the government of Canada is taking measures to protect national security, that's serious.\" CBC News reports: Champagne urged Canadians to use TikTok \"with eyes wide open.\" Critics have claimed that TikTok users' data could be obtained by the Chinese government. \"Obviously, parents and anyone who wants to use social platform should be mindful of the risk,\" he said. The decision was made in ac", "id": 1467920, "language": null, "link": "https://news.slashdot.org/story/24/11/06/2343250/canada-bans-tiktok-citing-national-security-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Canada Bans TikTok Citing National Security Concerns", "vote": 0}]