[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-03T18:30:16+00:00", "description": "When you think about popular video game franchises, much less role-playing games, Dragon Quest may or may not be mentioned. Back in the 80s, it was the RPG to play with its story-telling, combat, characters, and incredible visuals.\n\nThough it's not on the same scale of popularity these days, Dragon Quest remains a successful franchise. And like most companies, it makes sense for the publisher to revisit and remake one of its most beloved titles - Dragon Quest 3. Launching on November 14th, Dragon Quest 3 HD-2D Remake will be available for Xbox Series X/S, PS5, PC, and Nintendo Switch.\n\nMuch of the gameplay systems and story remain intact. However, developer Artdink is adding new story episodes, more involved Monster Arenas, and various quality-of-life features to go with the gorgeous \"HD-2D\" look. Check out everything you should know about the remake before jumping in.", "id": 1446110, "language": null, "link": "https://www.youtube.com/watch?v=SDECMWviE5M", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/SDECMWviE5M/hqdefault.jpg", "title": "Dragon Quest 3 HD-2D Remake - 15 Things You Need To Know Before You Buy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-03T13:30:37+00:00", "description": "So, is The Veilguard good enough to be better than Origins? Though there are some areas where it is decidedly better, thanks to its undeniable shakiness in others, you cannot confidently call it a better game than Origins, which is flat out one of the greatest RPGs ever made. \n\nBut is it a legitimately good Dragon Age game? It absolutely is- it's a very different take on the franchise, yes, but it's not an unsuccessful one. It's certainly one of BioWare's best games in a long time, potentially the best Dragon Age game since Origins, and definitely at least good enough to be mentioned in the same breath.", "id": 1444854, "language": null, "link": "https://www.youtube.com/watch?v=zdQPrEzM1_A", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/zdQPrEzM1_A/hqdefault.jpg", "title": "The Big Question: Does Dragon Age: The Veilguard Top Dragon Age: Origins?", "vote": 0}]