[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-10T16:00:47+00:00", "description": "2K’s ongoing NBA franchise is back for another round in 2024, and with incremental changes commonplace in annual sports games it's expected NBA 2K25 will be no different. Big changes aren’t coming, but more of a refinement of what already works with the series alongside a partial nullifying of what doesn’t. \n\nThe City, for example, has potential to be a more streamlined experience. Most headline grabbing though is that for the first time since the franchise went next-gen, the newer generation version of the game will be available to PC players. That means that formerly PS5 and Xbox Series X|S exclusive game modes such as MyNBA and The W can be enjoyed by those on PCs, plus the aforementioned The City. \n\nThis video highlights 15 things you need to know before hitting to the courts once again.", "id": 1004700, "language": null, "link": "https://www.youtube.com/watch?v=n_GU_5JIyQg", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/n_GU_5JIyQg/hqdefault.jpg", "title": "NBA 2K25 - 15 Things You Need To Know Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-10T09:30:12+00:00", "description": "Whether it’s because it’s too intimidating to start or because it’s a genre unfamiliar to us, some games never get played despite us spending our hard earned cash on them. This list of games will hopefully remind gamers what lies undisturbed deep within their backlog. \n\nThis list of ‘15 games we bought but never got around to playing’ doesn’t rely solely on sales charts or completion rates but is loosely based on discounts the game has gotten, intimidation factor, and how niche a game is. \n\nAlso note that the games included on this list aren’t of poor quality, with many outdoing their initial sales projections. In a majority of cases, these are games that we implore more people to play. These games are underdogs that, despite being good or interesting, fly under the radar for one reason or another.\n\nTimestamps:\n\nIntro 0:00\nNumber 1 0:40\nNumber 2 1:29\nNumber 3 2:09\nNumber 4 3:05\nNumber 5 3:52\nNumber 6 4:42\nNumber 7 5:23\nNumber 8 6:29\nNumber 9 7:27\nNumber 10 8:02\nNumber 11 8:36\nNumber 1", "id": 1004701, "language": null, "link": "https://www.youtube.com/watch?v=l8s-F3TgygE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/l8s-F3TgygE/hqdefault.jpg", "title": "15 Games We Bought But Never Got Around To Playing", "user": null, "vote": 0}]