[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-29T19:30:03+00:00",
        "description": "The Dino Crisis franchise has drawn hundreds of thousands of fans with its unique premise and enchanting gameplay, but it’s long absence from the market has definitely left a void in the hearts of players. \n\nWhether a new game will be released in the future is something that remains to be seen, we do have a new and promising alternative to look forward to in the form of PALEOPHAGE. Currently in development at LogDev, PALEOPHAGE feels like a great modernization of Dino Crisis complete with a new over-the-shoulder perspective and fitting survival horror mechanics. \n\nThere’s quite a bit of potential if LogDev plays its tactics right, and PALEOPHAGE might just end up as one of the biggest surprise hits of the near future.",
        "id": 1799775,
        "language": null,
        "link": "https://www.youtube.com/watch?v=m-NlY3rS0hg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/m-NlY3rS0hg/hqdefault.jpg",
        "title": "This Might Very Well Be The Game That Quenches Our Thirst For A New Dino Crisis",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-29T15:30:16+00:00",
        "description": "For many years, if not longer, the Xbox has often been viewed as a console without many exclusives. Sure, you could rely on Forza, Gears of War, and Halo at some point, but the initial years of the Xbox Series X/S proved that Microsoft needed more in its repertoire to survive, much less thrive.\n\nWhile many could argue that 2024 still hasn't seen the most consistent releases, there's no denying that this year has been great for Xbox owners. Senua's Saga: Hellblade 2 arrived in May, offering a solid action adventure with incredible visuals. S.T.A.L.K.E.R. 2: Heart of Chornobyl and Microsoft Flight Simulator 2024 launched back-to-back, and despite many issues, both solidified themselves as enjoyable experiences. \n\nMeanwhile, Indiana Jones and the Great Circle ended things on a high note as one of the year's best games. Let's look at other big titles that Xbox Series X/S owners should get their hands on.",
        "id": 1798736,
        "language": null,
        "link": "https://www.youtube.com/watch?v=uAs65r8C6Ao",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uAs65r8C6Ao/hqdefault.jpg",
        "title": "Top 15 Amazing Xbox Series X | S Games of 2024 You ABSOLUTELY NEED TO PLAY",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-29T09:30:30+00:00",
        "description": "The medium of video games has proven to be one of the leading forms of storytelling, excellently combining elements of writing with a layer of interactivity to create narratives that can’t really be told anywhere else - complete with multiple options and consequences for your actions. \n\nThe year 2024 has been pretty generous with games that end on a strong note, right from evoking nostalgia about the past to shocking plot twists to happy endings and much more. As the year draws to a close, we thought it would be fitting to look back on the months passed and count down 10 of the best video games that left a mark thanks to memorable endings. Given the nature of this discussion, it’s only natural that spoilers will follow - so consider yourself duly warned.",
        "id": 1797330,
        "language": null,
        "link": "https://www.youtube.com/watch?v=xTCZtGbgHw8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/xTCZtGbgHw8/hqdefault.jpg",
        "title": "10 MIND BLOWING Endings In Video Games of 2024",
        "vote": 0
    }
]