[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T17:30:09+00:00", "description": "With all the hype around Helldivers 2 this year, you must wonder about its inspiration, Starship Troopers. The 1997 action film struck gold with its biting satire and complex depictions, but we've yet to see any compelling adaptations in the gaming space.\n\nOffworld's Starship Troopers: Extermination seemed like it could fill that gap when it entered Steam Early Access last year. The first-person shooter combines elements of base-building and defense, resource management, and 16-player co-op into one big mix, topping it with Arachnid Hordes. With its 1.0 release, we get the Galactic Front for what could be a persistent community effort.\n\nHowever, the results leave much to be desired. Starship Troopers: Extermination does have some moments of gunning down hordes and chaos, but it falters under terrible performance, networking issues, repetitive mission design, and a horrible clan system. It also lacks much of the charm that the franchise has to offer.", "id": 1349573, "language": null, "link": "https://www.youtube.com/watch?v=uj6PAMZKh7M", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/uj6PAMZKh7M/hqdefault.jpg", "title": "Starship Troopers Extermination Review - Disappointing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T15:30:00+00:00", "description": "Like every Dragon Age game before it, the upcoming Dragon Age: The Veilguard is going to feature a new protagonist, a new cast of characters, and a new central conflict, though the story that it will tell is going to directly follow up from things that BioWare set the stage for with Dragon Age: Inquisition a decade ago. That, of course, means that Solas is going to have a crucial role to play in the upcoming fantasy action RPG.\n\nWith Dragon Age: The Veilguard looming on the horizon and approaching its release, here, we're going to look back and take stock of Solas' entire story and everything that we know about him so far, recounting his backstory and the role that he plays in the events of Dragon Age: Inquisition and its expansion, Trespasser, which is what The Veilguard is going to directly follow up on. Without further ado, then, let's dive right in.", "id": 1348627, "language": null, "link": "https://www.youtube.com/watch?v=0EuTcbMs_9c", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/0EuTcbMs_9c/hqdefault.jpg", "title": "The Full Story of Solas - Before You Play Dragon Age: The Veilguard", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T13:30:37+00:00", "description": "Shadow the Hedgehog has always had a massive following within the Sonic fanbase, and this year, Sega has finally been showing him the sort of love that so many feel he deserves but hasn’t gotten till now. 2024 was dubbed the Year of Shadow by the company, and though December’s theatrical release of Sonic the Hedgehog 3 – starring Keanu Reeves as Shadow – will obviously be the flag bearer of that particular drive, another big contributor is going to be Sonic X Shadow Generations. \n\nOn top of bringing back the beloved Sonic Generations in enhanced and remastered form, the upcoming release will also include an entirely new, standalone story centered around Shadow the Hedgehog- and naturally, fans are excited. As we count the days down to Sonic X Shadow Generations’ imminent release, here, we’re going to go over everything that you should know about it.", "id": 1348628, "language": null, "link": "https://www.youtube.com/watch?v=w1XrQt-2aog", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/w1XrQt-2aog/hqdefault.jpg", "title": "Sonic X Shadow Generations - 15 Things You Need To Know Before You Buy", "vote": 0}]