[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T23:10:57.031306+00:00", "description": "Netflix has begun raising prices in several countries, including Japan, parts of Europe, and Africa, as it seeks to sustain growth following its crackdown on password sharing. While its recent financial results show strong revenue growth, the company faces challenges in finding new subscribers and aims to boost future growth through advertising and fresh content. The BBC reports: In its latest results, Netflix announced that it had added 5.1 million subscribers between July and September - ahead of forecasts but the smallest gain in more than a year. The company is under pressure to show investors what will power growth in the years ahead, as its already massive reach makes finding new subscribers more difficult. The last time Netflix saw signs of slowdown, in 2022, it launched measures to stop password sharing and said it would offer a new streaming option with advertisements.\n \nThe crackdown unleashed a new wave of growth. The firm has added more than 45 million new members since la", "id": 1350957, "language": null, "link": "https://news.slashdot.org/story/24/10/18/2111218/netflix-raises-prices-as-password-boost-fades?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Netflix Raises Prices As Password Boost Fades", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T23:10:56.947866+00:00", "description": "An anonymous reader quotes a report from The Guardian: A US startup company is offering to help wealthy couples screen their embryos for IQ using controversial technology that raises questions about the ethics of genetic enhancement. The company, Heliospect Genomics, has worked with more than a dozen couples undergoing IVF, according to undercover video footage. The recordings show the company marketing its services at up to $50,000 for clients seeking to test 100 embryos, and claiming to have helped some parents select future children based on genetic predictions of intelligence. Managers boasted their methods could produce a gain of more than six IQ points. [...]\n \nThe footage appears to show experimental genetic selection techniques being advertised to prospective parents. A Heliospect employee, who has been helping the company recruit clients, outlined how couples could rank up to 100 embryos based on \"IQ and the other naughty traits that everybody wants,\" including sex, height, r", "id": 1350956, "language": null, "link": "https://science.slashdot.org/story/24/10/18/2120210/us-startup-charging-couples-to-screen-embryos-for-iq?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Startup Charging Couples To 'Screen Embryos For IQ'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T22:04:22.617811+00:00", "description": "Cuba's power grid failed on Friday, leaving 10 million people without electricity. NPR reports: One of the country's largest power plants, the Antonio Guiteras power plant in the western province of Matanzas, failed shortly before midday on Friday. The failure prompted a total breakdown of Cuba's electrical system. The power outage comes after days of rolling blackouts. Cuba's prime minister, Manuel Marrero Cruz, blamed the problem on deteriorating infrastructure and fuel shortages exacerbated by Hurricane Milton, which has made it difficult for fuel deliveries to reach the island.\n \nThe prime minister made an address on state television on Thursday evening and said the government would prioritize providing electricity to residential areas and promised shipments of fuel would arrive on the island in the coming days. Cuban officials have not indicated a timeline for when the power grid will be operational again. The massive blackout is a new low in a country that has already been deali", "id": 1350723, "language": null, "link": "https://hardware.slashdot.org/story/24/10/18/2114207/cuba-plunged-into-an-island-wide-blackout-as-power-grid-fails?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Cuba Plunged Into an Island Wide Blackout As Power Grid Fails", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T20:59:59.659780+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Recently, AI researcher Simon Willison wanted to add up his charges from using a cloud service, but the payment values and dates he needed were scattered among a dozen separate emails. Inputting them manually would have been tedious, so he turned to a technique he calls \"video scraping,\" which involves feeding a screen recording video into an AI model, similar to ChatGPT, for data extraction purposes. What he discovered seems simple on its surface, but the quality of the result has deeper implications for the future of AI assistants, which may soon be able to see and interact with what we're doing on our computer screens.\n \n\"The other day I found myself needing to add up some numeric values that were scattered across twelve different emails,\" Willison wrote in a detailed post on his blog. He recorded a 35-second video scrolling through the relevant emails, then fed that video into Google's AI Studio tool, which allows people to ex", "id": 1350437, "language": null, "link": "https://slashdot.org/story/24/10/18/2053242/cheap-ai-video-scraping-can-now-extract-data-from-any-screen-recording?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Cheap AI 'Video Scraping' Can Now Extract Data From Any Screen Recording", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T18:47:13.526811+00:00", "description": "An anonymous reader shares a report: At the end of September, Kaspersky forcibly uninstalled and replaced itself with a new antivirus called UltraAV on the computers of around a million Americans, many of whom were surprised and aghast that they were not asked to give their consent for the change. The move was the end result of the U.S. government ban on all sales of Kaspersky software in the country and -- at least in theory -- marked the end of Kaspersky in America. \n\nBut not everyone in the U.S. has given up on the Russian-made antivirus. Some Americans have found ways to get around the ban and are still using Kaspersky's antivirus, TechCrunch has learned. Several people who live in the U.S. said in posts on Reddit that they are holding out as Kaspersky customers. When TechCrunch asked them about their motivations, their reasons range from being skeptical of the reasons behind the ban, or having paid for the product already, to simply preferring the product over its rivals.<p><div ", "id": 1349854, "language": null, "link": "https://it.slashdot.org/story/24/10/18/1750210/some-americans-are-still-using-kasperskys-antivirus-despite-us-government-ban?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Some Americans Are Still Using Kaspersky's Antivirus Despite US Government Ban", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T18:47:13.441494+00:00", "description": "An anonymous reader shares a report: Every year for the past seven, Nathan Benaich, the founder and solo general partner at the early-stage AI investment firm Air Street Capital, has produced a magisterial \"State of AI\" report. Benaich and his collaborators marshal an impressive array of data to provide a great snapshot of the technology's evolving capabilities, the landscape of companies developing it, a survey of how AI is being deployed, and a critical examination of the challenges still facing the field. \n\nOne of the big takeaways from this year's report, which was published late last week, is that OpenAI's lead over other AI labs has largely eroded. Anthropic's Claude 3.5 Sonnet, Google's Gemini 1.5, X's Grok 2, and even Meta's open-source Llama 3.1 405 B model have equaled, or narrowly surpassed on some benchmarks, OpenAI's GPT-4o.&#226;&#226;But, on the other hand, OpenAI still retains an edge for the moment on reasoning tasks with the release of its o1 \"Strawberry\" model -- wh", "id": 1349853, "language": null, "link": "https://tech.slashdot.org/story/24/10/18/180238/openais-lead-over-other-ai-companies-has-largely-vanished-state-of-ai-report-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI's Lead Over Other AI Companies Has Largely Vanished, 'State of AI' Report Finds", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T17:41:29.915736+00:00", "description": "An anonymous reader shares a report: From the ground, northeastern Norway might look like fjord country, peppered with neat red houses and dissected by snowmobile tours through the winter. But for pilots flying above, the region has become a danger zone for GPS jamming. The jamming in the region of Finnmark is so constant, Norwegian authorities decided last month they would no longer log when and where it happens -- accepting these disturbance signals as the new normal. \n\nNicolai Gerrard, senior engineer at NKOM, the country's communications authority, says his organization no longer counts the jamming incidents. \"It has unfortunately developed into an unwanted normal situation that should not be there. Therefore, the [Norwegian authority in charge of the airports] are not interested in continuous updates on something that is happening all the time.\" Pilots meanwhile, still have to adapt, usually when they are above 6,000 feet in the air. \"We experience this almost every day,\" says Od", "id": 1349496, "language": null, "link": "https://news.slashdot.org/story/24/10/18/1650237/gps-jamming-is-screwing-with-norwegian-planes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": " GPS Jamming Is Screwing With Norwegian Planes", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T17:41:29.623175+00:00", "description": "The FIDO Alliance is developing new specifications to enable secure transfer of passkeys between different password managers and platforms. Announced this week, the initiative is the result of collaboration among members of the FIDO Alliance's Credential Provider Special Interest Group, including Apple, Google, Microsoft, 1Password, Bitwarden, Dashlane, and others. From a report: Passkeys are an industry standard developed by the FIDO Alliance and the World Wide Web Consortium, and were integrated into Apple's ecosystem with iOS 16, iPadOS 16.1, and macOS Ventura. They offer a more secure and convenient alternative to traditional passwords, allowing users to sign in to apps and websites in the same way they unlock their devices: With a fingerprint, a face scan, or a passcode. \n\nPasskeys are also resistant to online attacks like phishing, making them more secure than things like SMS one-time codes. The draft specifications, called Credential Exchange Protocol (CXP) and Credential Excha", "id": 1349495, "language": null, "link": "https://it.slashdot.org/story/24/10/18/179230/fido-alliance-working-on-making-passkeys-portable-across-platforms?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "FIDO Alliance Working on Making Passkeys Portable Across Platforms", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T16:37:41.728349+00:00", "description": "With ransomware attacks surging and 2024 on track to be one of the worst years on record, U.S. officials are seeking ways to counter the threat, in some cases, urging a new approach to ransom payments. From a report: Ann Neuberger, U.S. deputy national security adviser for cyber and emerging technologies, wrote in a recent Financial Times opinion piece, that insurance policies -- especially those covering ransomware payment reimbursements -- are fueling the very same criminal ecosystems they seek to mitigate. \"This is a troubling practice that must end,\" she wrote, advocating for stricter cybersecurity requirements as a condition for coverage to discourage ransom payments. \n\nZeroing in on cyber insurance as a key area for reform comes as the U.S. government scrambles to find ways to disrupt ransomware networks. According to the latest report by the Office of the Director of National Intelligence, by mid-2024 more than 2,300 incidents already had been recorded -- nearly half targeting ", "id": 1348970, "language": null, "link": "https://news.slashdot.org/story/24/10/18/1618246/the-government-is-getting-fed-up-with-ransomware-payments-fueling-endless-cycle-of-cyberattacks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Government is Getting Fed Up With Ransomware Payments Fueling Endless Cycle of Cyberattacks", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T15:33:34.710235+00:00", "description": "An anonymous reader quotes a report from TechCrunch: Stripe is in talks to acquire stablecoin platform Bridge for a whopping $1 billion, according to Forbes (paypalled). The talks are reportedly in advanced stages, although nothing has been finalized. Bridge, co-founded by Coinbase alumni Zach Abrams and Sean Yu, has built an API that helps companies accept stablecoins. The pair raised $58 million from investors like Index Ventures and Sequoia Capital, according to PitchBook. If the deal with Stripe goes through, it would be a huge jump from Bridge's $200 million valuation, as well as being Stripe's largest acquisition to date.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Stripe+In+Talks+To+Acquire+Bridge+For+%241+Billion%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F10%2F18%2F014215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" hr", "id": 1348388, "language": null, "link": "https://slashdot.org/story/24/10/18/014215/stripe-in-talks-to-acquire-bridge-for-1-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Stripe In Talks To Acquire Bridge For $1 Billion", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T15:33:34.611298+00:00", "description": "Salesforce founder and chief executive Marc Benioff has doubled down on his criticism of Microsoft's Copilot, the AI-powered tool that can write Word documents, create PowerPoint presentations, analyze Excel spreadsheets and even reply to emails through Outlook. In a post on X, he writes: When you look at how Copilot has been delivered to customers, it's disappointing. It just doesn't work, and it doesn't deliver any level of accuracy. Gartner says it's spilling data everywhere, and customers are left cleaning up the mess. \n\nTo add insult to injury, customers are then told to build their own custom LLMs. I have yet to find anyone who's had a transformational experience with Microsoft Copilot or the pursuit of training and retraining custom LLMs. Copilot is more like Clippy 2.0.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Salesforce+CEO+Benioff+Says+Microsoft's+Copilot+Doesn't+Work%2C+Doesn't+Offer+'Any+Level+of+A", "id": 1348387, "language": null, "link": "https://slashdot.org/story/24/10/18/046258/salesforce-ceo-benioff-says-microsofts-copilot-doesnt-work-doesnt-offer-any-level-of-accuracy-and-customers-are-left-cleaning-up-the-mess?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Salesforce CEO Benioff Says Microsoft's Copilot Doesn't Work, Doesn't Offer 'Any Level of Accuracy' And Customers Are 'Left Cleaning Up the Mess'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T15:33:34.504683+00:00", "description": "India is expected to limit imports of laptops, tablets and personal computers after January, Reuters reported Friday citing government sources, a move to push companies such as Apple to increase domestic manufacturing. From the report: This plan, if implemented, could disrupt an industry worth $8 billion to $10 billion and reshape the dynamics of the IT hardware market in India, which is heavily reliant on imports. A similar plan to restrict imports was withdrawn last year following backlash from companies and lobbying from the United States. India has since monitored imports under a system set to expire this year and has asked firms to seek fresh approvals for imports next year. The government feels it has given the industry enough time to adapt, said the sources, who did not want to be identified as discussions are private.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=India+Plans+Laptop+Import+Curbs+To+Boost+Loc", "id": 1348386, "language": null, "link": "https://tech.slashdot.org/story/24/10/18/143228/india-plans-laptop-import-curbs-to-boost-local-manufacturing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "India Plans Laptop Import Curbs To Boost Local Manufacturing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T15:33:34.397153+00:00", "description": "WP Engine has filed a motion for a preliminary injunction against Automattic and its CEO Matt Mullenweg, seeking to halt their public campaign and regain access to WordPress resources. The hosting platform claims it's suffering \"immediate irreparable harm,\" including a 14% spike in cancellation requests following Mullenweg's criticism. \n\nWP Engine alleges the dispute has created anxiety among developers and increased security risks for the WordPress community. The legal action comes after Automattic accused WP Engine of trademark infringement, leading to exchanged cease-and-desist orders and a lawsuit. Last week, the WordPress.org project, led by Mullenweg, took control of WP Engine's Advanced Custom Fields plugin, redirecting users to a forked version.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=WP+Engine+Asks+Court+To+Stop+Matt+Mullenweg+From+Blocking+Access+To+WordPress+Resources%3A+https%3A%2F%2Ftech.slashdot", "id": 1348385, "language": null, "link": "https://tech.slashdot.org/story/24/10/18/1448218/wp-engine-asks-court-to-stop-matt-mullenweg-from-blocking-access-to-wordpress-resources?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "WP Engine Asks Court To Stop Matt Mullenweg From Blocking Access To WordPress Resources", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T15:33:34.290379+00:00", "description": "An anonymous reader shares a report: Byju Raveendran, the founder of the embattled edtech group Byju's, acknowledged on Thursday afternoon that he made mistakes, mistimed the market, overestimated growth potential and that his startup, once valued at $22 billion, is now effectively worth \"zero.\" \n\nSpeaking to a group of journalists, Raveendran said the company's aggressive acquisition of more than two dozen startups to expand into new markets proved fatal when financing dried up in 2022. Byju's was planning to go public in early 2022 with several investment bankers giving the firm valuation as high as $50 billion, TechCrunch reported earlier. \n\nHe alleged that many of his more than 100 investors had urged him to pursue aggressive expansion into as many as 40 markets. But, he added, those very investors got cold feet when global markets tumbled following Russia's invasion of Ukraine, sending the venture capital market into a downward spiral.<p><div class=\"share_submission\" style=\"posit", "id": 1348384, "language": null, "link": "https://news.slashdot.org/story/24/10/18/153222/a-startup-once-valued-at-22-billion-is-now-worth-nothing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "A Startup Once Valued at $22 Billion is Now Worth Nothing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T07:07:43.381478+00:00", "description": "The blockchain-based identity verification company founded by Sam Altman is now called \"World.\" It also unveiled a new version of the \"Orb\" biometric devices the company uses to scan users' eyes. CoinTelegraph reports: World, as it's now known, also revealed a slew of other updates including a new version of its Orb biometric scanning devices, new options for identity verification and partnership integrations with popular apps including FaceTime, WhatsApp, and Zoom. [...] The new Orb, powered by Nvidia hardware, will be more efficient and \"five times\" more powerful than its predecessor with a smaller footprint and fewer parts. The company also said the new Orb would eventually be available in self-service kiosks in some markets.\n \nWorld also announced that users will soon be able to verify their identity through methods other than the firm's Orb hardware. Through a program called World ID Credentials, the company says users with NFC-enabled government issued passports will allow them ", "id": 1346488, "language": null, "link": "https://slashdot.org/story/24/10/18/0057206/sam-altmans-worldcoin-rebrands-as-world-unveils-next-generation-orb?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Sam Altman's Worldcoin Rebrands As 'World,' Unveils Next Generation Orb", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T06:03:49.126014+00:00", "description": "AWS CEO Matt Garman has harsh words for remote workers: return to the office or quit. TechCrunch: The Amazon executive recently told employees who don't like the new five-day in-person work policy that, \"there are other companies around,\" presumably companies they can work for remotely, Reuters reported on Thursday. Amazon's top boss, Andy Jassy, told employees last month that there will be a full return-to-office starting in 2025, an increase from three days for roughly the last year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Indicates+Employees+Can+Quit+If+They+Don't+Like+Its+Return-to-Office+Mandate%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F10%2F18%2F0359229%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F10%2F18%2F0359229%", "id": 1346284, "language": null, "link": "https://tech.slashdot.org/story/24/10/18/0359229/amazon-indicates-employees-can-quit-if-they-dont-like-its-return-to-office-mandate?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Indicates Employees Can Quit If They Don't Like Its Return-to-Office Mandate", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T03:52:44.471767+00:00", "description": "An anonymous reader quotes a report from The Verge: Donald Trump said Apple CEO Tim Cook called him to discuss the billions of dollars that Apple has been fined in the European Union. Trump made the statement during his appearance on the PBD Podcast -- and said that he won't let the EU \"take advantage\" of US companies like Apple if reelected. \"Two hours ago, three hours ago, he [Cook] called me,\" Trump said. \"He said the European Union has just fined us $15 billion... Then on top of that, they got fined by the European Union another $2 billion.\" In March, the EU fined Apple around $2 billion after finding that Apple used its dominance to restrict music streaming apps from telling customers about cheaper subscription deals outside the App Store. The EU later won its fight to make Apple pay $14.4 billion in unpaid taxes.\n \n\"He [Cook] said something that was interesting,\" Trump said. \"He said they're using that to run their enterprise, meaning Europe is their enterprise. \"I said, 'That's", "id": 1345915, "language": null, "link": "https://apple.slashdot.org/story/24/10/17/2323239/trump-says-tim-cook-called-him-to-complain-about-the-eu?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Trump Says Tim Cook Called Him To Complain About the EU", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T01:46:34.563425+00:00", "description": "During its MAX event yesterday, Adobe teased some experimental photo and video editing tools for PhotoShop and Premiere Pro. There are a total of nine features, which include being able to rotate vector images, produce sound effects from text descriptions, and generate images in various shapes and sizes. Engadget reports: [W]e'll start with Project Perfect Blend for PS, which improves natural blending and makes shadow casting more realistic, creating more lifelike images. Project Clean Machine removes photo flashes, fireworks and objects blocking the camera's view. One feature that stands out is Project In Motion, which lets users transform custom shape animations into video by entering a prompt, while Project Know How is a content authenticator tool that can search for a video file's source online. Project Turntable lets users rotate 2D vector art in 3D, thereby allowing the 2D vector art to face a direction of their choice. The generative AI model fills in any blanks to create prese", "id": 1345632, "language": null, "link": "https://tech.slashdot.org/story/24/10/17/237222/adobes-upcoming-features-include-ai-sound-generation-and-image-remixing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Adobe's Upcoming Features Include AI Sound Generation and Image Remixing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T00:39:08.929980+00:00", "description": "An anonymous reader quotes a report from BleepingComputer: A new ClickFix campaign is luring users to fraudulent Google Meet conference pages showing fake connectivity errors that deliver info-stealing malware for Windows and macOS operating systems. ClickFix is a social-engineering tactic that emerged in May, first reported by cybersecurity company Proofpoint, from a threat actor (TA571) that used messages impersonating errors for Google Chrome, Microsoft Word, and OneDrive. The errors prompted the victim to copy to clipboard a piece of PowerShell code that would fix the issues by running it in Windows Command Prompt. Victims would thus infect systems with various malware such as DarkGate, Matanbuchus, NetSupport, Amadey Loader, XMRig, a clipboard hijacker, and Lumma Stealer.\n \nIn July, McAfee reported that the ClickFix campaigns were becoming mode frequent, especially in the United States and Japan. A new report from Sekoia, a SaaS cybersecurity provider, notes that ClickFix campaig", "id": 1345370, "language": null, "link": "https://it.slashdot.org/story/24/10/17/2156214/fake-google-meet-conference-errors-push-infostealing-malware?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Fake Google Meet Conference Errors Push Infostealing Malware", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-18T00:39:08.699404+00:00", "description": "Google's NotebookLM app has been updated to let you generate custom podcasts from almost any source material. The AI software is also dropping the \"experimental\" tag. Wired reports: To make an AI podcast using NotebookLM, open up the Google Labs website and start a New Notebook. Then, add any source documents you would like to be used for the audio output. These can be anything from files on your computer to YouTube links. Next, when you click on the Notebook guide, you'll now see the option to generate a deep dive as well as the option to customize it first. Choose Customize and add your prompt for how you'd like the AI podcast to come out. The software suggests that you consider what sections of the sources you'd like highlighted, larger topics you want further explored, or different intended audiences who you want the message to reach.\n \nOne tip [Raiza Martin, who leads the NotebookLM team inside of Google Labs] shares for trying out the new feature is to generate the Audio Overvie", "id": 1345369, "language": null, "link": "https://tech.slashdot.org/story/24/10/17/2248238/googles-notebooklm-now-lets-you-customize-its-ai-podcasts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's NotebookLM Now Lets You Customize Its AI Podcasts", "vote": 0}]