[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-02T19:30:05+00:00", "description": "Sega's Super Monkey Ball series is over two decades old and given how critically acclaimed the first three entries were, a prolonged decline of any kind would be unimaginable. Nevertheless, it happened, but recent titles have shown an uptick in quality. Among these, Super Monkey Ball Banana Rumble is perhaps the best.\n\nDespite the almost non-existent storyline, Adventure Mode goes back to what it's all about - stage after stage of tense platforming and banana collecting. Despite their length, Banana Rumble's 200 stages feel unique, with interesting hooks and memorable aesthetics. \n\nWhether Super Monkey Ball died after the launch of Deluxe or you're seeking a compelling arcade platformer, Super Monkey Ball Banana Rumble is worth checking out. The franchise still has a ways to go, but it's still a fun time.", "id": 807880, "language": null, "link": "https://www.youtube.com/watch?v=dMyu4XVTbHY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/dMyu4XVTbHY/hqdefault.jpg", "title": "Super Monkey Ball Banana Rumble Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-02T15:30:11+00:00", "description": "Once Human seems to be another trendy multiplayer survival game on the surface, but it’s shaping to be far more than that. The horror element that permeates everything in Once Human is decidedly different than any other survival game on the market today. \n\nThe Deviant bosses are especially cool, sporting Bloodborne-like designs. There are even friendly Deviants that help you out in fascinating ways. There’s a single-player campaign available should you wish for a more traditional experience. \n\nOf course, you can completely ignore the campaign and just focus on creating buildings or rising in the PvP leaderboards; the game lets you play it your way. Once Human has many promising systems, so here’s our list of 15 things you need to know before you buy Once Human.", "id": 806191, "language": null, "link": "https://www.youtube.com/watch?v=gErzyhy7-mo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/gErzyhy7-mo/hqdefault.jpg", "title": "Once Human - 15 Things You NEED TO KNOW Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-02T10:00:08+00:00", "description": "The most immediately impressive (or disappointing) thing about video games are their graphics, and whilst graphical prowess isn’t any more important than gameplay or narrative the capability of developers to portray awe-striking environments, realistic character models, and dynamic lighting in incredible detail continues to excel year-on-year. \n\nThis feature will highlight 15 such games of 2024 which have the raised the bar in terms of graphics, so whilst the overall package might not be worthy of your time the way these games look and perform undeniably deserve our plaudits. After all, video games are all about creating a sense of immersion, and with patchy graphics a game’s other aspects such as the aforementioned gameplay or narrative can suffer.", "id": 804147, "language": null, "link": "https://www.youtube.com/watch?v=8oD3j162JF0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/8oD3j162JF0/hqdefault.jpg", "title": "Top 15 Best GRAPHICS of 2024 So Far [4K]", "user": null, "vote": 0}]