[{"bookmarked": false, "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating": 0, "user": null, "tags": [], "date_published": "2024-02-02T16:45:00+00:00", "dead": false, "page_rating_visits": 0, "artist": "GamingBolt", "language": null, "title": "Silent Hill: The Short Message Review - The Final Verdict", "source_obj__id": 208, "description": "The renaissance of Silent Hill is still underway, and while some of the heavy hitters, like Bloober Team's Silent Hill 2 and NeoBards' Silent Hill f, are yet to come, Konami has surprised players with Silent Hill: The Short Message.\n\nAvailable now as a free-to-play title on PS5, it tells a relatively short story about Anita, a teenager who arrives at a rundown apartment complex at the behest of her classmate Maya. The latter instructs her to find \"it\" or she can't leave. While Anita deciphers what \"it\" could be, she faces painful memories and a relentless monster.\n\nIt's a narrative with some intriguing presentation, including live-action sequences. While it may falter at points or offer limited gameplay, Silent Hill: The Short Message captures the series' signature atmosphere in its own way.", "permanent": false, "comments": [], "vote": 0, "album": "", "link": "https://www.youtube.com/watch?v=HFCRWNgB9m8", "page_rating_votes": 0, "thumbnail": "https://i1.ytimg.com/vi/HFCRWNgB9m8/hqdefault.jpg", "age": null}, {"bookmarked": false, "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating": 0, "user": null, "tags": [], "date_published": "2024-02-02T13:30:20+00:00", "dead": false, "page_rating_visits": 0, "artist": "GamingBolt", "language": null, "title": "15 Things Suicide Squad: Kill The Justice League DOESN'T TELL YOU", "source_obj__id": 208, "description": "Love it or hate it, Rocksteady's Suicide Squad: Kill the Justice League has its fair share of mechanics and systems to work out. You could equip anything you like while playing through the story on the default difficulty and do fine.\n\nHowever, there are various Legendary perks to understand, four Afflictions that each do different things (good and bad) and more. You even earn Talent Points somewhat oddly, while some slots and abilities (like Squad Ultimate) are locked behind level-ups. Then there's the Support Squad, who can each have their services improved by completing different missions.\n\nHere are 15 tips and tricks to remember while Suicide Squad: Kill the Justice League. It's out worldwide on February 2nd for Xbox Series X/S, PS5 and PC.", "permanent": false, "comments": [], "vote": 0, "album": "", "link": "https://www.youtube.com/watch?v=P15r3z1kCe4", "page_rating_votes": 0, "thumbnail": "https://i1.ytimg.com/vi/P15r3z1kCe4/hqdefault.jpg", "age": null}, {"bookmarked": false, "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating": 0, "user": null, "tags": [], "date_published": "2024-02-02T09:45:03+00:00", "dead": false, "page_rating_visits": 0, "artist": "GamingBolt", "language": null, "title": "Banishers - 12 Things You Need To Know Before You Buy", "source_obj__id": 208, "description": "With a release date right around the corner on 13th February, Banishers is Don’t Nod’s new game release in seven months, following on from last year’s Jusant. \n\nThe pressure of love against a backdrop of undead apparitions, betrayal, sacrifice, and death are central pillars supporting Banishers macabre storytelling. This video aims to unpack 12 essential things you need to know before pulling the trigger on a pre-order, covering setting, setting, combat, moral ambiguity and more in this enticing action-RPG.", "permanent": false, "comments": [], "vote": 0, "album": "", "link": "https://www.youtube.com/watch?v=v1VSCLGUPmw", "page_rating_votes": 0, "thumbnail": "https://i3.ytimg.com/vi/v1VSCLGUPmw/hqdefault.jpg", "age": null}]