[{"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Open Source Movie Streaming Project 'Movie-Web' Shut Down By Hollywood Complaint", "description": "An anonymous reader quotes a report from TorrentFreak: In recent months, Movie-Web has quickly gained popularity among a particular group of movie aficionados. The open source software, which is still available on GitHub, allows anyone to set up a movie search engine capable of streaming content from third-party sources. These external sources tend to have large libraries of pirated entertainment. Movie-web's developers are not oblivious to the legal ramifications but since they don't host any files, they hoped to avoid legal trouble. The software just provides a search engine for third-party content, they argued. [...]\n \nYesterday, the movie-web.app domain was suddenly taken down. According to a message posted on the official Discord server, this is the result of a \"court action\" from several movie companies including Warner Bros. Netflix, Paramount, Universal, and Disney. [I]t appears that action was taken against the movie-web.app domain. It seems likely that registrar Nam", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T23:53:13.002492+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://yro.slashdot.org/story/24/02/26/2126253/open-source-movie-streaming-project-movie-web-shut-down-by-hollywood-complaint?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Doom Is Now Playable On a Lawnmower", "description": "Landscaping tech company Husqvarna has partnered with Bethesda to bring the original 1993 Doom to its $2,000+ robotic lawnmowers. Kotaku reports: This new way to play Doom arrives in April on all Nera robotic lawnmower models. You don't have to pay for the game, either, just a $2,000+ lawnmower. Instead, just download it and play the shooter via the robo-mower's built-in screen. To rotate your view, you turn the knob and to shoot demons, you press it down. You hold the start button to move forward.\n \nA few caveats to mention. First, this isn't available in the United States. Why? I don't know. Perhaps we can't be trusted with video games on lawnmowers? Secondly, this isn't all of Doom. Instead, it's just the first episode -- Knee Deep In The Dead -- which is arguably its most famous one, sure, but just keep in mind you won't be able to play the rest of the beloved shooter in the middle of your backyard on a tiny LCD screen. Sorry.\n \nSadly, this won't be a permanent feature th", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T23:53:10.895056+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://games.slashdot.org/story/24/02/26/2152212/doom-is-now-playable-on-a-lawnmower?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "OnePlus Watch 2 Launches With Wear OS 4, 100-Hour Battery", "description": "Almost 3 years after launching the first OnePlus Watch, the Chinese smartphone company is launching a successor -- this time powered by Wear OS 4. Utilizing a \"hybrid interface,\" the OnePlus Watch 2 is able to offer 100 hours of battery life, or just over four full days of use. 9to5Google reports: To achieve that goal, the OnePlus Watch 2 actually runs two separate operating systems. Wear OS handles things like apps and watchfaces, while a RTOS powered by a secondary chipset handles more lightweight tasks. A \"smart mode\" on the watch allows the watch swap back and forth between its two operating systems and two chipsets. Wear OS is powered by the Snapdragon W5 Gen 1 and it is Wear OS 4. The RTOS is powered by a BES 2700 MCU Efficiency chipset.\n \nSwitching between the two OS's is something you're likely to not even notice, OnePlus claims: \"The BES2700 Efficiency Chipset runs RTOS and handles background activity and simple tasks, while the Snapdragon W5 handles more demanding t", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T22:48:11.261242+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://mobile.slashdot.org/story/24/02/26/2115224/oneplus-watch-2-launches-with-wear-os-4-100-hour-battery?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Sony Claims To Offer Subs 'Appropriate Value' For Deleting Digital Libraries", "description": "An anonymous reader quotes a report from Ars Technica: Sony is making an effort to appease customers who will lose their entire Funimation digital libraries when the anime streaming service merges into Crunchyroll. Currently, though, the company's plan for giving disappointed customers \"an appropriate value\" for their erased digital copies isn't very accessible or clear. Earlier this month, Sony-owned Funimation announced that customers' digital libraries would be unavailable starting on April 2. At that time, Funimation accounts will become Crunchyroll accounts. Sony acquired Crunchyroll in 2021, so some sort of merging of the services was expected. However, less expected was customers' lost access to online copies of beloved anime that they acquired through digital codes provided in purchased Funimation DVDs or Blu-rays. Funimation for years claimed that customers would be able to stream these copies \"forever, but there are some restrictions.\"\n \nRahul Purini, Crunchyroll's ", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T21:43:24.766764+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://slashdot.org/story/24/02/26/2057225/sony-claims-to-offer-subs-appropriate-value-for-deleting-digital-libraries?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "'Every PC Is Going To Be an AI PC'", "description": "During a briefing at Mobile World Congress in Barcelona, Meghana Patwardhan, VP of Commercial Mobility at Dell Technology, told The Register that while the immediate future would consist of two worlds -- one with AI hardware and one without -- \"every PC is going to be an AI PC in the longer term.\" From the report: In terms of new hardware, Dell used the Mobile World Congress event in Barcelona to show off new versions of its Surface-baiting Latitude 7350 convertible -- \"the world's most serviceable commercial detachable,\" according to the company -- and its workstation-class Precision 3680 tower. Other devices in the Precision range include mobile workstations and the 3280 Compact Form Factor PC. Dell was also determined to present itself as a leader in hybrid working with the Premier Wireless ANC headset, replete with AI-based noise cancellation.\n \nDuringt our talk, AI was never far from the lips of Dell's spokespeople as the company talked up the energy efficiency and futur", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T21:43:22.439361+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://hardware.slashdot.org/story/24/02/26/214237/every-pc-is-going-to-be-an-ai-pc?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "LockBit Ransomware Gang Resurfaces With New Site", "description": "wiredmikey writes: The LockBit ransomware operators launched a new leak site over the weekend, claiming they restored their infrastructure following a law enforcement takedown and invited affiliates to re-join the operation. \n\nOver the weekend, an individual involved with the RaaS, who uses the moniker of \"LockBitSupp\", launched a new leak site that lists hundreds of victim organizations and which contains a long message providing his view on the takedown.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=LockBit+Ransomware+Gang+Resurfaces+With+New+Site%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F02%2F26%2F1651207%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F02%2F26%2F1651207%2Flockbit-ransomware-gang-resurfaces-with-new-site%3Futm_source%3Dslashdot%26utm_medi", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T19:33:12.265404+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://it.slashdot.org/story/24/02/26/1651207/lockbit-ransomware-gang-resurfaces-with-new-site?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Apple's Decision To Drop iPhone Web Apps Comes Under Scrutiny in the EU", "description": "Apple could soon face an investigation over its decision to discontinue iPhone web apps in the European Union, according to a report from the Financial Times. The Verge: The European Commission has reportedly sent Apple and app developers requests for more information to assist in its evaluation. \"We are indeed looking at the compliance packages of all gatekeepers, including Apple,\" the European Commission said in a statement to the Financial Times. \"In that context, we're in particular looking into the issue of progressive web apps, and can confirm sending the requests for information to Apple and to app developers, who can provide useful information for our assessment.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple's+Decision+To+Drop+iPhone+Web+Apps+Comes+Under+Scrutiny+in+the+EU%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F02%2F26%2F1631200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T18:28:46.194962+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://apple.slashdot.org/story/24/02/26/1631200/apples-decision-to-drop-iphone-web-apps-comes-under-scrutiny-in-the-eu?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Google Says Microsoft Offered To Sell Bing To Apple in 2018, But Search-quality Issues Got in the Way", "description": "Microsoft offered to sell its Bing search engine to Apple in 2018, Google said in a court filing earlier this month. The document, from Google's antitrust case against the U.S. Justice Department, was unsealed on Friday. From a report: In the filing earlier this month, Google argued that Microsoft pitched Apple in 2009, 2013, 2015, 2016, 2018 and 2020 about making Bing the default in Apple's Safari web browser, but each time, Apple said no, citing quality issues with Bing. \"In each instance, Apple took a hard look at the relative quality of Bing versus Google and concluded that Google was the superior default choice for its Safari users. That is competition,\" Google wrote in the filing. \n\nThe Justice Department said in its own newly unsealed filing that Microsoft has spent almost $100 billion on Bing over 20 years. The Windows and Office software maker launched Bing in 2009, following search efforts under the MSN and Windows Live brands. Today Bing has 3% global market share,", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T18:28:42.695903+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://tech.slashdot.org/story/24/02/26/1548252/google-says-microsoft-offered-to-sell-bing-to-apple-in-2018-but-search-quality-issues-got-in-the-way?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Supreme Court Hears Landmark Cases That Could Upend What We See on Social Media", "description": "The US Supreme Court is hearing oral arguments Monday in two cases that could dramatically reshape social media, weighing whether states such as Texas and Florida should have the power to control what posts platforms can remove from their services. From a report: The high-stakes battle gives the nation's highest court an enormous say in how millions of Americans get their news and information, as well as whether sites such as Facebook, Instagram, YouTube and TikTok should be able to make their own decisions about how to moderate spam, hate speech and election misinformation. At issue are laws passed by the two states that prohibit online platforms from removing or demoting user content that expresses viewpoints -- legislation both states say is necessary to prevent censorship of conservative users. \n\nMore than a dozen Republican attorneys general have argued to the court that social media should be treated like traditional utilities such as the landline telephone network. The", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T17:16:13.068854+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://news.slashdot.org/story/24/02/26/1637201/supreme-court-hears-landmark-cases-that-could-upend-what-we-see-on-social-media?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Would You Use a Laptop with a Transparent Screen?", "description": "At CNN's product review site, one electronics reporter wrote they were \"dumbfounded\", \"surprised,\" and \"shocked\" by the transparent screen on Lenovo's ThinkBook Transparent Display prototype. \"This Micro LED screen is no slouch, either; a Full HD panel with up to 1,000 nits of brightness...\"\n\nLet's get the big issue out of the way early: Lenovo is merely boasting what it can do, not what it will do. That's what a \"concept\" product means, of course. That said, it's still the most exciting thing I've seen in laptops in quite some time... \n\nThinking of major use cases for such a laptop, I basically considered any time you're out in public and want a more complete world view. While websites with white backgrounds look more opaque than transparent, the black backgrounds of a Notepad document and animations of space and fish fit the experience much better, as I could see the plants that Lenovo had placed behind the screen. The more websites use dark modes, the better this will go, ", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T16:12:38.220500+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://hardware.slashdot.org/story/24/02/26/0215241/would-you-use-a-laptop-with-a-transparent-screen?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Bezos, Nvidia Join OpenAI in Funding Humanoid Robot Startup", "description": "OpenAI, Microsoft, Nvidia, and Jeff Bezos are all part of a pack of investors in a business \"developing human-like robots,\" reports Bloomberg, \"according to people with knowledge of the situation...\" \n\nAt the startup &mdash; which is named \"Figure\" &mdash; engineers \"are working on a robot that looks and moves like a human. The company has said it hopes its machine, called Figure 01, will be able to perform dangerous jobs that are unsuitable for people and that its technology will help alleviate labor shortages.\"\n\nFigure is raising about $675 million in a funding round that carries a pre-money valuation of roughly $2 billion, said the people, who asked not to be identified because the matter is private. Through his firm Explore Investments LLC, Bezos has committed $100 million. Microsoft is investing $95 million, while Nvidia and an Amazon.com Inc.-affiliated fund are each providing $50 million... Other technology companies are involved as well. Intel Corp.'s venture capital ", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T16:12:36.623857+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://hardware.slashdot.org/story/24/02/26/0228255/bezos-nvidia-join-openai-in-funding-humanoid-robot-startup?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Nvidia CEO Says Kids Shouldn't Learn To Code", "description": "theodp writes: Asked at the recent World Government Summit in Dubai what people should focus on when it comes to education, what should they learn, and how they should educate their kids and their societies, Nvidia CEO Jensen Huang made a counterintuitive break from tech CEOs advising youngsters to learn how to code. Huang argued that, even at this early stage of the AI revolution, programming is no longer a vital skill. With coding taken care of by AI, Huang suggested humans can instead focus on more valuable expertise like biology, education, manufacturing, or farming \n\nFrom the video: \"You probably recall over the course of the last 10 years, 15 years, almost everybody who sits on a stage like this would tell you it is vital that your children learn computer science, everybody should learn how to program, and in fact it's almost exactly the opposite. It is our job to create computing technology such that nobody has to program and that the programming language, it's human, ", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T16:12:34.699819+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://developers.slashdot.org/story/24/02/26/1322242/nvidia-ceo-says-kids-shouldnt-learn-to-code?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Microsoft Strikes Deal With Mistral in Push Beyond OpenAI", "description": "Microsoft has struck a deal with French AI startup Mistral as it seeks to broaden its involvement in the fast-growing industry beyond OpenAI. From a report: The US tech giant will provide the 10-month-old Paris-based company with help in bringing its AI models to market. Microsoft will also take a minor stake in Mistral, although the financial details have not been disclosed. The partnership makes Mistral the second company to provide commercial language models available on Microsoft's Azure cloud computing platform. Microsoft has already invested about $13 billion in San Francisco-based OpenAI, an alliance that is being reviewed by competition watchdogs in the US, EU and UK. Other Big Tech rivals, such as Google and Amazon, are also investing heavily in building generative AI -- software that can produce text, images and code in seconds -- which analysts believe has the capacity to shake up industries across the world. WSJ adds: On Monday, Mistral plans to announce a new AI ", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T16:12:33.181873+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://slashdot.org/story/24/02/26/1431255/microsoft-strikes-deal-with-mistral-in-push-beyond-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "$1 Billion Donation Will Provide Free Tuition at a Bronx Medical School", "description": "Dr. Ruth Gottesman, a longtime professor at the Albert Einstein College of Medicine, is making free tuition available to all students going forward. From a report: The 93-year-old widow of a Wall Street financier has donated $1 billion to a Bronx medical school, the Albert Einstein College of Medicine, with instructions that the gift be used to cover tuition for all students going forward. The donor, Dr. Ruth Gottesman, is a former professor at Einstein, where she studied learning disabilities, developed a screening test and ran literacy programs. It is one of the largest charitable donations to an educational institution in the United States and most likely the largest to a medical school. \n\nThe fortune came from her late husband, David Gottesman, known as Sandy, who was a protege of Warren Buffett and had made an early investment in Berkshire Hathaway, the conglomerate Mr. Buffett built. The donation is notable not only for its staggering size, but also because it is going ", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T16:12:31.643149+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://news.slashdot.org/story/24/02/26/1438202/1-billion-donation-will-provide-free-tuition-at-a-bronx-medical-school?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Lenovo's Laptop Concept is Fully Transparent, But the Point Isn't Entirely Clear", "description": "An anonymous reader shares a report from the ongoing Mobile World Congress trade show: This year's big scrum gatherer was Lenovo's long-rumored transparent laptop. It's real. It functions surprisingly well and -- nearest anyone can tell -- its existence is a testament to form over function. That's a perfectly fine thing to be when you're a concept device. When it comes to actually shipping a product, however, that's another conversation entirely. [...] Broadly speaking, it looks like a laptop, with a transparent pane where the screen should be. It's perhaps best understood as a kind of augmented reality device, in the sense that its graphics are overlaid on whatever happens to be behind it. \n\nIt's a crowd pleaser, with a futuristic air to it that embodies all manner of sci-fi tech tropes. The transparent display has become a kind of shorthand for future tech in stock art, and it's undeniably neat to see the thing in action. [...] The bottom of the device is covered in a large", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T16:12:30.163838+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://tech.slashdot.org/story/24/02/26/1532230/lenovos-laptop-concept-is-fully-transparent-but-the-point-isnt-entirely-clear?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Waymo's Self-Driving Cars Keep Hitting Things:  A Cyclist, a Gate, and a Pickup Truck", "description": "The Washington Post reports:\n\nGoogle's self-driving car company, Waymo, is hitting resistance in its quest to expand 24/7 robotaxi service to other parts of California, including a series of incidents that have fed public officials' safety concerns about the vehicles coming to their cities. Over eight days in February, for example, a Waymo vehicle smashed into a closing gate while exiting the University of Southern California's campus; the next day, another collided with a cyclist in San Francisco. Later that week, a mob of people vandalized and lit one of its cars on fire. Days later, the company announced a voluntary recall of its software for an incident involving a pickup truck in Phoenix. [Though it occurred three months ago, the Post reports that after the initial contact between the vehicles, \"A second Waymo vehicle made contact with the pickup truck a few minutes later.\"] \n\nThis string of events &mdash; none of which resulted in serious injuries &mdash; comes after Wa", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T04:54:25.849068+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://tech.slashdot.org/story/24/02/26/0111248/waymos-self-driving-cars-keep-hitting-things-a-cyclist-a-gate-and-a-pickup-truck?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "$500 Drone Calculates Its GPS Coordinates Offline from Downloaded Google Maps and a Camera", "description": "From a report:\n\nA team of drone enthusiasts have built a sub-$500 drone that uses a camera and Google Maps to provide itself with GPS co-ordinates, removing the need for a GPS satellite signal. And all of this was done in 24 hours during the El Segundo Defense Tech Hackathon. The drone the trio opted for is a custom designed and 3D printed fixed wing featuring a large single motor towards the rear and a downward facing camera used for geo-referencing... \n\n\nDoesn't Google Maps still require internet, you may ask? Google Maps allows users to download segments of maps ahead of time, usually for use when you are travelling or camping out in remote areas. In this instance, the team used this feature to their advantage, allowing the drone to continue operating...\n \n\nThanks to long-time Slashdot reader schwit1 for sharing the news.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=%24500+Drone+Calculates+Its+GPS+Coordinates+Offline+from+Downlo", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T02:44:21.112658+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://tech.slashdot.org/story/24/02/25/2110255/500-drone-calculates-its-gps-coordinates-offline-from-downloaded-google-maps-and-a-camera?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}, {"user": null, "permanent": false, "source_obj__id": 607, "page_rating_contents": 0, "title": "Are Corporate Interests Holding Back US Electrical Grid Expansion?", "description": "Long-time Slashdot reader BishopBerkeley writes: Though it does not come as much of a surprise, a new study highlighted in IEEE Spectrum delves into how corporate profit motives are preventing the upgrading and the expansion of the U.S. electrical grid. The full report can be downloaded here from the source [the nonprofit economic research group NBER]. \n\nBesides opening up the market to competition, utilities don't want to lose control over regional infrastructure, writes IEEE Spectrum. \"[I]nterregional lines threaten utility companies' dominance over the nation's power supply. In the power industry, asset ownership provides control over rules that govern energy markets and transmission service and expansion. When upstart entities build power plants and transmission lines, they may be able to dilute utility companies' control over power-industry rules and prevent utilities from dictating decisions about transmission expansion.\" \n\nThe article begins by noting that \"The United ", "thumbnail": null, "language": "en-us", "page_rating_votes": 0, "date_published": "2024-02-26T01:43:22.613070+00:00", "bookmarked": false, "tags": [], "dead": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "vote": 0, "age": null, "page_rating_visits": 0, "comments": [], "album": "", "page_rating": 0, "link": "https://hardware.slashdot.org/story/24/02/25/1956248/are-corporate-interests-holding-back-us-electrical-grid-expansion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "artist": "help@slashdot.org"}]