[{"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-21T17:16:49+00:00", "description": "\n<p>Mike Masnick, writing for MSNBC:</p>\n\n<blockquote>\n  <p>Turns out for the “Twitter Files” crew, “creeping\nauthoritarianism” isn’t so creepy when it’s your team doing the\ncreeping.</p>\n\n<p>Before, we were told that White House officials’ merely reaching\nout to social media companies about election misinformation was a\ndemocracy-ending threat. Now, the world’s richest man has openly\nused his platform to boost one candidate, ridden that campaign’s\nsuccess into the White House himself, and ... crickets. The\nsilence is deafening.</p>\n\n<p>There isn’t even a suggestion that Musk should have to divest from\nhis ownership of X. No one expects that. There is no discussion of\nhow Musk set up <a href=\"https://x.com/DOGE\">an entire account</a> on his own platform for\nhis own “Department of Government Efficiency” and gave it a “gray”\ncheck mark — denoting it as a verified government entity.</p>\n\n<p>The silence or cheers from “Twitter Files” writers and boosters\nover this merging of private and ", "id": 1560004, "language": null, "link": "https://www.msnbc.com/opinion/msnbc-opinion/trump-musk-partnership-x-twitter-files-rcna180427", "manual_status_code": 0, "page_rating": 29, "page_rating_contents": 90, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 489, "source_url": "https://daringfireball.com/feeds/main", "status_code": 0, "tags": [], "thumbnail": null, "title": "‘The Blurred Line Between X and the Trump Administration’", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-21T03:33:13+00:00", "description": "\n<p>Anil Dash, “<a href=\"https://www.anildash.com/2024/11/19/dont-call-it-a-substack/\">Don’t Call It a Substack</a>”:</p>\n\n<blockquote>\n  <p>We constrain our imaginations when we subordinate our creations to\nnames owned by fascist tycoons. Imagine the author of a book\ntelling people to “read my Amazon”. A great director trying to\npromote their film by saying “click on my Max”. That’s how much\nthey’ve pickled your brain when you refer to your own work and\nyour own voice within the context of their walled garden. There is\nno such thing as “my Substack”, there is only your writing, and a\nforever fight against the world of pure enshittification.</p>\n</blockquote>\n\n<p>I am upset by the above, but only insofar as I’m jealous that I had never thought to make the analogy to an author telling people to “read my Amazon”. A publication on Substack is no more “a Substack” than a blog on WordPress is “a WordPress”. It’s really quite a nifty — but devious — trick that Substack has pulled to make t", "id": 1555665, "language": null, "link": "https://daringfireball.net/2024/11/regarding_and_well_against_substack", "manual_status_code": 0, "page_rating": 29, "page_rating_contents": 90, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 489, "source_url": "https://daringfireball.com/feeds/main", "status_code": 0, "tags": [], "thumbnail": null, "title": "★ Regarding — and, Well, Against — Substack", "vote": 0}]