[{"manual_status_code": 0, "date_published": "2024-03-25T04:25:35+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://www.grimdarkmagazine.com/feed", "language": "en-AU", "page_rating": 94, "user": null, "source_obj__id": 137, "page_rating_votes": 0, "status_code": 0, "link": "https://www.grimdarkmagazine.com/review-all-who-wander-are-lost-by-gemma-amor", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "REVIEW: All Who Wander Are Lost by Gemma Amor", "age": null, "permanent": false, "description": "<p>Let Gemma Amor be your guide in All Who Wander Are Lost, a new anthology of destination horror stories that lead the reader across adventures on five different continents from northern Norway all the way to Antarctica. All Who Wander Are Lost kicks off with “There’s Something in First Landing State Park,” an ill-fated trip to Virginia Beach where the narrator, Melanie, spots a grotesque, slime-covered man emerging from the sand at sunrise, disappearing into the ocean as he oozes a trail of goop behind him. Amor combines science fiction and horror to astonishing effect, taking the story in bizarre directions on her way to a perfectly executed, jaw-dropping conclusion. The next story, “The Reunion,” is narrated by Tim, a formerly poor boy who was bullied in school and is now returning to his high school reunion as the successful vice president of a pharmaceutical company accompanied by his beautiful wife. But Tim’s plans of proving his worth to his classmates are disrupted b", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-25T02:59:28+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://www.grimdarkmagazine.com/feed", "language": "en-AU", "page_rating": 94, "user": null, "source_obj__id": 137, "page_rating_votes": 0, "status_code": 0, "link": "https://www.grimdarkmagazine.com/grimdark-magazine-issue-38-to-bring-the-best-of-south-east-asia-to-sff", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Grimdark Magazine Issue 38 to feature the best of South East Asia SFF", "age": null, "permanent": false, "description": "<p>Last Updated on March 25, 2024 We have two announcements for the upcoming release of Grimdark Magazine Issue 38. As somebody who lives in the Asia Pacific, the first announcement I think is one of the ones I&#8217;m the most excited about in my almost ten years of running this little publication. The second one is one of those announcements I dislike making. Let&#8217;s get to it. GdM#38 to focus on SEA authors Nearly nine percent of the world&#8217;s population live in South East Asia. A lot of history, mythology, stories, and world views sit in those nations and their peoples, and we feel that often the English speaking markets miss out on those stories for a range of reasons. Books like Sons of Darkness by Gaurav Mohanty have joined the list of authors giving us a lens into non-Euro grimdark fantasy, and I think the opportunity to really push the boundaries of our little corner of the subgenre world lies in giving authors from SEA a spot to play about with their charact", "vote": 0, "artist": null}]