[{"manual_status_code": 0, "date_published": "2024-03-25T16:00:33+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null, "page_rating": 94, "user": null, "source_obj__id": 129, "page_rating_votes": 0, "status_code": 0, "link": "https://www.youtube.com/watch?v=c9Bv2nJU0Dk", "thumbnail": "https://i4.ytimg.com/vi/c9Bv2nJU0Dk/hqdefault.jpg", "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Horizon Forbidden West PC vs PS5 Comparison - A STUNNING Graphical Showcase", "age": null, "permanent": false, "description": "PlayStation has been doing some amazing work with its recent PC ports of PlayStation first-party releases, and its latest project Horizon Forbidden West is no different in this regard. \n\nPlayers on PC can finally experience Aloy’s journey through the Forbidden West in great detail, and the transition from PS5 to PC is pretty smooth, to say the least. \n\nWith this technical analysis of Horizon Forbidden West on PC, we take a look at what’s running under the hood ranging from graphical options to how the port takes advantage of PC features like Windows DirectStorage and much more. \n\nWe also talk about performance alongside a head-to-head comparison between our maxed-out PC version and PS5’s Favour Resolution mode.", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-25T14:00:41+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null, "page_rating": 94, "user": null, "source_obj__id": 129, "page_rating_votes": 0, "status_code": 0, "link": "https://www.youtube.com/watch?v=w6r_G3WLF80", "thumbnail": "https://i4.ytimg.com/vi/w6r_G3WLF80/hqdefault.jpg", "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "5 Ways Ghost of Tsushima ABSOLUTELY CLOWNS Rise of the Ronin", "age": null, "permanent": false, "description": "Rise of the Ronin has a lot in common with a number of other games, from Team Ninja’s own past titles to open world experiences that it attempts to emulate in a number of ways. But the game that it probably has more in common with than most others is Ghost of Tsushima. \n\nPromising a historical Japanese setting where melee combat and stealth are front and center across a massive open world, Team Ninja’s newest game attempts to emulate Ghost of Tsushima in a number of ways- but it comes out on top in very few (if any) of those comparisons. From its world design to its storytelling style to its side activities, Rise of the Ronin fails to match the heights of Sucker Punch’s samurai epic in a number of areas. Here, we go over a few of them.", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-25T10:15:04+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null, "page_rating": 94, "user": null, "source_obj__id": 129, "page_rating_votes": 0, "status_code": 0, "link": "https://www.youtube.com/watch?v=w_15ixS5EIs", "thumbnail": "https://i4.ytimg.com/vi/w_15ixS5EIs/hqdefault.jpg", "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Princess Peach Showtime! Review - SURPRISINGLY GOOD", "age": null, "permanent": false, "description": "Is Princess Peach Showtime! Worth it? I would say it is if you have players you want getting into games, especially if they are coming off of the Mario movie, and want to play as Peach on her many adventures. It’s also a great game to just chill with - it’s inventive enough to make sure you’re not totally tuning out, but easy enough that you can afford to let your guard down. \n\nBut ultimately this is a game for newer players, and it’s a well designed version of that. They will have a great time with it, and you can still enjoy it if you don’t fall into those categories - but just keep your expectations in check.", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-25T10:15:02+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null, "page_rating": 94, "user": null, "source_obj__id": 129, "page_rating_votes": 0, "status_code": 0, "link": "https://www.youtube.com/watch?v=f1kic0JVgy0", "thumbnail": "https://i3.ytimg.com/vi/f1kic0JVgy0/hqdefault.jpg", "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Horizon Forbidden West PC Review - A NEW BENCHMARK For PC Ports", "age": null, "permanent": false, "description": "When it first came out on the PS5, Horizon Forbidden West was praised for being an excellent follow-up to Horizon Zero Dawn, already an incredibly fun open world adventure game. Burning Shores on the PS5 continued this trend, while making further use of more modern hardware with gorgeous vistas and engaging gameplay. The PC release, however, has set a new benchmark for just how well a port can be developed.\n\nThe PC version of Horizon Forbidden West includes just about every feature you can imagine, including more niche ones like support for ultrawide monitors. For the larger majority of PC gamers, however, the game also features incredible optimization across a wide range of hardware. This means that, as long as your PC has parts made in the last few years, it’ll probably run Horizon Forbidden West incredibly well.", "vote": 0, "artist": null}]