[{"vote": 0, "source_obj__id": 208, "bookmarked": false, "thumbnail": "https://i4.ytimg.com/vi/sE5vdxytqZ4/hqdefault.jpg", "dead": false, "comments": [], "artist": "GamingBolt", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "WRATH: Aeon of Ruin Review - A Surprisingly Fun Shooter", "permanent": false, "age": null, "page_rating": 0, "description": "Having spent quite a bit of time as an early access title, Wrath: Aeon of Ruin is finally out, and the pedigree of its level designers is at full display. Harkening back to dark fantasy shooters like Quake, Wrath: Aeon of Ruin throws players in a dying fantasy world filled with all sorts of grotesque monstrosities that must be taken down.\n\nWhile there isn’t really much of an interesting story in Wrath: Aeon of Ruin, its emphasis on non-stop combat, the verticality of its level design, and its emphasis on exploration make it feel like one of the purest boomer shooters that still manages to maintain its own identity. The only real downside with the game is that its weapons don’t really do anything unique; instead, they’re basically just the same pistol/shotgun/railgun combination we’ve seen countless times before.", "date_published": "2024-02-28T18:00:34+00:00", "page_rating_contents": 0, "link": "https://www.youtube.com/watch?v=sE5vdxytqZ4", "album": "", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null}, {"vote": 0, "source_obj__id": 208, "bookmarked": false, "thumbnail": "https://i3.ytimg.com/vi/r5P_7miQ38M/hqdefault.jpg", "dead": false, "comments": [], "artist": "GamingBolt", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "What Is GOING ON In Pokemon Legends: Z-A?", "permanent": false, "age": null, "page_rating": 0, "description": "Pokemon Legends: Arceus was the best game we’ve seen from the Pokemon franchise in well over a decade, so naturally, there’s every reason to be keenly anticipating a direct follow-up. The recent announcement of Pokemon Legends: Z-A has stirred up plenty of excitement in the series’ fanbase, and even though the trailer itself was brief and didn’t show any gameplay whatsoever, it’s easy to understand why. \n\nNot only can a sequel build on the first Pokemon Legends game’s excellent foundations in key ways, based on its trailer, it’s also looking like it’s going to bring in plenty of its own intriguing ideas (like being set entirely within one city), while the prospect of a game that finally dives deeper into the Kalos region’s fascinating lore is also an intriguing one. Here, we talk about all of that and more.", "date_published": "2024-02-28T15:00:46+00:00", "page_rating_contents": 0, "link": "https://www.youtube.com/watch?v=r5P_7miQ38M", "album": "", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null}, {"vote": 0, "source_obj__id": 208, "bookmarked": false, "thumbnail": "https://i2.ytimg.com/vi/1VQQARzgkGk/hqdefault.jpg", "dead": false, "comments": [], "artist": "GamingBolt", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "WWE 2K24 - 15 NEW Things You Need To Know Before You Buy", "permanent": false, "age": null, "page_rating": 0, "description": "WWE 2K24 is the latest iteration in Visual Concepts' long-running wrestling series, launching on March 8th for Xbox Series X/S, PS4, Xbox One, PS5 and PC. It features over 200 Superstars at launch, a new 2K Showcase encompassing 40 years of Wrestlemania, and several new match types, including Ambulance, Coffin, Special Referee and Gauntlet matches.\n\nBackstage Brawls also now feature new weapon types, throwing weapons and more. This is on top of several improvements to the gameplay, two new MyRISE campaigns, and new features like Create-A-Referee and Create-A Sign. Fans of Universe Mode, MyGM and MyFACTION will find plenty of new additions to look forward to.\n\nHere's what you should know about WWE 2K24 before it's out, including Superstars and new features arriving with the Season Pass.", "date_published": "2024-02-28T12:00:03+00:00", "page_rating_contents": 0, "link": "https://www.youtube.com/watch?v=1VQQARzgkGk", "album": "", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null}]