[{"vote": 0, "source_obj__id": 578, "bookmarked": false, "thumbnail": "https://i2.ytimg.com/vi/530P9WJ13fo/hqdefault.jpg", "dead": false, "comments": [], "artist": "VR Gorilla - Virtual Reality & 360 Videos", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Travel the world in VR with TriptoVR with your mobile VR viewer! (iPhone and Android)", "permanent": false, "age": null, "page_rating": 0, "description": "Get the TriptoVR app in the Playstore or Appstore under these links!\n\nAppstore: https://apps.apple.com/app/triptovr/id6451488055\nPlaystore: https://play.google.com/store/apps/details?id=com.HetAmsterdamsFilmbedrijf.Triptovr&amp;pcampaignid=web_share\n\nEmbark on an incredible lifelike virtual adventure with TriptoVR, your gateway to the world's most enchanting destinations. Experience the vibrancy of cities and landscapes, brought to life with stunning realism, from the bustling streets of Tokyo to the tranquil beaches of Cape Town.  All from the comfort of your home.\n\nBoat on the serene canals of Venice in a gondola, marvel at the grandeur of the Eiffel Tower, witness the architectural splendor of the Sydney Opera House, and immerse yourself in the culture, history, and nature of Istanbul, Bali, Prague, Lima, and many more. Our app brings you closer than ever to these breathtaking sites, letting you explore them in vivid detail.\n\nDesigned with a user-friendly interface, Tripto", "date_published": "2024-02-28T23:00:06+00:00", "page_rating_contents": 0, "link": "https://www.youtube.com/watch?v=530P9WJ13fo", "album": "", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC6AXBF-78lNa3_TjAIWZWmQ", "language": null}, {"vote": 0, "source_obj__id": 578, "bookmarked": false, "thumbnail": "https://i2.ytimg.com/vi/IszvZ8DAx8A/hqdefault.jpg", "dead": false, "comments": [], "artist": "VR Gorilla - Virtual Reality & 360 Videos", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Yoga VR - Balancing Poses with Anna - 8K 360 3D Video", "permanent": false, "age": null, "page_rating": 0, "description": "In this series, we explore the possibilities and benefits of participating in a yoga session through the power of virtual reality. Yogini Anna welcomes you to the amazing yoga studio of YogaToday in Weesp (near Amsterdam). The studio is built inside an old church, making for a truly unique and relaxing ambiance.\n\nBalancing poses in yoga are designed to improve focus, stability, and coordination. These poses challenge your balance, engage your core, and require concentration and breath control, contributing to both physical and mental strength. \n\nMore episodes coming soon! Obviously best experienced with a VR headset!\n\nThis episode is brought to you in stereoscopic 3D and at a maximum 8K resolution. \n\nIf you are interested in licensing this or other 360° VR videos we have made or wish to create new content, please contact us or visit https://www.vr-gorilla.com/licensing/ \n\nVR Gorilla is an Amsterdam-based virtual reality production studio. We aim to create the most immersive, ", "date_published": "2024-02-28T12:44:18+00:00", "page_rating_contents": 0, "link": "https://www.youtube.com/watch?v=IszvZ8DAx8A", "album": "", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC6AXBF-78lNa3_TjAIWZWmQ", "language": null}]