[{"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Reddit Discloses Bitcoin and Ether Investments In IPO Filing", "permanent": false, "age": null, "page_rating": 0, "description": "As part of its IPO filing with the SEC, Reddit disclosed that it has invested some of its excess cash in bitcoin, ether and Polygon. From a report: Based on the document, the firm now holds BTC and ETH in its balance sheet. Notably, Reddit filing came as part of the IPO registration statement with the SEC. Apart from ETH and BTC, the filing revealed Reddit's investment in Polygon (MATIC). According to the document, the social media platform plans to use both Ether and Polygon as a form of payment for digital goods. Further, Reddit noted that the amount of Polygon and Ethereum from virtual goods is currently immaterial. However, it indicated the possibility of a continuous addition of Bitcoin and Ethereum to its treasury. Also, it plans to keep trying out its passion for virtual goods. Moreover, the document revealed that Reddit made the investments using some of its excess cash reserves. However, the firm didn't disclose details of the crypto investments it made.\n \nReddit's f", "date_published": "2024-02-28T23:57:30.618835+00:00", "page_rating_contents": 0, "link": "https://slashdot.org/story/24/02/28/2143227/reddit-discloses-bitcoin-and-ether-investments-in-ipo-filing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "White House Urges Devs To Switch To Memory-Safe Programming Languages", "permanent": false, "age": null, "page_rating": 0, "description": "Tontoman shares a report: The White House Office of the National Cyber Director (ONCD) urged tech companies to switch to memory-safe programming languages, such as Rust, to improve software security by reducing the number of memory safety vulnerabilities. Such vulnerabilities are coding errors or weaknesses within software that can lead to memory management issues when memory can be accessed, written, allocated, or deallocated. They occur when software accesses memory in unintended or unsafe ways, resulting in various security risks and issues like buffer overflow, use after free, use of uninitialized memory, and double free that attackers can exploit. \n\nSuccessful exploitation carries severe risks, potentially enabling threat actors to gain unauthorized access to data or execute malicious code with the privileges of the system owner. \"For over 35 years, this same class of vulnerability has vexed the digital ecosystem. The challenge of eliminating entire classes of software v", "date_published": "2024-02-28T22:56:12.234079+00:00", "page_rating_contents": 0, "link": "https://developers.slashdot.org/story/24/02/28/1529238/white-house-urges-devs-to-switch-to-memory-safe-programming-languages?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "The Strange and Turbulent Global World of Ant Geopolitics", "permanent": false, "age": null, "page_rating": 0, "description": "Over the past four centuries quadrillions of ants have created a strange and turbulent global society that shadows our own. An excerpt from an Aeon article: In their native ranges, these multi-nest colonies can grow to a few hundred metres across, limited by physical barriers or other ant colonies. This turns the landscape to a patchwork of separate groups, with each chemically distinct society fighting or avoiding others at their borders. Species and colonies coexist, without any prevailing over the others. However, for the 'anonymous societies' of unicolonial ants, as they're known, transporting a small number of queens and workers to a new place can cause the relatively stable arrangement of groups to break down. As new nests are created, colonies bud and spread without ever drawing boundaries because workers treat all others of their own kind as allies. What was once a patchwork of complex relationships becomes a simplified, and unified, social system. The relative geneti", "date_published": "2024-02-28T22:56:10.738879+00:00", "page_rating_contents": 0, "link": "https://science.slashdot.org/story/24/02/28/1619234/the-strange-and-turbulent-global-world-of-ant-geopolitics?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Klarna Claims AI Is Doing Agents' Jobs", "permanent": false, "age": null, "page_rating": 0, "description": "Buy-now-pay-later lender Klarna said its AI assistant, powered by OpenAI, is doing the equivalent work of 700 full-time agents and has had 2.3 million conversations, equal to two-thirds of the company's customer service chats, within the first month of being deployed. The AI tool resolved errands much faster and matched human levels on customer satisfaction, Klarna said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Klarna+Claims+AI+Is+Doing+Agents'+Jobs%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F02%2F28%2F1624235%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F02%2F28%2F1624235%2Fklarna-claims-ai-is-doing-agents-jobs%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://sl", "date_published": "2024-02-28T22:56:09.220320+00:00", "page_rating_contents": 0, "link": "https://slashdot.org/story/24/02/28/1624235/klarna-claims-ai-is-doing-agents-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "White House Looks To Curb Foreign Powers' Ability To Buy Americans' Sensitive Personal Data With Executive Order", "permanent": false, "age": null, "page_rating": 0, "description": "President Joe Biden will issue an executive order on Wednesday aimed at curbing foreign governments' ability to buy Americans' sensitive personal information such as heath and geolocation data, according to senior US officials. From a report: The move marks a rare policy effort to address a longstanding US national security concern: the ease with which anyone, including a foreign intelligence services, can legally buy Americans' data and then use the information for espionage, hacking and blackmail. The issue, a senior Justice Department official told reporters this week, is a \"growing threat to our national security.\" \n\nThe executive order will give the Justice Department the authority to regulate commercial transactions that \"pose an unacceptable risk\" to national security by, for example, giving a foreign power large-scale access to Americans' personal data, the Justice Department official said. The department will also issue regulations that require better protection of s", "date_published": "2024-02-28T22:56:07.273918+00:00", "page_rating_contents": 0, "link": "https://yro.slashdot.org/story/24/02/28/1639246/white-house-looks-to-curb-foreign-powers-ability-to-buy-americans-sensitive-personal-data-with-executive-order?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "AI, Drones, Security Cameras: San Francisco Mayor's Arsenal To Fight Crime", "permanent": false, "age": null, "page_rating": 0, "description": "San Francisco will vote next week on a divisive ballot measure that would authorize police to use surveillance cameras, drones and AI-powered facial recognition as the city struggles to restore a reputation tarnished by street crime and drugs. From a report: The Safer San Francisco initiative, formally called Proposition E, is championed by Mayor London Breed who believes disgruntled citizens will approve the proposal on Tuesday. Although technology fueled the Silicon Valley-adjacent city's decades-long boom, residents have a history of being deeply suspicious. In 2019, San Francisco, known for its progressive politics, became the first large U.S. city to ban government use of facial recognition due to concerns about privacy and misuse. \n\nBreed, who is running for re-election in November, played down the potential for abuse under the ballot measure, saying safeguards are in place. \"I get that people are concerned about privacy rights and other things, but technology is all ar", "date_published": "2024-02-28T22:56:05.732059+00:00", "page_rating_contents": 0, "link": "https://news.slashdot.org/story/24/02/28/2011211/ai-drones-security-cameras-san-francisco-mayors-arsenal-to-fight-crime?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "EU Lawmakers Back Draft Rules on Patents for Connected Cars, Telecom Equipment", "permanent": false, "age": null, "page_rating": 0, "description": "EU lawmakers on Wednesday approved draft rules governing patents key to technologies for telecom equipment and connected cars in the face of criticism from Nokia, Ericsson and other patent holders. From a report: The draft rules proposed by the European Commission in April last year seek to end costly and lengthy litigation over patents used in technologies for telecom equipment, mobile phones, computers, connected cars and smart devices. The European Parliament will now have to thrash out the details of the proposed rules with EU countries before it can become law. Nokia, Ericsson and Siemens in a letter to EU lawmakers in January, highlighted concerns from the European Patent Office, standard-setting body ETSI and other bodies on the draft rules. Lobbying group IP Europe, which counts Nokia, Ericsson and Qualcomm as its members, reiterated its opposition to the draft rules. \"The beneficiaries would not be SMEs as claimed but big tech,\" IP Europe's managing director Patrick ", "date_published": "2024-02-28T22:56:04.199198+00:00", "page_rating_contents": 0, "link": "https://yro.slashdot.org/story/24/02/28/2023242/eu-lawmakers-back-draft-rules-on-patents-for-connected-cars-telecom-equipment?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Intel Puts 1nm Process (10A) on the Roadmap For 2027", "permanent": false, "age": null, "page_rating": 0, "description": "Intel's previously-unannounced Intel 10A (analogous to 1nm) will enter production/development in late 2027, marking the arrival of the company's first 1nm node, and its 14A (1.4nm) node will enter production in 2026. The company is also working to create fully autonomous AI-powered fabs in the future. Tom's Hardware: Intel's Keyvan Esfarjani, the company's EVP and GM and Foundry Manufacturing and Supply, held a very insightful session that covered the company's latest developments and showed how the roadmap unfolds over the coming years. Here, we can see two charts, with the first outlining the company's K-WSPW (thousands of wafer starts per week) capacity for Intel's various process nodes. Notably, capacity typically indicates how many wafers can be started, but not the total output -- output varies based on yields. You'll notice there isn't a label for the Y-axis, which would give us a direct read on Intel's production volumes. However, this does give us a solid idea of the", "date_published": "2024-02-28T22:56:02.682769+00:00", "page_rating_contents": 0, "link": "https://hardware.slashdot.org/story/24/02/28/2030237/intel-puts-1nm-process-10a-on-the-roadmap-for-2027?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "SBF Asks For 5-Year Prison Sentence, Calls 100-Year Recommendation 'Grotesque'", "permanent": false, "age": null, "page_rating": 0, "description": "An anonymous reader quotes a report from Ars Technica: Convicted FTX fraudster Sam Bankman-Fried pleaded for a lenient prison sentence in a court filing yesterday, saying that he isn't motivated by greed and \"is already being punished.\" Bankman-Fried requested a sentence of 63 to 78 months, or 5.25 to 6.5 years. Because of \"Sam's charitable works and demonstrated commitment to others, a sentence that returns Sam promptly to a productive role in society would be sufficient, but not greater than necessary, to comply with the purposes of sentencing,\" the court filing (PDF) said. Bankman-Fried's filing also said that he maintains his innocence and intends to appeal his convictions.\n \nA presentence investigation report (PSR) prepared by a probation officer recommended that Bankman-Fried be sentenced to 100 years in prison, according to the filing. \"That recommendation is grotesque,\" SBF's filing said, arguing that it is based on an erroneously calculated loss of $10 billion. The $", "date_published": "2024-02-28T22:56:01.165310+00:00", "page_rating_contents": 0, "link": "https://yro.slashdot.org/story/24/02/28/2129221/sbf-asks-for-5-year-prison-sentence-calls-100-year-recommendation-grotesque?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "KDE Plasma 6 Released", "permanent": false, "age": null, "page_rating": 0, "description": "\"Today, the KDE Community is announcing a new major release of Plasma 6.0 and Gear 24.02,\" writes longtime Slashdot reader jrepin. \"The new version brings new windows and desktop overview effects, improved color management, a cleaner theme, better overall performance, and much more.\" From the announcement: KDE Plasma is a modern, feature-rich desktop environment for Linux-based operating systems. Known for its sleek design, customizable interface, and extensive set of applications, it is also open source, devoid of ads, and makes protecting your privacy and personal data a priority.\n \nWith Plasma 6, the technology stack has undergone two major upgrades: a transition to the latest version of the application framework, Qt 6, and a migration to the modern Linux graphics platform, Wayland. We will continue providing support for the legacy X11 session for users who prefer to stick with it for now. [...] KDE Gear 24.02 brings many applications to Qt 6. In addition to the changes in", "date_published": "2024-02-28T22:55:59.676818+00:00", "page_rating_contents": 0, "link": "https://tech.slashdot.org/story/24/02/28/2137237/kde-plasma-6-released?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Google CEO Calls AI Tool's Controversial Responses 'Completely Unacceptable'", "permanent": false, "age": null, "page_rating": 0, "description": "Google CEO Sundar Pichai addressed the company's Gemini controversy Tuesday evening, calling the AI app's problematic responses around race unacceptable and vowing to make structural changes to fix the problem. The memo: I want to address the recent issues with problematic text and image responses in the Gemini app (formerly Bard). I know that some of its responses have offended our users and shown bias -- to be clear, that's completely unacceptable and we got it wrong. \n\nOur teams have been working around the clock to address these issues. We're already seeing a substantial improvement on a wide range of prompts. No AI is perfect, especially at this emerging stage of the industry's development, but we know the bar is high for us and we will keep at it for however long it takes. And we'll review what happened and make sure we fix it at scale. \n\nOur mission to organize the world's information and make it universally accessible and useful is sacrosanct. We've always sought to g", "date_published": "2024-02-28T15:46:15.857329+00:00", "page_rating_contents": 0, "link": "https://tech.slashdot.org/story/24/02/28/0633233/google-ceo-calls-ai-tools-controversial-responses-completely-unacceptable?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Meta Wants Llama 3 To Handle Contentious Questions as Google Grapples With Gemini Backlash", "permanent": false, "age": null, "page_rating": 0, "description": "An anonymous reader shares a report (paywalled): As Google grapples with the backlash over the historically inaccurate responses on its Gemini chatbot, Meta Platforms is dealing with a related issue. As part of its work on the forthcoming version of its large language model, Llama 3, Meta is trying to overcome a problem perceived in Llama 2: Its answers to anything at all contentious aren't helpful. Safeguards added to Llama 2, which Meta released last July and which powers the artificial intelligence assistant in its apps, prevent the LLM from answering a broad range of questions deemed controversial. These guardrails have made Llama 2 appear too \"safe\" in the eyes of Meta's senior leadership, as well as among some researchers who worked on the model itself, according to people who work at Meta. \n\n[...] Meta's conservative approach with Llama 2 was designed to ward off any public relations disasters, said the people who work at Meta. But researchers are now trying to loosen ", "date_published": "2024-02-28T15:46:14.362071+00:00", "page_rating_contents": 0, "link": "https://tech.slashdot.org/story/24/02/28/150246/meta-wants-llama-3-to-handle-contentious-questions-as-google-grapples-with-gemini-backlash?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Zurich Paid 30,000 Workers Double In $200 Million Bank Glitch", "permanent": false, "age": null, "page_rating": 0, "description": "An anonymous reader quotes a report from Fortune: Zurich authorities have apologized to city employees after a technical glitch caused a double payment of monthly salaries that local officials are now trying to claw back. About 175 million francs ($200 million) was sent in error on Monday, which was the payday for February, according to a statement. Workers can't keep the money, and officials are trying to devise a streamlined process so that the 30,000 employees affected can easily return it.\n \nA technical error at state-owned Zuercher Kantonalbank, which handles the city's salary transfers, is to blame. The bank itself said that faulty software from one of Swisscom AG's contractors caused the glitch. \"Swisscom is aware of the seriousness of this incident and apologizes for the inconvenience caused,\" the telecommunications company said in a statement shared by the bank. The unexpected windfall prompted a flurry of employees calling up the city's offices to ask about the extr", "date_published": "2024-02-28T13:38:48.746400+00:00", "page_rating_contents": 0, "link": "https://news.slashdot.org/story/24/02/28/0541207/zurich-paid-30000-workers-double-in-200-million-bank-glitch?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Antarctica's 'Doomsday Glacier' Began Melting In Mid-20th Century, Study Finds", "permanent": false, "age": null, "page_rating": 0, "description": "According to a new study published in the journal Proceedings of the National Academy of Sciences, West Antarctica's Thwaites Glacier began rapidly receding in the 1940s -- much earlier than scientists had previous thought. The Hill notes that it's often referred to as the \"doomsday glacier\" due to the potentially catastrophic consequences of its hypothetical collapse. From the report: While scientists had already observed the glacier's accelerated retreat by the 1970s, they did not know when it began. Coupled with earlier research about Thwaites's neighboring Pine Island Glacier, the study also provides new, potentially alarming, insight into the cause of the glacier's melting. Scientists tried to reconstruct the glacier's history using analysis of the marine sedimentary record, and they found the Thwaites and Pine Island glaciers both lost contact with the seafloor highs in the 1940s -- at around the same time. These significant changes happened against the backdrop of a ma", "date_published": "2024-02-28T09:53:04.658160+00:00", "page_rating_contents": 0, "link": "https://news.slashdot.org/story/24/02/28/0527235/antarcticas-doomsday-glacier-began-melting-in-mid-20th-century-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Amazon Aggregator Thrasio Files For Bankruptcy", "permanent": false, "age": null, "page_rating": 0, "description": "Amazon aggregator Thrasio filed for Chapter 11 bankruptcy protection and received commitments for $90 million in new financing from existing shareholders, it said on Wednesday. From a report: Thrasio also entered into a restructuring agreement with some of its lenders to reduce debt of $495 million from its existing debt pile, it said in a statement. It listed its estimated assets in the range of $1 billion to $10 billion and estimated liabilities of $500 million to $1 billion, according to a document filed with the New Jersey bankruptcy court. The startup raised more than $3 billion.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Aggregator+Thrasio+Files+For+Bankruptcy%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F02%2F28%2F0840203%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot", "date_published": "2024-02-28T08:47:42.116273+00:00", "page_rating_contents": 0, "link": "https://slashdot.org/story/24/02/28/0840203/amazon-aggregator-thrasio-files-for-bankruptcy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Nintendo Suing Makers of Open-Source Switch Emulator Yuzu", "permanent": false, "age": null, "page_rating": 0, "description": "Nintendo has filed a 41-page lawsuit against the makers of Yuzu, an open-source Nintendo Switch emulator, accusing them of \"facilitating piracy at a colossal scale.\" Polygon reports: Yuzu is a free emulator that was released in 2018 months after the Nintendo Switch originally launched. The same folks who made Citra, a Nintendo 3DS emulator, made this one. Basically, it's a piece of software that lets people play Nintendo Switch games on Windows PC, Linux, and Android devices. (It also runs on Steam Deck, which Valve showed -- then wiped -- in a Steam Deck video clip.) Emulators aren't necessarily illegal, but pirating games to play on them is. But Nintendo said in its lawsuit that there's no way to legal way to use Yuzu.\n \nNintendo argued that Yuzu executes codes that \"defeat\" Nintendo's security measures, including decryption using \"an illegally-obtained copy of prod.keys.\" \"In other words, without Yuzu's decryption of Nintendo's encryption, unauthorized copies of games coul", "date_published": "2024-02-28T06:34:49.036360+00:00", "page_rating_contents": 0, "link": "https://games.slashdot.org/story/24/02/28/0517251/nintendo-suing-makers-of-open-source-switch-emulator-yuzu?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Microplastics Found In Every Human Placenta Tested In Study", "permanent": false, "age": null, "page_rating": 0, "description": "An anonymous reader quotes a report from The Guardian: Microplastics have been found in every human placenta tested in a study, leaving the researchers worried about the potential health impacts on developing fetuses. The scientists analyzed 62 placental tissue samples and found the most common plastic detected was polyethylene, which is used to make plastic bags and bottles. A second study revealed microplastics in all 17 human arteries tested and suggested the particles may be linked to clogging of the blood vessels. [...] Prof Matthew Campen, at the University of New Mexico, US, who led the research, said: \"If we are seeing effects on placentas, then all mammalian life on this planet could be impacted. That's not good.\" He said the growing concentration of microplastics in human tissue could explain puzzling increases in some health problems, including inflammatory bowel disease (IBD), colon cancer in people under 50, and declining sperm counts. A 2021 study found people w", "date_published": "2024-02-28T04:25:31.449840+00:00", "page_rating_contents": 0, "link": "https://science.slashdot.org/story/24/02/28/0029233/microplastics-found-in-every-human-placenta-tested-in-study?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Hackers Backed By Russia and China Are Infecting SOHO Routers Like Yours, FBI Warns", "permanent": false, "age": null, "page_rating": 0, "description": "An anonymous reader quotes a report from Ars Technica: The FBI and partners from 10 other countries are urging owners of Ubiquiti EdgeRouters to check their gear for signs they've been hacked and are being used to conceal ongoing malicious operations by Russian state hackers. The Ubiquiti EdgeRouters make an ideal hideout for hackers. The inexpensive gear, used in homes and small offices, runs a version of Linux that can host malware that surreptitiously runs behind the scenes. The hackers then use the routers to conduct their malicious activities. Rather than using infrastructure and IP addresses that are known to be hostile, the connections come from benign-appearing devices hosted by addresses with trustworthy reputations, allowing them to receive a green light from security defenses.\n \n\"In summary, with root access to compromised Ubiquiti EdgeRouters, APT28 actors have unfettered access to Linux-based operating systems to install tooling and to obfuscate their identity wh", "date_published": "2024-02-28T02:10:19.347025+00:00", "page_rating_contents": 0, "link": "https://it.slashdot.org/story/24/02/27/2147247/hackers-backed-by-russia-and-china-are-infecting-soho-routers-like-yours-fbi-warns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "Uber-Like Surge Pricing Is Coming For Fast Food", "permanent": false, "age": null, "page_rating": 0, "description": "Fast food chain Wendy's announced it's adopting a similar approach to Uber's Surge Pricing policy by dynamically adjusting the prices of its menu items during peak demand periods at certain locations. The controversial strategy seeks to leverage real-time data to align pricing and demand, enhancing efficiency and potentially improving customer satisfaction. From a report: During a conference call earlier this month, Wendy's CEO Kirk Tanner said the fast-food chain would experiment with dynamic pricing as early as next year. \"Beginning as early as 2025, we will begin testing more enhanced features like dynamic pricing and daypart offerings, along with AI-enabled menu changes and suggestive selling,\" he said. \"As we continue to show the benefit of this technology in our company-operated restaurants, franchisee interest in digital menu boards should increase, further supporting sales and profit growth across the system.\"\n \nPrices seesaw all the time on the sites of online retail", "date_published": "2024-02-28T02:10:17.757204+00:00", "page_rating_contents": 0, "link": "https://news.slashdot.org/story/24/02/28/004224/uber-like-surge-pricing-is-coming-for-fast-food?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "'Open Documentation Academy' Offers On-Ramp To OSS", "permanent": false, "age": null, "page_rating": 0, "description": "\"Documentation authors at Canonical have launched the Open Documentation Academy to offer an easy way to get started contributing to open-source projects,\" writes longtime Slashdot reader tykev. From the blog post: Open and inclusive collaboration, and the sharing of ideas, remains the best way to develop software (and to do many other things!), but we also recognise that this \"getting involved\" step can be difficult. Where do you start? Who do you ask? What needs to be done? We all very much want to help people become open source contributors by building an on-ramp process. It may take some time, and we will need to adapt, but this is exactly why we've started our Open Documentation Academy.\n \nTo help you get involved, the Open Documentation Academy provides a curated list of documentation tasks. Choose one, let us know, and get started. Tasks include testing and fixing tutorials, updating the outdated, restructuring large documents, and anything else you may want to suggest", "date_published": "2024-02-28T02:10:15.868562+00:00", "page_rating_contents": 0, "link": "https://news.slashdot.org/story/24/02/28/0024205/open-documentation-academy-offers-on-ramp-to-oss?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}, {"vote": 0, "source_obj__id": 607, "bookmarked": false, "thumbnail": null, "dead": false, "comments": [], "artist": "help@slashdot.org", "page_rating_visits": 0, "page_rating_votes": 0, "tags": [], "user": null, "title": "US Judge Halts Government Effort To Monitor Crypto Mining Energy Use", "permanent": false, "age": null, "page_rating": 0, "description": "A federal judge in Texas has granted a temporary order blocking the U.S. government from monitoring the energy usage of cryptocurrency mining operations, stating that the industry had shown it would suffer \"irreparable injury\" if it was made to comply. The Guardian reports: The US Department of Energy had launched an \"eemergency\" initiative last month aimed at surveying the energy use of mining operations, which typically use vast amounts of computing power to solve various mathematical puzzles to add new tokens to an online network known as a blockchain, allowing the mining of currency such as bitcoin. The growth of cryptocurrency, and the associated mining of it, has been blamed for a surge in electricity use as data centers have sprung up across the US, even reviving, in some cases, ailing coal plants to help power the mining. [...]\n \n\"The massive energy consumption of cryptocurrency mining and its rapid growth in the United States threaten to undermine progress towards ac", "date_published": "2024-02-28T02:10:14.357909+00:00", "page_rating_contents": 0, "link": "https://hardware.slashdot.org/story/24/02/28/0012200/us-judge-halts-government-effort-to-monitor-crypto-mining-energy-use?utm_source=rss1.0mainlinkanon&utm_medium=feed", "album": "", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us"}]