[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T23:47:42.948506+00:00", "description": "Roblox announced it'll be rolling out virtual billboards with video advertisements that will be displayed in its virtual worlds. Reuters reports: Users will now see billboards featuring content from brands such as e.l.f beauty, Walmart and Warner Bros Discovery, just as they would in real life. That would give advertisers access to Roblox's nearly 72 million daily active users -- half of whom are Gen-Z customers, a population group prized by marketers and businesses.\n \nThe company in November began testing the video ads -- that will be served to users who are 13 years and older -- as part of its efforts to reduce reliance on revenue generated from its in-game currency \"Robux\", which players can use to buy outfits, vehicles and other features inside the company's digital worlds. It charges a fee on all purchases done on its platform, which hosts millions of videogames that are built by its users -- who get a share of any related revenue.\n \nThat practice will extend to the ads, with cre", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/01/2123226/roblox-players-to-start-seeing-video-ads-in-its-virtual-realms?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Roblox Players To Start Seeing Video Ads In Its Virtual Realms", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T23:47:40.445458+00:00", "description": "Anthropic has released its Claude AI chatbot on the App Store, bringing the company's ChatGPT competitor to the masses. Compared to OpenAI's chatbot, Claude is built with a focus on reducing harmful outputs and promoting safety, with a goal of making interactions more reliable and ethically aware. You can give it a try here. 9to5Mac reports: Anthropic highlights three launch features for Claude on iPhone:\n \nSeamless syncing with web chats: Pick up where you left off across devices.\nVision capabilities: Use photos from your library, take new photos, or upload files so you can have real-time image analysis, contextual understanding, and mobile-centric use cases on the go.\nOpen access: Users across all plans, including Pro and Team, can download the app free of charge.\n \nThe app is also capable of analyzing things that you show it like objects, images, and your environment.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anthropic+Brings+Claude+A", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/01/2147233/anthropic-brings-claude-ai-to-the-iphone-and-ipad?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Anthropic Brings Claude AI To the iPhone and iPad", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T22:43:22.289785+00:00", "description": "An anonymous reader quotes a report from Bloomberg: Dropbox said its digital-signature product, Dropbox Sign, was breached by hackers, who accessed user information including emails, user names and phone numbers. The software company said it became aware of the cyberattack on April 24, sought to limit the incident and reported it to law enforcement and regulatory authorities. \"We discovered that the threat actor had accessed data related to all users of Dropbox Sign, such as emails and user names, in addition to general account settings,\" Dropbox said Wednesday in a regulatory filing. \"For subsets of users, the threat actor also accessed phone numbers, hashed passwords, and certain authentication information such as API keys, OAuth tokens, and multi-factor authentication.\"\n \nDropbox said there is no evidence hackers obtained user accounts or payment information. The company said it appears the attack was limited to Dropbox Sign and no other products were breached. The company didn't d", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/01/220214/dropbox-says-hackers-breached-digital-signature-product?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Dropbox Says Hackers Breached Digital-Signature Product", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T21:36:45.191204+00:00", "description": "Microsoft has confirmed that the April 2024 Windows security updates break VPN connections across client and server platforms. From a report: The company explains on the Windows health dashboard that \"Windows devices might face VPN connection failures after installing the April 2024 security update or the April 2024 non-security preview update.\" \n\n\"We are investigating user reports, and we will provide more information in the coming days,\" Redmond added. The list of affected Windows versions includes Windows 11, Windows 10, and Windows Server 2008 and later.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Says+April+Windows+Updates+Break+VPN+Connections%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F05%2F01%2F198248%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/01/198248/microsoft-says-april-windows-updates-break-vpn-connections?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Says April Windows Updates Break VPN Connections", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T21:36:43.202690+00:00", "description": "The National Archives and Records Administration (NARA) told employees Wednesday that it is blocking access to ChatGPT on agency-issued laptops to \"protect our data from security threats associated with use of ChatGPT,\" 404 Media reported Wednesday. From the report: \"NARA will block access to commercial ChatGPT on NARANet [an internal network] and on NARA issued laptops, tablets, desktop computers, and mobile phones beginning May 6, 2024,\" an email sent to all employees, and seen by 404 Media, reads. \"NARA is taking this action to protect our data from security threats associated with use of ChatGPT.\" \n\nThe move is particularly notable considering that this directive is coming from, well, the National Archives, whose job is to keep an accurate historical record. The email explaining the ban says the agency is particularly concerned with internal government data being incorporated into ChatGPT and leaking through its services. \"ChatGPT, in particular, actively incorporates information ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/01/1840256/national-archives-bans-employee-use-of-chatgpt?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "National Archives Bans Employee Use of ChatGPT", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T20:34:11.237020+00:00", "description": "An anonymous reader shares a report: Two months after hackers broke into Change Healthcare systems stealing and then encrypting company data, it's still unclear how many Americans were impacted by the cyberattack. Last month, Andrew Witty, the CEO of Change Healthcare's parent company UnitedHealth Group, said that the stolen files include the personal health information of \"a substantial proportion of people in America.\" On Wednesday, during a House hearing, when Witty was pushed to give a more definitive answer, testifying that the breach impacted \"I think, maybe a third [of Americans] or somewhere of that level.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=UnitedHealthCare+CEO+Says+'Maybe+a+Third'+of+US+Citizens+Were+Affected+By+Recent+Hack%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F05%2F01%2F1959251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" ", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/01/1959251/unitedhealthcare-ceo-says-maybe-a-third-of-us-citizens-were-affected-by-recent-hack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "UnitedHealthCare CEO Says 'Maybe a Third' of US Citizens Were Affected By Recent Hack", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T19:28:24.439641+00:00", "description": "ArsTechnica: Sixty years ago, on May 1, 1964, at 4 am in the morning, a quiet revolution in computing began at Dartmouth College. That's when mathematicians John G. Kemeny and Thomas E. Kurtz successfully ran the first program written in their newly developed BASIC (Beginner's All-Purpose Symbolic Instruction Code) programming language on the college's General Electric GE-225 mainframe. \n\nLittle did they know that their creation would go on to democratize computing and inspire generations of programmers over the next six decades.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+BASIC+Programming+Language+Turns+60%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F05%2F01%2F1751243%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F05%2F01%2F1751243%2Fthe-basic-", "language": "en-us", "link": "https://developers.slashdot.org/story/24/05/01/1751243/the-basic-programming-language-turns-60?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The BASIC Programming Language Turns 60", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T19:28:21.938641+00:00", "description": "\"Tens of millions\" of people are using technical workarounds to secretly access WhatsApp in countries where it is banned, the messaging platform's boss has said. From a report: \"You'd be surprised how many people have figured it out,\" Will Cathcart told BBC News. Like many Western apps, WhatsApp is banned in Iran and North Korea and, intermittently, in Syria. And last month, China joined the list of those banning users from accessing the secure platform. Other countries, including Qatar, Egypt, Jordan and the United Arab Emirates, restrict features such as voice calls. \n\nBut WhatsApp can see where its users truly are, thanks to their registered phone numbers. \"We have a lot of anecdotal reports of people using WhatsApp and what we can do is look at some of the countries where we're seeing blocking and still see tens of millions of people connecting to WhatsApp,\" Mr Cathcart told BBC News. China ordered Apple to block Chinese iPhone users from downloading WhatsApp from the AppStore in ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/01/183251/tens-of-millions-secretly-use-whatsapp-despite-bans-company-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Tens of Millions Secretly Use WhatsApp Despite Bans, Company Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T18:22:32.040622+00:00", "description": "Windows 11's market share dropped in April 2024, falling below 26% after reaching an all-time high of 28.16% in February. According to Statcounter, Windows 11 lost 0.97 points, while Windows 10 gained 0.96 points, crossing the 70% mark for the first time since September 2023. Neowin adds: Some argue that Windows 11 still offers little to no benefits for upgrading, especially in light of Microsoft killing some of the system's unique features, such as Windows Subsystem for Android. Add to that the ever-increasing number of ads, some of which are quite shameless, and you get an operating system that has a hard time winning hearts and minds, and retaining its customers.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+10+Reaches+70%25+Market+Share+as+Windows+11+Keeps+Declining%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F05%2F01%2F1658204%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_lar", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/01/1658204/windows-10-reaches-70-market-share-as-windows-11-keeps-declining?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Windows 10 Reaches 70% Market Share as Windows 11 Keeps Declining", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T18:22:29.918820+00:00", "description": "The US could lose out on valuable AI and tech talent if some of its immigration policies are not modernized, Google says in a letter sent to the Department of Labor. From a report: Google says policies like Schedule A, a list of occupations the government \"pre-certified\" as not having enough American workers, have to be more flexible and move faster to meet demand in technologies like AI and cybersecurity. The company says the government must update Schedule A to include AI and cybersecurity and do so more regularly. \n\n\"There's wide recognition that there is a global shortage of talent in AI, but the fact remains that the US is one of the harder places to bring talent from abroad, and we risk losing out on some of the most highly sought-after people in the world,\" Karan Bhatia, head of government affairs and public policy at Google, tells The Verge. He noted that the occupations in Schedule A have not been updated in 20 years. \n\nCompanies can apply for permanent residencies, colloquia", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/01/1725208/google-urges-us-to-update-immigration-rules-to-attract-more-ai-talent?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Urges US To Update Immigration Rules To Attract More AI Talent", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T17:17:36.137720+00:00", "description": "Microsoft's motivation for investing heavily and partnering with OpenAI came from a sense of falling badly behind Google, according to an internal email released Tuesday as part of the Justice Department's antitrust case against the search giant. Bloomberg: The Windows software maker's chief technology officer, Kevin Scott, was \"very, very worried\" when he looked at the AI model-training capability gap between Alphabet's efforts and Microsoft's, he wrote in a 2019 message to Chief Executive Officer Satya Nadella and co-founder Bill Gates. The exchange shows how the company's top executives privately acknowledged they lacked the infrastructure and development speed to catch up to the likes of OpenAI and Google's DeepMind. \n\n[...] Scott, who also serves as executive vice president of artificial intelligence at Microsoft, observed that Google's search product had improved on competitive metrics because of the Alphabet company's advancements in AI. The Microsoft executive wrote that he ma", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/01/1437245/microsoft-concern-over-googles-lead-drove-openai-investment?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Concern Over Google's Lead Drove OpenAI Investment", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T17:17:34.084903+00:00", "description": "LastPass, the password manager company, has officially separated from its parent company, GoTo, following a series of high-profile hacks in recent years. The company will now operate under a shareholder holding company called LMI Parent. \n\nLastPass -- owned by private equity firms Francisco Partners and Elliott Management -- has faced criticism for its handling of the breaches, which resulted in the theft of customer data and encryption keys. The company has since enforced a 12-character minimum for master passwords to improve security.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=LastPass+Separates+From+GoTo%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F05%2F01%2F167255%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F05%2F01%2F167255%2Flastpass-separates-from-goto%3Fu", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/01/167255/lastpass-separates-from-goto?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "LastPass Separates From GoTo", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T16:00:23.929942+00:00", "description": "The massive volumes of debt piling up around the globe forced the president of the World Economic Forum to reach back more than 200 years for a comparable period. Fortune: In an interview Sunday with CNBC at a WEF conference in Saudi Arabia, Borge Brende warned overall debt is approaching the world's total economic output. \"We haven't seen this kind of debt since the Napoleonic Wars,\" he said. \"We're getting close to 100% of global GDP in debt.\" \n\nAccording to the International Monetary Fund last year, global public debt hit $91 trillion, or 92% of GDP, by the end of 2022. That was actually a dip from pandemic-era debt levels but remained in line with a decades-long trend higher. Data on global debt during the Napoleonic Wars, which took place in the early 1800s, is harder to come by. But for comparison, some estimates put British government debt at more than 200% of GDP by 1815. \n\nBrende also told CNBC that governments need to take fiscal measures to reduce their debts without trigge", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/01/1513253/global-debt-hasnt-been-this-bad-since-the-napoleonic-wars-says-wef-president?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Global Debt Hasn't Been This Bad Since the Napoleonic Wars, Says WEF President", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T14:50:42.181677+00:00", "description": "An anonymous reader shares a report: Harvard geneticist David Sinclair, who has said his \"biological age\" is roughly a decade younger than his actual one, has put forward his largely unlined face as a spokesman for the longevity movement. The 54-year-old has built his brand on the idea that aging is a treatable disease. The notion has proven so seductive that legions of acolytes follow his online postings about his research and the cocktails of supplements he consumes to stave off the inevitable. His social-media accounts are a platform for assertions that his work is pushing nearer to a fountain of youth. He claimed last year that a gene therapy invented in his Harvard lab and being developed by a company he co-founded, Life Biosciences, had reversed aging and restored vision in monkeys. \"Next up: age reversal in humans,\" he wrote on X and Instagram. \n\nOn Feb. 29, in the eyes of many other scientists working to unlock the mysteries of aging, he went too far. Another company he co-fou", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/01/1322234/star-scientists-claim-of-reverse-aging-draws-hail-of-criticism?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Star Scientist's Claim of 'Reverse Aging' Draws Hail of Criticism", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T14:50:39.918196+00:00", "description": "LinkedIn, the professional network known for job listings and unsolicited career advice, is jumping into gaming. From a report: The platform is officially introducing a set of Wordle-style puzzle games, weeks after they were first spotted in the app. The company is starting with three games: Pinpoint, a word game where players must guess the theme that ties a series of words together; Queens, a puzzle game that's a bit like a cross between Sudoku and Minesweeper; and Crossclimb, a trivia game that involves guessing a series of four-letter words and placing them in the correct order. \n\nLinkedIn describes them as \"thinking-oriented games,\" though the format will likely look familiar to fans of The New York Times Games app. Each game can only be played once a day, and players can share their score with friends in cute emoji-filled messages reminiscent of the \"Wordle grid.\" The service will also keep track of \"streaks,\" to encourage players to come back every day. Given the similarities, ", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/01/1422219/linkedin-now-has-wordle-style-games-you-can-play-every-day?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "LinkedIn Now Has Wordle-style Games You Can Play Every Day", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T13:45:12.400250+00:00", "description": "An anonymous reader quotes a report from Ars Technica: On Sunday, word began to spread on social media about a new mystery chatbot named \"gpt2-chatbot\" that appeared in the LMSYS Chatbot Arena. Some people speculate that it may be a secret test version of OpenAI's upcoming GPT-4.5 or GPT-5 large language model (LLM). The paid version of ChatGPT is currently powered by GPT-4 Turbo. Currently, the new model is only available for use through the Chatbot Arena website, although in a limited way. In the site's \"side-by-side\" arena mode where users can purposely select the model, gpt2-chatbot has a rate limit of eight queries per day -- dramatically limiting people's ability to test it in detail. [...] On Monday evening, OpenAI CEO Sam Altman seemingly dropped a hint by tweeting, \"i do have a soft spot for gpt2.\" [...]\n \nOpenAI's fingerprints seem to be all over the new bot. \"I think it may well be an OpenAI stealth preview of something,\" AI researcher Simon Willison told Ars Technica. But ", "language": "en-us", "link": "https://slashdot.org/story/24/05/01/0410231/mysterious-gpt2-chatbot-ai-model-appears-suddenly-confuses-experts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mysterious 'gpt2-chatbot' AI Model Appears Suddenly, Confuses Experts", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T10:28:32.328467+00:00", "description": "AmiMoJo shares a report from Tech Times: China has reached a major landmark in green transportation with the launch of the world's largest fully electric container ship. Developed and manufactured by China Ocean Shipping Group (Cosco), the vessel is now operating a regular service route between Shanghai and Nanjing, aiming to reduce emissions significantly along its journey. The Greenwater 01, an all-electric container ship, is positioning itself to be a shipping industry pioneer. Equipped with a main battery exceeding 50,000 kilowatt-hours, the vessel can accommodate additional battery boxes for longer voyages. These battery boxes, each containing 1,600 kilowatt-hours of electricity and similar in size to standard 20-foot containers, provide flexibility in extending the ship's travel range. With 24 battery boxes onboard, the Greenwater 01 can complete a journey consuming 80,000 kilowatt-hours of electricity. This is equivalent to saving 15 tons of fuel compared to a standard containe", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/30/2243243/china-launches-worlds-largest-electric-container-ship?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China Launches World's Largest Electric Container Ship", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T07:12:54.095786+00:00", "description": "Satellite operator SES plans to buy fellow satellite operator Intelsat, in a $3.1 billion deal that's expected to close next year. According to Space Magazine, the combined company could help it \"compete with SpaceX's huge Starlink broadband network.\" From the report: SES and Intelsat both operate communications satellites in geostationary orbit, which lies 22,236 miles (35,785 kilometers) above Earth. SES also runs a constellation called O3b in medium Earth orbit, at an altitude of about 5,000 miles (8,000 km). As [SES CEO Adel Al-Saleh] noted, there is increasingly fierce competition for the services provided by these satellites -- for example, from SpaceX's Starlink megaconstellation in low Earth orbit. And other LEO megaconstellations are in the works as well. For instance, Amazon launched the first two prototypes for its planned 3,200-satellite Project Kuiper network this past October.\n \n\"By combining our financial strength and world-class team with that of SES, we create a more ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/30/2248237/satellite-operator-ses-acquiring-intelsat-in-31-billion-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Satellite Operator SES Acquiring Intelsat In $3.1 Billion Deal", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T03:58:42.939640+00:00", "description": "An anonymous reader quotes a report from Bloomberg: U.S. wind power slipped last year for the first time in a quarter-century due to weaker-than-normal Midwest breezes, underscoring the challenge of integrating volatile renewable energy sources into the grid. Power produced by turbines slipped 2% in 2023, even after developers added 6.2 gigawatts of new capacity, according to a government report Tuesday. The capacity factor for the country's wind fleet -- how much energy it's actually generating versus its maximum possible output -- declined to an eight-year low of 33.5%. Most of that decline was driven by the central US, a region densely dotted with turbines.\n \nWind is a key component of the effort to cut carbon emissions, but the data highlights the downside of relying on intermittent energy sources tied to the effects of global weather. Last year's low wind speeds came during El Nino, a warming of the equatorial Pacific that tends to weaken trade winds. La Nina, the Pacific cooling", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/30/2229245/americas-wind-power-production-drops-for-the-first-time-in-25-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "America's Wind Power Production Drops For the First Time In 25 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T02:53:18.807258+00:00", "description": "An anonymous reader shares that IPv6rs has debuted a new one-click self hosting system:\n\nEveryone seemed like they were talking about self hosting, but we didn't understand why it wasn't more prolific. Thus, we conducted a survey to hear reasons. It turned out the two most common reasons were: \n\n1. Lack of an external IP address\n2. Too difficult to setup and maintain \n\nOur service already solves the first issue. We set out with a self-hostathon to figure out what the blockers were in setting up and running a self-hosted server.\n\n... writes IPv6rs on their blog.\n\nWe needed to make things easier, so we created Cloud Seeder, a one click installer that instantly launches a fully encapsulated server appliance that is externally reachable. \nAt the time of launching, the current version of Cloud Seeder supports 20+ different appliances - from Mastodon which federates with Meta's Threads to Nextcloud which provides an enterprise-level, self-hosted alternative to the big-name collaboration sui", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/01/0151240/is-self-hosting-going-mainstream?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is Self Hosting Going Mainstream?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T01:47:10.404524+00:00", "description": "Kaiser Permanente is the latest healthcare giant to report a data breach. Kaiser said 13.4 million current and former insurance members had their patient data shared with third-party advertisers, thanks to an improperly implemented tracking code the company used to see how its members navigated through its websites. Dark Reading reports: The shared data included names, IP addresses, what pages people visited, whether they were actively signed in, and even the search terms they used when visiting the company's online health encyclopedia. Kaiser has reportedly removed the tracking code from its sites, and while the incident wasn't a hacking event, the breach is still concerning from a security perspective, according to Narayana Pappu, CEO at Zendata.\n \n\"The presence of third-party trackers belonging to advertisers, and the oversharing of customer information with these trackers, is a pervasive problem in both health tech and government space,\" he explains. \"Once shared, advertisers have", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/30/2218205/134-million-kaiser-insurance-members-affected-by-data-leak-to-online-advertisers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "13.4 Million Kaiser Insurance Members Affected by Data Leak to Online Advertisers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T00:42:21.003331+00:00", "description": "Arcade giant Dave &amp; Buster's said it will begin allowing customers to bet on arcade games. \"Customers can soon make a friendly $5 wager on a Hot Shots basketball game, a bet on a Skee-Ball competition or on another arcade game,\" reports CNBC. \"The betting function, expected to launch in the next few months, will work through the company's app.\" From the report: Dave &amp; Buster's, started in 1982, now has more than 222 venues in North America, offering everything from bowling to laser tag, plus virtual reality. The company says it has five million loyalty members and 30 million unique visitors to its locations each year. The company's stock is up more than 50% over the past year. As a boom in betting increases engagement among sports fans, digital gamification could have a similar effect within Dave &amp; Buster's customer base by allowing loyalty members to compete with one another and earn rewards. Ultimately, it could mean people spend more time and money at the venues.\n \nDave", "language": "en-us", "link": "https://games.slashdot.org/story/24/04/30/2152203/dave-busters-to-allow-customers-to-bet-on-arcade-games?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Dave &amp; Buster's To Allow Customers To Bet On Arcade Games", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T00:42:19.095283+00:00", "description": "Mishaal Rahman reports via Android Authority: Earlier today, a Senior Staff Software Engineer at Google who, according to their LinkedIn, leads the Android Systems Team and works on Android's Linux kernel fork, submitted a series of patches to AOSP that \"remove ACK's support for riscv64.\" The description of these patches states that \"support for risc64 GKI kernels is discontinued.\"\n \nACK stands for Android Common Kernel and refers to the downstream branches of the official kernel.org Linux kernels that Google maintains. The ACK is basically Linux plus some \"patches of interest to the Android community that haven't been merged into mainline or Long Term Supported (LTS) kernels.\" There are multiple ACK branches, including android-mainline, which is the primary development branch that is forked into \"GKI\" kernel branches that correspond to a particular combination of supported Linux kernel and Android OS version. GKI stands for Generic Kernel Image and refers to a kernel that's built fro", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/30/223247/google-removes-risc-v-support-from-android-common-kernel-denies-abandoning-its-efforts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Removes RISC-V Support From Android Common Kernel, Denies Abandoning Its Efforts", "user": null, "vote": 0}]