[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T19:45:01+00:00", "description": "So, Warner Bros. free-to-play cross-platform brawler is coming back, and according to the gargantuan publisher and developer Player First Games this incarnation is set to be bigger and better than ever before. \n\nIt’s a tall order to sway player perception following the disastrous climax of MultiVersus’ open beta period, which ended in June 2023. Greedy monetisation, a lack of content, and glitchy online play plagued MultiVersus before now, but seeing as this new version has been rebuilt from the ground up, we’re expecting big things. \n\nChanging perception, as already mentioned, is going to be tough, but given the promises we’re hearing MultiVersus has a credible chance of a second birth. This video outlines 15 things to know before you take the plunge.", "language": null, "link": "https://www.youtube.com/watch?v=tr7Fj8GUF5M", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/tr7Fj8GUF5M/hqdefault.jpg", "title": "MultiVersus - 15 Things You ABSOLUTELY NEED TO KNOW Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T17:30:10+00:00", "description": "The first-person shooter genre often seems like the one that gets most commonly criticized for eschewing creativity and experimentation in favour of sticking to tried and true formulas, but there are some notable FPS franchises out there that do their own thing, do it very well, and get a lot of success on the back of it. \n\nThere is no better example of that, perhaps, than 4A Games’ post-apocalyptic semi-horror series, Metro. From its early days in 2010 right up to now, the Metro games have consistently delivered excellently crafted, single player, narrative-driven experiences, which, unsurprisingly, has endeared the franchise to a great many people. Here, we’re going to talk about exactly how Metro has managed to find that sort of success.", "language": null, "link": "https://www.youtube.com/watch?v=mZZNAHjyKIE", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/mZZNAHjyKIE/hqdefault.jpg", "title": "The Rise and Rise of The METRO Series", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-01T13:30:33+00:00", "description": "When revealed in December 2019 at The Game Awards, Senua's Saga: Hellblade 2 immediately made an impact. The facial expressions of Melina Juergens, reprising her role as Senua once more; the vocals and instrumentals; and the sheer gritty nature of the presentation remain unforgettable to this day.\n\nFast forward to this month, and the sequel is almost upon us, launching on May 21st for Xbox Series X/S and PC. As Senua ventures into Viking Iceland to seek revenge, Hellblade 2 makes significant strides in its visuals, story-telling, motion capture and combat. That's despite retailing for $49.99 and opting for a digital-only release.\n\nHow does it differ from (and improve on) Hellblade: Senua's Sacrifice? Is the combat any different? Can you expect the same types of puzzles as the sequel? Check out 11 of the biggest differences here.", "language": null, "link": "https://www.youtube.com/watch?v=wrBJUyJ1W6w", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/wrBJUyJ1W6w/hqdefault.jpg", "title": "Hellblade 2 vs Hellblade 1 - 11 BIGGEST DIFFERENCES", "user": null, "vote": 0}]