[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T22:00:06.803968+00:00", "description": "The foundations behind Rust, Python, Apache, Eclipse, PHP, OpenSSL, and Blender announced plans to create \"common specifications for secure software development,\" based on \"existing open source best practices.\" \n\nFrom the Eclipse Foundation:\nThis collaborative effort will be hosted at the Brussels-based Eclipse Foundation [an international non-profit association] under the auspices of the Eclipse Foundation Specification Process and a new working group... Other code-hosting open source foundations, SMEs, industry players, and researchers are invited to join in as well. \n\nThe starting point for this highly technical standardisation effort will be today's existing security policies and procedures of the respective open source foundations, and similar documents describing best practices. \n\nThe governance of the working group will follow the Eclipse Foundation's usual member-led model but will be augmented by explicit representation from the open source community to ensure diversity and b", "language": "en-us", "link": "https://developers.slashdot.org/story/24/04/07/2122222/rust-python-apache-foundations-and-others-announce-big-collaboration-on-cybersecurity-process-specifications?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Rust, Python, Apache Foundations and Others Announce Big Collaboration on Cybersecurity Process Specifications", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T19:51:41.980056+00:00", "description": "\"Scary moments for passengers on a Southwest flight from Denver to Houston,\" tweets an ABC News transportation reporter, \"when the engine cover ripped off during flight, forcing the plane to return to Denver Sunday morning.\" \n\n\"Think that big circular metal panel surrounding the engine,\" writes QZ &mdash; adding that after it ripped off, the engine cowling \"struck the 737-800's wing flap.\" \n\nIt happened during takeoff, so the plane was towed back to the gate after returning to the airport. All passengers and crew were safe, and passengers boarded a replacement plane for their flight to Houston:\n\nSouthwest was already having a rough few weeks before this event occurred. Last Thursday, an engine on one of its Boeing 737-800 planes caught fire before taking off from an airport in Texas, and before that, two FAA-scrutinized Southwest flights were disrupted by turbulence [One last month in New York City and the other in Florida on Wednesday. \"Two hours later, an All Nippon Airways Boeing 7", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/07/1928250/boeing-engine-cover-rips-apart-during-takeoff-this-morning?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Boeing Engine Cover Rips Apart During Takeoff This Morning", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T18:46:38.827210+00:00", "description": "Slashdot reader sciencehabit shares this report from Science magazine:\n\n\nFifty years ago, famed physicist Stephen Hawking wrote down an equation that predicts that a black hole has entropy, an attribute typically associated with the disordered jumbling of atoms and molecules in materials. \n\nThe arguments for black hole entropy were indirect, however, and no one had derived the famous equation from the fundamental definition of entropy &mdash; at least not for realistic black holes. Now, one team of theorists claims to have done so, although some experts are skeptical. \n\nReported in a paper in press at Physical Review Letters, the work would solve a homework problem that some theorists have labored over for decades. \"It's good to have it done,\" says Don Marolf, a gravitational theorist at the University of California, Santa Barbara who was not involved in the research. It \"shows us how to move forward, that's great.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twi", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/06/2033255/have-scientists-finally-made-sense-of-stephen-hawkings-famous-black-hole-formula?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Have Scientists Finally Made Sense of Stephen Hawking's Famous Black Hole Formula?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T18:46:36.617703+00:00", "description": "A professor at Ithaca College runs part of each student's essay through ChatGPT, \"asking the AI tool to critique and suggest how to improve the work,\" reports CNN. (The professor said \"The best way to look at AI for grading is as a teaching assistant or research assistant who might do a first pass ... and it does a pretty good job at that.\") \n\nAnd the same professor then requires their class of 15 students to run their draft through ChatGPT to see where they can make improvements, according to the article:\n\nBoth teachers and students are using the new technology. A report by strategy consultant firm Tyton Partners, sponsored by plagiarism&#226;detection platform Turnitin, found half of college students used AI tools in Fall 2023. Meanwhile, while fewer faculty members used AI, the percentage grew to 22% of faculty members in the fall of 2023, up from 9% in spring 2023. \n\nTeachers are turning to AI tools and platforms &mdash; such as ChatGPT, Writable, Grammarly and EssayGrader &mdash;", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/07/0859259/professors-are-now-using-ai-to-grade-essays-are-there-ethical-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Professors Are Now Using AI to Grade Essays.  Are There Ethical Concerns?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T17:41:14.041952+00:00", "description": "On Mozilla's blog, engineer Martin Thomson explores Google's \"Privacy Sandbox\" initiative (which proposes sharing a subset of private user information &mdash; but without third-party cookies). \n\nThe blog post concludes that Google's Protected Audience \"protects advertisers (and Google) more than it protects you.\" But it's not all bad &mdash; in theory:\n\nThe idea behind Protected Audience is that it creates something like an alternative information dimension inside of your (Chrome) browser... Any website can push information into that dimension. While we normally avoid mixing data from multiple sites, those rules are changed to allow that. Sites can then process that data in order to select advertisements. However, no one can see into this dimension, except you. Sites can only open a window for you to peek into that dimension, but only to see the ads they chose... \nProtected Audience might be flawed, but it demonstrates real potential. If this is possible, that might give people more o", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/07/0627235/mozilla-asks-will-googles-privacy-sandbox-protect-advertisers-and-google-more-than-you?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mozilla Asks: Will Google's Privacy Sandbox Protect Advertisers (and Google) More than You?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T16:36:13.026593+00:00", "description": "While the European Parliament passed a wide-ranging \"AI Act\" in March, \"Leaders from Microsoft, Google, and OpenAI have all called for AI regulations in the U.S.,\" writes CIO magazine. Even the Chamber of Commerce, \"often opposed to business regulation, has called on Congress to protect human rights and national security as AI use expands,\" according to the article, while the White House has released a blueprint for an AI bill of rights. \n\nBut even though the U.S. Congress hasn't passed AI legislation &mdash; 16 different U.S. states have, \"and state legislatures have already introduced more than 400 AI bills across the U.S. this year, six times the number introduced in 2023.\"\n\nMany of the bills are targeted both at the developers of AI technologies and the organizations putting AI tools to use, says Goli Mahdavi, a lawyer with global law firm BCLP, which has established an AI working group. And with populous states such as California, New York, Texas, and Florida either passing or co", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/06/1824232/in-america-a-complex-patchwork-of-state-ai-regulations-has-already-arrived?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "In America, A Complex Patchwork of State AI Regulations Has Already Arrived", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T15:31:11.628635+00:00", "description": "Slashdot reader sciencehabit shares this report from Science magazine:\n\n\nFifty years ago, famed physicist Stephen Hawking wrote down an equation that predicts that a black hole has entropy, an attribute typically associated with the disordered jumbling of atoms and molecules in materials. \n\nThe arguments for black hole entropy were indirect, however, and no one had derived the famous equation from the fundamental definition of entropy &mdash; at least not for realistic black holes. Now, one team of theorists claims to have done so, although some experts are skeptical. \n\nReported in a paper in press at Physical Review Letters, the work would solve a homework problem that some theorists have labored over for decades. \"It's good to have it done,\" says Don Marolf, a gravitational theorist at the University of California, Santa Barbara who was not involved in the research. It \"shows us how to how to move forward, that's great.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"htt", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/06/2033255/have-scientists-finally-made-sense-of-hawkings-famous-black-hole-formula?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Have Scientists Finally Made Sense of Hawking's Famous Black Hole Formula?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T12:16:22.306362+00:00", "description": "Four months ago long-time Slashdot reader Shayde tried restoring a 1986 DEC PDP-11 minicomputer. \n\nBut now he's gone even further back in time. Shayde writes:\n\nIn 1984, Apple II's were at the top of their game in the 8 bit market. A company in New Jersey decided to get in on the action and built an exact clone of the Apple. The Franklin Ace was chip and ROM compatible with the Apple II, and that led to it's downfall. \n\nIn this video we resurrect and old Franklin Ace and not only boot ProDOS, but also get the Z80 coprocessor up and running, and relive what coding in Turbo Pascal in the 80s was like. \n\n\nWhy Turbo Pascal? \"Some of my earliest professional programming was done in this environment,\" Shayde says in the video, \"and I was itching to play with it again.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Retro+Computing+Enthusiast+Tries+Running+Turbo+Pascal+On+a+40-Year-Old+Apple+II+Clone%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/06/2151232/retro-computing-enthusiast-tries-running-turbo-pascal-on-a-40-year-old-apple-ii-clone?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Retro Computing Enthusiast Tries Running Turbo Pascal On a 40-Year-Old Apple II Clone", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T07:55:57.527289+00:00", "description": "\"America's honeybee population has rocketed to an all-time high,\" reports the Washington Post:\n\n We've added almost 1 million bee colonies in the past five years. We now have 3.8 million, the census shows. Since 2007, the first census after alarming bee die-offs began in 2006, the honeybee has been the fastest-growing livestock segment in the country! And that doesn't count feral honeybees, which may outnumber their captive cousins several times over... \n\nMuch of the explosion of small producers came in just one state: Texas. The Lone Star State has gone from having the sixth-most bee operations in the country to being so far ahead of anyone else that it out-bees the bottom 21 states combined... [A]ll 254 Texas counties adopted bee rules requiring, for example, six hives on five acres plus another hive for every 2.5 acres beyond that to qualify for the tax break... \n\n When the census was taken in December 2022, California had more than four times as many bees as any other state. We em", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/07/0534231/wait-does-america-suddenly-have-a-record-number-of-bees?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Wait, Does America Suddenly Have a Record Number of Bees?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T05:48:00.966377+00:00", "description": "Windows Report speculates on what Microsoft may be working on next based on a recently-published patent for \"performant sound recognition AI technologies\" (dated April 2, 2024):\n\n\n\nMicrosoft's new technology can recognize different types of sounds, from doorbells to babies crying, or dogs barking, but not limited to them. It can also recognize sounds of coughing or breathing difficulties, or unusual noises, such as glass breaking. Most intriguing, it can recognize and monitor environmental sounds, and they can be further processed to let users know if a natural disaster is about to happen... \n\nThe neural network generates scores and probabilities for each type of sound event in each segment. This is like guessing what type of sound each segment is and how sure it is about the guess. After that, the system does some post-processing to smooth out the scores and probabilities and generate confidence values for each type of sound for different window sizes. \n\nUltimately, this technology c", "language": "en-us", "link": "https://slashdot.org/story/24/04/07/039225/is-microsoft-working-on-performant-sound-recognition-ai-technologies?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is Microsoft Working on 'Performant Sound Recognition' AI Technologies?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-07T02:32:50.733517+00:00", "description": "\"The San Francisco Giants are one of four teams in Major League Baseball this season offering fans a free shortcut through the gates into the ballpark,\" writes SFGate. \n\n\"The cost? Signing up for the league's 'facial authentication' software through its ticketing app.\"\n\nThe Giants are using MLB's new Go-Ahead Entry program, which intends to cut down on wait times for fans entering games. The pitch is simple: Take a selfie through the MLB Ballpark app (which already has your tickets on it), upload the selfie and, once you're approved, breeze through the ticketing lines and into the ballpark. Fans will barely have to slow down at the entrance gate on their way to their seats... \n\nThe Philadelphia Phillies were MLB's test team for the technology in 2023. They're joined by the Giants, Nationals and Astros in 2024... \n\n\n[Major League Baseball] says it won't be saving or storing pictures of faces in a database &mdash; and it clearly would really like you to not call this technology facial r", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/06/209224/four-baseball-teams-now-let-ticket-holders-enter-using-ai-powered-facial-authentication?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Four Baseball Teams Now Let Ticket-Holders Enter Using AI-Powered 'Facial Authentication'", "user": null, "vote": 0}]