[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T22:58:48.506381+00:00", "description": "An anonymous reader quotes a report from Ars Technica, written by John Timmer: [P]art of the software stack that companies are developing to control their quantum hardware includes software that converts abstract representations of quantum algorithms into the series of commands needed to execute them. IBM's version of this software is called Qiskit (although it was made open source and has since been adopted by other companies). Recently, IBM made a couple of announcements regarding Qiskit, both benchmarking it in comparison to other software stacks and opening it up to third-party modules. [...] Right now, the company is supporting six third-party Qiskit functions that break down into two categories.\n \nThe first can be used as stand-alone applications and are focused on providing solutions to problems for users who have no expertise programming quantum computers. One calculates the ground-state energy of molecules, and the second performs optimizations. But the remainder are focused ", "id": 1227634, "language": null, "link": "https://tech.slashdot.org/story/24/09/27/2210240/ibm-opens-its-quantum-computing-stack-to-third-parties?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "IBM Opens Its Quantum-Computing Stack To Third Parties", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T22:58:48.420287+00:00", "description": "iFixit's iPhone 16 teardown revealed a new battery removal process that does away with the usual pull tabs, instead opting for an adhesive that debonds when exposed to a low electrical current. \"It only takes about a minute and a half for it to come unstuck,\" reports Engadget, citing Apple's repair guide. iFixit tech Shahram Mokhtari said, \"I'm not sure we've ever had a battery removal process go so cleanly and smoothly.\" From the report: Only the iPhone 16 and iPhone 16 Plus have the new adhesive, and they've earned a 7/10 on iFixit's repairability scale. \"Apple definitely seems to be leveling up on repairability,\" Mokhtari, adding Apple has \"landed another repairability win\" with this year's base iPhones thanks to the new battery removal procedure. Further reading: iPhone's 80% Charge Cap Barely Boosts Battery Life, Year-Long Test Reveals<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=iFixit's+iPhone+16+Teardown+R", "id": 1227633, "language": null, "link": "https://apple.slashdot.org/story/24/09/27/2218240/ifixits-iphone-16-teardown-reveals-game-changing-battery-removal-process?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "iFixit's iPhone 16 Teardown Reveals Game-Changing Battery Removal Process", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T21:55:22.129907+00:00", "description": "Meta Platforms' claims that Facebook doesn't polarize Americans came under new doubt as the journal Science raised questions about a prominent research paper the tech giant has cited to support its position. WSJ: In an editorial Thursday, Science said that Meta's emergency efforts to calm its platforms in the wake of the 2020 election may have swayed the conclusions of the paper, which the journal published in July 2023. The editorial, titled \"Context matters in social media,\" was prompted by a letter that Science also published presenting new criticism of the paper. Because the study of Facebook's algorithms relied on data provided by Meta when it was undertaking extraordinary efforts to restrain incendiary political content, the letter's authors argue that the paper may have overstated the case that social media algorithms didn't contribute to political polarization. \n\nSuch criticisms of peer-reviewed research often appear below papers in academic journals, but Science's editors fel", "id": 1227438, "language": null, "link": "https://tech.slashdot.org/story/24/09/27/2027221/science-editors-raise-new-doubts-on-metas-claims-it-isnt-polarizing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Science Editors Raise New Doubts on Meta's Claims It Isn't Polarizing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T20:49:20.648310+00:00", "description": "SpzToid shares a report: Today, a group of independent security researchers revealed that they'd found a flaw in a web portal operated by the carmaker Kia that let the researchers reassign control of the Internet-connected features of most modern Kia vehicles -- dozens of models representing millions of cars on the road -- from the smartphone of a car's owner to the hackers' own phone or computer. By exploiting that vulnerability and building their own custom app to send commands to target cars, they were able to scan virtually any Internet-connected Kia vehicle's license plate and within seconds gain the ability to track that car's location, unlock the car, honk its horn, or start its ignition at will. \n\nAfter the researchers alerted Kia to the problem in June, Kia appears to have fixed the vulnerability in its web portal, though it told WIRED at the time that it was still investigating the group's findings and hasn't responded to WIRED's emails since then. But Kia's patch is far fro", "id": 1227133, "language": null, "link": "https://it.slashdot.org/story/24/09/27/1950242/flaw-in-kias-web-portal-let-researchers-track-hack-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Flaw In Kia's Web Portal Let Researchers Track, Hack Cars", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T20:49:20.264604+00:00", "description": "23andMe is not doing well. Its stock is on the verge of being delisted. It shut down its in-house drug-development unit last month, only the latest in several rounds of layoffs. Last week, the entire board of directors quit, save for Anne Wojcicki, a co-founder and the company's CEO. Amid this downward spiral, Wojcicki has said she'll consider selling 23andMe -- which means the DNA of 23andMe's 15 million customers would be up for sale, too. The Atlantic: 23andMe's trove of genetic data might be its most valuable asset. For about two decades now, since human-genome analysis became quick and common, the A's, C's, G's, and T's of DNA have allowed long-lost relatives to connect, revealed family secrets, and helped police catch serial killers. Some people's genomes contain clues to what's making them sick, or even, occasionally, how their disease should be treated. For most of us, though, consumer tests don't have much to offer beyond a snapshot of our ancestors' roots and confirmation of", "id": 1227132, "language": null, "link": "https://yro.slashdot.org/story/24/09/27/208242/if-23andme-is-up-for-sale-so-is-all-that-dna?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "If 23andMe Is Up for Sale, So Is All That DNA", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T19:45:43.321087+00:00", "description": "The United Nations is set to vote on a treaty later this year intended to create norms for fighting cybercrime -- and the Biden administration is fretting over whether to sign on. Politico: The uncertainty over the treaty stems from fears that countries including Russia, Iran and China could use the text as a guise for U.N. approval of their widespread surveillance measures and suppression of the digital rights of their citizens. If the United States chooses not to vote in favor of the treaty, it could become easier for these adversarial nations -- named by the Cybersecurity and Infrastructure Security Agency as the biggest state sponsors of cybercrime -- to take the lead on cyber issues in the future. And if the U.S. walks away from the negotiating table now, it could upset other nations that spent several years trying to nail down the global treaty with competing interests in mind. \n\nWhile the treaty is not set for a vote during the U.N. General Assembly this week, it's a key topic ", "id": 1226760, "language": null, "link": "https://yro.slashdot.org/story/24/09/27/1834246/white-house-agonizes-over-un-cybercrime-treaty?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "White House Agonizes Over UN Cybercrime Treaty", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T19:45:43.083532+00:00", "description": "The European Space Agency (ESA) plans to launch a satellite into Earth's orbit in 2027 to watch it get wrecked as it reenters the atmosphere. From a report: The project is intended to help understand how exactly satellites break apart so that scientists can learn how to prevent the creation of more space debris. Space junk is becoming a bigger problem as we send more satellites into orbit, but there are efforts to try and address it. This mission is part of the ESA's Zero Debris Charter initiative to stop the creation of additional space debris by 2030. The mission is called the Destructive Reentry Assessment Container Object (DRACO), and the insides of the satellite will collect data as the craft gets destroyed during reentry into the atmosphere. It will also contain a 40-centimeter capsule designed to survive the destruction that will transmit the collected data as the capsule moves toward the ocean.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" hre", "id": 1226759, "language": null, "link": "https://science.slashdot.org/story/24/09/27/1924212/europes-space-agency-will-destroy-a-brand-new-satellite-in-2027-just-to-see-what-happens?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Europe's Space Agency Will Destroy a Brand-New Satellite in 2027 Just To See What Happens", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T18:40:55.288775+00:00", "description": "Steam just removed its forced arbitration policy, opening the door for lawsuits against its parent company, Valve. From a report: In an update on Thursday, Steam says its subscriber agreement \"now provides that any disputes are to go forward in court instead of arbitration.\" Many companies include a forced arbitration clause in their user agreement, waiving a person's right to a trial in court. Arbitration involves settling a dispute outside a legal system before an impartial third party. This method is often faster but may not get the best results for consumers, as arbitrators don't need to consider the law when issuing a decision.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Steam+Will+Let+You+Sue+Valve+Now%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F09%2F27%2F1819254%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://w", "id": 1226416, "language": null, "link": "https://slashdot.org/story/24/09/27/1819254/steam-will-let-you-sue-valve-now?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Steam Will Let You Sue Valve Now", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T17:35:47.154367+00:00", "description": "The Justice Department unsealed criminal charges Friday against three Iranian operatives suspected of hacking Donald Trump's presidential campaign and disseminating stolen information to media organizations. From a report: The three accused hackers were employed by Iran's paramilitary Revolutionary Guard and their operation also targeted a broad swath of targets, including government officials, members of the media and non-governmental organizations, the Justice Department said. \n\nThe Trump campaign disclosed on Aug. 10 that it had been hacked and said Iranian actors had stolen and distributed sensitive internal documents. Multiple major news organizations that said they were leaked confidential information from inside the Trump campaign, including Politico, The New York Times and The Washington Post, declined to publish it.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Iranian+Operatives+Charged+in+the+US+With+Hac", "id": 1226078, "language": null, "link": "https://news.slashdot.org/story/24/09/27/1649223/iranian-operatives-charged-in-the-us-with-hacking-donald-trumps-presidential-campaign?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Iranian Operatives Charged in the US With Hacking Donald Trump's Presidential Campaign", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T17:35:46.903422+00:00", "description": "wiredmikey writes: Three months after pulling previews of the controversial Windows Recall feature due to public backlash, Microsoft says it has completely overhauled the security architecture with proof-of-presence encryption, anti-tampering and DLP checks, and screenshot data managed in secure enclaves outside the main operating system. \n\nIn an interview with SecurityWeek, Microsoft vice president David Weston said the company's engineers rewrote the security model of Windows Recall to reduce attack surface on Copilot+ PCs and minimize the risk of malware attackers targeting the screenshot data store.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Controversial+Windows+Recall+AI+Search+Tool+Returns%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F09%2F27%2F1722216%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.faceb", "id": 1226077, "language": null, "link": "https://it.slashdot.org/story/24/09/27/1722216/controversial-windows-recall-ai-search-tool-returns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Controversial Windows Recall AI Search Tool Returns", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T16:30:44.132921+00:00", "description": "Taiwan Semiconductor Manufacturing Co (TSMC) executives have dismissed OpenAI CEO Sam Altman's ambitious chip-making proposal as unrealistic, according to The New York Times. Altman, seeking to boost AI computing power, pitched a $7 trillion plan to build 36 semiconductor plants over several years during a visit to TSMC's Taiwan headquarters. TSMC leaders reportedly found Altman's proposal so far-fetched that they privately referred to him as a \"podcasting bro,\" reflecting skepticism about his grasp of the semiconductor industry's complexities. The world's largest contract chipmaker, already grappling with multi-billion dollar expansion projects, viewed Altman's scheme as overly risky given the massive capital requirements and market uncertainties.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=TSMC+Execs+Dismiss+OpenAI+Chief's+%247+Trillion+Chip+Plan+as+'Podcasting+Bro'+Vision%3A+https%3A%2F%2Ftech.slashdot.org%2Fs", "id": 1225565, "language": null, "link": "https://tech.slashdot.org/story/24/09/27/1357209/tsmc-execs-dismiss-openai-chiefs-7-trillion-chip-plan-as-podcasting-bro-vision?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "TSMC Execs Dismiss OpenAI Chief's $7 Trillion Chip Plan as 'Podcasting Bro' Vision", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T16:30:43.894180+00:00", "description": "An anonymous reader shares a report: Apple is rethinking its movie strategy after the disappointing box office performance of several big-budget films, including Martin Scorsese's Killers of the Flower Moon, Napoleon, Argylle and Fly Me to the Moon. Apple canceled plans to release Wolfs -- an action comedy starring George Clooney and Brad Pitt -- in thousands of theaters globally. Instead, the picture made its debut in a limited number of venues before it became available on the Apple TV+ streaming service on Sept. 27. Apple plans to use a similar approach with the next few titles on its calendar, including the World War II drama Blitz. Apple, which previously had intended to spend about $1 billion annually on blockbusters for cinemas, won't return to the big screen with a wide, global theatrical release until June with F1 -- a film starring Pitt as a former Formula One driver who returns to racing to mentor a rising star. \n\n[...] Apple is pulling back from theaters at the same time N", "id": 1225564, "language": null, "link": "https://apple.slashdot.org/story/24/09/27/1542238/apple-rolls-back-its-big-plans-to-release-movies-in-theaters?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Rolls Back Its Big Plans to Release Movies in Theaters", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T15:24:46.335107+00:00", "description": "Dell is requiring global sales employees to work from offices five days a week starting September 30, according to an internal memo. The move aims to foster collaboration and skill development. Field representatives must spend five days weekly with customers, partners, or in-office, up from the previous three-day requirement, Dell says in the memo, according to Reuters. Remote workers unable to access Dell offices will continue working from home.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Dell+Mandates+Five-Day+Office+Presence+For+Global+Sales+Team%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F09%2F27%2F1318203%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F09%2F27%2F1318203%2Fdell-mandates-five-day-office-presence-for-global-sales-team%3Futm_sour", "id": 1225031, "language": null, "link": "https://slashdot.org/story/24/09/27/1318203/dell-mandates-five-day-office-presence-for-global-sales-team?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Dell Mandates Five-Day Office Presence For Global Sales Team", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T14:19:53.338468+00:00", "description": "OpenAI, creator of ChatGPT, is experiencing significant internal turmoil as a wave of high-profile departures, including Chief Technology Officer Mira Murati, rocks the company. Over 20 researchers and executives have left this year, reflecting deepening tensions between the organization's original nonprofit mission and its new profit-driven focus, WSJ reported Friday. \n\nEmployees report rushed product launches and inadequate safety testing, raising concerns about OpenAI's technological edge. CEO Sam Altman's global promotional efforts have reportedly left him detached from daily operations. The shift towards a conventional business model, with new C-suite appointments and a $6.5 billion funding drive, has alienated longtime staff who fear the company is abandoning its founding principles.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Turning+OpenAI+Into+a+Real+Business+Is+Tearing+It+Apart%3A+https%3A%2F%2Ftech.sla", "id": 1224650, "language": null, "link": "https://tech.slashdot.org/story/24/09/27/133234/turning-openai-into-a-real-business-is-tearing-it-apart?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Turning OpenAI Into a Real Business Is Tearing It Apart", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T11:04:42.584645+00:00", "description": "\"The Federal Trade Commission is cracking down on 'automation' companies that launch and manage online businesses on behalf of customers in exchange for an upfront investment,\" reports CNBC's Annie Palmer. \"The latest case targets Ascend Ecom, which ran an e-commerce money-making scheme, primarily on Amazon.\" The FTC accuses the e-commerce company of defrauding consumers of at least $25 million through false claims, deceptive marketing practices, and attempts to suppress negative reviews. From the report: Jamaal Sanford received a disturbing email in May of last year. The message, whose sender claimed to be part of a \"Russian shadow team,\" contained Sanford's home address, social security number and his daughter's college. It came with a very specific threat. The sender said Sanford, who lives in Springfield, Missouri, would only only be safe if he removed a negative online review. \"Do not play tough guy,\" the email said. \"You have nothing to gain by keeping the reviews and EVERYTHING", "id": 1223397, "language": null, "link": "https://news.slashdot.org/story/24/09/27/0047225/promises-of-passive-income-on-amazon-led-to-death-threats-for-negative-online-review-ftc-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Promises of 'Passive Income' On Amazon Led To Death Threats For Negative Online Review, FTC Says", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T07:39:14.025593+00:00", "description": "Hot on the heels of United Airlines' Starlink announcement, Hawaiian Airlines said it, too, is offering \"fast and free Starlink Wi-Fi\" across its entire Airbus fleet. CNET reports: Hawaiian Airlines is now the first major carrier to use Elon Musk's satellite internet service, which taps more than 7,000 satellites in low earth orbit to deliver high-speed internet worldwide. \"In Starlink's low earth orbit constellation of advanced satellites, the latest of which utilize a revolutionary laser mesh network, we found an ideal solution to ensure reliable, high-speed, low-latency Wi-Fi on transpacific flights,\" a Hawaiian Airlines representative told CNET. \"Working with Starlink has allowed us to offer a fast and consistent in-flight connectivity experience that meets our high standard for guest service.\"\n \nThe company first debuted Starlink on its planes in February on a flight from Honolulu to Long Beach, California. It first struck a deal with Starlink in 2022 and has now completed instal", "id": 1222396, "language": null, "link": "https://mobile.slashdot.org/story/24/09/27/0039207/starlink-is-now-available-on-all-hawaiian-airlines-airbus-flights?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Starlink Is Now Available on All Hawaiian Airlines Airbus Flights", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T04:17:00.580461+00:00", "description": "An anonymous reader quotes a report from PCWorld, written by Michael Crider: The latest perpetrator of questionable AI branding? HP. The company is introducing \"Print AI,\" what it calls the \"industry's first intelligent print experience for home, office, and large format printing.\" What does that mean? It's essentially a new beta software driver package for some HP printers. According to the press release, it can deliver \"Perfect Output\" -- capital P capital O -- a branded tool that reformats the contents of a page in order to more ideally fit it onto physical paper.\n \nDespite my skeptical tone, this is actually a pretty cool idea. \"Perfect Output can detect unwanted content like ads and web text, printing only the desired text and images, saving time, paper, and ink.\" That's neat! If the web page you're printing doesn't offer a built-in print format, the software will make one for you. It'll also serve to better organize printed spreadsheets and images, too. But I don't see anything ", "id": 1221813, "language": null, "link": "https://hardware.slashdot.org/story/24/09/27/0030239/hp-is-adding-ai-to-its-printers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "HP Is Adding AI To Its Printers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T02:07:41.571809+00:00", "description": "Ars Technica's Dan Goodin reports: Last week, NIST released its second public draft of SP 800-63-4, the latest version of its Digital Identity Guidelines. At roughly 35,000 words and filled with jargon and bureaucratic terms, the document is nearly impossible to read all the way through and just as hard to understand fully. It sets both the technical requirements and recommended best practices for determining the validity of methods used to authenticate digital identities online. Organizations that interact with the federal government online are required to be in compliance. A section devoted to passwords injects a large helping of badly needed common sense practices that challenge common policies. An example: The new rules bar the requirement that end users periodically change their passwords. This requirement came into being decades ago when password security was poorly understood, and it was common for people to choose common names, dictionary words, and other secrets that were eas", "id": 1221488, "language": null, "link": "https://yro.slashdot.org/story/24/09/27/0021240/nist-proposes-barring-some-of-the-most-nonsensical-password-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "NIST Proposes Barring Some of the Most Nonsensical Password Rules", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T01:03:11.900512+00:00", "description": "Mozilla has been hit with a complaint by EU privacy group noyb, accusing it of violating GDPR by tracking Firefox users by default without their consent. TechCrunch reports: Mozilla calls the feature at issue \"Privacy Preserving Attribution\" (PPA). But noyb argues this is misdirection. And if EU privacy regulators agree with the complaint the Firefox-maker could be slapped with orders to change tack -- or even face a penalty (the GDPR allows for fines of up to 4% of global revenue). \"Contrary to its reassuring name, this technology allows Firefox to track user behaviour on websites,\" noyb wrote in a press release. \"In essence, the browser is now controlling the tracking, rather than individual websites. While this might be an improvement compared to even more invasive cookie tracking, the company never asked its users if they wanted to enable it. Instead, Mozilla decided to turn it on by default once people installed a recent software update. This is particularly worrying because Mozi", "id": 1221269, "language": null, "link": "https://tech.slashdot.org/story/24/09/27/002223/mozilla-hit-with-privacy-complaint-in-eu-over-firefox-tracking-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Mozilla Hit With Privacy Complaint In EU Over Firefox Tracking Tech", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-27T01:03:11.671267+00:00", "description": "\"Dozens of Fortune 100 organizations\" have unknowingly hired North Korean IT workers using fake identities, generating revenue for the North Korean government while potentially compromising tech firms, according to Google's Mandiant unit. \"In a report published Monday [...], researchers describe a common scheme orchestrated by the group it tracks as UNC5267, which has been active since 2018,\" reports The Record. \"In most cases, the IT workers 'consist of individuals sent by the North Korean government to live primarily in China and Russia, with smaller numbers in Africa and Southeast Asia.'\" From the report: The remote workers \"often gain elevated access to modify code and administer network systems,\" Mandiant found, warning of the downstream effects of allowing malicious actors into a company's inner sanctum. [...] Using stolen identities or fictitious ones, the actors are generally hired as remote contractors. Mandiant has seen the workers hired in a variety of complex roles across ", "id": 1221268, "language": null, "link": "https://it.slashdot.org/story/24/09/27/0011212/dozens-of-fortune-100-companies-have-unwittingly-hired-north-korean-it-workers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Dozens of Fortune 100 Companies Have Unwittingly Hired North Korean IT Workers", "vote": 0}]