[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T23:40:29.981141+00:00",
        "description": "The Washington Post reports:\n\nYears before the internet was created and the first smartphones buzzed to life, an educational platform called PLATO offered a glimpse of the digital world to come. Launched in 1960 at the University of Illinois at Urbana-Champaign [UIUC], it was the first generalized, computer-based instructional system, and grew into a home for early message boards, emails, chatrooms, instant messaging and multiplayer video games.\n\n The platform's developer, Donald Bitzer, was a handball-playing, magic-loving electrical engineer who opened his computer lab to practically everyone, welcoming contributions from Illinois undergrads as well as teenagers who were still in high school. Dr. Bitzer, who died Dec. 10 at age 90, spent more than two decades working on PLATO, managing its growth and development while also pioneering digital technologies that included the plasma display panel, a forerunner of the ultrathin screens used on today's TVs and tablets. \"All of the featur",
        "id": 1712224,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/14/2128209/donald-bitzer-a-pioneer-of-cyberspace-and-plasma-screens-dies-at-90?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Donald Bitzer, a Pioneer of Cyberspace and Plasma Screens, Dies At 90",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T23:40:29.897382+00:00",
        "description": "An anonymous reader shared this report from The Verge:\n\nWaymo's driverless vehicles can detect emergency vehicles, know how to respond to hand signals for traffic cops, and can be disabled manually when something goes wrong, according to an independent review of the company's first responder protocols. As such, the Alphabet company's first responder protocols passed an independent review conducted by T&uuml;v S&uuml;d, a German tech inspection company. The firm's assessment found that Waymo's First Responder Program \"meets industry standards\" for responding to emergency situations, which is in line with the best practices set out in the Society of Automotive Engineers (SAE)... \n\nWaymo is staking out the position that it goes beyond what's required to prove that its vehicles are trustworthy... The company has also publicly released its own guide for first responders who are responding to incidents involving autonomous vehicles. The 32-page document includes a toll free number for gett",
        "id": 1712223,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/14/0640258/waymo-robotaxis-pass-emergency-vehicle-review-but-one-got-stuck-in-a-roundabout?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Waymo Robotaxis Pass Emergency Vehicle Review.  But One Got Stuck in a Roundabout",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T22:36:19.666419+00:00",
        "description": "\"Single-board computer maker Raspberry Pi is updating its cute little computer-meet-keyboard device with better specifications...\" reports TechCrunch. \n\nThey call the new $90 Raspberry Pi 500 \"not as intimidating\" because \"when you look at the Raspberry Pi 500, you can't see any chipsets or printed circuit board... The idea with the Raspberry Pi 500 is that you can plug in a mouse and display, and you're ready to hit the ground running.\"\nWhen it comes to specifications, the Raspberry Pi 500 features a 64-bit quad-core Arm processor (the same one as the Raspberry Pi 5 uses); 8GB of RAM; 2 micro-HDMI ports, with support for up to two 4K displays; 3 traditional USB ports (but no USB-C besides the power port unfortunately); a Gigabit Ethernet port; and a 40-pin expansion header. It comes with native Wi-Fi and Bluetooth support. \n\nMore importantly, this device brings us back Raspberry Pi's roots. Raspberry Pi computers were originally intended for educational use cases... The Raspberry Pi",
        "id": 1711969,
        "language": null,
        "link": "https://build.slashdot.org/story/24/12/14/2044250/raspberry-pi-announces-new-90-computer-in-a-keyboard-plus-raspberry-pi-monitor?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Raspberry Pi Announces New $90 Computer in a Keyboard, Plus 'Raspberry Pi Monitor'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T21:20:25.926430+00:00",
        "description": "\"Proposals for a tunnel connecting the U.K. to the U.S. underneath the Atlantic Ocean have resurfaced,\" reports Newsweek, \"but with a price tag of almost $20 trillion, the project is a big ask.\"\n\n\n\nWith the two global cities being over 3,000 miles apart, construction would take several years &mdash; the 23.5-mile Channel Tunnel linking England and France took six years to construct &mdash; and require significant investment. Estimates over the cost have reached as high as &pound;15.5 trillion, the equivalent of $19.8 trillion. \n\nHowever, developments in vacuum tube technology have made the concept more viable. By creating a vacuum within the tunnel and using pressurized vehicles, trains traveling along the structure could theoretically reach speeds of more than 3,000 mph, making the journey between London and New York barely an hour long. This is because trains would not face any air resistance within the tunnel, allowing them to reach higher speeds than unconventional trains. This d",
        "id": 1711680,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/14/1945209/could-an-undersea-hyperloop-train-tunnel-offer-one-hour-trips-from-london-to-new-york?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Could an Undersea Hyperloop Train Tunnel Offer One-Hour Trips From London to New York?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T20:15:22.048553+00:00",
        "description": "The U.S. wants to limit China's access to advanced AI chips, reports the Wall Street Journal, with new rules to restrict sales in parts of the world. \n\n\"The rules are aimed at China, but they threaten to create conflict between the U.S. and nations that may not want their purchases of chips micromanaged from Washington.\n\n\nThe latest round of curbs could come this month... Among the restrictions, the administration aims to introduce caps on shipments of AI chips to certain countries for use in large computing facilities, people familiar with the plans said. One grouping of countries &mdash; close U.S. allies &mdash; would be unrestricted, the people said, while another tier of countries would face limits on the number of chips that can go into data centers used for AI... The purchasing caps primarily apply to regions such as Southeast Asia and the Middle East, the people said... \n\nThe administration recently sent letters to major chip-makers including Taiwan Semiconductor Manufacturin",
        "id": 1711414,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/14/1921226/america-prepares-new-ai-chip-restrictions-to-close-chinas-backdoor-access?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America Prepares New AI Chip Restrictions to Close China's Backdoor Access",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T19:10:24.886028+00:00",
        "description": "America's telecom-regulating Federal Communications Commission \"has opened up the entire 6 GHz frequency band to very low-power devices,\" reports the Register, \"alongside other unlicensed applications such as Wi-Fi kits.\"\n\n\n\nThe FCC said it has adopted extra rules to allow very low-power device operation across the entire 1,200 MHz of the 6 GHz band, from 5.925 to 7.125 GHz, within the US. The agency had already opened up 850 MHz of the band to small mobile devices a year ago, and has now decided to open up the remaining 350 MHz. \n\nIt hopes that this will give a shot in the arm to an ecosystem of short-range devices such as wearables, healthcare monitors, short-range mobile hotspots, and in-car devices that will be able to make use of this spectrum without the need of a license. These applications often call for low power transmission across short distances, but at very high connection speeds, the FCC says &mdash; otherwise, existing technologies like Bluetooth could suffice. \"This 1",
        "id": 1711195,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/14/0548225/americas-fcc-opens-6-ghz-band-to-unlicensed-very-low-power-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's FCC Opens 6-GHz Band to Unlicensed Very-Low-Power Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T18:05:25.074193+00:00",
        "description": "\"The Chinese government has long subsidized carmakers with the goal of becoming a major auto exporter,\" notes the New York Times. But this week they reported on dozens of dealerships around Mexico that are now selling China-made electric vehicles, saying it could be \"a potentially grave threat to the North American auto industry.\" \n\nOne employee said their dealership \"was selling cars as fast as they arrived from China,\" including \"a small but capable four-door electric compact that costs about $18,000.\"\n\nChinese carmakers are effectively barred from the United States by tariffs that double the sticker price of vehicles imported from China, and they are not yet manufacturing significant numbers of vehicles in Mexico that could be exported across the border. But their ambition to expand overseas is on vivid display in Mexico and across Latin America, Asia, Europe and Africa. Ads for Chinese brands are in airports and soccer stadiums and loom above Mexico City streets on large billboar",
        "id": 1710897,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/14/0534213/chinese-electric-cars-are-already-surging-in-popularity-in-mexico-europe-asia-and-africa?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Chinese Electric Cars are Already Surging in Popularity in Mexico, Europe, Asia, and Africa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T17:00:48.794264+00:00",
        "description": "An anonymous reader quotes a report from MacRumors: Apple will begin making AirPods in India for the first time early next year, reports Bloomberg. Foxconn will make the wireless earphones at a factory near Hyderabad in Telangana state, beginning around Q1 2025. The factory has reportedly been making AirPods on a trial basis, with manufacturing set to ramp up quickly after production begins. It will make AirPods only the second major Apple product to be assembled in India after the iPhone.\n \nThe decision to set up production in India was requested by Apple back in 2023, according to a previous report. Foxconn officials apparently debated internally for months about whether to assemble AirPods due to the relatively low profit margins, but ultimately decided to go ahead with it to \"reinforce engagement\" with Apple. Indian Prime Minister Narendra Modi's government offers financial incentives to companies that produce wireless earphones and smartwatches locally, which influenced Apple's ",
        "id": 1710642,
        "language": null,
        "link": "https://apple.slashdot.org/story/24/12/14/016212/airpods-to-be-made-in-india-for-the-first-time-next-year?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AirPods To Be Made In India For the First Time Next Year",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T15:54:49.643689+00:00",
        "description": "NASA believes Ingenuity's navigation system was responsible for its crash on the surface of Mars. Engineers determined that the helicopter's navigation system struggled to track features over smooth terrain, leading to a hard landing and structural failure. Universe Today reports: Now, almost a year after the incident, a team of engineers from NASA's Jet Propulsion Laboratory have been analyzing the data. Their findings will be published in the next few weeks however the team of engineers assert it was harder than expected to complete an accident investigation from 160 million kilometers. The faults lie in the navigation system that was designed to visually track surface features using a camera pointed at the round. The system worked during early flights over more textured terrain but as Ingenuity moved over the Jezero Crater, it began operating over featureless sand ripples.\n \nThe navigation system was designed to provide estimates of the helicopter's velocity, chiefly to enable it ",
        "id": 1710399,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/14/0051211/nasa-thinks-it-knows-why-ingenuity-crashed-on-mars?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA Thinks It Knows Why Ingenuity Crashed On Mars",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T13:45:42.228552+00:00",
        "description": "BrianFagioli shares a report from BetaNews: As we close out 2024, we Linux enthusiasts are once again looking ahead to what the future holds. While Linux has long been the unsung hero of technology, powering servers, supercomputers, and the cloud, it's also a dominant force in the consumer space, even if many don't realize it. With Android leading the way as the most widely used Linux-based operating system, 2025 is shaping up to be another landmark year for the open source world Here are the predictions mentioned in the article:\n \n- Linux will continue to dominate the enterprise sector\n- Linux will further solidify its role in powering cloud infrastructure, with major providers like AWS and Google Cloud relying on it.\n- Gaming on Linux is set to grow in 2025 \n- Linux will play a major role in AI development \n- Linux's appeal to developers and tech enthusiasts will remain strong\n- The open source movement will grow stronger\n \nWhat additional predictions do you have for Linux in 2025?",
        "id": 1709808,
        "language": null,
        "link": "https://linux.slashdot.org/story/24/12/14/0058244/linux-predictions-for-2025?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Linux Predictions For 2025",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T10:32:07.229315+00:00",
        "description": "25 years ago today, the late, great Suck.com played a prank on Slashdot. Their daily column of pop-culture criticism was replaced by... Suckdot, a parody site satirically filed with Slashdot-style headlines like \"Linux Possibly Defamed Somewhere.\"\n\nRabidZelot was one of a bunch to report: \"In Richmond, California, this afternoon, this dude said something bad about Linux at the Hilltop Mall near the fountains right after the first showing of Phantom Menace let out. He was last seen heading towards Sears and has a 'Where Do You Want to Go Today?' T-shirt and brown hair. Let us know when you spot him.\" \n\n( Read More... | 0 of 72873 comments)\n \nThere's more Slashdot-style news blurbs like \"Red Hat Reports Income\". (In which Red Hat founder Bob Young finds a quarter on the way to the conference room, and adds it to the company's balance sheet...) Its list of user-submitted \"Ask Suckdot\" questions include geek-mocking topics like \"Is Overclocking Worth That Burning Smell?\" and \"HOW DO I TU",
        "id": 1708773,
        "language": null,
        "link": "https://meta.slashdot.org/story/24/12/13/0026213/25-years-ago-today-slashdot-parodied-by-suckcom?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "25 Years Ago Today:  Slashdot Parodied by Suck.com",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T10:32:06.999160+00:00",
        "description": "An anonymous reader shared this report from the SF Standard:\n\n\n\nSan Francisco police found Open AI whistleblower Suchir Balaji, 26, dead in his Lower Haight apartment November 26, SiliconValley.com reported on Friday. Police said there is \"no evidence of foul play. \"The manner of death has been determined to be suicide,\" David Serrano Sewell, director of the office of the city's chief medical examiner, told The Standard by email. \n\nBalaji, a former researcher for the company, accused OpenAI of using copyrighted material to train ChatGPT shortly after he quit the company in August. The New York Times profiled Balaji in a story focused on his whistleblowing in October. Multiple lawsuits against Open AI are expected to present information Balaji unearthed as key evidence. \n\nMore details from TechCrunch:\n\nAfter nearly four years working at OpenAI, Balaji quit the company when he realized the technology would bring more harm than good to society, he told The New York Times. Balaji's main ",
        "id": 1708772,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/14/0518203/police-report-openai-whistleblower-committed-suicide-in-november?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Police Report OpenAI Whistleblower Committed Suicide in November",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T04:21:12.871693+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: A sophisticated and ongoing supply-chain attack operating for the past year has been stealing sensitive login credentials from both malicious and benevolent security personnel by infecting them with Trojanized versions of open source software from GitHub and NPM, researchers said. The campaign, first reported three weeks ago by security firm Checkmarx and again on Friday by Datadog Security Labs, uses multiple avenues to infect the devices of researchers in security and other technical fields. One is through packages that have been available on open source repositories for over a year. They install a professionally developed backdoor that takes pains to conceal its presence. The unknown threat actors behind the campaign have also employed spear phishing that targets thousands of researchers who publish papers on the arXiv platform.\n \nThe objectives of the threat actors are also multifaceted. One is the collection of SSH private k",
        "id": 1708314,
        "language": null,
        "link": "https://it.slashdot.org/story/24/12/13/2220211/yearlong-supply-chain-attack-targeting-security-pros-steals-390000-credentials?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Yearlong Supply-Chain Attack Targeting Security Pros Steals 390,000 Credentials",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T03:16:33.864033+00:00",
        "description": "Meta is asking California Attorney General Rob Bonta to block OpenAI's planned transition from a non-profit to for-profit entity. From a report: In a letter sent to Bonta's office this week, Meta says that OpenAI \"should not be allowed to flout the law by taking and reappropriating assets it built as a charity and using them for potentially enormous private gains.\" \n\nThe letter goes so far as to say that Meta believes Elon Musk is \"qualified and well positioned to represent the interests of Californians in this matter.\" Meta supporting Musk's fight against OpenAI is notable given that Musk and Mark Zuckerberg were talking about literally fighting in a cage match just last year. \n\nOpenAI started as a non-profit but stumbled into commercial success with ChatGPT, which now makes billions of dollars a year in revenue. CEO Sam Altman has been clear that the company needs to shed its non-profit status to become more attractive to investors and continuing funding its ambitions.<p><div class",
        "id": 1708190,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/14/0238223/meta-asks-the-us-government-to-block-openais-switch-to-a-for-profit?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Asks the US Government To Block OpenAI's Switch To a For-Profit",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T02:12:53.522884+00:00",
        "description": "MojoKid writes: Today's release and review launch of the new Intel Arc B580 marks a second-gen effort from the company, with a fully refreshed Intel Xe2 graphics architecture, aka Battlemage, that promises big gains in performance and efficiency. Comparing Arc B580 to its Arc Alchemist ancestors, you can see that it's somewhat of a smaller GPU. It has fewer of nearly everything, and yet its performance specifications don't look too far off. A lot of this comes down to massive architectural improvements with an eye toward efficiency and making better use of the resources that were already there.\n \nWith 12GB of GDDR6 memory at 19Gbps, Arc B580 delivers performance that typically beats a GeForce RTX 4060 and even an RTX 4060 Ti in spots, especially when its extra 4GB of frame buffer memory comes into play. All in, Intel's latest Arc graphics offering is a strong contender in the $250 graphics card segment, and it should sell well in the months ahead, based on its value proposition, impr",
        "id": 1708026,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/13/2151259/intel-arc-b580-battlemage-tested-250-graphics-cards-are-worthy-once-again?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel Arc B580 Battlemage Tested: $250 Graphics Cards Are Worthy Once Again",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T02:12:53.198815+00:00",
        "description": "Tucked away in a blog post about Google's quantum computing chip, Willow, Google Quantum AI founder Hartmut Neven wrote that the chip was so \"mind-boggling\" fast that it seemed to borrow computational power from other universes. According to Neven, the chip's performance suggests the existence of parallel universes, writing, \"We live in a multiverse.\" TechCrunch reports: Here's the passage: \"Willow's performance on this benchmark is astonishing: It performed a computation in under five minutes that would take one of today's fastest supercomputers 1025 or 10 septillion years. If you want to write it out, it's 10,000,000,000,000,000,000,000,000 years. This mind-boggling number exceeds known timescales in physics and vastly exceeds the age of the universe. It lends credence to the notion that quantum computation occurs in many parallel universes, in line with the idea that we live in a multiverse, a prediction first made by David Deutsch.\"\n \nThis drop-the-mic moment on the nature of rea",
        "id": 1708025,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/13/225210/google-says-its-new-quantum-chip-indicates-that-multiple-universes-exist?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Says Its New Quantum Chip Indicates That Multiple Universes Exist",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T01:05:30.000383+00:00",
        "description": "Nvidia is hosting its first LAN party in over a decade to celebrate the debut of the RTX 50 series. It'll occur at CES 2025 in January and feature a 50-hour gaming marathon with tournaments, prizes, and global remote sessions. Tom's Hardware reports: The LAN party (dubbed GeForce LAN 50) will start on January 4 at 4:30 pm PT and end right before Nvidia CES Jensen Huang gives his opening speech at the CES event in Las Vegas on January 6 at 6:30 pm PT. The main LAN event will occur in Las Vegas, while remote sessions will take place in Beijing, Berlin, and Taipei. The event will purportedly host up to 400 gamers, requiring a $125 refundable deposit to sign up. The 400 lucky people who manage to make the list will not include content creators who might be invited directly to the LAN party from Nvidia.\n \nAs mentioned, the LAN party will be a full-blown 50-hour gaming marathon with in-game and LAN contests, tournaments, and prize raffles. For everyone who won't be able to get into the LAN",
        "id": 1707856,
        "language": null,
        "link": "https://games.slashdot.org/story/24/12/13/2139233/nvidia-revives-lan-party-after-13-years-to-celebrate-rtx-50-series-gpu-launch?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nvidia Revives LAN Party After 13 Years To Celebrate RTX 50-Series GPU Launch",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T01:05:29.856879+00:00",
        "description": "An anonymous reader quotes a report from Engadget: The United States Postal Service unveiled a plan to buy a fleet of all-electric mail trucks for its mail carriers back in 2022, of which 3,000 were supposed to be delivered by now. Unfortunately, those plans aren't even close to fruition. The Washington Post reported that defense contractor Oshkosh has only delivered 93 vehicles so far. [...]\n \nThe Washington Post obtained nearly 21,000 government and internal company records and spoke with 20 people familiar with the trucks' manufacturing and design process. Its reporting shows that Oshkosh ran into significant manufacturing delays of the electric NGDVs that caused lower than expected delivery numbers. Some of the anonymous sources said that engineers struggled to calibrate the mail trucks' airbags, and the vehicles' body and internal components are unable to contain water leaks to an alarming degree. The turnaround time for building these new mail trucks is also very slow. The Post",
        "id": 1707855,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/13/2144254/postal-services-plan-to-electrify-mail-trucks-falling-far-short-of-its-goal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Postal Service's Plan To Electrify Mail Trucks Falling Far Short of Its Goal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T00:01:01.895393+00:00",
        "description": "Tumblr is introducing a new Community feature similar to subreddits: in-app groups organized by topic or interest. \"Topics include things like film photography, marine biology, LGBTQ, and video games, and each topic has its own landing page where posts shared with the community populate,\" reports The Verge. From the report: Many of the features mirror Reddit, like a count of how many members are online, moderators, and community guidelines. Posts shared to communities also get a new comments section that's only visible within the group. Communities have the option to be public or private. [...] Communities is available on the web, iOS, and Android.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Tumblr+Adds+Reddit-Like+'Communities'%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F13%2F2224202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a clas",
        "id": 1707608,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/13/2224202/tumblr-adds-reddit-like-communities?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tumblr Adds Reddit-Like 'Communities'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-14T00:01:01.608779+00:00",
        "description": "Google's NotebookLM and its podcast-like Audio Overviews are being updated with a new feature that allows listeners to interact with the AI \"hosts.\" Google describes how this feature works in a blog post. The Verge reports: In addition to the interactive Audio Overviews, Google is introducing a new interface for NotebookLM that organizes things into three areas: a \"sources\" panel for your information, a \"chat\" panel to talk with an AI chatbot about the sources, and a \"studio\" panel that lets you make things like Audio Overviews and Study Guides. I think it looks nice.\n \nGoogle is announcing a NotebookLM subscription, too: NotebookLM Plus. The subscription will give you \"five times more Audio Overviews, notebooks, and sources per notebook,\" let you \"customize the style and tone of your notebook responses,\" let you make shared team notebooks, and will offer \"additional privacy and security,\" Google says. The subscription is available today for businesses, schools and universities, and ",
        "id": 1707607,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/13/2129249/googles-notebooklm-ai-podcast-hosts-can-now-talk-to-you-too?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's NotebookLM AI Podcast Hosts Can Now Talk To You, Too",
        "vote": 0
    }
]