[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-29T17:30:02+00:00", "description": "Clock Tower officially arrives for the first time outside of Japan with Clock Tower Rewind. WayForward has joined up with Limited Run Games has released the original Super Famicom port from 1995 in addition to a remastered version of Clock Tower: The First Fear. \n\nClock Tower Rewind functions as a point and click adventure game, with plenty of pixel hunting and vague puzzle solutions. The convenience features added to Clock Tower Rewind hardly make it more accessible to newer players, but this version does have a rewind feature and save states at the least. \n\nIf you’re a fan of old-school survival horror and want to see one of the seminal games of the genre, Clock Tower Rewind offers a hauntingly atmospheric experience that delivers with its scares and tone.", "id": 1409816, "language": null, "link": "https://www.youtube.com/watch?v=5wifLUOtkJM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/5wifLUOtkJM/hqdefault.jpg", "title": "Clock Tower Rewind Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-29T15:30:11+00:00", "description": "Ghost of Tsushima ranks as one of the best games we’ve played in recent memory, so it goes without saying that anticipation for the announcement of a sequel had been high for some time. \n\nEarlier this year, we did get that announcement, with developer Sucker Punch confirming that the sequel, Ghost of Yotei, is going to launch next year and bring players an entirely new setting to explore, and a new protagonist to play as. \n\nGiven the strong story that was told in the first game and that fan following that Jin has amassed, you can understand why some would have wanted a direct sequel, but ultimately, we feel Sucker Punch has made the best possible choice with Ghost of Yotei in choosing not to develop it as a direct sequel.", "id": 1408779, "language": null, "link": "https://www.youtube.com/watch?v=N7DILoxGVss", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/N7DILoxGVss/hqdefault.jpg", "title": "We Will Miss Jin Sakai, But Ghost of Yōtei's New Open World And Protagonist Are An Excellent Choice", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-29T13:30:32+00:00", "description": "The PlayStation 5 is an absolute powerhouse, and while the graphical differences might not seem that much on a surface level when compared to the PS4, it is definitely a significant step up from the previous generation. \n\nA faster CPU and close-knit high-speed SSD have allowed developers to flex their creative muscles even further and bring their wildest imaginations to your TV screen thanks to the improved rendering capabilities of the console. \n\nFans have gotten the opportunity to experience some really great looking games on the PS5, from horror to open-worlds and much more. With this video, we will be taking a look at 15 such games that well and truly resemble the best of PlayStation 5 from a graphical standpoint.", "id": 1407805, "language": null, "link": "https://www.youtube.com/watch?v=cm5IYzp4Tls", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/cm5IYzp4Tls/hqdefault.jpg", "title": "Top 15 PS5 Games With ABSOLUTELY STUNNING GRAPHICS You Need To Check Out", "vote": 0}]