[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-14T19:30:04+00:00", "description": "Incoming on July 19th to PlayStation 5 and Xbox Series X|S, EA Sports College Football 25 is EA’s first College Football focused title since 2014’s NCAA Football 14. \n\nNow, College Football is a big deal in North America, attracting hordes of excited fans in their droves, hundreds of thousands creating an electric atmosphere that isn’t replicated anywhere else. \n\nEA Tiburon are putting this unique gameday atmosphere front and center, with unique rivalry rituals and traditions supporting the excitement. Some new gameplay features, such as the suite of innovative mechanics dubbed CampusIQ alongside returning franchise and career modes mean even those on the fence about football games akin to Madden might find something to love here.", "id": 715185, "language": null, "link": "https://www.youtube.com/watch?v=kPwl9ihwPr8", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/kPwl9ihwPr8/hqdefault.jpg", "title": "Why EA Sports College Football 25 Is Shaping Up To Be One of the Biggest Games of 2024", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-14T15:30:05+00:00", "description": "When anyone thinks of a Souls-like, FromSoftware's Dark Souls series comes to mind. When the recommendations come pouring in, it's often Dark Souls 3 that comes to mind (though the first game should immediately be next). Over eight years since its launch, the finale still holds up, even in this post-Elden Ring world.\n\nMaybe it's the fact that it celebrates everything about the franchise till that point, paying homage to famous characters, locations and bosses. Perhaps the fluid combat and movement, alongside the addition of Arts for weapons and shields, continue to draw players in. It could also be a well-designed, well-paced, excellent Souls-like, not to mention some of the best-designed bosses in gaming history.\n\nWhatever the reason, Dark Souls 3 continues to appeal to generations of players, and thanks to an active mod community, fans will never run out of ways to die.", "id": 713493, "language": null, "link": "https://www.youtube.com/watch?v=OumpTy6yGAs", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/OumpTy6yGAs/hqdefault.jpg", "title": "8 Years Later, Dark Souls 3 Is A TOTALLY DIFFERENT Masterpiece", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-14T09:45:00+00:00", "description": "While E3 is no longer the center stage of new game reveals as it once used to be, most major publishers have taken the initiative to host similar events to showcase whatever they have in the works. Over the last week, we have had showcase events from several companies which have shed light on both previously announced titles and brand-new IPs. \n\nWe have received release date reveals, extensive gameplay trailers, and announcements for a bunch of great games that are set to come out in the near future. To that end, we present the top 30 of the biggest game announcements that happened this week. So, if you missed out on anything, this video should serve as a great reminder of everything important that you need to catch up on.", "id": 711374, "language": null, "link": "https://www.youtube.com/watch?v=8krYjZQXM00", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/8krYjZQXM00/hqdefault.jpg", "title": "Top 30 BIGGEST Game Announcements That Happened This Week", "user": null, "vote": 0}]