[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T17:12:26+00:00", "description": "\n<p>Tripp Mickle, writing for The New York Times:</p>\n\n<blockquote>\n  <p>Mr. Ive and Mr. Altman met for dinner several more times before\nagreeing to build a product, with LoveFrom leading the design.\nThey have raised money privately, with Mr. Ive and Emerson\nCollective, Ms. Powell Jobs’s company, contributing, and could\nraise up to $1 billion in start-up funding by the end of the year\nfrom tech investors.</p>\n\n<p>In February, Mr. Ive found office space for the company. They\nspent $60 million on a 32,000-square-foot building called the\nLittle Fox Theater that backs up to the LoveFrom courtyard. He has\nhired about 10 employees, including Tang Tan, who oversaw iPhone\nproduct development, and Evans Hankey, who succeeded Mr. Ive in\nleading design at Apple.</p>\n\n<p>On a Friday morning in late June, Mr. Tan and Ms. Hankey could be\nseen wheeling chairs between the Little Fox Theater and the nearby\nLoveFrom studio. The chairs were topped by papers and cardboard\nboxes with the earliest ideas fo", "id": 1197181, "language": null, "link": "https://www.nytimes.com/2024/09/21/technology/jony-ive-apple-lovefrom.html?smid=nytcore-ios-share&referringSource=articleShare&ngrp=mnp&pvid=2D87E4C1-1429-49ED-9B2A-558595007065", "manual_status_code": 0, "page_rating": 29, "page_rating_contents": 90, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 489, "source_url": "https://daringfireball.com/feeds/main", "status_code": 0, "tags": [], "thumbnail": null, "title": "Tripp Mickle Profiles Jony Ive and LoveFrom, Confirms OpenAI Partnership for Device", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T16:47:13+00:00", "description": "\n<p>Zac Hall, with a public service message at 9to5Mac:</p>\n\n<blockquote>\n  <p>For now, the bug is triggered when someone replies to a shared\nwatch face in a thread on Messages in iOS 18. The <a href=\"https://support.apple.com/en-us/104974\">threaded\nresponses feature</a> allows you to have an inline\nconversation about a specific message that may have been sent\nearlier in the chat.</p>\n\n<p>If this happens, Messages will repeatedly crash if the user tries\nto open the conversation in the app. Sending or responding to\nconversations from other chats directly in Messages is also not\neasily possible as the app may repeatedly crash.</p>\n\n<p>Once triggered, the bug affects both users. It appears to require\nresponding to the shared watch face from iOS 18. Replying from iOS\n18.1 will not trigger the bug.</p>\n\n<p>However, if the user responds in a thread to the shared watch\nface, Messages will crash on iOS 18.1 beta, iPadOS 18.1 beta, and\nmacOS 15.1 beta as well.</p>\n</blockquote>\n\n<p>I suspect w", "id": 1197182, "language": null, "link": "https://9to5mac.com/2024/09/18/ios-18-messages-app-crash", "manual_status_code": 0, "page_rating": 29, "page_rating_contents": 90, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 489, "source_url": "https://daringfireball.com/feeds/main", "status_code": 0, "tags": [], "thumbnail": null, "title": "iOS 18 Messages Bug, Triggered When Sharing an Apple Watch Face, Causes Crash and Data Loss", "vote": 0}]