[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T23:26:56.217726+00:00", "description": "Amazon, Meta, and Tesla were named by the International Trade Union Confederation (ITUC) as some of the worst corporate underminers of democracy . These companies were accused of union busting, monopolizing media and technology, violating human rights, contributing to climate change, and fostering political movements that threaten democratic institutions. The full list of \"corporate underminers of democracy for 2024\" is Amazon, Blackstone Group, ExxonMobil, Glencore, Meta, Tesla and the Vanguard Group. The Register reports: The International Trade Union Confederation (ITUC) today published a list of seven companies it said were \"emblematic\" of the ways large international corporations have begun tossing their weight around to influence global affairs. Those businesses, ITUC noted, violate trade union and alleged human rights, monopolize media and technology, exacerbate the climate catastrophe and try to privatize public services in a way that \"protects and expands [their] own profits ", "id": 1199090, "language": null, "link": "https://news.slashdot.org/story/24/09/23/2054216/amazon-tesla-meta-considered-harmful-to-democracy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon, Tesla, Meta Considered Harmful To Democracy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T22:21:57.324611+00:00", "description": "joshuark shares a report: Microsoft has officially announced that Windows Server Update Services (WSUS) is now deprecated, but plans to maintain current functionality and continue publishing updates through the channel. This move isn't surprising, as Microsoft first listed WSUS as one of the \"features removed or no longer developed starting with Windows Server 2025\" on August 13. In June, the company also revealed that it would also soon deprecate WSUS driver synchronization. \n\nWhile new features and development for WSUS will cease, Microsoft said today that it plans to continue supporting the service's existing functionality and updates, which will still be distributed, even after deprecation. \"Specifically, this means that we are no longer investing in new capabilities, nor are we accepting new feature requests for WSUS,\" Microsoft's Nir Froimovici said on Friday. \"However, we are preserving current functionality and will continue to publish updates through the WSUS channel. We will", "id": 1198808, "language": null, "link": "https://tech.slashdot.org/story/24/09/23/1957225/microsoft-ends-development-of-windows-server-update-services?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Ends Development of Windows Server Update Services", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T22:21:57.222497+00:00", "description": "An anonymous reader quotes a report from TechCrunch: Cloudflare announced plans on Monday to launch a marketplace in the next year where website owners can sell AI model providers access to scrape their site's content. The marketplace is the final step of Cloudflare CEO Matthew Prince's larger plan to give publishers greater control over how and when AI bots scrape their websites. \"If you don't compensate creators one way or another, then they stop creating, and that's the bit which has to get solved,\" said Prince in an interview with TechCrunch.\n \nAs the first step in its new plan, on Monday, Cloudflare launched free observability tools for customers, called AI Audit. Website owners will get a dashboard to view analytics on why, when, and how often AI models are crawling their sites for information. Cloudflare will also let customers block AI bots from their sites with the click of a button. Website owners can block all web scrapers using AI Audit, or let certain web scrapers through", "id": 1198807, "language": null, "link": "https://tech.slashdot.org/story/24/09/23/2038215/cloudflares-new-marketplace-will-let-websites-charge-ai-bots-for-scraping?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Cloudflare's New Marketplace Will Let Websites Charge AI Bots For Scraping", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T21:16:56.401008+00:00", "description": "Customers of Kaspersky antivirus in the United States found out in the last few days that their cybersecurity software was automatically replaced with a new one called UltraAV, according to several customers. And while Kaspersky said earlier this month that its U.S. customers would be transitioned to UltraAV, many of its customers said they had no idea this was going to happen and that it would automatically be forced upon them. From a report: \"Woke up to Kasperky [sic] completely gone from my system with Ultra AV and Ultra VPN freshly installed (not by me, just automatically while I slept),\" a user on Reddit wrote. Others reported having the same experience in the same Reddit thread, as well as in other threads. A reseller, who until recently sold Kaspersky products prior to the recent sales ban, told TechCrunch that he was left \"annoyed\" by the move to automatically remove Kaspersky software and replace it with an entirely different antivirus. A former senior U.S. government cyberse", "id": 1198465, "language": null, "link": "https://tech.slashdot.org/story/24/09/23/1949250/some-kaspersky-customers-receive-surprise-forced-update-to-new-antivirus-software?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Some Kaspersky Customers Receive Surprise Forced-Update To New Antivirus Software", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T20:12:08.721785+00:00", "description": "Industrial civilisation is close to breaching a seventh planetary boundary, and may already have crossed it, according to scientists who have compiled the latest report on the state of the world's life-support systems. From a report: \"Ocean acidification is approaching a critical threshold,\" particularly in higher-latitude regions, says the latest report on planetary boundaries. \"The growing acidification poses an increasing threat to marine ecosystems.\" The report, from the Potsdam Institute for Climate Impact Research (PIK), builds on years of research showing there are nine systems and processes -- the planetary boundaries -- that contribute to the stability of the planet's life-support functions. \n\nThresholds beyond which they can no longer properly function have already been breached in six. Climate change, the introduction of novel entities, change in biosphere integrity and modification of biogeochemical flows are judged to be in high-risk zones, while planetary boundaries are ", "id": 1198103, "language": null, "link": "https://news.slashdot.org/story/24/09/23/1927231/earth-may-have-breached-seven-of-nine-planetary-boundaries-health-check-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Earth May Have Breached Seven of Nine Planetary Boundaries, Health Check Shows", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T20:12:08.381970+00:00", "description": "The government of Bhutan is currently holding over $828 million in bitcoin, according to onchain data by Arkham Intelligence. From a report: \"Unlike most governments, Bhutan's BTC does not come from law enforcement asset seizures, but from bitcoin mining operations, which have ramped up dramatically since early 2023,\" the crypto intelligence firm explained. Crypto intelligence firm Arkham highlighted the Kingdom of Bhutan's bitcoin holdings on social media platform X last week. Bhutan is a small, landlocked kingdom located in the eastern Himalayas, bordered by China to the north and India to the south. The country currently has a population of less than 800,000 people. We learned last year that Bhutan had been secretly mining bitcoin using its abundant hydroelectric resources since around 2019. The operation, which began when bitcoin was priced at approximately $5,000, aims to harness the country's vast renewable energy reserves to power mining rigs. \n\nHydroelectricity already account", "id": 1198102, "language": null, "link": "https://slashdot.org/story/24/09/23/1940238/government-of-bhutan-holds-over-825-million-or-nearly-a-third-of-its-gdp-in-bitcoin-arkham-data-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Government of Bhutan Holds Over $825 Million, or Nearly a Third of Its GDP, in Bitcoin, Arkham Data Shows", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T19:06:04.062883+00:00", "description": "An anonymous reader shares a report: YouTube Premium users around the world woke up to bad news today. In over a dozen countries, the price of YouTube Premium individual and family plans increased significantly. This is only the most recent sweep of price increases from Google, as many countries saw price jumps only months ago, with the United States being one of them last summer. Impacted countries include Ireland, Netherlands, Italy, Belgium, UAE, Switzerland, Malaysia, Saudi Arabia, Indonesia, Colombia, Thailand, Singapore, Norway, Sweden, Czech Republic, and Denmark. The prices have gone up by as early as 40%.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=YouTube+Premium+Prices+Increased+Again+in+Numerous+Countries%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F09%2F23%2F1656222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" ", "id": 1197741, "language": null, "link": "https://news.slashdot.org/story/24/09/23/1656222/youtube-premium-prices-increased-again-in-numerous-countries?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "YouTube Premium Prices Increased Again in Numerous Countries", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T19:06:03.795350+00:00", "description": "Microsoft unveiled detailed security reforms Monday, five months after CEO Satya Nadella pledged to prioritize cybersecurity following major breaches. The 25-page Secure Future Initiative report [PDF] outlines technical and governance changes addressing criticisms in an April 2024 Cyber Safety Review Board report that deemed Microsoft's security culture \"inadequate.\" \n\nMicrosoft said it implemented significant security upgrades to its Entra ID and Microsoft Account systems, introducing Azure-managed hardware security modules for access token signing keys. The company has also purged 5.75 million inactive tenants to minimize potential attack vectors and adopted a new testing system with secure defaults to prevent legacy-related security issues. Concurrently, Microsoft has enhanced its network tracking capabilities, now monitoring over 99 percent of its physical network through a centralized inventory system, which aids in firmware compliance and logging. \n\nInternal security measures ha", "id": 1197740, "language": null, "link": "https://it.slashdot.org/story/24/09/23/1841218/microsoft-tightens-digital-defenses-with-sweeping-security-overhaul?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Tightens Digital Defenses with Sweeping Security Overhaul", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T17:59:34.051365+00:00", "description": "Marc Benioff said Microsoft's Copilot AI hasn't lived up to the hype. The Salesforce CEO said on the company's second-quarter earnings call that its own AI is nothing like Copilot, which he said was unimpressive. From a report: \"So many customers are so disappointed in what they bought from Microsoft Copilot because they're not getting the accuracy and the response that they want,\" Benioff said. \"Microsoft has disappointed so many customers with AI.\" \n\nMicrosoft Copilot integrates OpenAI's ChatGPT tech into the company's existing suite of business software like Word, Excel, and PowerPoint that comes with Microsoft 365. Launched last year, Copilot is meant to help companies boost productivity by responding to employee prompts and helping them with daily tasks like scheduling meetings, writing up product announcements, and creating presentations. In response to Benioff's comments, Jared Spataro, Microsoft's corporate vice president for AI at work, said in a statement to Fortune that the", "id": 1197296, "language": null, "link": "https://slashdot.org/story/24/09/23/1712210/salesforce-ceo-marc-benioff-says-microsoft-copilot-has-disappointed-many-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Salesforce CEO Marc Benioff Says Microsoft Copilot Has Disappointed Many Customers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T16:53:09.407438+00:00", "description": "SpaceX plans to launch about five uncrewed Starship missions to Mars in two years, CEO Elon Musk said on Sunday. From a report: Earlier this month, Musk had said that the first Starships to Mars would launch in two years \"when the next Earth-Mars transfer window opens.\" \n\nThe CEO on Sunday said that the first crewed mission timeline will depend upon the success of the uncrewed flights. If the uncrewed missions land safely, crewed missions will be launched in four years. However, in case of challenges, crewed missions will be postponed by another two years, Musk said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=SpaceX+Plans+To+Send+Five+Uncrewed+Starships+To+Mars+in+Two+Years%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F09%2F23%2F165239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?", "id": 1196860, "language": null, "link": "https://science.slashdot.org/story/24/09/23/165239/spacex-plans-to-send-five-uncrewed-starships-to-mars-in-two-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "SpaceX Plans To Send Five Uncrewed Starships To Mars in Two Years", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T16:53:09.024120+00:00", "description": "Messaging app Telegram will provide users' IP addresses and phone numbers to relevant authorities in response to valid legal requests, according to Chief Executive Officer Pavel Durov. From a report: The platform changed its terms of service to deter criminals from abusing it, Durov said in a post on Telegram Monday. The move comes less than a month after his arrest in France, where he faces charges of alleged complicity in the spread of child sexual abuse materials. \n\nThe move represents a marked difference from Telegram's approach to government requests for data and its reputation for lax moderation. The United Arab Emirates-based platform has been notoriously non-responsive to takedown requests from governments around the world, and often ignored requests for information about suspected criminals.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Telegram+CEO+Durov+Says+App+To+Provide+More+Data+To+Governments%3A+htt", "id": 1196859, "language": null, "link": "https://slashdot.org/story/24/09/23/1619228/telegram-ceo-durov-says-app-to-provide-more-data-to-governments?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Telegram CEO Durov Says App To Provide More Data To Governments", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T15:44:46.850316+00:00", "description": "Automattic CEO and WordPress co-creator Matt Mullenweg unleashed a scathing attack on a rival firm this week, calling WP Engine -- a managed WordPress hosting provider that has raised nearly $300 million in funding over its 14-year history -- a \"cancer to WordPress.\" From a report: Mullenweg criticized the company -- which has been commercializing the open source WordPress project since 2010 -- for profiteering without giving much back, while also disabling key features that make WordPress such a powerful platform in the first place. \n\n[...] But speaking last week at WordCamp US 2024, a WordPress-focused conference held in Portland, Oregon, Mullenweg pulled no punches in his criticism of WP Engine. Taking to the stage, Mullenweg read out a post he had just published to his personal blog, where he points to the distinct \"five for the future\" investment pledges made by Automattic and WP Engine to contribute resources to support the sustained growth of WordPress, with Automattic contribu", "id": 1196365, "language": null, "link": "https://tech.slashdot.org/story/24/09/23/1348226/wordpress-founder-calls-wp-engine-a-cancer-to-wordpress-and-urges-community-to-switch-providers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "WordPress Founder Calls WP Engine a 'Cancer To WordPress' and Urges Community To Switch Providers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T15:44:43.509739+00:00", "description": "Sonos launched a disastrous app update in May, prompting CEO Patrick Spence to commission an internal investigation led by chief counsel Eddie Lazarus. The software release, plagued with missing features and bugs, has sparked widespread customer outrage and led to a $200 million revenue shortfall. Sonos shares have plummeted 25% this year. Lazarus interviewed about two dozen employees and reviewed meeting recordings before presenting his findings to the board in late July. Bloomberg: What has happened to Sonos is at its heart a cautionary tale of company leadership ignoring the perils of \"technical debt,\" the term used by software engineers to describe the compounding threat of outdated code and infrastructure on security, usability and stability. \n\nFor two decades, Sonos had allowed its tech debt to pile high. When it undertook in earnest its effort to revamp its app in mid-2022, the company knew it was sitting on infrastructure and code written in languages that were pretty much obs", "id": 1196364, "language": null, "link": "https://tech.slashdot.org/story/24/09/23/155253/how-sonos-botched-an-app-and-infuriated-its-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "How Sonos Botched an App and Infuriated Its Customers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T14:35:59.205782+00:00", "description": "The US Commerce Department on Monday will propose a ban on the sale or import of smart vehicles that use specific Chinese or Russian technology because of national security concerns, according to US officials. From a report: A US government investigation that began in February found a range of national security risks from embedded software and hardware from China and Russia in US vehicles, including the possibility of remote sabotage by hacking and the collection of personal data on drivers, Secretary of Commerce Gina Raimondo told reporters Sunday in a conference call. \n\n\"In extreme situations, a foreign adversary could shut down or take control of all their vehicles operating in the United States, all at the same time, causing crashes (or) blocking roads,\" she said. The rule would not apply to cars already on the road in the US that already have Chinese software installed, a senior administration official told CNN. The software ban would take effect for vehicles for \"model year\" 202", "id": 1195825, "language": null, "link": "https://tech.slashdot.org/story/24/09/23/136242/us-proposes-ban-on-smart-cars-with-chinese-and-russian-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Proposes Ban on Smart Cars With Chinese and Russian Tech", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T11:55:27.814362+00:00", "description": "Nature published an introduction to running an LLM locally, starting with the example of a bioinformatician who's using AI to generate readable summaries for his database of immune-system protein structures. \"But he doesn't use ChatGPT, or any other web-based LLM.\" He just runs the AI on his Mac...\n\n\nTwo more recent trends have blossomed. First, organizations are making 'open weights' versions of LLMs, in which the weights and biases used to train a model are publicly available, so that users can download and run them locally, if they have the computing power. Second, technology firms are making scaled-down versions that can be run on consumer hardware &mdash; and that rival the performance of older, larger models. Researchers might use such tools to save money, protect the confidentiality of patients or corporations, or ensure reproducibility... As computers get faster and models become more efficient, people will increasingly have AIs running on their laptops or mobile devices for a", "id": 1194461, "language": null, "link": "https://slashdot.org/story/24/09/23/0452250/forget-chatgpt-why-researchers-now-run-small-ais-on-their-laptops?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'Forget ChatGPT: Why Researchers Now Run Small AIs On Their Laptops'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T11:55:27.704049+00:00", "description": "In 2022 about 346,000 electric cars were reportedly sold in California. But the same year its greenhouse gas emissions dropped a whopping 9.3 million metric tons &mdash; the amount produced by 2.2 million gas-powered cars &mdash; lowering emissions 2.4% from the year before. \"The biggest drop came from transportation, due largely to the increased use of renewable fuels,\" according to the state's Air Resources Board, touting a newly-released report. (And electricity sector emissions also fell by 2.6 million metric tons, or 4.1%, \"even as electricity usage rose,\" according to The Hill &mdash; \"a dichotomy that the regulators attributed to an increase in solar and wind power generation.\") \n\nSo despite a growing economy, \"the latest data underscores a continued trend of steady emissions decline...\" according to a statement from the Board. \"Between 2000 to 2022, emissions fell by 20% while California's gross domestic product increased by 78%, pointing to the effectiveness of the state's cl", "id": 1194460, "language": null, "link": "https://hardware.slashdot.org/story/24/09/23/0128256/how-california-cuts-greenhouse-gas-emissions---while-its-economy-grows?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "How California Cuts Greenhouse Gas Emissions - While Its Economy Grows", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T04:38:31.275673+00:00", "description": "First released on July 11th, the Firefox-based Zen browser is \"taking a different approach to the user interface,\" according to the blog It's FOSS. \n\nThe Register says the project \"reminds us strongly of Arc, a radical Chromium-based web browser... to modernize the standard web browser UI by revising some fundamental assumptions.\"\n[Arc] removes the URL bar from front and center, gets rid of the simple flat list of tabs, and so on. Zen is trying to do some similar things, but in a slightly more moderate way &mdash; and it's doing it on the basis of Mozilla's Firefox codebase... Instead of the tired old horizontal tab bar you'll see in both Firefox and Chrome, Zen implements its own tab bar... By default, this tab bar is narrow and just shows page icons &mdash; but there are some extra controls at the bottom of the sidebar, one of which expands the sidebar to show page titles too. For us, it worked better than Vivaldi's fancier sidebar. \n\nThe article concludes it's \"a new effort to mode", "id": 1193481, "language": null, "link": "https://news.slashdot.org/story/24/09/23/0353206/zen-browser-a-new-firefox-based-alternative-to-chromium-browsers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Zen Browser: a New Firefox-based Alternative to Chromium Browsers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T02:28:55.463295+00:00", "description": "German law enforcement seized 47 cryptocurrency exchange services \"that facilitated illegal money laundering activities for cybercriminals,\" according to BleepingComputer, \"including ransomware gangs.\" \n\nLong-time Slashdot reader Arrogant-Bastard shares their report:\nThe platforms allowed users to exchange cryptocurrencies without following applicable \"Know Your Customer\" regulations, meaning that users remained completely anonymous when making transactions. This created a low-risk environment for cybercriminals to launder their proceeds without fearing prosecution or being tracked. \"Exchange services that enable such anonymous financial transactions and thus money laundering represent one of the most relevant building blocks in the criminal value chain of the cybercrime phenomenon,\" reads a Federal Criminal Police Office (BKA) announcement...\n\nWhen visiting any of the seized exchanges, you are now redirected to a warning page titled \"Operation Final Exchange,\" which warns visitors th", "id": 1193213, "language": null, "link": "https://news.slashdot.org/story/24/09/23/0018238/germany-seizes-47-crypto-exchanges-used-by-ransomware-gangs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Germany Seizes 47 Crypto Exchanges Used By Ransomware Gangs", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T01:23:54.217955+00:00", "description": "The republic of Cyprus \"has outstripped all other EU member states in embracing hot-water solar systems,\" reports the Guardian, \"with an estimated 93.5 % of households exploiting the alternative energy form for domestic needs.\"\n\nEU figures show the eastern Mediterranean island exceeding renewable energy targets set in the heating and cooling of buildings thanks to the widespread use of the solar thermal technology... [First introduced in the late 1960s], the solar thermal systems not only collected solar energy as heat &mdash; usually generated through electricity and the burning of fossil fuels &mdash; they were extremely cost-effective and had helped spawn an entire industry [says Charalampos Theopemptou, the island's first environment commissioner and the head of the Cypriot parliament's environment committee]. \n\n\"It's been great for low-income families and then there's the jobs: so many have been generated,\" the MP says. \"There are the local manufacturers who produce the parts and", "id": 1193065, "language": null, "link": "https://hardware.slashdot.org/story/24/09/23/000233/how-cyprus-became-a-world-leader-in-solar-heating?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "How Cyprus Became a World Leader In Solar Heating", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T00:18:49.858400+00:00", "description": "\"Many GitHub users this week received a novel phishing email warning of critical security holes in their code,\" reports Krebs on Security &mdash; citing an email shared by one of his readers:\n\n\"Hey there! We have detected a security vulnerability in your repository. Please contact us at https://github-scanner[.]com to get more information on how to fix this issue....\" Clicking the \"I'm not a robot\" button generates a pop-up message asking the user to take three sequential steps to prove their humanity. Step 1 involves simultaneously pressing the keyboard key with the Windows icon and the letter \"R,\" which opens a Windows \"Run\" prompt that will execute any specified program that is already installed on the system. \n\nStep 2 asks the user to press the \"CTRL\" key and the letter \"V\" at the same time, which pastes malicious code from the site's virtual clipboard. Step 3 &mdash; pressing the \"Enter\" key &mdash; causes Windows to launch a PowerShell command, and then fetch and execute a malic", "id": 1192893, "language": null, "link": "https://tech.slashdot.org/story/24/09/22/2322247/windows-powershell-phish-uses-fake-captcha-downloads-credential-stealer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Windows PowerShell Phish Uses Fake CAPTCHA, Downloads Credential Stealer", "vote": 0}]