[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T20:00:05+00:00", "description": "Antony Starr, Jack Quaid, and more star in The Boys, now streaming on Prime Video.\n\nAbout The Boys: THE BOYS is an irreverent take on what happens when superheroes, who are as popular as celebrities, as influential as politicians and as revered as Gods, abuse their superpowers rather than use them for good. It's the powerless against the super powerful as The Boys embark on a heroic quest to expose the truth about “The Seven,” and their formidable Vought backing.\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Prime Video offers a variety of unique and captivating entertainment, including original series “The Boys,” “Invincible,” “Hazbin Hotel,” “The Summer I Turned Pretty,” and more.\n \n#TheBoys #Shorts #PrimeVideo", "id": 1198352, "language": null, "link": "https://www.youtube.com/watch?v=amoKl754znM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 454, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/amoKl754znM/hqdefault.jpg", "title": "To answer the Homelander question, yes. | The Boys", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T18:00:08+00:00", "description": "New episodes of The Lord of the Rings: The Rings of Power are dropping weekly.\n \nAbout The Lord of the Rings: The Rings of Power: Set thousands of years before the events of J.R.R. Tolkien’s The Lord of the Rings, this epic drama follows an ensemble cast of characters, both familiar and new, as they confront the long-feared re-emergence of evil to Middle-earth.\n\nAbout The Lord of the Rings: The Rings of Power Season 2: Sauron has returned. Cast out by Galadriel, the Dark Lord must now rely on his own cunning to rebuild his strength and forge the legendary Rings of Power, threatening to bind all peoples of Middle-earth to his sinister will. Season 2 plunges its most beloved characters into a rising tide of darkness, challenging each to find his or her place in a world on the brink of calamity.\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are ", "id": 1197499, "language": null, "link": "https://www.youtube.com/watch?v=FZg0AtmebGk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 454, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/FZg0AtmebGk/hqdefault.jpg", "title": "In Middle-Earth, pronunciation is key. | The Lord of The Rings: The Rings of Power", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T17:00:19+00:00", "description": "Ready to get hooked on another anime on Prime Video? TRIGGER WARNING: @CheyenneTheGeek is about to introduce you to the wild world that is My Deer Friend Nokotan. \n\nMy Deer Friend Nokotan is now available to stream on Prime Video.\n \n» Watch My Deer Friend Nokotan on Prime Video: https://amzn.to/3XPSUSM\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n \nAbout My Deer Friend Nokotan: Humans, aspire to be like the deer!Torako Koshi, a high schooler, one day feels something cold hit her face. Looking up, she spots a girl stuck, her antlers tangled in power lines. Helping Shikanoko, antlered and peculiar, turns Torako's life, a model student by appearance only, upside down. Thus begins a tale of a girl (once a delinquent) and another (a deer?), in this Girl Meets Deer adventure!\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video ", "id": 1197104, "language": null, "link": "https://www.youtube.com/watch?v=F_6bXhM2d6c", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 454, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/F_6bXhM2d6c/hqdefault.jpg", "title": "Everything You Need to Know About My Deer Friend Nokotan | Anime Club | Prime Video", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T16:00:26+00:00", "description": "Starring Anne Hathaway and Nicholas Galitzine, The Idea of You is now streaming only on Prime Video.\n\nAbout The Idea of You: Based on the acclaimed, contemporary love story of the same name, The Idea of You centers on Solène (Anne Hathaway), a 40-year-old single mom who begins an unexpected romance with 24-year-old Hayes Campbell (Nicholas Galitzine), the lead singer of August Moon, the hottest boy band on the planet.\n \nAbout Prime Video:\nWant to watch it now? We've got it. This week's newest movies, last night's TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. \n \n#PrimeVideo #TheIdeaofYou #Shorts", "id": 1197105, "language": null, "link": "https://www.youtube.com/watch?v=OEETqtw6iq4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 454, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/OEETqtw6iq4/hqdefault.jpg", "title": "Well twist her arm. | The Idea of You", "vote": 0}]