[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T17:30:09+00:00", "description": "More often than not, the biggest changes that EA’s annual football series has touted in recent years haven’t ended up amounting to much, leaving many disappointed with their surface-level changes that ultimately don’t really improve much. This year, however, EA Sports FC 25 feels like a much welcome legitimate upgrade for the series over recent years, even if it is ultimately still an incremental step forward, owing to the series’ very nature. \n\nCareer Mode has seen meaningful improvements at long last, while the addition of player roles and an even greater emphasis on tactical flexibility gives players even greater strategic control over their team. Some issues still remain, of course, but it’s safe to say that EA Sports FC 25 is a better game than most of its predecessors in recent years.", "id": 1197222, "language": null, "link": "https://www.youtube.com/watch?v=vDIVhZUcNyU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/vDIVhZUcNyU/hqdefault.jpg", "title": "EA Sports FC 25 Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T17:30:02+00:00", "description": "Enotria: The Last Song may not stand out as the best Soulslike released in 2024, but it’s not a bad one either. Combat moves along somewhat slower than I’d like, but the clever Mask Line system makes up for that with its open-ended class creation. \n\nAnd if combat isn’t enough to get you to try it, the rich visuals might. Enotria shines in its intricate level design, particularly the way it loops in on itself. I simply love exploring the environments in this game and would give it a higher rating if it weren’t for a bevy of other issues weighing it down. \n\nEnotria: The Last Song has been plagued by bugs at launch, but if you can get through that as well as its slow combat, you may find yourself having a fabulous time like if you’re a fan of Soulslikes like myself.", "id": 1197223, "language": null, "link": "https://www.youtube.com/watch?v=7xTNMpFZ93A", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/7xTNMpFZ93A/hqdefault.jpg", "title": "Enotria: The Last Song - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T15:30:02+00:00", "description": "The Legend of Zelda: Echoes of Wisdom releases on September 26 th and it marks the first new 2D entry the series has seen in 11 years. The developer has been keen to show us a lot of info about this new 2D title, but some of the finer details may have gone under the radar for some gamers. \n\nEchoes of Wisdom pulls its roots in interesting ways while bringing in new gameplay concepts. The most noteworthy feature is the Tri-Rod and its Echo ability, no doubt, but there’s a host of other fascinating abilities that allow for a near-unlimited number of ways to solve puzzles. \n\nWhether it’s using automatons to detonate on an enemy or calling on a trusty steed to gallop through the world, Echoes of Wisdom looks like one of this year’s most exciting games.", "id": 1196422, "language": null, "link": "https://www.youtube.com/watch?v=6TgfB57F1JY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/6TgfB57F1JY/hqdefault.jpg", "title": "The Legend of Zelda: Echoes of Wisdom - 15 Things You NEED To Know Before You Buy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-23T13:30:25+00:00", "description": "Santa Monica Studio's Ragnarok is now available on Steam and the Epic Games Store, bringing the thunderous Norse saga to a close. Released in 2022 for PS5 and PS4, it's still an incredible experience with its responsive combat, excellent story-telling, and gorgeous world design.\n\nThis applies to the PC version as well, with Jetpack Interactive (who also worked on the port for 2018's reboot) delivering a well-optimized experience. The available graphical options are solid, with Ultrawide monitor support, unlocked frame rates, and native 4K, ensuring the best possible experience.\n\nIt's not without hiccups. There are some frame dips in the second realm, Svartalfheim, when in combat. Environmental textures also had a noticeable load after emerging from the Realm Between Realms. Nevertheless, as an overall showcase of what the title is capable of on stronger hardware, Ragnarok is an exceptional PC port.", "id": 1195513, "language": null, "link": "https://www.youtube.com/watch?v=T1xRf8gLB-s", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/T1xRf8gLB-s/hqdefault.jpg", "title": "God of War Ragnarok PC vs PS5 Graphics Comparison: A Mind-Blowing PC Experience", "vote": 0}]