[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-19T19:00:21+00:00", "description": "When considering social survival strategy titles, 11 bit studios is the developer that comes to mind, and Frostpunk is arguably its most significant work. Thirty years after the Great Freeze, New London is under new management, and the obstacles are far greater in Frostpunk 2.\n\nHowever, it's more than just the first game with a bigger city and more expansive scale, where you measure time in weeks and growth by districts. It also offers more complex problems, such as the overall direction of progress, which of the many factions you'll side with, and how you'll prevail against the human condition.\n\nWhile it can get overwhelming, especially when trying to solve squalor, disease, crime, and so on, and the interface requires some patience, Frostpunk 2 is a worthy follow-up. The \"bigger picture\" can desensitize you as much as the stories on the ground will inspire (or demoralize).\n\nCorrection: By mistake we added PS5 and Xbox Series X", "id": 1177239, "language": null, "link": "https://www.youtube.com/watch?v=m83XCFM7KGA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/m83XCFM7KGA/hqdefault.jpg", "title": "Frostpunk 2 Review - Everything You Need To Know Before You Purchase", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-19T16:00:50+00:00", "description": "Incoming via Turkey based developer Motion Blur Game Studio is Black State, a third-person action espionage title which the developer promises will shake up the industry. \n\nAs a collective of individuals well-versed in real-time game engines and cutting-edge technology, most immediate with Black State is the incredibly lifelike graphics, supported by awestriking reflections, photorealistic environments, and biting inclement weather. \n\nThere’s an intriguing narrative here too, one in which we’ll discover its mysteries via missions undertaken through mysterious portal doorways capable of transporting us to a range of locations by simply walking through. There are inherent problems with glamourous game-slash-tech demos which will be discussed in this feature alongside all the promise Motion Blur’s debut outing possesses. This is definitely one to keep your eye on.", "id": 1175920, "language": null, "link": "https://www.youtube.com/watch?v=nb8pftj48ms", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/nb8pftj48ms/hqdefault.jpg", "title": "This Graphically Stunning Game Looks Like A Potent Mix of Metal Gear And Death Stranding", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-19T09:30:27+00:00", "description": "Blizzard Entertainment has consistently kept adding to Diablo 4 with its post-launch seasonal updates since it launched over a year ago, but the action RPG will soon also be receiving its first major paid expansion when Vessel of Hatred launches on October 8. \n\nFrom a new playable class and new story content to an additional region to explore and more, there's plenty that the upcoming DLC is promising to add to Diablo 4, and as we count the days down to its release, here, we'll be going over all of those details.", "id": 1173507, "language": null, "link": "https://www.youtube.com/watch?v=mJsB653XbvA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/mJsB653XbvA/hqdefault.jpg", "title": "Diablo 4: Vessel of Hatred DLC - 15 Things You Need To Know Before You Buy", "vote": 0}]