[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 AMAZING Video Game Sequels of 2023 You NEED TO PLAY", "description": "As we’ve seen countless times over the years, making a good sequel in an established property isn’t always as easy as one might think. Not only do developers have to keep the series’ style and identity intact, they have to do so while ensuring that things don’t get too stagnant or boring- which is why we always appreciate a good sequel that does just that. \n\nThroughout the course of 2023, we got plenty of games that very much fit that description. In fact, the vast majority of the year’s biggest and most acclaimed releases were new instalments in existing properties. Here, we are going to talk about the ones that stood out to us more than all the others.", "link": "https://www.youtube.com/watch?v=2lphw_U7Tvk", "date_published": "2023-12-03T15:30:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/2lphw_U7Tvk/hqdefault.jpg", "age": null, "page_rating_contents": 51, "page_rating_votes": 0, "page_rating_visits": 2, "page_rating": 51, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 First Person Shooters With BEST HIGH-END GRAPHICS [4K]", "description": "Some genres have always been associated with pushing the medium forward in terms of its visual and technological capabilities, and very few of them exemplify that notion better than first person shooters. \n\nFrom the early days of the genre right up to this point, where it has grown to become a pillar of the medium at large, it has played host to some of the most graphically stunning games we have ever played. \n\nOver the years, there has been no shortage of first person shooters that have wowed the masses with their visual accomplishments, and here in this feature, we are going to highlight a few that we feel stand head and shoulders above their peers in this particular department.", "link": "https://www.youtube.com/watch?v=XgbPYM5X-0A", "date_published": "2023-12-03T09:30:09+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/XgbPYM5X-0A/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]