[{"tags": [], "page_rating": 0, "bookmarked": false, "permanent": false, "dead": false, "page_rating_contents": 0, "link": "https://www.youtube.com/watch?v=I2ADiSPvJbc", "date_published": "2024-03-05T17:00:22+00:00", "user": null, "title": "Rise of the Ronin - 15 NEW Things You Should Know Before You Purchase", "vote": 0, "artist": "GamingBolt", "album": "", "description": "Team Ninja's Rise of the Ronin is the next big PS5 exclusive, launching on March 22nd. With seven years of development time behind it and a scale unlike anything the developer has done before, it's become one of the more hotly anticipated titles of the year.\n\nThankfully, Sony and Koei Tecmo aren't hiding just how impressive the open-world action RPG looks. From showcasing the locations and cities that players will visit to the sheer variety of weapons and ways to use them, there's a lot to delve into. There are even some mechanics which are a first for the developer, like switching characters mid-combat.\n\nCheck out some new details that you should know about Rise of the Ronin, including difficulty options, co-op confirmation and more.", "thumbnail": "https://i2.ytimg.com/vi/I2ADiSPvJbc/hqdefault.jpg", "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null, "source_obj__id": 129, "age": null, "page_rating_votes": 0, "page_rating_visits": 0}, {"tags": [], "page_rating": 0, "bookmarked": false, "permanent": false, "dead": false, "page_rating_contents": 0, "link": "https://www.youtube.com/watch?v=GlAGDZ2FCfc", "date_published": "2024-03-05T10:00:09+00:00", "user": null, "title": "Final Fantasy 7 Rebirth's Ending Explained, And How It Sets Up Part 3", "vote": 0, "artist": "GamingBolt", "album": "", "description": "In 2020, Final Fantasy 7 Remake put the long-anticipated remake trilogy on a path that many hadn’t expected, and Final Fantasy 7 Rebirth continues down that road. Though it does hit all (or most) of the major beats you would expect it to, it does so much more on top, charting its own story in unexpected ways with a litany of major reveals thrown at you in the game’s final chapter. \n\nThere is, in fact, so much going on in those last couple of hours that it’s all too easy to miss crucial details and be left confused about a lot of what you’re shown. To help crystallize the picture that Final Fantasy 7 Rebirth paints, here, we’re going to analyze its ending and talk about how it sets up Final Fantasy 7 Remake Part 3 (or whatever it ends up being called).", "thumbnail": "https://i4.ytimg.com/vi/GlAGDZ2FCfc/hqdefault.jpg", "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null, "source_obj__id": 129, "age": null, "page_rating_votes": 0, "page_rating_visits": 0}]