[{"vote": 0, "source_obj__id": 208, "title": "The Legend of Heroes: Trails of Cold Steel 4 PS5 Review - The Final Verdict", "page_rating_votes": 0, "comments": [], "dead": false, "user": null, "page_rating": 0, "description": "The Legend of Heroes: Trails of Cold Steel 4 first launched in 2018 for PS4 and is finally coming to PS5 on February 16th. As the end of the Erebonia saga, with dozens of playable characters and heroes from Trails in the Sky and Zero/Azure, it's an epic finale in many ways.\n\nWhile it doesn't always hit the mark in that regard - especially in terms of pacing with the second Act - Cold Steel 4 still offers an extensive world to explore, endearing characters to connect with, lots of content to complete and fun combat to engage with.\n\nThe PS5 version doesn't provide much outside of an improved frame rate and resolution, which makes the visual style look antiquated. Nevertheless, The Legend of Heroes: Trails of Cold Steel 4 is worth experiencing, even if the real send-off awaits in Trails into Reverie.", "artist": "GamingBolt", "album": "", "bookmarked": false, "thumbnail": "https://i3.ytimg.com/vi/zrNu4GoWZGM/hqdefault.jpg", "language": null, "age": null, "page_rating_visits": 0, "page_rating_contents": 0, "date_published": "2024-02-09T20:30:06+00:00", "tags": [], "link": "https://www.youtube.com/watch?v=zrNu4GoWZGM", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "permanent": false}, {"vote": 0, "source_obj__id": 208, "title": "The Legend of Heroes: Trails of Cold Steel 3 PS5 Review - The Final Verdict", "page_rating_votes": 0, "comments": [], "dead": false, "user": null, "page_rating": 0, "description": "The Legend of Heroes: Trails series has been around for a while, and the setting has come a long way. However, even as fans prepare for Trails through Daybreak this Summer, they can revisit Trails of Cold Steel 3 and 4 on February 16th for PS5.\n\nThough you shouldn't expect much visual improvements - aside from a higher resolution/frame rate and faster loading times - The Legend of Heroes: Trails of Cold Steel 3 is still a standout title in the Erebonian saga. It offers strong characters, a compelling plot, slick combat and exceptional world-building, even if it can get overwhelming.\n\nWhile its visuals won't win too many players, the music and voice acting are top-notch. Whether new to the series or raring for another playthrough, it's well worth your time.", "artist": "GamingBolt", "album": "", "bookmarked": false, "thumbnail": "https://i3.ytimg.com/vi/ZgH7ZQ7Nvz8/hqdefault.jpg", "language": null, "age": null, "page_rating_visits": 0, "page_rating_contents": 0, "date_published": "2024-02-09T20:30:04+00:00", "tags": [], "link": "https://www.youtube.com/watch?v=ZgH7ZQ7Nvz8", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "permanent": false}, {"vote": 0, "source_obj__id": 208, "title": "Skull and Bones – 15 Things You Should Know BEFORE BUYING", "page_rating_votes": 0, "comments": [], "dead": false, "user": null, "page_rating": 0, "description": "Almost seven years since its official announcement, Skull and Bones is finally launching on February 16th for Xbox Series X/S, PS5 and PC. It's not too late for another delay, but the naval combat/pirate fantasy title is seemingly on track. \n\nOffering multiple regions across the vast ocean to explore, Skull and Bones sees players interacting with the kingpins of the pirating world and building up their reputation to become a legend. \n\nCompleting contracts, like ambushing convoys and transporting materials, are a few methods to achieve this, and as your Infamy rises, you gain access to new ships, weapons and more. Here's what you should know about Skull and Bones before its (current) worldwide release, from its differing price on consoles vs. PC to the post-launch plans.", "artist": "GamingBolt", "album": "", "bookmarked": false, "thumbnail": "https://i2.ytimg.com/vi/QotpdD6VjuA/hqdefault.jpg", "language": null, "age": null, "page_rating_visits": 0, "page_rating_contents": 0, "date_published": "2024-02-09T14:00:30+00:00", "tags": [], "link": "https://www.youtube.com/watch?v=QotpdD6VjuA", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "permanent": false}, {"vote": 0, "source_obj__id": 208, "title": "Single Player Studios NEED TO STOP Chasing The Live Service Trend", "page_rating_votes": 0, "comments": [], "dead": false, "user": null, "page_rating": 0, "description": "Suicide Squad: Kill the Justice League has been on the receiving end of plenty of criticism ever since its launch, and a lot of it is, sadly, well deserved. \n\nBut while there’s been plenty of conversation about the game’s own inherent flaws (of which it has plenty), the conversation that’s been the loudest of them all has been how a studio as talented and beloved as Rocksteady has ended up being wasted on yet another live service looter shooter that is, above all else, aspiring to be a source of constant revenue for its publisher, rather than an actual good game that its audience will enjoy. \n\nRocksteady is not the first single player studio that has fallen victim to that mindset, but will it be the last? Here, we attempt to answer that question.", "artist": "GamingBolt", "album": "", "bookmarked": false, "thumbnail": "https://i1.ytimg.com/vi/lN2U3H1mYU4/hqdefault.jpg", "language": null, "age": null, "page_rating_visits": 0, "page_rating_contents": 0, "date_published": "2024-02-09T09:30:19+00:00", "tags": [], "link": "https://www.youtube.com/watch?v=lN2U3H1mYU4", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "permanent": false}]