[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "What Role Could Harley Quinn Play In Suicide Squad: Kill The Justice League?", "description": "As a live service looter shooter, the upcoming Suicide Squad: Kill the Justice League has attracted more than its fair share of skepticism from most that have laid their eyes on the game, and though there’s surely plenty about it that does warrant skepticism, the one part of the game that it’s hard not to be optimistic about is Harley Quinn. \n\nWith Suicide Squad set in the same universe as the Batman: Arkham games, an already fascinating character is going to have even more nuance and history for the writers at Rocksteady Studios to dive into, which means that her characterization in this particular universe and her relationships with other returning characters are going to be building off of an already-existing (and solid) foundation. Here, we talk about all of that and more.", "link": "https://www.youtube.com/watch?v=XRzyynaZxlk", "date_published": "2024-01-21T18:15:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i1.ytimg.com/vi/XRzyynaZxlk/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Final Fantasy 7 Rebirth - 15 Things I CAN'T WAIT TO DO", "description": "The long-awaited follow up to Final Fantasy 7 Remake is upon us, and with the developer promising a deeper, more emotionally impactful setting complete with deeper emphasis on party member relationships. \n\nThe wide-open world itself is said to foster a sense of limitless exploration with curated side content that’ll be diverse enough to keep players entertained for up to 100 hours. This video aims to highlight the key things long-time fanatics of the genre will be most excited to experience, although it’s worth remembering that the developer has built Final Fantasy 7 Rebirth as a standalone title that even newcomers can enjoy. \n\nRebirth will tread familiar ground, but be different enough in enticing ways, including fresh combat mechanics and reinterpretations of iconic scenes.", "link": "https://www.youtube.com/watch?v=jZKQu8Vf2jo", "date_published": "2024-01-21T15:30:11+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i3.ytimg.com/vi/jZKQu8Vf2jo/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Helldivers 2 PS5 - 11 Things You NEED TO KNOW Before You Buy", "description": "Big-budget, blockbuster, AAA single player titles might be what PlayStation’s exclusive output has become known for over the years, but soon, we’ll be seeing something different from that pipeline. Several years on from the original Helldivers’ launch, Sony and developer Arrowhead Game Studios are set to launch its sequel, and in more ways than one, Helldivers 2 is looking like a promising and intriguing evolution of the original game’s chaotic co-op antics. \n\nFrom retaining elements like friendly fire and the importance of stratagems to the core gameplay to introducing new ones like an over-the-shoulder third-person camera and the added emphasis being placed on loadouts and progression systems, there’s plenty about Helldivers 2 that has caught the eye in the lead-up to its release. Here, that’s exactly what we’ll be talking about.", "link": "https://www.youtube.com/watch?v=LkRsaASulqQ", "date_published": "2024-01-21T09:30:11+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i1.ytimg.com/vi/LkRsaASulqQ/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]