[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-20T17:30:05+00:00", "description": "There are so many games out there that need follow-ups. Seriously, some games have narrative cliff-hangers that need urgent resolutions. Other games showcase unique gameplay mechanics, world building, or plainly stunning, evocative worlds that we’re dying to spend more time in them. \n\nWhatever the reason, this video aims to highlight 15 such games that desperately need a sequel. The games included are RPG epics, third-person shooter franchises, survival horrors, and innovative sandbox sims, to name a few. The key thing here is that they’re all single player, and this is an important distinction to make as single player games demanding a sequel generally have unfinished stories. As already mentioned though, some feature amazingly detailed worlds that are such a joy to exist in that we can’t help but demand a follow-up.", "language": null, "link": "https://www.youtube.com/watch?v=rMwuWuViFFg", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/rMwuWuViFFg/hqdefault.jpg", "title": "15 Single Player Games That Desperately NEED A SEQUEL", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-20T13:30:25+00:00", "description": "Just when you thought the Fallout franchise was dormant, coasting on its solid player base of tens of thousands, Amazon's TV show releases and turns everything upside down. Suddenly, everyone wants to play a Fallout game, specifically Fallout 4 and Fallout 76, and experience the wasteland.\n\nIt's unsurprising then that Amazon has immediately renewed the Fallout series for a second season. With how well it translated the game's elements into an original story, what else could the next season offer? How many different ways could it go even further beyond? A lot, as it turns out.\n\nCheck out ten things we'd like to see in Season 2 of Amazon's Fallout series, from appearances by classic characters (and protagonists) to familiar settings and maybe some new Vaults.", "language": null, "link": "https://www.youtube.com/watch?v=zKGk8J_IcU4", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/zKGk8J_IcU4/hqdefault.jpg", "title": "Fallout Season 2 - 10 Things Gamers Want To See", "user": null, "vote": 0}]