[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T23:51:19.795753+00:00", "description": "An anonymous reader quotes a report from IGN: Final Fantasy 16 producer Naoki Yoshida has asked fans to please not make \"offensive or inappropriate\" mods upon the game's PC release tomorrow, September 17. Yoshida wouldn't comment on any specific mods he wants to see in Final Fantasy 16 in an interview with PC Gamer, though made clear what he doesn't want to see. \"If we said, 'it'd be great if someone made X, Y, Z,' it might come across as a request, so I'll avoid mentioning any specifics here,\" Yoshida said. \"The only thing I will say is that we definitely don't want to see anything offensive or inappropriate, so please don't make or install anything like that.\"\n \nMods allow players to create custom content for games, often resulting in incredibly useful gameplay changes such as the ability to play Elden Ring with friends seamlessly, or major additions such as an entire new expansion for Fallout 4 or the ability to play as custom characters in The Witcher 3: Wild Hunt. Due to the natu", "id": 1164384, "language": null, "link": "https://games.slashdot.org/story/24/09/17/2132210/final-fantasy-16-producer-asks-fans-not-to-make-offensive-or-inappropriate-mods?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Final Fantasy 16 Producer Asks Fans Not To Make 'Offensive Or Inappropriate' Mods", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T23:51:18.768917+00:00", "description": "Apple's iPadOS 18 update is no longer available after some iPad Pro owners found that it bricked their devices. MacRumors reports: There are reports on Reddit from iPad Pro users who had an interruption in the installation process, leading to an iPad that refused to turn on. A total replacement was required for affected users. Not all M4 iPad Pro owners have had an issue installing the update, and it could be linked to installing the new iOS 17.7 update before installing iOS 18. Apple will make the software available again when the underlying problem has been addressed.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Pulls+iPadOS+18+For+M4+iPad+Pro+After+Bricking+Complaints%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F09%2F17%2F2251254%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?", "id": 1164383, "language": null, "link": "https://apple.slashdot.org/story/24/09/17/2251254/apple-pulls-ipados-18-for-m4-ipad-pro-after-bricking-complaints?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Pulls iPadOS 18 For M4 iPad Pro After Bricking Complaints", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T22:47:07.761919+00:00", "description": "Mozilla is exiting the fediverse by shutting down its Mozilla.social Mastodon server on December 17. Moving forward, the company will focus on Firefox and AI, aligning with its strategy under interim CEO Laura Chambers to scale back investments in non-core products. TechCrunch reports: Mozilla.social was a small instance, having only 270 active users at the time of Tuesday's announcement. By comparison, the most popular Mastodon instance, Mastodon.social, has over 247,500 monthly active users. Mozilla had telegraphed its plans to scale back on its fediverse investments earlier this year after the CEO stepped down. At the time, Mozilla board member Laura Chambers took over the job as the interim CEO of Mozilla Corporation through the end of 2024. Shortly after the change in leadership, Mozilla said it would refocus its product strategy around Firefox and AI and significantly scale back or even shutter other efforts. Among those products affected by the pullback were its VPN, Relay, and", "id": 1164129, "language": null, "link": "https://tech.slashdot.org/story/24/09/17/2115223/mozilla-exits-the-fediverse-will-shutter-its-mastodon-server-in-december?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mozilla Exits the Fediverse, Will Shutter Its Mastodon Server In December", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T22:47:06.589154+00:00", "description": "Instagram has introduced new safety features that make teenage accounts private by default, enhance parental supervision, and set messaging restrictions to protect young users, requiring parental approval for changes. NPR reports: Meta said users under 16 will now need a parent's approval to change the restricted settings, dubbed \"Teen Accounts,\" which filter out offensive words and limit who can contact them. \"It's addressing the same three concerns we're hearing from parents around unwanted contact, inappropriate contact and time spent,\" said Naomi Gleit, Meta's head of product, in an interview with NPR. With teens all being switched to private accounts, they can only be messaged or tagged by people they follow. Content from accounts they don't follow will be in the most restrictive setting, and the app will make periodic screen time reminders under a revamped \"take a break\" feature. [...]\n \nMeta requires users to be at least 13 years old to create an account. Social media researche", "id": 1164128, "language": null, "link": "https://tech.slashdot.org/story/24/09/17/2124201/instagram-makes-all-teen-accounts-private?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Instagram Makes All Teen Accounts Private", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T21:41:05.338256+00:00", "description": "An anonymous reader quotes a report from Ars Technica, written by Scharon Harding: TCL has come under scrutiny this month after testing that claimed to examine three TCL TVs marketed as quantum dot TVs reportedly showed no trace of quantum dots. [...] Earlier this month, South Korean IT news publication ETNews published a report on testing that seemingly showed three TCL quantum dot TVs, marketed as QD TVs, as not having quantum dots present. Hansol Chemical, a Seoul-headquartered chemicals company, commissioned the testing. SGS, a Geneva-headquartered testing and certification company, and Intertek, a London-headquartered testing and certification company, performed the tests. The models examined were TCL's C755, said to be a quantum dot Mini LED TV, the C655, a purported quantum dot LED (QLED) TV, and the C655 Pro, another QLED. None of those models are sold in the US, but TCL sells various Mini LED and LED TVs in the US that claim to use quantum dots. According to a Google translat", "id": 1163807, "language": null, "link": "https://entertainment.slashdot.org/story/24/09/17/2058255/tcl-accused-of-selling-quantum-dot-tvs-without-actual-quantum-dots?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "TCL Accused of Selling Quantum Dot TVs Without Actual Quantum Dots", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T20:37:14.400351+00:00", "description": "Salesforce is unveiling a pivot in its AI strategy this week at its annual Dreamforce conference, now saying that its AI tools can handle tasks without human supervision and changing the way it charges for software. From a report: The company is famous for ushering in the era of software as a service, which involves renting access to computer applications via a subscription. But as generative AI shakes up the industry, Salesforce is rethinking its business model for the emerging technology. The software giant will charge $2 per conversation held by its new \"agents\" -- generative AI built to handle tasks like customer service or scheduling sales meetings without the need for human supervision. \n\nThe new pricing strategy also seeks to protect Salesforce if AI contributes to future job losses and business customers have fewer workers to buy subscriptions to the company's software. Salesforce is even leaning into the employee-replacement potential of the new technology. Its new AI agents ", "id": 1163265, "language": null, "link": "https://slashdot.org/story/24/09/17/198210/salesforces-new-ai-strategy-acknowledges-that-ai-will-take-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Salesforce's New AI Strategy Acknowledges That AI Will Take Jobs", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T18:46:15.769666+00:00", "description": "IBM has acquired Kubecost, a FinOps startup that helps teams at companies like Allianz, Audi, Rakuten, and GitLab monitor and optimize their Kubernetes clusters with a focus on efficiency and, ultimately, cost. From a report: Tuesday's announcement follows IBM's $4.3 billion acquisition of Apptio in 2023, another company in the FinOps space. In previous years, we also saw IBM acquire companies like cloud app and network management firm Turbonomic and application performance management startup Instana. Now with the acquisition of KubeCost, IBM continues this effort to bolster its IT and FinOps capabilities as enterprises increasingly look to better manage their increasingly complex cloud and on-prem infrastructure.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=IBM+Acquires+Kubernetes+Cost+Optimization+Startup+Kubecost%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F09%2F17%2F184256%2F%3Futm_source%3Dtwitter%26utm_", "id": 1162721, "language": null, "link": "https://tech.slashdot.org/story/24/09/17/184256/ibm-acquires-kubernetes-cost-optimization-startup-kubecost?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "IBM Acquires Kubernetes Cost Optimization Startup Kubecost", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T18:46:15.680838+00:00", "description": "An anonymous reader shares a report: September has been a big month for desktop hypervisors, with the field's big players all delivering significant updates. Oracle delivered VirtualBox version 7.1, billed as a major upgrade thanks to its implementation of a UI with a \"modernized look and feel, offering a selection between Basic and Experienced user level with reduced or full UI functionality.\" \n\n[...] Parallels also released a desktop hypervisor update last week. Version 20 of the eponymous tool now offers a VM that's packed with tools developers may find handy as they work on generative AI applications. Among those tools are the Docker community edition, lmutils, the OpenCV computer vision library, and the Ollama chatbot interface for AI models. [...] The other big player in desktop hypervisors is VMware, with its Fusion and Workstation products for macOS and Windows respectively. Both were recently updated.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slash", "id": 1162720, "language": null, "link": "https://it.slashdot.org/story/24/09/17/1835235/desktop-hypervisors-are-like-buses-none-for-ages-then-four-at-once?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Desktop Hypervisors Are Like Buses: None for Ages, Then Four at Once", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T17:27:14.928972+00:00", "description": "The Federal Deposit Insurance Corp. on Tuesday proposed a new rule forcing banks to keep detailed records for customers of fintech apps after the failure of tech firm Synapse resulted in thousands of Americans being locked out of their accounts. From a report: The rule, aimed at accounts opened by fintech firms that partner with banks, would make the institution maintain records of who owns it and the daily balances attributed to the owner, according to an FDIC memo. Fintech apps often lean on a practice where many customers&#226;(TM) funds are pooled into a single large account at a bank, which relies on either the fintech or a third party to maintain ledgers of transactions and ownership. \n\nThat situation exposed customers to the risk that the nonbanks involved would keep shoddy or incomplete records, making it hard to determine who to pay out in the event of a failure. That's what happened in the Synapse collapse, which impacted more than 100,000 users of fintech apps including Yot", "id": 1162201, "language": null, "link": "https://news.slashdot.org/story/24/09/17/1631214/fdic-unveils-rule-forcing-banks-to-keep-fintech-customer-data-in-aftermath-of-synapse-debacle?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FDIC Unveils Rule Forcing Banks To Keep Fintech Customer Data in Aftermath of Synapse Debacle", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T17:27:14.830479+00:00", "description": "Wireless communication devices exploded across Lebanon on Tuesday, injuring over 2,700 people and killing eight, in what security experts suspect was a sophisticated Israeli intelligence operation. New York Times: Hundreds of pagers blew up at the same time across Lebanon on Tuesday in an apparently coordinated attack that killed eight people and injured more than 2,700, health officials said on Tuesday. [...] Hezbollah said that pagers belonging to its members had exploded and accused Israel of being behind the attack. The Israeli military declined to comment. \n\n[...] Three officials briefed on the attack said that it had targeted hundreds of pagers belonging to Hezbollah operatives who have used such devices for years to make it harder for their messages to be intercepted. The devices were programmed to beep for several seconds before exploding, according to the officials, who spoke on the condition of anonymity because of the sensitivity of the matter. Further reading: Reuters; CNN", "id": 1162200, "language": null, "link": "https://news.slashdot.org/story/24/09/17/1721229/exploding-pagers-injure-thousands-across-lebanon?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Exploding Pagers Injure Thousands Across Lebanon", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T16:23:33.449563+00:00", "description": "China's internet regulator has proposed a strict regime that will, if adopted, require digital platforms to label content created by AI. From a report: The Cyberspace Administration of China announced its draft plan, which will require platforms and online service providers to label all AI-generated material with a visible logo and with metadata embedded in relevant files. The draft proposes that logos appear in several locations in a text, image, video, or audio file. In audio files, Beijing wants a voice prompt to inform listeners about AI-generated content at the start and end of a file -- and, as appropriate, mid-file too. Software that plays audio files will also need to inform netizens when they tune in to AI content. \n\nVideo players can get away with just posting notices about the content at the start, end, and relevant moments during a clip. Netizens who post AI-generated content will be required to label it as such. If they use generation tools provided by a platform, they'll", "id": 1161534, "language": null, "link": "https://slashdot.org/story/24/09/17/1447222/china-wants-red-flags-on-all-ai-generated-content-posted-online?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 85, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China Wants Red Flags on All AI-generated Content Posted Online", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T16:23:33.068510+00:00", "description": "Bruce66423 writes: Allowing flexible working and working from home creates a more productive, loyal workforce, the business secretary has said. In an interview with the Times, Jonathan Reynolds said employers \"need to judge people on outcomes and not a culture of presenteeism.\" Labour is poised to unveil its Employment Rights Bill, which includes measures such as a right to \"disconnect\" outside working hours, a ban on zero-hours contracts and allowing workers to compress their contracted hours into fewer working days. \n\nBusiness groups have raised concerns about the plans, warning it could push up the cost of hiring staff and have the unintended consequence of ending overtime. However, Reynolds said Labour's plans to address workers' rights should not be alarming for business leaders. Since April, workers have had the right -- introduced under the previous government -- to ask for flexible working as soon as they start a job, but firms do not have to agree.<p><div class=\"share_submiss", "id": 1161533, "language": null, "link": "https://news.slashdot.org/story/24/09/17/157254/uk-business-secretary-says-right-to-work-from-home-boosts-productivity?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 85, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "UK Business Secretary Says Right To Work From Home Boosts Productivity", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T16:23:32.340499+00:00", "description": "Luxury camera maker Leica Camera reported record sales in 2023, defying the global decline in digital camera demand. The German company's Q3 model, priced at $6,000, saw six-month waiting lists upon release last year. Industry data shows premium camera sales are surging as smartphone photography dominates the consumer market, Economist writes. \n\nThe Camera and Imaging Products Association reports the average camera price has tripled in six years as manufacturers shift focus to high-end models. Fujifilm's X100 series, launched in February at $1,600, is sold out and commanding higher prices on secondary markets. Nikon and other brands are following suit, prioritizing premium offerings. From a report: In a Japanese interview with Yomiuri, Nikon's president, Muneaki Tokunari, acknowledged that while smartphones harmed overall sales of digital interchangeable lens cameras, they may contribute to the demand for high-end cameras. Not many years removed from dire straits, Tokunari also outlin", "id": 1161531, "language": null, "link": "https://mobile.slashdot.org/story/24/09/17/1546226/demand-for-high-end-cameras-is-soaring?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 85, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Demand For High-End Cameras is Soaring", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T14:38:12.013269+00:00", "description": "Google's acquisition strategy in online advertising has come under scrutiny in the U.S. antitrust trial against the tech giant. Neal Mohan, YouTube CEO and former Google ad executive, defended the company's purchases of DoubleClick and Admeld, saying they were aimed at competing, not neutralizing rivals. \n\nThe Justice Department alleges Google built an impenetrable ad empire by owning key parts of the ad tech stack, stifling competition. Prosecutors pointed to internal emails discussing \"parking\" acquired companies, which they argue shows intent to sideline competitors. Mohan countered that \"parking\" meant allowing acquired firms to operate independently while integrating with Google's technology.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=In+US+v.+Google%2C+YouTube's+CEO+Defends+the+Google+Way%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F09%2F17%2F1357242%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><", "id": 1161088, "language": null, "link": "https://news.slashdot.org/story/24/09/17/1357242/in-us-v-google-youtubes-ceo-defends-the-google-way?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "In US v. Google, YouTube's CEO Defends the Google Way", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T13:32:37.839394+00:00", "description": "An anonymous reader quotes a report from Wired: Eric and Donald Trump Jr., the sons of former president Donald Trump, have pledged to \"make finance great again\" with a new family-run crypto endeavor called World Liberty Financial. Introduced in a meandering livestream on X Monday, the Trump family and their associates described World Liberty Financial as a crypto platform that would let users conduct transactions without a bank sitting in the middle and extracting fees -- a concept known as decentralized finance, or DeFi. While short on details, Donald Trump, Jr. and Eric Trump both stressed repeatedly that World Liberty Financial's primary goal was to make DeFi more broadly accessible. \"It's truly our job to make it understandable,\" said Eric Trump during the livestream. \"We have to make it intuitive, we have to make it user-friendly, and we will.\" Former President Donald Trump joined the call as well, stressing his pro-crypto stance. \"I do believe in it,\" said Trump of cryptocurrenc", "id": 1160619, "language": null, "link": "https://politics.slashdot.org/story/24/09/17/0449227/the-trumps-have-gone-full-crypto-with-world-liberty-financial?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Trumps Have Gone Full Crypto With World Liberty Financial", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T10:16:33.826276+00:00", "description": "Google is updating the post-quantum cryptography in Chrome, replacing the experimental Kyber with the fully standardized Module Lattice Key Encapsulation Mechanism (ML-KEM) to enhance protection against quantum computing attacks. BleepingComputer reports: This change comes roughly five months after Google rolled out the post-quantum secure TLS key encapsulation system on Chrome stable for all users, which also caused some problems with TLS exchanges. The move from Kyber to ML-KEM though is not related to those early problems, that got resolved soon after manifesting. Rather, its a strategic choice to abandon an experimental system for a NIST-approved and fully standardized mechanism.\n \nML-KEM was fully endorsed by the U.S. National Institute of Standards and Technology (NIST) in mid-August, with the agency publishing the complete technical specifications of the final version at the time. Google explains that despite the technical changes from Kyber to ML-KEM being minor, the two are e", "id": 1159431, "language": null, "link": "https://it.slashdot.org/story/24/09/17/0455248/chrome-switching-to-nist-approved-ml-kem-quantum-encryption?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Chrome Switching To NIST-Approved ML-KEM Quantum Encryption", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T08:05:35.095349+00:00", "description": "Google's philanthropic arm is partially funding a new initiative that \"aims to deploy more than 50 small satellites in low-Earth orbit to pinpoint flare-ups as small as a classroom anywhere in the world,\" reports Ars Technica. From the report: The FireSat constellation, managed by a nonprofit called Earth Fire Alliance (EFA), will be the first satellite fleet dedicated to detecting and tracking wildfires. Google announced a fresh investment of $13 million in the FireSat constellation Monday, building on the tech giant's previous contributions to support the development of custom infrared sensors for the FireSat satellites. Google's funding commitment will maintain the schedule for the launch of the first FireSat pathfinder satellite next year, EFA said. The first batch of satellites to form an operational constellation could launch in 2026.\n \nThe FireSat satellites will be built by Muon Space, a California-based satellite manufacturing startup. Each of the Muon Space-built microsatell", "id": 1158884, "language": null, "link": "https://news.slashdot.org/story/24/09/17/0442204/google-backs-privately-funded-satellite-constellation-for-wildfire-detection?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Backs Privately Funded Satellite Constellation For Wildfire Detection", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T03:43:07.849540+00:00", "description": "An anonymous reader quotes a report from the New York Times: Scientists who helped pioneer artificial intelligence are warning that countries must create a global system of oversight to check the potentially grave risks posed by the fast-developing technology. The release of ChatGPT and a string of similar services that can create text and images on command have shown how A.I. is advancing in powerful ways. The race to commercialize the technology has quickly brought it from the fringes of science to smartphones, cars and classrooms, and governments from Washington to Beijing have been forced to figure out how to regulate and harness it. In a statement on Monday, a group of influential A.I. scientists raised concerns that the technology they helped build could cause serious harm. They warned that A.I. technology could, within a matter of years, overtake the capabilities of its makers and that \"loss of human control or malicious use of these A.I. systems could lead to catastrophic outc", "id": 1158088, "language": null, "link": "https://news.slashdot.org/story/24/09/16/2226243/ai-pioneers-call-for-protections-against-catastrophic-risks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Pioneers Call For Protections Against 'Catastrophic Risks'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T01:32:35.038164+00:00", "description": "Intel shares surged 8% after announcing plans to make its foundry business an independent unit with its own board and potential for outside capital, part of CEO Pat Gelsinger's strategy to restructure the company amid financial challenges. The company is also exploring the possibility of spinning off the foundry business, pausing some European manufacturing projects, and expanding its AI chip production partnership with Amazon Web Services to regain market share in the growing AI server chip industry. CNBC reports: As part of CEO Pat Gelsinger's effort to turn around the struggling chipmaker, Intel said in a memo to employees that it will also sell off part of its stake in Altera. Gelsinger said the restructuring would allow the foundry business to \"evaluate independent sources of funding,&#226; and comes days after Intel's board met to assess the direction and future of the company. The foundry business, which Intel plans to use to manufacture chips for other customers, has been a bi", "id": 1157703, "language": null, "link": "https://slashdot.org/story/24/09/16/2214216/intel-plans-to-turn-foundry-business-into-subsidiary-allow-for-outside-funding?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Plans To Turn Foundry Business Into Subsidiary, Allow For Outside Funding", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T01:32:34.939699+00:00", "description": "Former MoviePass CEO Mitch Lowe pleaded guilty to securities fraud, admitting he misled investors about the viability of the company's $9.95-a-month movie subscription service, and faces up to five years in prison. His co-defendant, former Helios and Matheson CEO Ted Farnsworth, faces similar charges and is scheduled for trial in March 2025; Farnsworth has been in federal custody since August 2023 due to bond violations involving misuse of company funds. Variety reports: Farnsworth and Lowe were the architects of MoviePass' doomed all-you-can-watch offering, which resulted in hundreds of millions of dollars in investor losses in 2017 and 2018. Investigators found that Lowe tried to stem the losses by throttling the service, forcing high-volume users to reset their passwords and verify their tickets. The two men were charged in November 2022 on counts of wire fraud and securities fraud. According to Lowe's plea agreement, the government estimates the total losses from the scheme at $30", "id": 1157702, "language": null, "link": "https://yro.slashdot.org/story/24/09/16/2221244/former-moviepass-ceo-mitch-lowe-pleads-guilty-to-securities-fraud-conspiracy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Former MoviePass CEO Mitch Lowe Pleads Guilty to Securities Fraud Conspiracy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T00:28:26.142569+00:00", "description": "An anonymous reader quotes a report from the Associated Press: The Postal Service's new delivery vehicles aren't going to win a beauty contest. They're tall and ungainly. The windshields are vast. Their hoods resemble a duck bill. Their bumpers are enormous. \"You can tell that (the designers) didn't have appearance in mind,\" postal worker Avis Stonum said. Odd appearance aside, the first handful of Next Generation Delivery Vehicles that rolled onto postal routes in August in Athens, Georgia, are getting rave reviews from letter carriers accustomed to cantankerous older vehicles that lack modern safety features and are prone to breaking down -- and even catching fire.\n \nWithin a few years, the fleet will have expanded to 60,000, most of them electric models, serving as the Postal Service's primary delivery truck from Maine to Hawaii. Once fully deployed, they'll represent one of the most visible signs of the agency's 10-year, $40 billion transformation led by Postmaster General Louis D", "id": 1157514, "language": null, "link": "https://tech.slashdot.org/story/24/09/16/2114245/usps-long-awaited-mail-truck-makes-its-debut-to-rave-reviews-from-carriers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "USPS' Long-Awaited Mail Truck Makes Its Debut To Rave Reviews From Carriers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-17T00:28:25.602504+00:00", "description": "The FDA has approved sleep apnea detection on the Apple Watch Series 9, Series 10, and Watch Ultra 2. \"The green light comes four days ahead of the Series 10's September 20 release date,\" notes TechCrunch. From the report: The feature, announced at last week's iPhone 16 event, will arrive as part of the imminent watchOS 11 release. Once enabled, it requires 10 nights of sleep tracking data spread out over a 30-day span to determine whether a user may have the condition. During that time, it also offers insights into nightly sleeping disturbances, utilizing the on-board accelerometer.\n \nThe FDA classes the feature as an \"over-the-counter device to assess risk of sleep apnea.\" Apple is quick to note that the addition is not a diagnostic tool. Rather, it will prompt users to seek a formal diagnosis from a healthcare provider. The condition, which causes breathing to become shallower or repeatedly stop during the night, is associated with a variety of different symptoms. The Mayo Clinic n", "id": 1157513, "language": null, "link": "https://science.slashdot.org/story/24/09/16/227236/apple-watch-sleep-apnea-detection-gets-fda-approval?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Watch Sleep Apnea Detection Gets FDA Approval", "vote": 0}]