[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "What Role Could Batman Play In Suicide Squad: Kill The Justice League?", "description": "2015’s Batman: Arkham Knight was the last time that the famous superhero had a major presence in a AAA game, but after a long absence, he’s finally set to make his return in the upcoming Suicide Squad: Kill the Justice League. \n\nOf course, he won’t be a playable character, but as a hero-turned-villain thanks to Braniac’s antics and an enemy that the titular Suicide Squad will have to take on and deal with, he has a potentially interesting role to play in the upcoming shooter’s story. \n\nAdd to that the fact that the game is going to be set in the same universe as the Batman: Arkham games, and there’s even more potential for some interesting storytelling- which is exactly what we’ll be talking about in this feature.", "link": "https://www.youtube.com/watch?v=uHvtQhh5PsU", "date_published": "2024-01-13T19:30:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i2.ytimg.com/vi/uHvtQhh5PsU/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "18 NEW Horror And Zombie Games Releasing In 2024 And Beyond", "description": "Horror games have been one of the most prominent genres of the last year, with great hits like Dead Space Remake taking us back to the glory days of the franchise without any of the frustrations that come along with it. And now that 2024 has finally dawned upon us, it’s really exciting to see what’s in store for fans of spooky games. \n\nWith this feature, we will look at some of the best zombie/horror games that will be released in 2024 and beyond, from indie games like ILL to retro throwbacks like Echoes of the Living to frenetic firefights found in games like Killing Floor 3 and much more.", "link": "https://www.youtube.com/watch?v=j33wxz21IMw", "date_published": "2024-01-13T15:30:10+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i3.ytimg.com/vi/j33wxz21IMw/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 BRAND NEW Open World Games of 2024 And Beyond", "description": "There’s nothing like the boundless player freedom provided by open world games. The chance to go anywhere at your own pace, to explore, discover, and immerse in increasingly detailed, lifelike environments is unparalleled in gaming. \n\nThe thing with open world game design too is it can accommodate numerous distinct game genres too. The upcoming new open world games on this rundown aren’t just the usual fayre of exploration and combat, there’re street racing titles, creature farming, primeval survival, and – in Death Stranding 2’s case – something enigmatic that can’t be surmised by a teaser trailer. \n\n2024 will be a great year for open world games, but this feature was sure to include a handful from the year’s beyond as there’s some hefty titles in the distant future.", "link": "https://www.youtube.com/watch?v=9imY9Qj7PEU", "date_published": "2024-01-13T09:30:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i2.ytimg.com/vi/9imY9Qj7PEU/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]