[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-27T20:30:01+00:00", "description": "While Codemasters offers its take on building a team and managing various aspects, Frontier Development's F1 Manager aspires for something more. This year's iteration aims to go further beyond, providing the option to make a team and compete against the best to rise to the top.\n\nOf course, it's easier said than done when you need to balance various facilities, manage the Mentality and confidence of your Drivers, improve and fine-tune vehicles, negotiate contracts, meet sponsor expectations and much more. The wealth of options in Create A Team means several unique starts and challenges while expertly capturing the tension of Race Day.\n\nIt has several flaws, from the oddly handled contracts system and Drivers communicating phantom occurrences to iffy crash physics. However, F1 Manager 2024 offers a compelling depiction of the highs and lows of the sport behind the scenes with some good production values.", "id": 941658, "language": null, "link": "https://www.youtube.com/watch?v=Z8UmU1dv7_Y", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/Z8UmU1dv7_Y/hqdefault.jpg", "title": "F1 Manager 2024 Review - Can This Automobile Sim Take Pole Position?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-27T14:00:46+00:00", "description": "Fallout 5 may not be coming anytime soon, but for longtime fans of the franchise, there's something else to dive into. Fallout: London, an ambitious mod in the works for years, is finally available on PC. It explores the post-apocalypse across the ocean as players escape a mysterious facility to discover their true identity.\n\nWhile it's not leaps and bounds ahead of Fallout 4 in visuals, Fallout: London captures the city's atmosphere in incredible detail while adding new weapons, enemies, and much more. Team FOLON is touting 200 quests, 20 factions, full voice acting for its extensive cast of characters, and even a revamped soundtrack.\n\nThough it has several issues concerning optimization, Fallout: London is worth playing for fans of the series. The fact that it offers such a detailed look into another part of the world while being free is simply mind-boggling.", "id": 940467, "language": null, "link": "https://www.youtube.com/watch?v=kcSDNxW7cng", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/kcSDNxW7cng/hqdefault.jpg", "title": "Fallout London Is A MUST PLAY For Fallout Fans", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-27T10:45:00+00:00", "description": "Third person genres have been a popular genre for a long, long time now, and they have only grown in popularity as time has gone on, even bleeding into genres that traditionally did not have much to do with shooters. \n\nOver the years, we’ve been spoiled with some truly excellent games in the genre that we are unlikely to forget about anytime soon, but on the flipside, there are no few legitimately fun and well-made third person shooters that don’t get the sort of recognition that they probably deserve. \n\nThough not perfect, these are games with their own unique strengths that we would love to see attracting a larger audience. Here, we’re going to go over a few such games.\n\nLinks to previous parts:\n\nPart 1: https://www.youtube.com/watch?v=zBUDn6yS8S4\n\nPart 2: https://www.youtube.com/watch?v=OfEmU-fQsQE\n\nPart 3: https://www.youtube.com/watch?v=gIfnuYWBk4U", "id": 939730, "language": null, "link": "https://www.youtube.com/watch?v=0llWczP5GyQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/0llWczP5GyQ/hqdefault.jpg", "title": "15 MORE Amazing Third Person Shooters You Didn't Play", "user": null, "vote": 0}]