[{"title": "17 NEW Third And First Person Shooters of 2024 You Need To Look Forward To", "comments": [], "bookmarked": false, "user": null, "dead": false, "album": "", "thumbnail": "https://i3.ytimg.com/vi/FFhWxni1yqw/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "language": null, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_visits": 0, "artist": "GamingBolt", "vote": 0, "source_obj__id": 208, "description": "Shooting games continue to be one of the most popular genres in gaming, and fans have been treated to some amazing first and third person shooters in the last few years. \n\nAs we move towards the year 2024 and beyond, the future is looking pretty bright for fans of shooters. Right from post-apocalyptic games like STALKER 2 to ultra realistic tactical shooters like Unrecord and live service games like The Division 3, there's no shortage of first and third person shooters that are due to release in 2024 and beyond. \n\nWith this feature, we have compiled a list of 17 of the best first and third person shooters that are worth looking forward to complete with release dates and platforms.", "page_rating": 0, "date_published": "2024-01-30T15:30:07+00:00", "tags": [], "link": "https://www.youtube.com/watch?v=FFhWxni1yqw", "permanent": false}, {"title": "13 BIG PS5 Announcements That Could Happen At State of Play", "comments": [], "bookmarked": false, "user": null, "dead": false, "album": "", "thumbnail": "https://i2.ytimg.com/vi/ipM_KRm0cks/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "language": null, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_visits": 0, "artist": "GamingBolt", "vote": 0, "source_obj__id": 208, "description": "Sony has confirmed that a State of Play presentation is coming immimently, on January 31, and it’s looking like it's going to be a big one. Rise of the Ronin is confirmed to make an apperance, but with the event set to last over 40 minutes and cover more than 15 upcoming games, there’s plenty that we don’t know about- officially, at least. \n\nReports have potentially spilled the beans on a number of major titles that are expected to show up at the upcoming State of Play, while there are some games that we can pretty safely speculate will show up, even if there aren’t any reports specifically suggesting that. \n\nAs such, here, we’re going to go over several big announcements that have a good chance of taking the spotlight at the State of Play showcase.", "page_rating": 0, "date_published": "2024-01-30T10:30:22+00:00", "tags": [], "link": "https://www.youtube.com/watch?v=ipM_KRm0cks", "permanent": false}]