[{"tags": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Planet Zoo: PS5 And Xbox Series X | S - 15 Things You Need To Know Before Purchasing", "comments": [], "album": "", "page_rating_votes": 0, "language": null, "vote": 0, "age": null, "link": "https://www.youtube.com/watch?v=XpYAkRfJj-o", "artist": null, "source_obj__id": 129, "user": null, "date_published": "2024-03-15T22:30:04+00:00", "bookmarked": false, "permanent": false, "page_rating_contents": 94, "dead": false, "thumbnail": "https://i1.ytimg.com/vi/XpYAkRfJj-o/hqdefault.jpg", "page_rating": 94, "description": "Amid Frontier Developments' various console endeavors, seeing Planet Zoo on Xbox Series X/S and PS5 is perhaps the most surprising. Released in 2019 for PC, the management title launches on March 26th for current-gen consoles, with years of free updates included.\n\nPlayers can access Career, Sandbox, Challenge and Online Franchise modes; manage 76 different species of animals, keeping their needs in mind; hire staff to help build up their zoo for visitors; and indulge in research to improve the lives of their animals. With different biomes, each offering unique challenges and numerous customization options, Planet Zoo promises to keep new players busy for some time.\n\nFrom the Season Pass content to cross-platform sharing of Blueprints, here's what console players should know about the management title before it launches this month.", "page_rating_visits": 0}, {"tags": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Rise of the Ronin vs. Ghost of Tsushima – 15 BIGGEST DIFFERENCES", "comments": [], "album": "", "page_rating_votes": 0, "language": null, "vote": 0, "age": null, "link": "https://www.youtube.com/watch?v=rzOF5HP7fcI", "artist": null, "source_obj__id": 129, "user": null, "date_published": "2024-03-15T15:30:27+00:00", "bookmarked": false, "permanent": false, "page_rating_contents": 94, "dead": false, "thumbnail": "https://i3.ytimg.com/vi/rzOF5HP7fcI/hqdefault.jpg", "page_rating": 94, "description": "Team Ninja's Rise of the Ronin is one of the more hyped titles of the year, with its launch coming up on March 22nd for PS5. Pre-release impressions have ranged from average to very positive, but some, if not all, draw comparisons to another Sony exclusive - Ghost of Tsushima.\n\nWhether it's the open world, the combat or even the presentation, Ghost of Tsushima is seemingly the bar which Rise of the Ronin is measured against (for better or worse). Whether you're a fan of Sucker Punch's epic or looking for something similar, there are several differences between the two.\n\nCheck out 15 ways that Rise of the Ronin differs from Ghost of Tsushima, from their story and characters to the combat essentials and co-op.", "page_rating_visits": 0}, {"tags": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "What The Hell Is Going On With Star Wars: Battlefront Classic Collection?", "comments": [], "album": "", "page_rating_votes": 0, "language": null, "vote": 0, "age": null, "link": "https://www.youtube.com/watch?v=-7V1AeHz55Y", "artist": null, "source_obj__id": 129, "user": null, "date_published": "2024-03-15T10:15:00+00:00", "bookmarked": false, "permanent": false, "page_rating_contents": 94, "dead": false, "thumbnail": "https://i2.ytimg.com/vi/-7V1AeHz55Y/hqdefault.jpg", "page_rating": 94, "description": "Star Wars: Battlefront Classic Collection launched recently, and what should have been some moment for the community quickly went wrong. Players who hopped onto for multiplayer realized that only three servers were available to accommodate nearly 10,000 players on Steam.\n\nSeveral other issues were quickly discovered, from the lack of aim assist in multiplayer to split-screen only supporting two players instead of four. While developer Aspyr reportedly added more servers, players complained of high ping, lag, stuttering and more. That's not including crashes, graphical glitches and other issues players have discovered in short order.\n\nSuffice it to say that the Steam rating took a beating, plummeting to \"Mostly Negative\" reviews. What caused all this? How did a collection that offers some genuinely great modes and content for single-player fumble so hard with multiplayer and quality control? What's Aspyr's next move? Find out here.", "page_rating_visits": 0}]