[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T22:43:06.397335+00:00", "description": "\"The US Cybersecurity and Infrastructure Security Agency has added a critical security bug in Linux to its list of vulnerabilities known to be actively exploited in the wild,\" reported Ars Technica on Friday. \n\n\"The vulnerability, tracked as CVE-2024-1086 and carrying a severity rating of 7.8 out of a possible 10, allows people who have already gained a foothold inside an affected system to escalate their system privileges.\"\n\nIt's the result of a use-after-free error, a class of vulnerability that occurs in software written in the C and C++ languages when a process continues to access a memory location after it has been freed or deallocated. Use-after-free vulnerabilities can result in remote code or privilege escalation. The vulnerability, which affects Linux kernel versions 5.14 through 6.6, resides in the NF_tables, a kernel component enabling the Netfilter, which in turn facilitates a variety of network operations... It was patched in January, but as the CISA advisory indicates, s", "language": "en-us", "link": "https://linux.slashdot.org/story/24/06/01/2049230/federal-agency-warns-patched-critical-linux-vulnerability-being-actively-exploited?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Federal Agency Warns (Patched) Critical Linux Vulnerability Being Actively Exploited", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T21:41:19.750418+00:00", "description": "\"Within less than a minute, I'm approached by a store worker who comes up to me and says, 'You're a thief, you need to leave the store'.\" \n\nThat's a quote from the BBC by a wrongly accused customer who was flagged by a facial-recognition system called Facewatch. \"She says after her bag was searched she was led out of the shop, and told she was banned from all stores using the technology.\" \n\nFacewatch later wrote to her and acknowledged it had made an error &mdash; but declined to comment on the incident in the BBC's report:\n\n\n[Facewatch] did say its technology helped to prevent crime and protect frontline workers. Home Bargains, too, declined to comment. It's not just retailers who are turning to the technology... [I]n east London, we joined the police as they positioned a modified white van on the high street. Cameras attached to its roof captured thousands of images of people's faces. If they matched people on a police watchlist, officers would speak to them and potentially arrest t", "language": "en-us", "link": "https://news.slashdot.org/story/24/06/01/2018224/how-facial-recognition-tech-is-being-used-in-london-by-shops---and-police?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How Facial Recognition Tech Is Being Used In London By Shops - and Police", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T20:36:17.270829+00:00", "description": "Journalist Steven Brill has written a new book called The Death of Truth. Its subtitle? \"How Social Media and the Internet Gave Snake Oil Salesmen and Demagogues the Weapons They Needed to Destroy Trust and Polarize the World-And What We Can Do.\" \n\nAn excerpt published by Wired points out that last year around the world, $300 billion was spent on \"programmatic advertising\", and $130 billion was spent in the United States alone in 2022. The problem? For over a decade there's been \"brand safety\" technology, the article points out &mdash; but \"what artificial intelligence could not do was spot most forms of disinformation and misinformation...\" \n\nThe end result...\n\nIn 2019, other than the government of Vladimir Putin, Warren Buffett was the biggest funder of Sputnik News, the Russian disinformation website controlled by the Kremlin... Geico, the giant American insurance company and subsidiary of Buffett's Berkshire Hathaway, was the leading advertiser on the American version of Sputnik N", "language": "en-us", "link": "https://news.slashdot.org/story/24/06/01/1855208/how-misinformation-spreads-its-funded-by-the-hellhole-of-programmatic-advertising?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How Misinformation Spreads? It's Funded By 'The Hellhole of Programmatic Advertising'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T20:36:15.374494+00:00", "description": "Long-time Slashdot reader schwit1 shares the announcement of a new report from the International Energy Forum:\n\nThe seemingly universal presumption persists that the copper needed for the green transition will somehow be available... This paper addresses this issue by projecting copper supply and demand from 2018 to 2050 and placing both in the historical context of copper mine output... \n\nJust to meet business-as-usual trends, 115% more copper must be mined in the next 30 years than has been mined historically until now. To electrify the global vehicle fleet requires bringing into production 55% more new mines than would otherwise be needed... Our main purpose... is to communicate the magnitude of the copper mining challenge to the broader public that is less familiar with upstream resource issues. \n\n\"On the other hand, hybrid electric vehicle manufacture would require negligible extra copper mining...\" the report points out. \n\n Wikipedia describes the non-profit as a 73-country orga", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/01/1932203/vehicle-electrification-could-require-55-more-copper-mines-in-the-next-30-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Vehicle Electrification Could Require 55% More Copper Mines in the Next 30 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T19:03:45.319859+00:00", "description": "A new article in the Washington Post argues that a phenomenon called \"Quiet vacationing\" has \"joined 'quiet quitting' and 'quiet firing' as the latest (and least poetic) scourge of the modern workplace. \n\n\"Also known as the hush trip, workcation, hush-cation, or bleisure travel &mdash; you get the idea &mdash; quiet vacationing refers to workers taking time off, even traveling, without notifying their employers.\"\n\n\nTaking advantage of work-from-anywhere technology, they are logging in from hotels, beaches and campgrounds, sometimes using virtual backgrounds and VPNs to cover their tracks. \n Given the difficulty many employers already have trusting remote workers to be productive anywhere outside the office, you can bet they are not keen on the idea of their employees pretending to have their head in the game while their toes are in the sand. But employers also have legitimate legal reasons for keeping tabs on their employees' location when they're on the clock. \"Evil HR Lady\" Suzanne ", "language": "en-us", "link": "https://it.slashdot.org/story/24/06/01/0313226/not-quiet-quitting---remote-workers-try-quiet-vacationing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Not 'Quiet Quitting' - Remote Workers Try 'Quiet Vacationing'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T17:57:56.962993+00:00", "description": "How will Apple protect user data while their requests are being processed by AI in applications like Siri? \n\nLong-time Slashdot reader AmiMoJo shared this report from Apple Insider:\nAccording to sources of The Information [four different former Apple employees who worked on the project], Apple intends to process data from AI applications inside a virtual black box. \n\nThe concept, known as \"Apple Chips in Data Centers\" internally, would involve only Apple's hardware being used to perform AI processing in the cloud. The idea is that it will control both the hardware and software on its servers, enabling it to design more secure systems. While on-device AI processing is highly private, the initiative could make cloud processing for Apple customers to be similarly secure... By taking control over how data is processed in the cloud, it would make it easier for Apple to implement processes to make a breach much harder to actually happen. \n\nFurthermore, the black box approach would also prev", "language": "en-us", "link": "https://apple.slashdot.org/story/24/06/01/1727203/apples-ai-plans-include-black-box-for-cloud-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple's AI Plans Include 'Black Box' For Cloud Data", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T16:53:22.697449+00:00", "description": "This week the Washington Post reported that Americans \"are more hesitant to buy EVs now than they were a year ago, according to a March Gallup poll, which found that just 44 percent of American adults say they'd consider buying an EV in the future, down from 55 percent last year. High prices and charging worries consistently rank as the biggest roadblocks for electric vehicles,\" they write, noting the concerns coincide with a slowdown in electric car and truck sales, while hybrids are increasing their market share. \n\n\nBut something else happened this week. The chair of California's Air Resource Board and the chair of the state's Energy Commission teamed up for an op-ed piece arguing that \"despite negative hype,\" electric cars are their state's future:\n\nWhen California's electric vehicle sales dipped at the end of last year, critics predicted the start of a new downward trend that would doom the industry and the state's broader effort to clean up the transportation sector, the single l", "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/01/0355210/electric-car-sales-keep-increasing-in-california-despite-negative-hype?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Electric Car Sales Keep Increasing in California, Despite 'Negative Hype'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T15:48:11.132658+00:00", "description": "\"A Swiss biocomputing startup has launched an online platform that provides remote access to 16 human brain organoids,\" reports Tom's Hardware:\n\n\nFinalSpark claims its Neuroplatform is the world's first online platform delivering access to biological neurons in vitro. Moreover, bioprocessors like this \"consume a million times less power than traditional digital processors,\" the company says. FinalSpark says its Neuroplatform is capable of learning and processing information, and due to its low power consumption, it could reduce the environmental impacts of computing. In a recent research paper about its developments, FinalSpakr claims that training a single LLM like GPT-3 required approximately 10GWh &mdash; about 6,000 times greater energy consumption than the average European citizen uses in a whole year. Such energy expenditure could be massively cut following the successful deployment of bioprocessors. \n\nThe operation of the Neuroplatform currently relies on an architecture that c", "language": "en-us", "link": "https://science.slashdot.org/story/24/06/01/061202/worlds-first-bioprocessor-uses-16-human-brain-organoids-consumes-less-power?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "World's First Bioprocessor Uses 16 Human Brain Organoids, Consumes Less Power", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T14:43:21.889062+00:00", "description": "An anonymous reader shared this report from the Washington Post:\n\n\n Twice before, this Virginia carpenter had awoken in the predawn to start his work day only to find one of his vans broken into. Tools he depends on for a living had been stolen, and there was little hope of retrieving them. Determined to shut down thieves, he said, he bought a bunch of Apple AirTags and hid the locator devices in some of his larger tools that hadn't been pilfered. Next time, he figured, he would track them. \n\nIt worked. \n On Jan. 22, after a third break-in and theft, the carpenter said, he drove around D.C.'s Maryland suburbs for hours, following an intermittent blip on his iPhone, until he arrived at a storage facility in Howard County. He called police, who got a search warrant, and what they found in the locker was far more than just one contractor's nail guns and miter saws. \n\nThe storage unit, stuffed with purloined power tools, led detectives to similar caches in other places in the next four mo", "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/01/0332238/how-an-apple-airtag-helped-police-recover-15000-stolen-power-tools?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How an Apple AirTag Helped Police Recover 15,000 Stolen Power Tools", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T13:38:25.132330+00:00", "description": "An anonymous reader quotes a report from Digital Trends: HP researchers have published a paper detailing a new modular monitor design they call \"composable microLED monitors.\" Using advancing microLED tech to make smaller screens with no bezels, they imagine a Lego-like system that allows customers to buy different monitor modules and slot them together at home. In the paper, diagrams show \"core units\" with a direct connection to the host computer being expanded both horizontally and vertically with multiple extensions. The idea is that by choosing from flat or curved extension pieces and connecting them to the core unit, you can make a monitor in whatever size or shape you want. To keep assembly simple and effective, the design uses jigsaw-like connections alongside magnets to ensure each module automatically aligns correctly. And to prevent the number of possible configurations from getting out of hand, the design only allows extensions to attach to the sides or bottom of the square", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/01/0249252/hps-microled-monitors-stack-together-like-legos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "HP's MicroLED Monitors Stack Together Like Legos", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T10:15:28.326121+00:00", "description": "Benj Edwards and Ashley Belanger reports via Ars Technica: On Wednesday, Axios broke the news that OpenAI had signed deals with The Atlantic and Vox Media that will allow the ChatGPT maker to license their editorial content to further train its language models. But some of the publications' writers -- and the unions that represent them -- were surprised by the announcements and aren't happy about it. Already, two unions have released statements expressing \"alarm\" and \"concern.\" \"The unionized members of The Atlantic Editorial and Business and Technology units are deeply troubled by the opaque agreement The Atlantic has made with OpenAI,\" reads a statement from the Atlantic union. \"And especially by management's complete lack of transparency about what the agreement entails and how it will affect our work.\"\n \nThe Vox Union -- which represents The Verge, SB Nation, and Vulture, among other publications -- reacted in similar fashion, writing in a statement, \"Today, members of the Vox Med", "language": "en-us", "link": "https://news.slashdot.org/story/24/06/01/0245209/journalists-deeply-troubled-by-openais-content-deals-with-vox-the-atlantic?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Journalists 'Deeply Troubled' By OpenAI's Content Deals With Vox, The Atlantic", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T08:05:17.337434+00:00", "description": "On June 3, a \"planet parade\" of six planets -- Jupiter, Mercury, Uranus, Mars, Neptune and Saturn -- will form a straight line through the pre-dawn sky. Astronomy.com reports: Some 20 minutes before sunrise, all six planets should be visible, though note that Uranus (magnitude 5.9) and Neptune (magnitude 7.8) will be too faint for naked-eye observing and, although they're present in the lineup, will need binoculars or a telescope to spot. But Jupiter (magnitude -2), Mercury (magnitude -1), Mars (magnitude 1), and Saturn (magnitude 1) will all stand out clearly to the naked eye in a line spanning some 73 degrees on the sky.\n \nWhat's more, a delicate waning crescent Moon is crashing the party as well, standing just to the lower left of Mars. Note, however, that our Moon is not perfectly in line -- that's because Luna's orbit is tilted some 5 degrees with respect to the ecliptic. The next morning, June 4, the crescent Moon does a little better, falling more closely in line a bit farther ", "language": "en-us", "link": "https://science.slashdot.org/story/24/06/01/0233258/planetary-parade-will-see-six-planets-line-up-in-the-morning-sky?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Planetary Parade' Will See Six Planets Line Up In the Morning Sky", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T03:44:32.523131+00:00", "description": "An anonymous reader quotes a report from the New York Times: Last year, Jaume Pellicer led a team of fellow scientists into a forest on Grande Terre, an island east of Australia. They were in search of a fern called Tmesipteris oblanceolata. Standing just a few inches tall, it was not easy to find on the forest floor. \"It doesn't catch the eye,\" said Dr. Pellicer, who works at the Botanical Institute of Barcelona in Spain. \"You would probably step on it and not even realize it.\" The scientists eventually managed to spot the nondescript fern. When Dr. Pellicer and his colleagues studied it in the lab, they discovered it held an extraordinary secret. Tmesipteris oblanceolata has the largest known genome on Earth. As the researchers described in a study published on Friday, the fern's cells contain more than 50 times as much DNA as ours do. [The analysis revealed the species T. oblanceolata to have a record-breaking genome size of 160.45 Gbp, which is about 7% larger than that of P. japo", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/31/2247221/scientists-find-the-largest-known-genome-inside-a-small-plant?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Scientists Find the Largest Known Genome Inside a Small Plant", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T01:35:08.837453+00:00", "description": "Last than two weeks after it was announced, \"Windows enthusiasts have managed to crack Microsoft's flagship AI-powered Recall feature to run on unsupported hardware,\" reports The Verge. From the report: Recall leverages local AI models on new Copilot Plus PCs to run in the background and take snapshots of anything you've done or seen on your PC. You then get a timeline you can scrub through and the ability to search for photos, documents, conversations, or anything else on your PC. Microsoft positioned Recall as needing the very latest neural processing units (NPU) on new PCs, but you can actually get it running on older Arm-powered hardware.\n \nWindows watcher Albacore has created a tool called Amperage, which enables Recall on devices that have an older Qualcomm Snapdragon chip, Microsoft's SQ processors, or an Ampere chipset. You need to have the latest Windows 11 24H2 update installed on one of these Windows on Arm devices, and then the tool will unlock and enable Recall. [...] You", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/31/2226235/windows-11s-new-recall-feature-has-been-cracked-to-run-on-unsupported-hardware?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Windows 11's New Recall Feature Has Been Cracked To Run On Unsupported Hardware", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T01:35:06.696493+00:00", "description": "London's famed Evening Standard newspaper has announced plans to end its daily outlet, \"bringing an end to almost 200 years of publication in the capital,\" reports The Guardian. Going forward, the company plans to launch \"a brand new weekly newspaper later this year and consider options for retaining ES Magazine with reduced frequency,\" while also working to increase traffic to its website. \"In its 197-year history the Evening Standard has altered its format, price, content and distribution models,\" notes The Guardian. \"But giving up on producing a daily print newspaper is the biggest change yet.\" From the report: The newspaper said it has been hit hard by the introduction of wifi on the London Underground, a shortage of commuters owing to the growth of working from home and changing consumer habits. The Standard lost 84.5 million pounds in the past six years, according to its accounts, and is reliant on funding from its part-owner Evgeny Lebedev. Its other shareholders include a bank", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/31/2237222/londons-evening-standard-to-end-daily-newspaper-after-almost-200-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "London's Evening Standard To End Daily Newspaper After Almost 200 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T00:31:27.701014+00:00", "description": "The New York Times, owner of the once-viral, word game Wordle, is suing a geography-based spinoff called Worldle, accusing its similar name of \"creating confusion\" and attempting to capitalize on \"the enormous goodwill\" associated with its own brand. Worldle's creator, Kory McDonald, vows to fight back. The BBC reports: \"There's a whole industry of [dot]LE games,\" he told the BBC. \"Wordle is about words, Worldle is about the world, Flaggle is about flags,\" he pointed out. The New York Times disagrees. Worldle is \"nearly identical in appearance, sound, meaning, and imparts the same commercial impression to... Wordle,\" it says in its legal document. The paper told the BBC it had no further comment to make beyond the contents of its legal submission.\n \nBritish inventor Josh Wardle developed Wordle in 2021 as a side project to keep his girlfriend entertained. But since then it has become a behemoth, reaching millions of people worldwide. By contrast, around 100,000 people play Worldle eve", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/31/1949210/wordle-in-legal-row-with-geography-spinoff-wordle?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Wordle In Legal Row With Geography Spinoff, Wordle", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-01T00:31:25.815813+00:00", "description": "An anonymous reader quotes a report from Bloomberg: California expects to avoid rolling blackouts this summer as new solar plants and large batteries plug into the state's grid at a rapid clip. The state's electricity system has been strained by years of drought, wildfires that knock out transmission lines and record-setting heat waves. But officials forecast Wednesday new resources added to the grid in the last four years would give California ample supplies for typical summer weather.\n \nSince 2020, California has added 18.5 gigawatts of new resources. Of that, 6.6 gigawatts were batteries, 6.3 gigawatts were solar and 1.4 gigawatts were a combination of solar and storage. One gigawatt can power about 750,000 homes. In addition, the state's hydropower plants will be a reliable source of electricity after two wet winters in a row ended California's most recent drought. Those supplies would hold even if California experiences another heat wave as severe as the one that triggered rollin", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/31/203236/battery-powered-california-faces-lower-blackout-risk-this-summer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Battery-Powered California Faces Lower Blackout Risk This Summer", "user": null, "vote": 0}]