[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T23:08:41.378513+00:00", "description": "Salesforce shares dropped as much as 17% in extended trading due to weaker-than-expected revenue and guidance that fell short of Wall Street expectations. \"Revenue in the fiscal first quarter, which ended April 30, increased 11% from $8.25 billion a year earlier,\" reports CNBC. \"It's the first time since 2006 that Salesforce fell short on revenue, according to LSEG data.\" From the report: Salesforce called for adjusted earnings per share in the current quarter of $2.34 to $2.36 on $9.2 billion to $9.25 billion in revenue. Analysts surveyed by LSEG had expected $2.40 in adjusted earnings per share on $9.37 billion in revenue. [...] Salesforce saw budget scrutiny and longer deal cycles than usual during the quarter, president and operating chief Brian Millham told analysts on a conference call. Management implemented go-to-market changes that cut into bookings, Millham said.\n \nAll five of Salesforce's product areas contributed to the growth. But revenue from the Professional Services an", "language": "en-us", "link": "https://slashdot.org/story/24/05/29/2157220/salesforce-shares-plunge-17-on-first-revenue-miss-since-2006?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Salesforce Shares Plunge 17% On First Revenue Miss Since 2006", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T22:03:41.427833+00:00", "description": "American Lidar, a company registered in Michigan in December, is a subsidiary of China-based lidar maker Hesai Group, which the U.S. has labeled a security concern, WSJ reported Wednesday, citing policymakers and national-security experts. Chinese firms facing regulatory or reputational problems are rebranding and creating U.S.-domiciled businesses to sell their wares as the Biden administration expands the government entity lists that restrict Chinese companies' business dealings in the U.S., the report said. \n\nThese moves, while legal, irritate regulators who can't enforce laws when it isn't clear who is behind a company. Hesai became a target in the U.S.-China tech-trade war after allegations that its laser sensors could be used to collect sensitive American data, and was added to the Defense Department list that designates companies as Chinese military entities operating in the U.S. BGI Genomics and DJI are also facing similar challenges and are attempting to rebrand or license th", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/29/1849214/blacklisted-chinese-companies-rebrand-as-american-to-dodge-crackdown?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Blacklisted Chinese Companies Rebrand as American To Dodge Crackdown", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T22:03:39.889725+00:00", "description": "An anonymous reader quotes a report from KrebsOnSecurity: The U.S. Department of the Treasury today unveiled sanctions against three Chinese nationals for allegedly operating 911 S5, an online anonymity service that for many years was the easiest and cheapest way to route one's Web traffic through malware-infected computers around the globe. KrebsOnSecurity identified one of the three men in a July 2022 investigation into 911 S5, which was massively hacked and then closed ten days later.\n \nFrom 2015 to July 2022, 911 S5 sold access to hundreds of thousands of Microsoft Windows computers daily, as \"proxies\" that allowed customers to route their Internet traffic through PCs in virtually any country or city around the globe -- but predominantly in the United States. 911 built its proxy network mainly by offering \"free\" virtual private networking (VPN) services. 911's VPN performed largely as advertised for the user -- allowing them to surf the web anonymously -- but it also quietly turne", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/29/2148232/treasury-sanctions-creators-of-911-s5-proxy-botnet?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Treasury Sanctions Creators of 911 S5 Proxy Botnet", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T20:58:28.423943+00:00", "description": "An anonymous reader shares a report: At a two-hour drive from Riyadh, Saudi Arabia's capital, rows of solar panels extend to the horizon like waves on an ocean. Despite having almost limitless reserves of oil, the kingdom is embracing solar and wind power, partly in an effort to retain a leading position in the energy industry, which is vitally important to the country but fast changing. Looking out over 3.3 million panels, covering 14 square miles of desert, Faisal Al Omari, chief executive of a recently completed solar project called Sudair, said he would tell his children and grandchildren about contributing to Saudi Arabia's energy transition. \n\nAlthough petroleum production retains a crucial role in the Saudi economy, the kingdom is putting its chips on other forms of energy. Sudair, which can light up 185,000 homes, is the first of what could be many giant projects intended to raise output from renewable energy sources like solar and wind to around 50 percent by 2030. Currently,", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/29/1853205/saudi-arabia-eyes-a-future-beyond-oil?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Saudi Arabia Eyes a Future Beyond Oil", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T20:58:26.855570+00:00", "description": "An anonymous reader shares a report: Google is killing off a messaging service! This one is the odd \"Google Business Messaging\" service -- basically an instant messaging client that is built into Google Maps. If you looked up a participating business in Google Maps or Google Search on a phone, the main row of buttons in the place card would read something like \"Call,\" \"Chat,\" \"Directions,\" and \"Website.\" That \"Chat\" button is the service we're talking about. It would launch a full messaging interface inside the Google Maps app, and businesses were expected to use it for customer service purposes. Google's deeply dysfunctional messaging strategy might lead people to joke about a theoretical \"Google Maps Messaging\" service, but it already exists and has existed for years, and now it's being shut down.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+is+Killing+Off+the+Messaging+Service+Inside+Google+Maps%3A+https%3A%2F%2Ftech.slashdot.org%", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/29/1856254/google-is-killing-off-the-messaging-service-inside-google-maps?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google is Killing Off the Messaging Service Inside Google Maps", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T19:53:41.347173+00:00", "description": "Apple is seeking a senior engineer to help build a television and sports app for Android, a sign the company is finally bringing its TV+ service to the rival smartphone platform. From a report: In a job listing published in recent days, Apple said it's looking for someone to lead the development of \"fun new features\" and \"help build an application used by millions to watch and discover TV and sports.\" The move suggests that the company is looking to gain market share in video streaming -- and is setting aside its rivalry with Android in order to chase additional users. It's rare for Apple to develop software for Google's Android, which competes with its iOS platform. The TV+ service, launched in 2019, is Apple's answer to Netflix or Disney+, and the company has spent heavily on feeding it with original content.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Signals+That+It's+Working+on+TV%2B+App+for+Android+Phones%3A+https%3A%2F%2Fapple", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/29/1917221/apple-signals-that-its-working-on-tv-app-for-android-phones?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Signals That It's Working on TV+ App for Android Phones", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T18:49:01.528173+00:00", "description": "Mistral, the French AI startup backed by Microsoft and valued at $6 billion, has released its first generative AI model for coding, dubbed Codestral. From a report: Codestral, like other code-generating models, is designed to help developers write and interact with code. It was trained on over 80 programming languages, including Python, Java, C++ and JavaScript, explains Mistral in a blog post. Codestral can complete coding functions, write tests and \"fill in\" partial code, as well as answer questions about a codebase in English. Mistral describes the model as \"open,\" but that's up for debate. The startup's license prohibits the use of Codestral and its outputs for any commercial activities. There's a carve-out for \"development,\" but even that has caveats: the license goes on to explicitly ban \"any internal usage by employees in the context of the company's business activities.\" The reason could be that Codestral was trained partly on copyrighted content. Codestral might not be worth ", "language": "en-us", "link": "https://developers.slashdot.org/story/24/05/29/1759223/mistral-releases-codestral-its-first-generative-ai-model-for-code?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mistral Releases Codestral, Its First Generative AI Model For Code", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T18:48:59.536925+00:00", "description": "House Republicans this week accused officials at the National Institutes of Health of orchestrating \"a conspiracy at the highest levels\" of the agency to hide public records related to the origins of the Covid pandemic. And the lawmakers promised to expand an investigation that has turned up emails in which senior health officials talked openly about trying to evade federal records laws. From a report: The latest accusations -- coming days before a House panel publicly questions Dr. Anthony S. Fauci, a former top N.I.H. official -- represent one front of an intensifying push by lawmakers to link American research groups and the country's premier medical research agency with the beginnings of the Covid pandemic. \n\nThat push has so far yielded no evidence that American scientists or health officials had anything to do with the coronavirus outbreak. But the House panel, the Select Subcommittee on the Coronavirus Pandemic, has released a series of private emails that suggest at least some", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/29/1839250/health-officials-tried-to-evade-public-records-laws-lawmakers-say?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Health Officials Tried To Evade Public Records Laws, Lawmakers Say", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T17:43:34.905977+00:00", "description": "Data centers could use up to 9% of total electricity generated in the United States by the end of the decade, more than doubling their current consumption, as technology companies pour funds into expanding their computing hubs, the Electric Power Research Institute said on Wednesday. From a report: Depending on the adoption pace of technology such as generative artificial intelligence, which is fueling the expansion of data centers, and the energy efficiency of new centers, the estimated annual growth rate of electricity use by the industry ranges from 3.7% to 15% through 2030, the institute's analysis said. The institute is a U.S.-based research organization funded by energy and government organizations. \n\nData centers, along with expanding domestic manufacturing and electrification of transportation, are lifting the U.S. electricity industry out of two decades of flat growth. The centers require massive amounts of power for high-intensity computing and cooling systems, with a new la", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/29/1725228/data-centers-could-use-9-of-us-electricity-by-2030-research-institute-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Data Centers Could Use 9% of US Electricity By 2030, Research Institute Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T16:39:51.979401+00:00", "description": "IP core designer Arm announced its next-generation CPU and GPU designs for flagship smartphones: the Cortex-X925 CPU and Immortalis G925 GPU. Both are direct successors to the Cortex-X4 and Immortalis G720 that currently power MediaTek's Dimensity 9300 chip inside flagship smartphones like the Vivo X100 and X100 Pro and Oppo Find X7. From a report: Arm changed the naming convention for its Cortex-X CPU design to highlight what it says is a much faster CPU design. It claims the X925's single-core performance is 36 percent faster than the X4 (when measured in Geekbench). Arm says it increased the AI workload performance by 41 percent, time to token, with up to 3MB of private L2 cache. The Cortex-X925 brings a new generation of Cortex-A microarchitectures (\"little\" cores) with it, too: the Cortex-A725, which Arm says has 35 percent better performance efficiency than last-gen's A720 and a 15 percent more power-efficient Cortex-A520. \n\nArm's new Immortalis G925 GPU is its \"most performant ", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/29/1535257/arm-says-its-next-gen-mobile-gpu-will-be-its-most-performant-and-efficient?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Arm Says Its Next-Gen Mobile GPU Will Be Its Most 'Performant and Efficient'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T15:34:57.224364+00:00", "description": "Colorado Governor Jared Polis has signed the \"Consumer Right to Repair Digital Electronic Equipment\" bill into law. The legislation grants consumers the right to repair their own electronic devices, including cell phones, gaming systems, computers, and televisions. According to Polis, the bill will provide Coloradans with the necessary information to repair their own equipment or choose their preferred repair provider, potentially leading to lower prices and faster repairs through increased competition. \n\nState Senator Jeff Bridges, the bill's prime sponsor, called for the federal government and other states to follow Colorado's lead, claiming that this bill is the strongest repair legislation in the country. Bridges emphasized that the law addresses issues such as \"parts pairing\" and repair restrictions that have prevented owners from fixing their devices in the past. The bill expands on Colorado's previous right-to-repair law for agricultural equipment, which Polis cited as a succes", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/29/1437231/colorado-enacts-right-to-repair-law-for-electronics?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Colorado Enacts Right-to-Repair Law for Electronics", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T14:30:00.030642+00:00", "description": "Helen Toner, a former OpenAI board member, said that the board didn't know about the company's 2022 launch of its chatbot ChatGPT until afterward -- and only found out about it on Twitter. From a report: In a podcast, Toner gave her fullest account to date of the events that prompted her and other board members to fire Sam Altman in November of last year. In the days that followed Chief Executive Officer Sam Altman's sudden ouster, employees threatened to quit, Altman was reinstated, and Toner and other directors left the board. \"When ChatGPT came out in November 2022, the board was not informed in advance about that,\" Toner said on the podcast. \"We learned about ChatGPT on Twitter.\" \n\nIn a statement provided to the TED podcast, OpenAI's current board chief, Bret Taylor said, \"We are disappointed that Ms. Toner continues to revisit these issues.\" He also said that an independent review of Altman's firing \"concluded that the prior board's decision was not based on concerns regarding pr", "language": "en-us", "link": "https://slashdot.org/story/24/05/29/0915201/ex-openai-director-says-board-learned-of-chatgpt-launch-on-twitter?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ex-OpenAI Director Says Board Learned of ChatGPT Launch on Twitter", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T13:24:59.121257+00:00", "description": "Former FTX executive Ryan Salame has been sentenced to more than seven years in prison, \"the first of the lieutenants of failed cryptocurrency mogul Sam Bankman-Fried to receive jail time for their roles in the 2022 collapse of the cryptocurrency exchange,\" reports the Associated Press. From the report: Salame, 30, was a high-ranking executive at FTX for most of the exchange's existence and, up until its collapse, was the co-CEO of FTX Digital Markets. He pleaded guilty last year to illegally making unlawful U.S. campaign contributions and to operating an unlicensed money-transmitting business. The sentence of 7 1/2 years in prison, plus three years of supervised release, was more than the five to seven years prosecutors had asked Judge Lewis A. Kaplan to impose on Salame in their pre-sentencing memo.\n \nWhile Salame was a high-level executive at FTX, he was not a major part of the government's case against Bankman-Fried at his trial earlier this year and did not testify against him. I", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/29/0551216/former-ftx-executive-ryan-salame-sentenced-to-75-years-in-prison?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Former FTX Executive Ryan Salame Sentenced To 7.5 Years In Prison", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T11:15:09.449515+00:00", "description": "A new tool called Lifeseeker could help search and rescue teams find missing people in minutes using their cellphones. The technology acts as a miniature cellphone tower, allowing rescuers to pinpoint cellphone locations within a 3-mile radius, significantly improving the efficiency and success rate of search missions in challenging terrains. The Colorado Sun reports: \"As we detect the phone, basically a blotch shows up on the map and as we fly around that area, that blotch gets smaller and smaller and smaller until we can see exactly where they are,\" said Dr. Tim Durkin, a search and rescue program coordinator for Colorado Highland Helicopters. \"That process of detecting, focusing on one specific location takes about a minute -- not really very long at all.\" Depending on the situation, search and rescue teams can then send in ground crews with the person's location or land the helicopter if there's a clearing nearby and conditions allow for a safe landing, Durkin said. During a test ", "language": "en-us", "link": "https://mobile.slashdot.org/story/24/05/29/0543211/new-tech-may-help-find-missing-people-in-the-backcountry-within-minutes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New Tech May Help Find Missing People In the Backcountry Within Minutes", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T09:04:50.431509+00:00", "description": "An anonymous reader quotes a report from the BBC: A sophisticated joint European-Japanese satellite has launched to measure how clouds influence the climate. Some low-level clouds are known to cool the planet, others at high altitude will act as a blanket. The Earthcare mission will use a laser and a radar to probe the atmosphere to see precisely where the balance lies. It's one of the great uncertainties in the computer models used to forecast how the climate will respond to increasing levels of greenhouse gases. \"Many of our models suggest cloud cover will go down in the future and that means that clouds will reflect less sunlight back to space, more will be absorbed at the surface and that will act as an amplifier to the warming we would get from carbon dioxide,\" Dr Robin Hogan, from the European Centre for Medium-Range Weather Forecasts, told BBC News.\n \nThe 2.3-tonne satellite was sent up from California on a SpaceX rocket. The project is led by the European Space Agency (ESA), w", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/29/0559253/earthcare-cloud-mission-launches-to-resolve-climate-unknowns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Earthcare Cloud Mission Launches To Resolve Climate Unknowns", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T05:50:38.381235+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Some of the most infamous so-called shadow libraries have increasingly faced legal pressure to either stop pirating books or risk being shut down or driven to the dark web. Among the biggest targets are Z-Library, which the US Department of Justice has charged with criminal copyright infringement, and Library Genesis (Libgen), which was sued by textbook publishers last fall for allegedly distributing digital copies of copyrighted works \"on a massive scale in willful violation\" of copyright laws. But now these shadow libraries and others accused of spurning copyrights have seemingly found an unlikely defender in Nvidia, the AI chipmaker among those profiting most from the recent AI boom.\n \nNvidia seemed to defend the shadow libraries as a valid source of information online when responding to a lawsuit from book authors over the list of data repositories that were scraped to create the Books3 dataset used to train Nvidia's AI platfo", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/28/2157242/nvidia-denies-pirate-e-book-sites-are-shadow-libraries-to-shut-down-lawsuit?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Nvidia Denies Pirate e-Book Sites Are 'Shadow Libraries' To Shut Down Lawsuit", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T05:50:36.874235+00:00", "description": "The term \"auth\" is ambiguous, often meaning either authentication (authn) or authorization (authz), which leads to confusion and poor system design. Instead, Nicole Tietz-Sokolskaya, a software engineer at AI market research platform Remesh, argues that the industry adopt the terms \"login\" for authentication and \"permissions\" for authorization, as these are clearer and help maintain distinct, appropriate abstractions for each concept. From their blog post: We should always use the most clear terms we have. Sometimes there's not a great option, but here, we have wonderfully clear terms. Those are \"login\" for authentication and \"permissions\" for authorization. Both are terms that will make sense with little explanation (in contrast to \"authn\" and \"authz\", which are confusing on first encounter) since almost everyone has logged into a system and has run into permissions issues. There are two ways to use \"login\" here: the noun and the verb form. The noun form is \"login\", which refers to t", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/28/2211252/instead-of-auth-we-should-say-permissions-and-login?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Instead of 'Auth,' We Should Say 'Permissions' and 'Login'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T05:50:35.347733+00:00", "description": "Google is introducing the Gemini AI chatbot to Chromebook Plus models, enhancing features like text rewriting, image editing, and hands-free control. Here are a few of the top new features coming to ChromeOS, as summarized by Wired: The first notable feature is Help Me Write, which works in any text box. Select text in any text box and right-click -- you'll see a box next to the standard right-click context menu. You can ask Google's AI to rewrite the selected text, rephrase it in a specific way, or change the tone. I tried to use it on a few sentences in this story but did not like any of the suggestions it gave me, so your mileage may vary. Or maybe I'm a better writer than Google's AI. Who knows?\n \nGoogle's bringing the same generative AI wallpaper system you'll find in Android to ChromeOS. You can access this feature in ChromeOS's wallpaper settings and generate images based on specific parameters. Weirdly, you can create these when you're in a video-calling app too. You'll see a ", "language": "en-us", "link": "https://slashdot.org/story/24/05/28/2148248/chromebooks-will-get-gemini-and-new-google-ai-features?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Chromebooks Will Get Gemini and New Google AI Features", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T05:50:33.823545+00:00", "description": "Danny Goodwin reports via Search Engine Land: A trove of leaked Google documents has given us an unprecedented look inside Google Search and revealed some of the most important elements Google uses to rank content. Thousands of documents, which appear to come from Google's internal Content API Warehouse, were released March 13 on Github by an automated bot called yoshi-code-bot. These documents were shared with Rand Fishkin, SparkToro co-founder, earlier this month.\n \nWhat's inside. Here's what we know about the internal documents, thanks to Fishkin and [Michael King, iPullRank CEO]:\n \nCurrent: The documentation indicates this information is accurate as of March.\nRanking features: 2,596 modules are represented in the API documentation with 14,014 attributes.\nWeighting: The documents did not specify how any of the ranking features are weighted -- just that they exist.\nTwiddlers: These are re-ranking functions that \"can adjust the information retrieval score of a document or change the ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/28/2236255/huge-google-search-document-leak-reveals-inner-workings-of-ranking-algorithm?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Huge Google Search Document Leak Reveals Inner Workings of Ranking Algorithm", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T05:50:31.895348+00:00", "description": "An anonymous reader quotes a report from the New York Times: The defense lawyer minced no words as he addressed a room full of plastic-industry executives. Prepare for a wave of lawsuits with potentially \"astronomical\" costs. Speaking at a conference earlier this year, the lawyer, Brian Gross, said the coming litigation could \"dwarf anything related to asbestos,\" one of the most sprawling corporate-liability battles in United States history. Mr. Gross was referring to PFAS, the \"forever chemicals\" that have emerged as one of the major pollution issues of our time. Used for decades in countless everyday objects -- cosmetics, takeout containers, frying pans -- PFAS have been linked to serious health risks including cancer. Last month the federal government said several types of PFAS must be removed from the drinking water of hundreds of millions of Americans. \"Do what you can, while you can, before you get sued,\" Mr. Gross said at the February session, according to a recording of the ev", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/29/0532259/lawyers-to-plastic-makers-prepare-for-astronomical-pfas-lawsuits?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Lawyers To Plastic Makers: Prepare For 'Astronomical' PFAS Lawsuits", "user": null, "vote": 0}]