[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T18:30:17+00:00", "description": "According to recent reoorts, however, neither Resident Evil 1 nor Resident Evil 5 is being remade. As per prominent insider Dusk Golem, the developer is currently working on remakes of Resident Evil Zero and Resident Evil - Code: Veronica (which, as per the insider, are two among five Resident Evil games that are currently being worked on, Resident Evil 9 being another one). \n\nOther reliable sources like IGN and VGC's Andy Robinson have also corroborated Dusk Golem's claims, which means it's looking more than a likely at this point that the next remakes we see from Resident Evil are going to be ones that not many would have expected to see.", "language": null, "link": "https://www.youtube.com/watch?v=ObbcG8Kl658", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/ObbcG8Kl658/hqdefault.jpg", "title": "We May Be FINALLY Getting That Remake We Always Wanted...", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T15:30:21+00:00", "description": "It's hard to believe that Tom Clancy's Rainbow Six Siege has survived for this long, especially given how other live service titles have come and gone. Nevertheless, the tactical shooter gameplay continues to resonate with players to this day, becoming one of the genre's most successful titles and a core pillar of revenue.\n\nDespite its success and active player base, however, the publisher decided it best to introduce yet another monetization practice to the game - R6 Membership. It offers cosmetic items, some exclusive to the service, access to the premium Battle Pass, Credits and more to subscribers.\n\nThe problem is it arrives at a time when other issues demand attention, to say nothing of the lack of content in the coming season. Maybe it's just the developer attempting to cash in on the subscription trend. Either way, players aren't having it.", "language": null, "link": "https://www.youtube.com/watch?v=qh9f1LjyKA8", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qh9f1LjyKA8/hqdefault.jpg", "title": "Rainbow Six Siege Players Are ANGRY As Ubisoft Announces $9.99 A-Month Membership", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-29T09:30:16+00:00", "description": "E3 may be dead, but even so, there's no shortage of major upcoming gaming events and showcases to look forward to in the next couple of weeks, and as is the case every summer, Microsoft is going to be leading that pack with its annual Xbox Games Showcase. \n\nWith the combined might of Microsoft, Bethesda, and Activision Blizzard making up the Xbox umbrella's first-party, this year's showcase, which is set for June 9, is looking like it may very well end up being one of the more packed ones in recent memory. Here, then, we're going to talk about a few games that we feel have a good chance of showing up for some reason or the other.", "language": null, "link": "https://www.youtube.com/watch?v=vJh_0TRPcEY", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/vJh_0TRPcEY/hqdefault.jpg", "title": "10 HUGE XBOX Games That Could Be Revealed At XBOX SHOWCASE 2024", "user": null, "vote": 0}]