[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-26T21:30:04+00:00", "description": "Demand for an Assassin’s Creed game set in Japan has been high for as long as anyone can remember, but now that the series is finally going to feudal Japan, many will likely argue that they already got everything they wanted out of a Japan Assassin’s Creed game from 2020’s Ghost of Tsushima, and then some. \n\nSucker Punch’s samurai epic was a stellar game that boasts one of the most gorgeous depictions of Japan in a compelling, intricately designed open world game, and with Assassin’s Creed Shadows looking to provide a similar gameplay experience in a similar historical Japanese setting, comparisons between the two are going to be inevitable. \n\nFor Assassin’s Creed Shadows to have a shot at not being completely clowned by Ghost of Tsushima in those matchups, it’s going to have to excel in some particular areas, which is what we’ll be talking about here.", "language": null, "link": "https://www.youtube.com/watch?v=frapO7SKWLQ", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/frapO7SKWLQ/hqdefault.jpg", "title": "Can Assassin’s Creed Shadows BEAT Ghost of Tsushima?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-26T09:30:10+00:00", "description": "This Summer marks another thrilling range of showcases, from the Summer Game Fest and Xbox Games Showcase to the PC Gaming Show. \n\nWhat can fans likely forward to, based on rumors and reports? A release date for the Silent Hill 2 remake, a new look at Metal Gear Solid Delta: Snake Eater, the reappearance (finally) of Perfect Dark and State of Decay 3, Gears 6's announcement, some Sonic the Hedgehog-related news and much more. Maybe there will be an update on Wonder Woman or a reveal for Mafia 4.\n\nAll of that is only scratching the surface, though. Check out our picks for the 30 biggest announcements that could happen soon, including a few unexpected curveballs.", "language": null, "link": "https://www.youtube.com/watch?v=kGnBlzXN-2s", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/kGnBlzXN-2s/hqdefault.jpg", "title": "30 BIG Gaming Announcements That Will Likely Happen Soon", "user": null, "vote": 0}]