[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T23:52:59.307030+00:00", "description": "DOJ-Collected Information Exposed In Data Breach Affecting 340,000\nInformation Collected\n\nAn anonymous reader shared this report from Security Week:\n\nEconomic analysis and litigation support firm Greylock McKinnon Associates, Inc. (GMA) is notifying over 340,000 individuals that their personal and medical information was compromised in a year-old data breach. The incident was detected on May 30, 2023, but it took the firm roughly eight months to investigate and determine what type of information was compromised and to identify the impacted individuals. \n \n\nAccording to GMA's notification letter to the affected individuals, a copy of which was submitted to the Maine Attorney General's Office, both personal and Medicare information was compromised in the data breach... \"This information may have included your name, date of birth, address, Medicare Health Insurance Claim Number (which contains a Social Security number associated with a member) and some medical information and/or health i", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/13/2314233/data-collected-by-the-us-justice-department-exposed-in-consultants-breach?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Data Collected by the US Justice Department Exposed in Consultant's Breach", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T22:47:00.283049+00:00", "description": "Foreign Policy magazine visits a U.S. military training exercise that pitted Lt. Isaac McCurdy and his platoon of infantry troops against machines with camera lenses for eyes and sheet metal for skin:\n\nDriving on eight screeching wheels and carrying enough firepower on their truck beds to fill a small arms depot, a handful of U.S. Army robots stormed through the battlefield of the fictional city of Ujen. The robots shot up houses where the opposition force hid. Drones that had been loitering over the battlefield for hours hovered above McCurdy and his team and dropped \"bombs\" &mdash; foam footballs, in this case &mdash; right on top of them, a perfectly placed artillery shot. Robot dogs, with sensors for heads, searched houses to make sure they were clear. \n\n\"If you see the whites of someone's eyes or their sunglasses, [and] you shoot back at that, they're going to have a human response,\" McCurdy said. \"If it's a robot pulling up, shooting something that's bigger than you can carry yo", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/13/2140255/will-americas-next-soldiers-be-machines?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Will America's Next Soldiers Be Machines?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T21:41:53.566035+00:00", "description": "An anonymous reader shared this report from BleepingComputer:\n\nResearchers have demonstrated the \"first native Spectre v2 exploit\" for a new speculative execution side-channel flaw that impacts Linux systems running on many modern Intel processors. Spectre V2 is a new variant of the original Spectre attack discovered by a team of researchers at the VUSec group from VU Amsterdam. The researchers also released a tool that uses symbolic execution to identify exploitable code segments within the Linux kernel to help with mitigation. \n\nThe new finding underscores the challenges in balancing performance optimization with security, which makes addressing fundamental CPU flaws complicated even six years after the discovery of the original Spectre.... \n\nAs the CERT Coordination Center (CERT/CC) disclosed yesterday, the new flaw, tracked as CVE-2024-2201, allows unauthenticated attackers to read arbitrary memory data by leveraging speculative execution, bypassing present security mechanisms des", "language": "en-us", "link": "https://linux.slashdot.org/story/24/04/13/1911230/new-spectre-v2-attack-impacts-linux-systems-on-intel-cpus?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New Spectre V2 Attack Impacts Linux Systems On Intel CPUs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T20:36:56.123321+00:00", "description": "Andrew Jones reports via IEEE Spectrum: The European Space Agency will launch a mission late this year to demonstrate precision formation flying in orbit to create artificial solar eclipses. In a press conference last week, the agency announced details of the mission and the technology the orbiters will use to pull off its exquisitely-choreographed maneuvers. ESA's Proba-3 (PRoject for On-Board Autonomy) consists of a pair of spacecraft: a 300-kilogram Coronagraph spacecraft and a 250-kilogram Occulter. The pair are now slated to launch on an Indian PSLV rocket in September and ultimately enter a highly elliptical, 600-by-60,530-kilometer orbit. The aim, the agency says, is to move the separate spacecraft to some 144 meters apart, with the Occulter, as a disc, blocking out the sun.\n \nAchieving this formation will allow the Coronagraph to study our star's highly ionized, extremely hot atmosphere -- but also demonstrate the technology as a precursor for more ambitious, future, formation", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/12/2144255/esa-prepares-to-create-solar-eclipses-to-study-the-sun?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "ESA Prepares To Create Solar Eclipses To Study the Sun", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T20:36:54.598310+00:00", "description": "Under a new agreement between the U.S. and Japan, the first non-American on the Moon as part of the Artemis lunar exploration campaign will be a Japanese astronaut. SpaceNews reports: At an event in Washington, NASA Administrator Bill Nelson and Japanese Minister of Education, Culture, Sports, Science and Technology (MEXT) Masahito Moriyama signed an agreement regarding an additional Japanese contribution to Artemis, a pressurized lunar rover called Lunar Cruiser. NASA will deliver the rover to the moon, which the agencies said should take place ahead of the Artemis 7 mission scheduled for no earlier than 2031. NASA will also provide two seats on future Artemis lunar landing missions to astronauts from the Japanese space agency JAXA, the first agency other than NASA to secure spots on landing missions.\n \nThe Japanese rover will support extended expeditions from Artemis landing sites that are beyond the range of the Lunar Terrain Vehicle that three American companies are developing for", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/12/2152212/japanese-astronauts-to-land-on-moon-as-part-of-new-nasa-partnership?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Japanese Astronauts To Land On Moon As Part of New NASA Partnership", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T20:36:53.124511+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Influential US Senator Sherrod Brown (D-Ohio) has called on U.S. President Joe Biden to ban electric vehicles from Chinese brands. Brown calls Chinese EVs \"an existential threat\" to the U.S. automotive industry and says that allowing imports of cheap EVs from Chinese brands \"is inconsistent with a pro-worker industrial policy.\" Brown's letter to the president (PDF) is the most recent to sound alarms about the threat of heavily subsidized Chinese EVs moving into established markets. Brands like BYD and MG have been on sale in the European Union for some years now, and last October, the EU launched an anti-subsidy investigation into whether the Chinese government is giving Chinese brands an unfair advantage.\n \nThe EU probe won't wrap until November, but another report published this week found that government subsidies for green technology companies are prevalent in China. BYD, which now sells more EVs than Tesla, has benefited from", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/12/220248/should-the-us-ban-chinese-evs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Should the US Ban Chinese EVs?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T20:36:51.633895+00:00", "description": "The Linux Foundation-backed project OpenTofu \"has gotten legal pushback from HashiCorp,\" according to a report &mdash; just seven months after forking OpenTofu's code from HashiCorp's IT deployment software Terraform:\n\nOn April 3, HashiCorp issued a strongly-worded Cease and Desist letter to OpenTofu, accusing that the project has \"repeatedly taken code HashiCorp provided only under the Business Software License (BSL) and used it in a manner that violates those license terms and HashiCorp's intellectual property rights.\" It goes on to note that \"In at least some instances, OpenTofu has incorrectly re-labeled HashiCorp's code to make it appear as if it was made available by HashiCorp originally under a different license.\" Last August, HashiCorp announced that it would be transitioning its software from the open source Mozilla Public License (MPL 2.0) to the Business Source License (BSL), a license that permits the source to be viewed, but not run in production environments without expl", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/13/0422200/the-linux-foundations-opentofu-project-denies-hashicorps-allegations-of-code-theft?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Linux Foundation's 'OpenTofu' Project Denies HashiCorp's Allegations of Code Theft", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T20:36:49.767811+00:00", "description": "Aboard the deck of a World War II-era aircraft carrier, University of Washington scientists flicked the switch on a glorified snow-making machine,\" reports the Seattle Times. They describe the scientists \"blasting a plume of saline spray off the coast of Alameda, California... trying to perfect a shot of salty particles that would make clouds better at reflecting sunlight back toward space, and help cool the Earth. \n\n\"It's called marine cloud brightening.\"\nCompressed air was pumped at hundreds of pounds per square inch through a nozzle full of a salty mix with a similar composition to seawater housed in an apparatus similar to a snow-making machine. The New York Times reported the machine produced a deafening hiss, releasing a fine mist that traveled hundreds of feet through the air. The scientists wanted to see if the machine could generate a consistent spray of the right size salt aerosols, taking samples downwind with instruments mounted on scissor lifts, commonly used in construct", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/13/028228/cloud-brightening-research-begins-in-california?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cloud Brightening Research Begins in California", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T20:36:48.231541+00:00", "description": "This week the new \"Find My Device\" feature rolled out to Android devices around the world, starting in the U.S. and Canada. \n\n\n\"With a new, crowdsourced network of over a billion Android devices, Find My Device can help you find your misplaced Android devices and everyday items quickly and securely,\" according to a Google blog post.\nZDNet explains:\n\nAlthough Google already offers a Find My Device setting on Android phones, the device you're looking for must be powered on and connected for the feature to work. The new Find My Device network is designed to use Bluetooth to track down missing phones and other devices that are disconnected from a Wi-Fi or cellular network. A Powered Off Finding feature would let each device store beacons in its Bluetooth controller's memory, letting the network see any supported device even if it's not connected.\n \nFrom Google's blog post:\nLocate your compatible Android phone and tablet by ringing them or viewing their location on a map in the app &mdash;", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/13/0237210/google-finally-launches-androids-find-my-device-network?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Finally Launches Android's 'Find My Device' Network", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T20:36:46.723871+00:00", "description": "O'Reilly's \"Tech Trends\" newsletter included an interesting item this month:\n\n Want your own Klein Bottle? Made by Cliff Stoll, author of the cybersecurity classic The Cuckoo's Egg, who will autograph your bottle for you (and may include other surprises). \n\nFirst described in 1882 by the mathematician Felix Klein, a Klein bottle (like a Mobius strip) has a one-side surface. (\"Need a zero-volume bottle...?\" asks Stoll's web site. \"Want the ultimate in non-orientability...? A mathematician's delight, handcrafted in glass.\") \n\nBut how the legendary cyberbreach detective started the company is explained in this 2016 article from a U.C. Berkeley alumni magazine. Its headline? \"How a Berkeley Eccentric Beat the Russians &mdash; and Then Made Useless, Wondrous Objects.\"\n\nThe reward for his cloak-and-dagger wizardry? A certificate of appreciation from the CIA, which is stashed somewhere in his attic... Stoll published a best-selling book, The Cuckoo's Egg, about his investigation. PBS followe", "language": "en-us", "link": "https://idle.slashdot.org/story/24/04/13/0344258/73-year-old-clifford-stoll-is-now-selling-klein-bottles?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "73-Year-Old Clifford Stoll Is Now Selling Klein Bottles", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T20:36:45.235740+00:00", "description": "\"After a year of cracking down with rigid return-to-office mandates, defeated CEOs are now finally accepting that hybrid working is here to stay,\" reports Fortune:\n\nKPMG surveyed U.S. CEOs of companies turning over at least $500 million and found that just one-third expect a full return to the office in the next three years. \n\nSo it's official: Leaders who believe that office workers will be back at their desks five days a week in the near future are now in the small minority. It's a complete 360 on their stance last year, when 62% of CEOs surveyed predicted that working from home would end by 2026. At the time, 90% of CEOs even admitted that they were so steadfast on summoning staff back to their vertical towers that they were sweetening the pot with salary raises, promotions, and favorable assignments to those who showed face more. \n\nBut now, bosses are backtracking: Nearly half of CEOs have concluded that the future of work is hybrid &mdash; up from 34% last year. What's more, a si", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/13/059251/defeated-ceos-finally-concede-hybrid-working-is-here-to-stay?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Defeated' CEO's Finally Concede Hybrid Working Is Here to Stay", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T20:36:43.754798+00:00", "description": "From the Washington Post:\n\n\nThe U.S. government said Thursday that Russian government hackers who recently stole Microsoft corporate emails had obtained passwords and other secret material that might allow them to breach multiple U.S. agencies. \n\nThe Cybersecurity and Infrastructure Security Agency, an arm of the Department of Homeland Security, on Tuesday issued a rare binding directive to an undisclosed number of agencies requiring them to change any log-ins that were taken and investigate what else might be at risk. The directive was made public Thursday, after recipients had begun shoring up their defenses. The \"successful compromise of Microsoft corporate email accounts and the exfiltration of correspondence between agencies and Microsoft presents a grave and unacceptable risk to agencies,\" CISA wrote. \"This Emergency Directive requires agencies to analyze the content of exfiltrated emails, reset compromised credentials, and take additional steps to ensure authentication tools fo", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/13/0443217/us-government-says-recent-microsoft-breach-exposed-federal-agencies-to-hacking?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Government Says Recent Microsoft Breach Exposed Federal Agencies to Hacking", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T04:04:50.210388+00:00", "description": "An anonymous reader quotes a report from Wired: A controversial US wiretap program days from expiration cleared a major hurdle on its way to being reauthorized. After months of delays, false starts, and interventions by lawmakers working to preserve and expand the US intelligence community's spy powers, the House of Representatives voted on Friday to extend Section 702 (PDF) of the Foreign Intelligence Surveillance Act (FISA) for two years. Legislation extending the program -- controversial for being abused by the government -- passed in the House in a 273-147 vote. The Senate has yet to pass its own bill.\n \nSection 702 permits the US government to wiretap communications between Americans and foreigners overseas. Hundreds of millions of calls, texts, and emails are intercepted by government spies each with the \"compelled assistance\" of US communications providers. The government may strictly target foreigners believed to possess \"foreign intelligence information,\" but it also eavesdro", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/12/2058237/house-votes-to-extend----and-expand----a-major-us-spy-program?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "House Votes To Extend -- and Expand -- a Major US Spy Program", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T03:00:00.423937+00:00", "description": "Calpine's billion-dolllar Nova Power Bank near Los Angeles will be among the largest in the world when it comes online later this year. According to Reuters, the plant is built on the site of a failed gas-fired power plant and \"will be able to power about 680,000 homes for up to four hours when charged.\" From the report: The 680-megawatt lithium-ion battery bank is big even for California, which boasts about 55% of the nation's power storage capacity, according to data from the U.S. Energy Information Administration. Calpine will bring online 620 MW of the bank in two phases this year starting in the summer and open the remaining 60 MW in 2025. [...] Calpine, best known in the state for its fleet of gas plants, has about 2,000 MW of battery capacity under development. California was a pioneer in mandating that its utilities begin procuring energy storage more than a decade ago. The state is expected to need about 50 gigawatts of battery storage to meet its 2045 goal of getting all of ", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/12/2134248/calpines-california-battery-plant-is-among-worlds-largest?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Calpine's California Battery Plant Is Among World's Largest", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T01:55:20.158999+00:00", "description": "An anonymous reader quotes a report from The Guardian: Hospitals -- despite being places where people implicitly expect to have their personal details kept private -- frequently use tracking technologies on their websites to share user information with Google, Meta, data brokers, and other third parties, according to research published today. Academics at the University of Pennsylvania analyzed a nationally representative sample of 100 non-federal acute care hospitals -- essentially traditional hospitals with emergency departments -- and their findings were that 96 percent of their websites transmitted user data to third parties. Additionally, not all of these websites even had a privacy policy. And of the 71 percent that did, 56 percent disclosed specific third-party companies that could receive user information.\n \nThe researchers' latest work builds on a study they published a year ago of 3,747 US non-federal hospital websites. That found 98.6 percent tracked and transferred visitor", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/12/2046230/96-of-us-hospital-websites-share-visitor-info-with-meta-google-data-brokers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "96% of US Hospital Websites Share Visitor Info With Meta, Google, Data Brokers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T01:55:18.627232+00:00", "description": "In two recent papers, an international team of scientists describes the first known nitrogen-fixing organelle within a eukaryotic cell, which the researchers are calling a nitroplast. Phys.Org reports: The discovery of the organelle involved a bit of luck and decades of work. In 1998, Jonathan Zehr, a UC Santa Cruz distinguished professor of marine sciences, found a short DNA sequence of what appeared to be from an unknown nitrogen-fixing cyanobacterium in Pacific Ocean seawater. Zehr and colleagues spent years studying the mystery organism, which they called UCYN-A. At the same time, Kyoko Hagino, a paleontologist at Kochi University in Japan, was painstakingly trying to culture a marine alga. It turned out to be the host organism for UCYN-A. It took her over 300 sampling expeditions and more than a decade, but Hagino eventually successfully grew the alga in culture, allowing other researchers to begin studying UCYN-A and its marine alga host together in the lab. For years, the scien", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/12/2122258/scientists-discover-first-nitrogen-fixing-organelle?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Scientists Discover First Nitrogen-Fixing Organelle", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-13T00:50:01.472905+00:00", "description": "According to Bloomberg, Adobe used images from its competitor Midjourney to train its own artificial intelligence image generator, Firefly -- contradicting the \"commercially safe\" ethical standards the company promotes. Tom's Guide reports: The startup has never declared the source of its training data but many suspect it is from images it scraped from the internet without licensing. Adobe says only about 5% of the millions of images used to train Firefly fell into this category and all of them were part of the Adobe Stock library, which meant they'd been through a \"rigorous moderation process.\"\n \nWhen Adobe first launched Firefly it offered an indemnity against copyright theft claims for its enterprise customers as a way to convince them it was safe. Adobe also sold Firefly as the safe alternative to the likes of Midjourney and DALL-E as all the data had been licensed and cleared for use in training the model. Not all artists were that keen at the time and felt they were coerced into", "language": "en-us", "link": "https://slashdot.org/story/24/04/12/2010228/adobe-firefly-used-thousands-of-midjourney-images-in-training-its-ethical-ai-model?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Adobe Firefly Used Thousands of Midjourney Images In Training Its 'Ethical AI' Model", "user": null, "vote": 0}]