[{"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T23:06:37.391087+00:00", "description": "June, 2023: \"Harvard Scholar Who Studies Honesty Is Accused of Fabricating Findings.\" \nNovember, 2024: \"The Business-School Scandal That Just Keeps Getting Bigger.\" A senior editor at the Atlantic raises the possibility of systemic dishonesty-rewarding incentives where \"a study must be even flashier than all the other flashy findings if its authors want to stand out,\" writing that \"More than a year since all of this began, the evidence of fraud has only multiplied.\" \n\nAnd the suspect isn't just Francesca Gino, a Harvard Business School professor. One person deeply affected by all this is Gino's co-author, a business school professor from the University of California at Berkeley &mdash; Juliana Schroeder &mdash; who launched an audit of all 138 studies conducted by Francesca Gino (called \"The Many Coauthors Project\"):\n\nGino was accused of faking numbers in four published papers. Just days into her digging, Schroeder uncovered another paper that appeared to be affected &mdash; and it w", "id": 1574066, "language": null, "link": "https://science.slashdot.org/story/24/11/23/2151226/more-business-school-researchers-accused-of-fabricated-findings?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "More Business School Researchers Accused of Fabricated Findings", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T21:57:25.594254+00:00", "description": "Meta wants to force Apple and Google to verify the ages of people downloading apps from their app stores, reports the Washington Post &mdash; and now Meta's campaign \"is picking up momentum\" with legislators in the U.S. Congress. \n\n\n\nFederal and state lawmakers have recently proposed a raft of measures requiring that platforms such as Meta's Facebook and Instagram block users under a certain age from using their sites. The push has triggered fierce debate over the best way to ascertain how old users are online. Last year Meta threw its support behind legislation that would push those obligations onto app stores rather than individual app providers, like itself, as your regular host and Naomi Nix reported. While some states have considered the plan, it has not gained much traction in Washington. \nThat could be shifting. Two congressional Republicans are preparing a new age verification bill that places the burden on app stores, according to two people familiar with the matter, who spo", "id": 1573895, "language": null, "link": "https://apple.slashdot.org/story/24/11/23/0414258/meta-wants-apple-and-google-to-verify-the-age-of-app-downloaders?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Wants Apple and Google to Verify the Age of App Downloaders", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T20:52:53.986800+00:00", "description": "CNN reports that investigators \"are trying to crack the mystery of how two undersea internet cables in the Baltic Sea were cut within hours of each other.\" But there's now two competing viewpoints, \"with European officials saying they believe the disruption was an act of sabotage and U.S. officials suggesting it was likely an accident.\"\nThe foreign ministers of Finland and Germany said in a joint statement that they were \"deeply concerned\" about the incident and raised the possibility that it was part of a \"hybrid warfare,\" specifically mentioning Russia in their statement. Their assessment was not plucked out of thin air. Russia has been accused of waging a hybrid war against Europe after a string of suspicious incidents, arson attacks, explosions and other acts of sabotage across multiple European countries were traced back to Moscow. And the disruption to the cables came just weeks after the US warned that Moscow was likely to target critical undersea infrastructure. This followed", "id": 1573680, "language": null, "link": "https://tech.slashdot.org/story/24/11/23/1953221/sabotage-or-accident-american-and-european-officials-disagree-on-what-caused-cuts-to-two-undersea-cables?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Sabotage or Accident? American and European Officials Disagree On What Caused Cuts to Two Undersea Cables", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T19:47:24.856668+00:00", "description": "Slashdot reader jjslash shared this report from TechSpot:\n\n\nThe SilverStone FLP01 made quite the impression when it was shared on X for April Fools' Day 2023. Loosely modeled after popular desktops from yesteryear like the NEC PC-9800 series, the chassis features dual 5.25-inch faux floppy bays that could stand to look a bit more realistic. Notably, the covers flip open to reveal access to a more modern (yet still legacy) optical drive and front I/O ports. \n\nModern-looking fan grills can be found on either side of the desktop, serving as yet another hint that the chassis is not as old at it appears on first glance. The grills look to be removable, and probably hold washable dust filters. Like early desktops, the system doubles as a stand for your monitor. The use of a green power LED up front helps round out the retro look; a red LED is used as a storage activity indicator.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?s", "id": 1573439, "language": null, "link": "https://hardware.slashdot.org/story/24/11/23/0529232/silverstones-retro-beige-pc-case-turns-april-fools-joke-into-actual-product?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "SilverStone's Retro Beige PC Case Turns April Fools' Joke into Actual Product", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T18:42:49.280595+00:00", "description": "Instead of focusing on chatbots, a new study reveals an automated way to breach LLM-driven robots \"with 100 percent success,\" according to IEEE Spectrum. \"By circumventing safety guardrails, researchers could manipulate self-driving systems into colliding with pedestrians and robot dogs into hunting for harmful places to detonate bombs...\"\n\n[The researchers] have developed RoboPAIR, an algorithm designed to attack any LLM-controlled robot. In experiments with three different robotic systems &mdash; the Go2; the wheeled ChatGPT-powered Clearpath Robotics Jackal; and Nvidia's open-source Dolphins LLM self-driving vehicle simulator. They found that RoboPAIR needed just days to achieve a 100 percent jailbreak rate against all three systems... RoboPAIR uses an attacker LLM to feed prompts to a target LLM. The attacker examines the responses from its target and adjusts its prompts until these commands can bypass the target's safety filters. RoboPAIR was equipped with the target robot's app", "id": 1573224, "language": null, "link": "https://hardware.slashdot.org/story/24/11/23/0513211/its-surprisingly-easy-to-jailbreak-llm-driven-robots?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'It's Surprisingly Easy To Jailbreak LLM-Driven Robots'", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T17:37:53.279071+00:00", "description": "\"The past 15 years were unique in ways that might be a bad predictor of our future,\" writes the Washington Post, with a surge in the number of internet users since 2010, and everyone spending more time online. \n\nBut today, \"lots of smart people believe that artificial intelligence will upend how you find information. Googling is so yesterday.\"\n\nSam Altman, the top executive overseeing ChatGPT, has said that AI has a good shot at shoving aside Google search. Bill Gates predicted that emerging AI will do tasks like researching your ideal running shoes and automatically placing an order so you'll \"never go to a search site again.\" In defending itself from a judge's decision that it runs an illegal monopoly, Google says the company might be roadkill as AI and other new technologies change how you find information. (On Wednesday, the U.S. government asked the judge to overhaul Google to undo its monopoly.) \n\nBut predictions of Google's looming obsolescence have been wrong before, which ca", "id": 1572927, "language": null, "link": "https://tech.slashdot.org/story/24/11/23/0333202/will-ai-kill-google?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Will AI Kill Google?", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T17:37:53.195300+00:00", "description": "\"You can use any Linux distribution inside of the Windows Subsystem for Linux\" Microsoft recently reminded Windows users, \"even if it is not available in the Microsoft Store, by importing it with a tar file.\" \n\nBut being an official distro \"makes it easier for Windows Subsystem for Linux users to install and discover it with actions like wsl --list --online and wsl --install,\" Microsoft pointed out this week. And \"We're excited to announce that Red Hat will soon be delivering a Red Hat Enterprise Linux WSL distro image in the coming months...\" \n\nThank you to the Red Hat team as their feedback has been invaluable as we built out this new architecture, and we're looking forwards to the release...! Ron Pacheco, senior director, Red Hat Enterprise Linux Ecosystem, Red Hat says: \n\"Developers have their preferred platforms for developing applications for multiple operating systems, and WSL is an important platform for many of them. Red Hat is committed to driving greater choice and flexibi", "id": 1572926, "language": null, "link": "https://tech.slashdot.org/story/24/11/23/0251245/red-hat-is-becoming-an-official-microsoft-windows-subsystem-for-linux-distro?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Red Hat is Becoming an Official Microsoft 'Windows Subsystem for Linux' Distro", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T16:33:06.428881+00:00", "description": "An anonymous reader shared this report from CNET:\n\n\nMeta says it's taken down more than 2 million accounts this year linked to overseas criminal gangs behind scam operations that human rights activists say forced hundreds of thousands of people to work as scammers and cost victims worldwide billions of dollars. \n\nIn a Thursday blog post, the parent of Facebook, Instagram and WhatsApp says the pig butchering scam operations &mdash; based in Myanmar, Laos, Cambodia, the United Arab Emirates and the Philippines &mdash; use platforms like Facebook and Instagram; dating, messaging, crypto and other kinds of apps; and texts and emails, to globally target people... [T]he scammers strike up an online relationship with their victims and gain their trust. Then they move their conversations to crypto apps or scam websites and dupe victims into making bogus investments or otherwise handing over their money, Meta said. They'll ask the victims to deposit money, often in the form of cryptocurrency,", "id": 1572651, "language": null, "link": "https://yro.slashdot.org/story/24/11/23/0356221/meta-removed-2-million-accounts-linked-to-organized-crime-pig-butching-scams?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Removed 2 Million Accounts Linked to Organized Crime 'Pig Butching' Scams", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T13:17:35.344240+00:00", "description": "Longtime Slashdot reader theodp writes: Past corporate-sponsored Hour of Code tutorials for the nation's schoolchildren have blurred the lines between coding lessons and product infomercials. So too is the case again with this year's newly-announced Hour of Code 2024 flagship tutorials, which include Microsoft Minecraft, Amazon Music, and Transformers One movie-themed intros to coding. The press release announcing the tutorials from tech-backed nonprofit Code.org, which organizes the Hour of Code and counts Microsoft and Amazon as $30+ million donors, boasts of its \"decade of partnership with [Microsoft] Minecraft this year, reaching more than 300 million sessions of Minecraft Hour of Code since 2015!\"\n \nInterestingly, The Transformers (Paramount Pictures, which released Transformers One in the U.S., is a $25,000+ Code.org donor) is cited as one of the OG's of children's Saturday morning cartoon advertising (aka 30-minute commercials) that prompted the Children's Television Act (CTA)", "id": 1571837, "language": null, "link": "https://news.slashdot.org/story/24/11/23/0040245/is-the-hour-of-code-the-new-30-minute-saturday-morning-cartoon-commercial?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Is the 'Hour of Code' the New 30-Minute Saturday Morning Cartoon Commercial?", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T11:07:49.415372+00:00", "description": "Neuralink, the brain chip startup founded by Elon Musk, says it has received approval to launch its first clinical trial in Canada for a device designed to give paralysed individuals the ability to use digital devices simply by thinking. Reuters reports: [T]he Canadian study aims to assess the safety and initial functionality of its implant which enables people with quadriplegia, or paralysis of all four limbs, to control external devices with their thoughts. Canada's University Health Network hospital said in a separate statement that its Toronto facility had been selected to perform the complex neurosurgical procedure. Neuralink has successfully implanted the device in two patients in the United States. One of the patients has been using it to play video games and learn how to design 3D objects.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Neuralink+Receives+Canadian+Approval+For+Brain+Chip+Trial%3A+https%3A%2F", "id": 1571404, "language": null, "link": "https://science.slashdot.org/story/24/11/23/0035224/neuralink-receives-canadian-approval-for-brain-chip-trial?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Neuralink Receives Canadian Approval For Brain Chip Trial", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T07:52:34.907831+00:00", "description": "A team of undergraduate students from the University of Southern California's Rocket Propulsion Lab set multiple amateur spaceflight records with their rocket, Aftershock II. \"The student-made missile soared 90,000 feet (27,400 meters) beyond the previous record-holder -- a rocket launched more than 20 years ago,\" reports Live Science. From the report: The students launched Aftershock II on Oct. 20 from a site in Black Rock Desert, Nevada. The rocket stood about 14 feet (4 meters) tall and weighed 330 pounds (150 kilograms). The rocket broke the sound barrier just two seconds after liftoff and reached its maximum speed roughly 19 seconds after launch, the RPL team wrote in a Nov. 14 paper summarizing the launch. The rocket's engine then burned out, but the craft continued to climb as atmospheric resistance decreased, enabling it to leave Earth's atmosphere 85 seconds after launch and then reach its highest elevation, or apogee, 92 seconds later. At this point, the nose cone separated", "id": 1570806, "language": null, "link": "https://science.slashdot.org/story/24/11/23/0028234/student-built-rocket-breaks-multiple-20-year-spaceflight-records?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Student-Built Rocket Breaks Multiple 20-Year Spaceflight Records", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T04:37:06.960866+00:00", "description": "An anonymous reader quotes a report from VICE: It's early on a Sunday morning in late 1994, and you're shuffling your way through Fitzrovia in Central London, bloodstream still rushing after a long night at Bagley's. The sun comes up as you come down. You navigate side streets that you know like the back of your hand. But your hand's stamped with a party logo. And your brain's kaput. Coffee... yes, coffee. Good idea. Suddenly, you find yourself outside a teal blue cafe. Walking in is like entering an alien world; rows of club kids, tech heads, and game developers sit in front of desktops, lost in the primitive version of some new reality. Tentacular cables hang from the ceiling. Ambient techno reverberates from wall to wall. Cigarette smoke fills the air.\n \nWelcome to Cyberia, the world's first internet cafe. Which, if you're too young to remember, are basically cafes with computers in them. It all began when Eva Pascoe, a Polish computing student living in London, crossed paths with", "id": 1570414, "language": null, "link": "https://tech.slashdot.org/story/24/11/23/006233/remembering-cyberia-the-worlds-first-ever-cyber-cafe?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Remembering Cyberia, the World's First Ever Cyber Cafe", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T02:28:53.277930+00:00", "description": "Longtime Slashdot reader Geoffrey.landis writes: Economist Phillip Kobernick makes the case that the emphasis on fast-charging stations for electric vehicles in the U.S. is misplaced. According to an article from CleanTechnica, he argues that, from an economic standpoint, what we should be doing is installing more slow chargers. All thing equal, who wouldn't choose a 10-minute charge over a 3-hour charge or a 10-hour charge? But all things are not equal.\n \nSuperfast chargers are far more expensive than Level 2 chargers, and Level 2 chargers are also significantly more expensive than Level 1 charging infrastructure, which consists of normal electricity outlets. He points out that we get 4-7 times more charging capability installed for the same cost by going with Level 1 charging instead of Level 2. And given that people often just plug in their electric vehicles overnight, Level 1 charging can more than adequately provide what is needed in that time. The case is examined in a podcast ", "id": 1570135, "language": null, "link": "https://hardware.slashdot.org/story/24/11/22/2343228/economist-makes-the-case-for-slow-level-1-ev-charging?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Economist Makes the Case For Slow Level 1 EV Charging", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T02:28:53.039920+00:00", "description": "Longtime Slashdot reader mspohr shares a report from Gizmodo: Hackers for the Chinese government were able to deeply penetrate U.S. telecommunications infrastructure in ways that President Joe Biden's administration hasn't yet acknowledged, according to new reports from the Washington Post and New York Times. The hackers were able to listen to phone calls and read text messages, reportedly exploiting the system U.S. authorities use to wiretap Americans in criminal cases. The worst part? The networks are still compromised and it may take incredibly drastic measures to boot them from U.S. systems.\n \nThe hackers behind the infiltration of U.S. telecom infrastructure are known to Western intelligence agencies as Salt Typhoon, and this particular breach of U.S. equipment was first reported in early October by the Wall Street Journal. But Sen. Mark Warner, a Democrat from Virginia, spoke with the Washington Post and New York Times this week to warn the public that this is so much worse tha", "id": 1570134, "language": null, "link": "https://yro.slashdot.org/story/24/11/22/2336254/china-wiretaps-americans-in-worst-hack-in-our-nations-history?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "China Wiretaps Americans in 'Worst Hack in Our Nation's History'", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T01:23:45.511040+00:00", "description": "An anonymous reader quotes a report from Reuters: Google has sued one of its former engineers in Texas federal court, accusing him of stealing trade secrets related to its chip designs and sharing them publicly on the internet. The lawsuit, filed on Tuesday (PDF), said that Harshit Roy \"touted his dominion\" over the secrets in social media posts, tagging competitors and making threatening statements to the company including \"I need to take unethical means to get what I am entitled to\" and \"remember that empires fall and so will you.\"\n \nGoogle hired Roy in 2020 to develop computer chips used in Google Pixel devices like smartphones. Google said in the lawsuit that Roy resigned in February and moved from Bangalore, India to the United States in August to attend a doctorate program at the University of Texas at Austin. According to the complaint, Roy began posting confidential Google information to his X account later that month along with \"subversive text\" directed at the company, such", "id": 1569948, "language": null, "link": "https://yro.slashdot.org/story/24/11/22/2235202/google-sues-ex-engineer-in-texas-over-leaked-pixel-chip-secrets?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Sues Ex-Engineer In Texas Over Leaked Pixel Chip Secrets", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T01:23:45.301268+00:00", "description": "\"Steven Adair, of cybersecurity firm Veloxity, revealed at the Cyberwarcon security conference how Russian hackers were able to daisy-chain as many as three separate Wi-Fi networks in their efforts to attack victims,\" writes Longtime Slashdot reader smooth wombat. Wired reports: Adair says that Volexity first began investigating the breach of its DC customer's network in the first months of 2022, when the company saw signs of repeated intrusions into the customer's systems by hackers who had carefully covered their tracks. Volexity's analysts eventually traced the compromise to a hijacked user's account connecting to a Wi-Fi access point in a far end of the building, in a conference room with external-facing windows. Adair says he personally scoured the area looking for the source of that connection. \"I went there to physically run down what it could be. We looked at smart TVs, looked for devices in closets. Is someone in the parking lot? Is it a printer?\" he says. \"We came up dry.\"\n", "id": 1569947, "language": null, "link": "https://mobile.slashdot.org/story/24/11/22/2331247/russian-spies-jumped-from-one-network-to-another-via-wi-fi?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Russian Spies Jumped From One Network To Another Via Wi-Fi", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-23T00:07:03.182420+00:00", "description": "The latest Steam client drops support for operating systems older than Windows 10 or macOS 10.15 Catalina. \"That means Mac users can't run 32-bit games anymore, as all macOS versions from Catalina onward only run 64-bit binaries,\" reports The Register. From the report: [I]f you have a well-specified older Mac, here is another reason to check out Open Core Legacy Patcher. For now, macOS 10.15 Catalina will do but we suspect it won't for long. This version of Steam uses the equivalent to Chrome 126: \"Updated embedded Chromium build in Steam to 126.0.6478.183.\" However, versions since Chrome 128 require macOS 11 or newer. For now, Catalina will work -- but the next significant Steam update will update Chromium as well, and there's a high probability that that will drop support for 10.15.\n \nSo, if you're using OCLP to install a newer macOS, you should probably go directly to Big Sur. In The Reg FOSS desk's testing, we found that Big Sur ran reasonably well on a machine with Intel HD 520 ", "id": 1569692, "language": null, "link": "https://tech.slashdot.org/story/24/11/22/2226201/steam-cuts-the-cord-for-legacy-windows-macos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Steam Cuts the Cord For Legacy Windows, macOS", "vote": 0}]