[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-11T15:30:01+00:00", "description": "Despite a slow start and mistakes galore, Sony ended up having a great run with the PS3. Utilizing a Cell processor that was extremely powerful yet notoriously difficult to code for, the PS3 had a vast library of first and third party games, many of which were vital in shaping the brand's current identity.\n\nBut apart from all this, there was plenty of facts and controversies related to PS3 that many fans might not know about. And with this video we are taking a look at 15 of the most interesting facts about the PS3 that you probably didn't know about - right from the infamous 2011 network hack that caused a loss of millions to lesser-known console features and much more.", "language": null, "link": "https://www.youtube.com/watch?v=5TZdVvIWd6s", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/5TZdVvIWd6s/hqdefault.jpg", "title": "15 Insane PS3 Facts And Secret Features Many GAMERS DON'T KNOW", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-11T09:30:21+00:00", "description": "There are certain mechanics and quality of life features that we all take for granted in most open world games. Fast travel, for instance, is deemed almost a necessity in the vast majority of games that fall in that category (and even many that do not)- but it is perhaps always not as necessary as one might think. \n\nEither through the strength of their world design, the visual beauty of their map, their excellent traversal mechanics, or any number of other factors, games have often found a way to make navigation and exploration so engaging that fast travel almost ends up feeling unnecessary. Here, we are going to take a look at a few games that manage to do just that.", "language": null, "link": "https://www.youtube.com/watch?v=qsKR3Vxt3AA", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qsKR3Vxt3AA/hqdefault.jpg", "title": "15 Games That Are BETTER Without Fast Travel", "user": null, "vote": 0}]