[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-11T09:13:43+00:00", "description": "<p>Last Updated on April 11, 2024 Fallout is the latest TV series from Amazon Prime Video and is the streaming giant’s attempt to cash in on the success of the videogame series from Bethesda which has sold millions of copies across the world and achieved critical acclaim. With HBO’s The Last of Us, and Netflix’s Arcane proving that videogame adaptions can be some of the best shows out there, will Amazon’s shiny, new show hang with the big guns or wilt in the light of a nuclear bomb? Fans of the game can breathe a sigh of relief and newcomers need to prepare to be entertained – this will be your new favourite post-apocalyptic show. Fallout is brought to us by Jonathan Nolan (Westworld, The Dark Knight, Interstellar) so it’s in steady hands and the Amazon budget allows the series to match the tone, visuals, and general feeling of the games. Based in a world decimated by a nuclear holocaust, some humans dwell in vaults, beneath the surface in Los Angeles 2296 and our protagonist, Lucy, n", "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-fallout", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: Fallout", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-11T04:25:45+00:00", "description": "<p>Veris Thorn has seen death. She had survived the war and the tyranny that never ended. As a woman nearing forty, she knows suffering. It is why she cherishes her remaining family and keeps a low profile. However, the tyrant king has called upon her. As the sole person to have entered the forest of Elmever and survived, Veris is tasked with rescuing the tyrant’s lost children. But these woods hide more than monsters. The woods itself possess a power to expose fear and spawn nightmares. To save her family, Veris will enter these woods and face hell once more. Premee Mohamed unleashes a startling and tragic tale in The Butcher of the Forest. Veris Thorn in The Butcher of the Forest is an excellent portrayal of a traumatized character. The story of her past is slowly and almost sparsely revealed throughout the novella. Each fragment of her life is like finding a clue and unlocking a mystery. She is a character a reader wants to know more about. The strong characterization in Veris Thor", "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-the-butcher-of-the-forest-by-premee-mohamed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: The Butcher of the Forest by Premee Mohamed", "user": null, "vote": 0}]