[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-09T20:30:05+00:00",
        "description": "Infinity Nikki is for those tired of gacha games that push you to pull for characters and min-max them to clear end-game activities at the fastest clip. With its open-world setting, a first for the series, the gameplay is more on exploration, puzzle-solving, and platforming.\n\nThe story of Nikki venturing to Miraland to find the Miracle Outfits is promising at the start, though quickly bogged down by middling performances and a lack of agency. However, the actual gameplay is responsive, with the open world offering a fun playground to explore. Challenges like Curio Domains and hunting Whimstars also provide plenty of variety.\n\nThough the dress-up mechanics are solid, the gacha system could be improved, especially with pulling nine to ten pieces for a complete outfit. The visuals on PS5 also suffer from pop-in, which significantly hinders the otherwise gorgeous environments. Despite these caveats, Infinity Nikki is worth checking out for those who favor an ambitious dress-up title that",
        "id": 1676431,
        "language": null,
        "link": "https://www.youtube.com/watch?v=p64mc5Gte3g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/p64mc5Gte3g/hqdefault.jpg",
        "title": "Infinity Nikki Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-09T17:30:03+00:00",
        "description": "As we bid adieu to 2024, the year is signing off on a high note with yet another major critical and commercial success- and the game is a hero shooter. NetEase Games' Marvel Rivals released just recently, and on the back of sustained hype and anticipation over several weeks and months, the free to play multiplayer title has not only attracted a massive audience of over 10 million players in just three days, the majority of that audience also seems ecstatic about how the game itself has turned out. \n\nAt a time when it feels like the hero shooter genre and the Marvel license had both lost a significant chunk of the staggering popularity they both enjoyed until not that long ago, Marvel Rivals has come along and proven that genuine quality can trumps fatigue.",
        "id": 1675062,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Jhpoxo38qWg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Jhpoxo38qWg/hqdefault.jpg",
        "title": "WHY MARVEL RIVALS IS CATCHING ON LIKE WILDFIRE",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-09T13:30:33+00:00",
        "description": "Mortal Kombat has always been a huge, unshakable name not just for Warner Bros. but for the games industry as a whole, and though the franchise has had its slumps, over the last decade and a half in particular, it’s only gone from strength to strength with each successive instalment. \n\nWith Mortal Kombat 1, however, it does feel like things are a little different. The newest entry in the fighting series provoked muted responses at best and negative ones at worst, and reception for its expansion, Khaos Reigns, and the rest of the game’s post launch content hasn’t been much better, to the extent that reports claim further post launch plans have been outright cancelled. \n\nHow exactly did we get to this point?",
        "id": 1673106,
        "language": null,
        "link": "https://www.youtube.com/watch?v=mCSeAc0eSf0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mCSeAc0eSf0/hqdefault.jpg",
        "title": "Why Is Mortal Kombat 1 DYING?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-09T07:15:00+00:00",
        "description": "So, Path of Exile 2 is out in early access for Xbox Series X/S, PS5, and PC, and even with roughly 82 percent of its 25K user reviews being positive, fans have mixed opinions. Some are blasting through the campaign, annihilating everything in their path. Others are struggling, getting trapped by monsters in a corner (as often happened to me) and dying. Impressions on loot are pretty much divided, with some getting a steady amount of Exalts and Rare gear throughout the campaign while others are less favored.\n\nThere's a lot to get through, and while I had fun with the game, there are things to keep in mind for those on the fence. Let's go over 15 of them here.",
        "id": 1671450,
        "language": null,
        "link": "https://www.youtube.com/watch?v=MOsTZo2trQ0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/MOsTZo2trQ0/hqdefault.jpg",
        "title": "Path of Exile 2 - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    }
]