[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T23:41:49.080765+00:00", "description": "Long-time Slashdot reader Geoffrey.landis writes: According to a new report from the United Nations, the world population is expected to grow to an estimated peak of 10.3 billion people in the mid-2080s, an increase over the current global population of 8.2 billion people. \n\n\nThe estimated world population at the end of the century (2100) is now expected to be 6% less than estimates from a decade ago. \n\nHowever, calculating the number of future people is not a perfect science, with \"many sources of uncertainty in estimating the global population,\" according to the U.S. Census Bureau. It estimated the world reached 8 billion people last September, while the U.N. timed the milestone nearly one year earlier.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+World's+Population+Is+Projected+To+Peak+At+10.3+Billion+In+the+2080s%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F07%2F14%2F2227218%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src", "id": 864723, "language": "en-us", "link": "https://slashdot.org/story/24/07/14/2227218/the-worlds-population-is-projected-to-peak-at-103-billion-in-the-2080s?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The World's Population Is Projected To Peak At 10.3 Billion In the 2080s", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T22:36:43.862518+00:00", "description": "\"Researchers are proposing a new way to battle the effects of climate change...\" writes Science magazine: slowing the rising of sea levels with \"glacial geoengineering\". (That is, \"building flexible barriers around them or drilling deep into them to slow their slippage into the sea.\")\n\nGeoengineering proponents say it would be better to begin research now on how to staunch sea level rise at its source, rather than spending billions and billions of dollars to wall off coastal cities. \"At some point you have to think, 'Well, is there anything else we can do?'\" asks glaciologist John Moore of the University of Lapland, an author on the white paper, which was sponsored by the University of Chicago. One idea researched by Moore and covered in the report is to build buoyant \"curtains,\" moored to the sea floor beyond the edge of ice shelves and glaciers, to block natural currents of warm water that erode ice sheets from below. (Especially in Antarctica, warming ocean water is a bigger threat", "id": 864591, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/14/2150209/to-avoid-sea-level-rise-some-researchers-propose-barriers-around-the-worlds-vulnerable-glaciers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "To Avoid Sea Level Rise, Some Researchers Propose Barriers Around the World's Vulnerable Glaciers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T21:31:46.735708+00:00", "description": "As the number of autism diagnoses rises in America, a number of large employers \"are taking steps to make workplaces more accessible and welcoming for neurodivergent employees,\" reports the New York Times &mdash; including Microsoft, Dell and Ford. [Alternate URL here.]\n\nThe Centers for Disease Control and Prevention estimates that 1 in 36 8-year-olds in the United States has autism. That's up from 1 in 44 in 2018 and 1 in 150 in 2000, an increase that experts attribute, in part, to better screening. In addition, 2.2% of adults in the country, or 5.4 million people, are autistic, according to the CDC... \n\nAutism activists have praised companies that have become more accepting of remote work since the coronavirus pandemic. Workplaces with too much light and noise can overwhelm those who are autistic, leading to burnout, said Jessica Myszak, a clinical psychologist in Chicago who specializes in testing and evaluations for autism. Remote work \"reduces the social demands and some of the e", "id": 864422, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/14/2031223/how-microsoft-dell-and-other-large-us-employers-accommodate-neurodivergent-employees?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How Microsoft, Dell and Other Large US Employers Accommodate Neurodivergent Employees", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T20:26:39.716668+00:00", "description": "AT&amp;T paid more than $300,000 to a member of the team that stole call records for tens of millions of customers, reports Wired &mdash; \"to delete the data and provide a video demonstrating proof of deletion.\"\n\n\nThe hacker, who is part of the notorious ShinyHunters hacking group that has stolen data from a number of victims through unsecured Snowflake cloud storage accounts, tells WIRED that AT&amp;T paid the ransom in May. He provided the address for the cryptocurrency wallet that sent the currency to him, as well as the address that received it. WIRED confirmed, through an online blockchain tracking tool, that a payment transaction occurred on May 17 in the amount of 5.7 bitcoin... The hacker initially demanded $1 million from AT&amp;T but ultimately agreed to a third of that. WIRED viewed the video that the hacker says he provided to AT&amp;T as proof to the telecom that he had deleted its stolen data from his computer... \n\nAT&amp;T is one of more than 150 companies that are beli", "id": 864230, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/14/1919219/att-paid-370000-for-the-deletion-of-stolen-phone-call-records?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AT&amp;T Paid $370,000 For the Deletion of Stolen Phone Call Records", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T18:16:03.179202+00:00", "description": "Thunderbird's annual Extended Support Release was revealed Friday, promising \"significant\" improvements to the overall user experience and \"the speed at which we can deliver new features to you,\" according to the Thunderbird blog:\n\nWe've devoted significant development time integrating Rust &mdash; a modern programming language originally created by Mozilla Research &mdash; into Thunderbird. Even though this is a seemingly invisible change, it is a major leap forward because it enhances our code quality and performance. This overhaul will allow us to share features between the desktop and future mobile versions of Thunderbird, and speed up our development process. It's a win for our developers and a win for you. \n\n\nMore from the blog OMG Ubuntu:\n\nI'm also stoked to see that Thunderbird 128 makes 'newest first' the default sort order for messages in message list. While some prefer the old way, I always found it strange that the oldest mails were shown first &mdash; team reverse chronol", "id": 863828, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/14/1733229/thunderbird-128-annual-esr-brings-new-features-and-a-rust-revolution?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Thunderbird 128:  Annual ESR Brings New Features and 'a Rust Revolution'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T17:11:32.366918+00:00", "description": "Long-time Slashdot reader schwit1 shared this report from non-profit libertarian law firm, the Institute for Justice:\n\n\nU.S. District Judge Rita Lin has permanently enjoined the California Bureau of Security and Investigative Services from enforcing its private-investigator licensing requirement against anti-spam entrepreneur Jay Fink. The order declares that forcing Jay to get a license to run his business is so irrational that it violates the Due Process Clause of the Fourteenth Amendment... \n\nJay's business stems from California's anti-spam act, which allows individuals to sue spammers. But to sue, they have to first compile evidence. To do that, recipients often have to wade through thousands of emails. For more than a decade, Jay has offered a solution: he and his team will scour a client's junk folder and catalog the messages that likely violate the law. But last summer, Jay's job &mdash; and Californians' ability to bring spammers to justice &mdash; came to a screeching halt wh", "id": 863592, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/13/1818256/california-prohibited-from-enforcing-pi-licensing-law-against-anti-spam-crusader?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "California Prohibited From Enforcing PI Licensing Law Against Anti-Spam Crusader", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T16:06:29.331804+00:00", "description": "At the end of June, Apple's App Store rejected the Windows/retro PC emulator \"UTM SE\". But in a reversal Apple approved the app Saturday, reports the Verge. \n\n\n\"We are happy to announce that UTM SE is available (for free) on iOS and visionOS App Store,\" the developer posted on X, \"and coming soon to AltStore PAL.\" \n\nFrom the Verge:\n\n\nAfter Apple rejected the app in June, the developer said it wasn't going to keep trying because the app was \"a subpar experience.\" Today, UTM thanked the AltStore team for helping it and credited another developer \"whose QEMU TCTI implementation was pivotal for this JIT-less build.\" \n\nAs with other emulators on the App Store, you can't do much with UTM SE out of the box. It doesn't come with any operating systems, though the app does link to UTM's site, which has guides for Windows XP through Windows 11 emulation, as well as downloads of pre-built virtual Linux machines. Mac OS 9.2.1 and DOS are listed in one screenshot from the UTM SE App Store page. Mac", "id": 863320, "language": "en-us", "link": "https://apple.slashdot.org/story/24/07/14/0434227/apple-approves-pclinuxmac-emulating-app-utm-se-for-app-store-reversing-earlier-rejection?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Approves PC/Linux/Mac-Emulating App 'UTM SE' for App Store, Reversing Earlier Rejection", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T15:01:44.916281+00:00", "description": "An anonymous reader shared this report from ScienceAlert:\n\nNASA's Parker Solar Probe, tasked with taking a close-up look at the Sun's outer corona, has just equalled the record for the fastest-moving human-made object ever.\nThe previous record holder? The Parker Solar Probe, again.\n\nThe probe was recorded traveling at 635,266 kilometers (394,736 miles) per hour on June 29, the second time it's reached that speed since it launched in 2018. We're talking around 500 times faster than the speed of sound here.\n\n\nIt's on course to get even faster too, with a top speed of around 692,000 kph (430,000 mph) expected when it makes its closest approach to the Sun in 2025.\n \n\nIt's the probe's 20th approach to the sun, according to the article, with the probe using Venus \"to create a sort of gravity-powered slingshot,\" according to the article. (NASA has created a nice interactive 3D model of the probe...)\n \n\nBesides collecting particle samples in 2021, \"The probe is eventually going to get nice an", "id": 863102, "language": "en-us", "link": "https://science.slashdot.org/story/24/07/13/1950247/fastest-object-ever-made-by-humans-continues-circling-the-sun-500x-faster-than-sound?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Fastest Object Ever Made By Humans Continues Circling the Sun, 500x Faster Than Sound", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T11:46:20.408557+00:00", "description": "An anonymous reader shared this report from InfoWorld:\n\nRust has leaped to its highest position ever in the monthly Tiobe index of language popularity, scaling to the 13th spot this month, with placement in the top 10 anticipated in an upcoming edition. Previously, Rust has never gone higher than 17th place in the Tiobe Programming Index. Tiobe CEO Paul Jansen attributed Rust's ascent in the just-released July index to a February 2024 U.S. White House report recommending Rust over C/C+ for safety reasons. He also credited the growing community and ecosystem support for the language. \"Rust is finally moving up.\" \nThe article adds that these rankings are based on \"the number of skilled engineers worldwide, courses, and third-party vendors pertaining to languages, examining websites such as Google, Amazon, Wikipedia, and more than 20 others to determine the monthly numbers.\"\n\n Python C++ C Java C# JavaScript Go Visual Basic Fortran SQL\n\nInterestingly, Rust has just moved into the top ten", "id": 862401, "language": "en-us", "link": "https://developers.slashdot.org/story/24/07/14/0159233/rust-leaps-forward-on-language-popularity-index?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Rust Leaps Forward on Language Popularity Index", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T08:31:15.339580+00:00", "description": "\"A leading South Korean producer of electric vehicle batteries has declared itself in crisis,\" reports the Financial Times, \"as its customers struggle with disappointing EV sales in Europe and the US.\"\n\nSK On, the world's fourth-largest EV battery maker behind Chinese giants CATL and BYD and South Korean rival LG Energy Solution, has recorded losses for 10 consecutive quarters since being spun off by its parent company in 2021. Its net debt has increased more than fivefold, from Won2.9tn ($2.1bn) to Won15.6tn over the same period, as western EV sales have fallen far short of its expectations. With losses snowballing, chief executive Lee Seok-hee announced a series of cost-cutting and working practice measures last Monday, describing them as a state of \"emergency management\". \n\n\"We have our back against the wall,\" Lee wrote in a letter to employees. \"We should all pull together.\" \n\n[...] Tim Bush, a Seoul-based battery analyst at UBS, said the South Korean battery makers had been \"badl", "id": 861899, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/13/2341237/battery-maker-sk-on-declares-emergency-as-ev-sales-disappoint?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Battery Maker SK On Declares 'Emergency' As EV Sales Disappoint", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T04:11:05.429765+00:00", "description": "\"In the largest public sector trial of the four-day week in Britain, fewer refuse collectors quit,\" reports the Guardian, \"and there were faster planning decisions, more rapid benefits processing and quicker call answering, independent research has found.\"\n\n\nSouth Cambridgeshire district council's controversial experiment with a shorter working week resulted in improvements in performance in 11 out of 24 areas, little or no change in 11 areas and worsening of performance in two areas, according to analysis of productivity before and during the 15-month trial by academics at the universities of Cambridge and Salford... The multi-year study of the trial involving about 450 desk staff plus refuse collectors found: \n\n- Staff turnover fell by 39%, helping save &pound;371,500 in a year, mostly on agency staff costs.\n- Regular household planning applications were decided about a week and a half earlier.\n- Approximately 15% more major planning application decisions were completed within the c", "id": 861417, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/14/0115206/largest-uk-public-sector-trial-of-four-day-work-week-sees-huge-benefits?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Largest UK Public Sector Trial of Four-Day Work Week Sees Huge Benefits", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T02:01:02.520274+00:00", "description": "ewhac (Slashdot reader #5,844) writes: \n\nFriday the hardware review site Gamers Nexus filed a YouTube video report alleging some serious claims: that PC component manufacturer MSI left their internal warranty and RMA processing web site accessible to the open Internet, with no authentication. Virtually the entire history of MSI warranty claims going back to at least 2017 were searchable and accessible for the browsing, including customer names, email addresses, phone numbers, and serial numbers of MSI devices. \n\nThis event follows closely on the heels of a video report just a few days earlier alleging PC component manufacturer Zotac left their warranty/RMA and B2B records server open to indexing by Google. \n\nGamers Nexus posted their reports after informing Zotac and MSI of their open servers and verifying they were no longer accessible. However, the data from MSI's server could have been fully scraped at this point, giving scammers a gold mine of data permitting them to impersonate M", "id": 861131, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/13/1741259/youtube-investigators-say-msi-exposed-600k-warranty-records-via-an-open-server?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "YouTube Investigators Say MSI Exposed 600K+ Warranty Records Via an Open Server", "user": null, "vote": 0}]