[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T15:30:08+00:00", "description": "Breaking into the Soulslike genre is no easy feat. It seems there’s a new combat-centric RPG around every corner, but Enotria: The Last Song from Italian developer Jyamma Games looks to offer enough distinction that it stands good chance to enter the growing pantheon of worthy Soulslikes. \n\nIts sun-baked, nature filled environs aren’t the only aspect that’ll serve Enotria: The Last Song well. There’s an in-depth RPG system at play here, with push-forward combat, a wealth of stat buffs, perks, equip-able items, and skills to unlock in what Jyamma Games are promising as a wholly customisable, experimental experience. \n\nFurthermore, Italian culture, heritage, and history is baked into every facet, with theatrical masks reminiscent of Venetian carnivals most attention grabbing. This feature aims to unpack everything there is to know about Enotria: The Last Song, but, as you’ll discover, there’s much more to this hopeful Soulslike than warm Mediterranean weather.", "id": 863252, "language": null, "link": "https://www.youtube.com/watch?v=_ZrG418nG2E", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/_ZrG418nG2E/hqdefault.jpg", "title": "This NEW Soulslike Could Be This Year's Lies of P", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T09:30:18+00:00", "description": "While only a handful of titles stand out among critics and players yearly, it's easy to forget how many thousands of other titles launch to relative obscurity. However, some games, whether moderately hyped or otherwise, aren't up to the mark.\n\nThey could be early access titles like Winter Survival, which fumble almost all of their mechanics, or ports like Teenage Mutant Ninja Turtles Arcade: Wrath of the Mutants, suffering from horrible movement, gameplay and lackluster content. Perhaps they're high-budget titles with immense hype, like Suicide Squad: Kill the Justice League or Skull and Bones, which crash and burn.\n\nMaybe it's an awful VR port of a beloved first-person shooter like Bulletstorm VR or a terrible cash-in for a beloved anime/manga property that should have been a slam-dunk hit. Regardless, here are our top 15 picks for the worst games of 2024 (so far).", "id": 862052, "language": null, "link": "https://www.youtube.com/watch?v=kNslLdFc8-U", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/kNslLdFc8-U/hqdefault.jpg", "title": "Top 15 Worst Games of 2024 [First Half]", "user": null, "vote": 0}]