[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T17:02:17+00:00", "description": "<p>Our team is committed to sharing our love of grimdark fantasy and science fiction in all media—be it books, film, TV or games—in the hopes that you might find a story you love. But, what exactly is grimdark and where does it situate itself relative to other speculative fiction? Although it lacks a formal definition, the term “grimdark” is now commonly used to describe works of fantasy or science fiction that are particularly violent, dystopian, or amoral. The purpose of this essay is to reconsider this popularly held opinion of grimdark and propose a description that fits how we’ve seen it evolve over the years and where we see it now. The definition proposed herein represents the collective view of the Grimdark Magazine leadership team. Previous Attempts to Define Grimdark The word “grimdark” originated from the tagline of the dystopian tabletop war game, Warhammer 40,000, which was introduced in 1987 and famously proclaimed: “In the grim darkness of the far future there is only w", "id": 863618, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/defining-grimdark-fantasy-and-sf-moving-to-an-inclusive-future", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "Defining Grimdark Fantasy and SF: Moving to an Inclusive Future", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-14T04:25:13+00:00", "description": "<p>Arm of the Sphinx is Josiah Bancroft’s swashbuckling sequel to Senlin Ascends and the second entry in his Books of Babel tetralogy. This second book has a very different feel compared to Bancroft’s debut, which focused almost exclusively on its lead protagonist, Thomas Senlin, a small-town schoolteacher whose honeymoon at the Tower of Babel turns into a Kafkaesque nightmare as he searches for his lost wife, Marya, across stratified layers of absurdity. In contrast, Arm of the Sphinx adopts a more conventional narrative structure, with multiple points of view from Senlin and his companions. Arm of the Sphinx opens with Senlin in the guise of Captain Tom Mudd, an airship pirate causing fear and disruption outside the walls of the Tower of Babel. Senlin’s motley crew includes the scrappy fighter Iren and siblings Adam and Voleta Boreas. Adam is an engineer of questionable loyalty who committed the original sin against Senlin upon his initial entry into the Tower. His adventurous siste", "id": 861514, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-arm-of-the-sphinx-by-josiah-bancroft", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: Arm of the Sphinx by Josiah Bancroft", "user": null, "vote": 0}]