[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Top 15 HARDEST GAMES of 2023 That Will Test Your MIGHT", "description": "As fun as it can be to play a breezy, easygoing experience that doesn’t demand too much from you, there’s an undeniable charm to games that refuse to chill out and let you take a breath. \n\nExtreme challenge is, by its very nature, inherently not something that everyone is going to be able to enjoy, but there’s a massive crowd of people out there who clearly do, which means there’s never any shortage of games out there that deliver exactly that sort of experience. \n\nThroughout the course of 2023, we saw plenty such titles, coming from big and small developers alike and ranging across a variety of different genres, and here, we’re going to take a look at some that have managed to stand out in our memory thanks to their approach for difficulty (which, in a couple of cases, isn’t exactly a strength).", "link": "https://www.youtube.com/watch?v=GiuOVc91P80", "date_published": "2023-12-04T17:30:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/GiuOVc91P80/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "TOP 30 MOST AMAZING Action RPGs That Are Worth Your Time [2023 Edition]", "description": "With more games adapting role-playing game elements, narrowing down a pure role-playing experience can be challenging. The same applies to action RPGs, which utilize upgrades, level-ups and loot while embracing faster-paced combat.\n\nWhether it's a hack-and-slash title with epic boss storylines and boss fights, games that emphasize difficulty and exploration, or shooters which offer choice and build variety, there are all kinds of action RPGs out there. Given the genre's history, how many are worth playing, let alone investing dozens of hours and repeat playthroughs?\n\nCheck out our list of top 30 action RPGs as of 2023. It could be a story-focused affair or the pursuit of better loot for min-maxing your character, but these are all worth checking out.", "link": "https://www.youtube.com/watch?v=tWq6vJmwfnQ", "date_published": "2023-12-04T13:30:31+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/tWq6vJmwfnQ/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Why Game Pass On PS5 Will NEVER HAPPEN, Even if Microsoft Wanted It To", "description": "In an industry that’s been almost excessively focused on consoles and closed ecosystems for about as long as it has existed, Microsoft’s pivot to a platform-agnostic approach with the advent of Game Pass has been fascinating to see. \n\nBut though that approach has naturally led to the company looking to put its subscription service – which is now central to anything and everything Xbox – on rival platforms, it’s hard to see a scenario where that actually ends up happening. \n\nAs much as fans and consumers would love to see Game Pass on non-Xbox consoles, platform holders like Sony have very little reason to ever allow that to actually happen- at least in the way that Microsoft would want it to. Here, we talk about why that is the case.", "link": "https://www.youtube.com/watch?v=Oai2t-QOMfo", "date_published": "2023-12-04T09:30:07+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/Oai2t-QOMfo/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]