[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-27T20:30:04+00:00", "description": "Boss fights by-and-large serve as brute force tests to examine player skill and proficiency with the game’s mechanics up to that point. They also provide a thrilling showpiece, memorable encounters, and or worthy challenges. \n\nIn combat-centric games, boss battles are all, but a given. However, not every combat focused game has boss fights. The games on this rundown, whilst all involving combat in some shape or form, largely eschew the boss battling trope, instead seeing the boss battle as a distraction from the game’s narrative, the context of the story or character arcs not consistent with a visually arresting showpiece. \n\nThere are showpiece encounters in most of these games, mind, but there’s no way they can be described as an examination of player skill, proficiency with mechanics, or assessment of character upgrades.", "language": null, "link": "https://www.youtube.com/watch?v=XYqFf9O2nYk", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/XYqFf9O2nYk/hqdefault.jpg", "title": "8 Amazing Games THAT HAD NEXT TO NO BOSS FIGHTS", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-27T17:30:10+00:00", "description": "Video game development is a tricky business. Studios with deep pockets and one-man indie developers alike can encounter misfortune, their games exuding hope and promise seemingly falling by the wayside in mysterious circumstances. \n\nThe strange thing about the majority of the games on this rundown is that despite concept art, gameplay demos, websites, and E3 appearances, these games have never been released nor officially cancelled. \n\nSome developers – Rockstar included, obviously – can be quite secretive to their inner workings, so we may never know what’s gone on behind the scenes. Others have just disappeared off the face of the earth, despite the odd update over the years hinting that progress is still trundling along.", "language": null, "link": "https://www.youtube.com/watch?v=qoytzXcDmmM", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qoytzXcDmmM/hqdefault.jpg", "title": "15 Most Ambitious Games That Have Just VANISHED", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-27T13:30:21+00:00", "description": "It’s been close to a decade since Fallout 4 originally came out, but with Bethesda have released an enhanced version for current-gen machines, the post-apocalyptic action RPG has seen a sudden influx of both new and returning players (while the Amazon show’s popularity has, of course, helped matters as well). \n\nCriticisms regarding the game’s pared back RPG mechanics, streamlined dialogue system, inconsistent writing, and largely unengaging main story have persisted to this day, and jumping back into the game, it’s easy to see why. On top of that, Bethesda has also been disappointingly restrained in the technical upgrades it has applied to the game with its newly released version. At the same time, however, with fun combat, compelling exploration, and a stellar open world, for the most part, Fallout 4 remains an incredibly fun game to play.", "language": null, "link": "https://www.youtube.com/watch?v=rJZH25k-Hec", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/rJZH25k-Hec/hqdefault.jpg", "title": "Fallout 4 Next-Gen Review - Could Have Been Better", "user": null, "vote": 0}]