[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-15T15:30:14+00:00",
        "description": "There's nothing quite like a good old jolt to the system, isn't there? You settle comfortably into the status quo, you're activating your open world towers, you're looking at the rarities of the loot in your inventory, you're cracking packs and progressing through battle passes- and then this game comes along out of nowhere that just refuses to play by the rules. \n\nIt gleefully tears up the precious status quo and revels in its weirdness- and it might be a little rough around the edges, but you can't quite take your eye off it. 2024 had a surprising number of such games, and here, we're going to talk about a few of them.",
        "id": 1715079,
        "language": null,
        "link": "https://www.youtube.com/watch?v=o1CJ2LzGig0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/o1CJ2LzGig0/hqdefault.jpg",
        "title": "10 Most BIZARRE Video Games of 2024 You Won’t Believe Actually Exist",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-15T09:30:10+00:00",
        "description": "Remember when the year began, and Sony said it wouldn't launch any \"major franchise titles\" through the year or even before April 2025? There was understandable panic, and as the months went on, it became clear that the PS5's first-party offerings would be slim pickings. And while Astro Bot arrived to assuage the pain, Concord was a massive flop.\n\nFortunately, the year saw many other developers step up and deliver some incredible exclusives. Final Fantasy 7 Rebirth is an incredible RPG and a Game of the Year frontrunner. Stellar Blade marked Shift Up's console gaming debut and offered a solid hack-and-slash action experience. Silent Hill 2 remake is one of the best horror games ever made.\n\nThen you have Black Myth: Wukong's breakout success with over 20 million copies sold. Plenty of other non-exclusive games also made their mark, so let's outline the 20 best PS5 titles from 2024.",
        "id": 1713570,
        "language": null,
        "link": "https://www.youtube.com/watch?v=KsEtiOtCmGk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KsEtiOtCmGk/hqdefault.jpg",
        "title": "Top 20 Best PS5 Games of 2024 You SHOULD NOT IGNORE",
        "vote": 0
    }
]