[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-04T15:30:07+00:00", "description": "It’s too soon to declare Senua’s Saga: Hellblade II in contention for GOTY just yet seeing as we haven’t seen any more than glimpses of actual gameplay, but from what we have seen and from the behind-the-scenes features developer Ninja Theory have shared, this long-awaited sequel to the much-celebrated 2017 game has all the ingredients to be a frontrunner. \n\nNinja Theory have ramped up the realism and immersion for this entry; this sequel isn’t just a graphical, weapons, and enemy type expansion. No, Senua’s relationship with her psychosis has shifted, actress Melina Juergens has put in some hard work to deliver as convincing a performance as possible for Senua’s expanded combat skillset, and the signature binaural audio of the first game returns with greater focus on more than just the haunting voices in Senua’s head.", "language": null, "link": "https://www.youtube.com/watch?v=FVT-HP17O4U", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/FVT-HP17O4U/hqdefault.jpg", "title": "Why Hellblade 2 Will Be One of the BIGGEST GAMES OF THE YEAR", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-04T09:45:02+00:00", "description": "Shift Up's Stellar Blade's gameplay looks interesting ever since its showing during Sony's State of Play in January. Coupled with the recent demo and the lack of big first-party PS5 titles for the rest of the year, its gameplay is shaping up well.\n\nHowever, there's a lot more to the hack-and-slash action-adventure. Despite the modern action game's inspiration, combat is methodical and challenging, though there's plenty of room for flashy evades, special attacks and finishers.\n\nStellar Blade launches on April 26th exclusively for PS5, retailing at $70 and promising a 25-hour campaign. Here's everything you need to know about it before jumping in.", "language": null, "link": "https://www.youtube.com/watch?v=SNGXMweub78", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/SNGXMweub78/hqdefault.jpg", "title": "Stellar Blade - 15 Things You Need To Know Before You Buy", "user": null, "vote": 0}]