[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-15T19:23:25+00:00", "description": "Agam, now 18, was held hostage by Hamas after gunmen stormed her kibbutz on Oct. 7. She shares her story in \"A Year of War: Israelis and Palestinians,\" a documentary chronicling the experiences of people in Israel and Gaza living through a year of unprecedented violence. Watch an excerpt now.\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate​/\n\nIn the film, Agam is among the Israelis who recount what it was like to live through the Oct. 7 attacks, the deadliest day for Jews since World War II, with around 1,200 people killed and 251 taken hostage. And in Gaza, where more than 40,000 people have reportedly been killed in Israel’s retaliation against Hamas, Palestinians describe — and record — the large-scale devastation.  \nThrough these individual stories, \"A Year of War: Israelis and Palestinians,\" offers a devastating portrait of the conflict as a whole, and a profound look inside a cycle of violence and tragedy with", "id": 1330547, "language": null, "link": "https://www.youtube.com/watch?v=R4doFbAqYc8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 109, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/R4doFbAqYc8/hqdefault.jpg", "title": "Held Hostage by Hamas: Agam’s Story | A Year of War: Israelis and Palestinians | FRONTLINE (PBS)", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-15T19:22:37+00:00", "description": "Ghada, now 23, lost her home in the Israeli bombardment of Gaza that followed the Oct. 7 attacks. She shares her story in \"A Year of War: Israelis and Palestinians,\" a documentary chronicling the experiences of people in Gaza and Israel living through a year of unprecedented violence. Watch an excerpt now.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate​/\n\nIn the film, Ghada is one of the Palestinians who describe — and record — the large-scale devastation in Gaza, where more than 40,000 people have reportedly been killed in Israel’s retaliation against Hamas. The film also chronicles the experiences of Israelis who recount what it was like to live through the Oct. 7 Hamas attacks, the deadliest day for Jews since World War II, with around 1,200 people killed and 251 taken hostage. \n\nThrough these individual stories, \"A Year of War: Israelis and Palestinians,\" offers a devastating portrait of the conflict as a whol", "id": 1330548, "language": null, "link": "https://www.youtube.com/watch?v=Xp7iQ7JE558", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 109, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/Xp7iQ7JE558/hqdefault.jpg", "title": "Displaced in Gaza: Ghada’s Story | A Year of War: Israelis and Palestinians | FRONTLINE (PBS)", "vote": 0}]