[{"album": "", "age": null, "page_rating_votes": 0, "link": "https://www.youtube.com/watch?v=M8ZqDxC2gr8", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Tomb Raider 1-3 Remastered - 15 Things You Should Know BEFORE YOU BUY", "page_rating": 0, "language": null, "page_rating_contents": 0, "source_obj__id": 208, "user": null, "artist": "GamingBolt", "date_published": "2024-02-13T18:00:11+00:00", "thumbnail": "https://i2.ytimg.com/vi/M8ZqDxC2gr8/hqdefault.jpg", "dead": false, "comments": [], "page_rating_visits": 0, "description": "Launching on February 14th, Tomb Raider 1-3 Remastered packages the original three games and their expansions together while offering revamped visuals, a new control scheme and various updates.\n\nAspyr looks to retain the original feel of the originals, including an option to switch to the classic visual style at any point. Players can also look forward to Photo Mode, health bars on bosses and over 200 new Trophies exclusively on PlayStation.\n\nWhat else is in store, especially for those playing on Xbox? How significant are the visual improvements? Find out more before the remastered collection's launch later this week.", "permanent": false, "vote": 0, "bookmarked": false, "tags": []}, {"album": "", "age": null, "page_rating_votes": 0, "link": "https://www.youtube.com/watch?v=SW8OW2Sfv4Y", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 BEST Helldivers 2 Tips And Tricks You NEED TO KNOW", "page_rating": 0, "language": null, "page_rating_contents": 0, "source_obj__id": 208, "user": null, "artist": "GamingBolt", "date_published": "2024-02-13T07:00:11+00:00", "thumbnail": "https://i4.ytimg.com/vi/SW8OW2Sfv4Y/hqdefault.jpg", "dead": false, "comments": [], "page_rating_visits": 0, "description": "Arrowhead Game Studios' Helldivers 2 is an out-and-out enjoyable experience, where dying is as essential as carpet-bombing alien insects. However, past the uber-patriotic tutorial, it could do a better job of explaining some things.\n\nDid you know you can switch firing modes on your gun or ping different locations? How about that Super Credits, the premium currency, are earnable in-game (and at a pretty rapid pace)? How about the various Eagle Strike skills that are usable more than the specified number of times in a mission? Or that Chargers are much easier to defeat than you think?\n\nSeveral other details are worth pointing out for new and long-term players. Here are 15 things that Helldivers 2 doesn't tell you and how to best optimize your experience.", "permanent": false, "vote": 0, "bookmarked": false, "tags": []}]