[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-13T19:00:32+00:00", "description": "When you look at the stealth genre and its titles throughout the years, it hasn't been burgeoning with triple-A efforts. The likes of Splinter Cell and Metal Gear are seemingly far behind, though both are receiving remakes. From that perspective, Spikewave's Evotinction is an interesting title.\n\nAs part of Sony's Hero Project, it follows Dr. Thomas Liu and his efforts to defeat the RED virus in the high-tech facility HERE. Though his combat options are limited, Liu can utilize hacking tools to redirect and outsmart the rogue Genies roaming the facility. The visuals are pretty striking, thanks to Unreal Engine 5.\n\nHowever, dig deeper, and problems emerge. Whether it's the characterization and script reading that doesn't get enough time to breathe, the performance issues, or the overall plot, Evotinction squanders much of its potential. The stealth mechanics stand out, but everything else leaves much to be desired.", "id": 1141250, "language": null, "link": "https://www.youtube.com/watch?v=kYkgMtV6UMw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/kYkgMtV6UMw/hqdefault.jpg", "title": "Evotinction PS5 Review - Does This New Stealth Game Revitalize the Declining Genre?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-13T16:01:45+00:00", "description": "The PS5 Pro has been officially unveiled, and though there's no shortage of discourse around whether or not the upgrades it offers over the base PS5 are enough to justify its eye-watering $700 price (or even to justify its existence, for that matter), it also goes without saying that, at the same time, there is going to be some excitement around seeing how different games will be able to leverage and benefit from the added capabilities that the mid-gen console is bringing to the table, from its faster rendering and its advanced ray tracing to the all-new PSSR and more. \n\nHere, then, we're going to go over a few games that we're hoping will be enhanced on the PS5 Pro, to the extent where it makes an actual, tangible difference.", "id": 1140095, "language": null, "link": "https://www.youtube.com/watch?v=f-IAxLJq64Q", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/f-IAxLJq64Q/hqdefault.jpg", "title": "15 PS5 Games That ABSOLUTELY NEED A PS5 PRO PATCH", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-13T09:30:22+00:00", "description": "We’ve been waiting for Silent Hill to return for a long time, and finally, Konami is ready to bring the series back into the limelight with a ground up remake of the legendary Silent Hill 2. \n\nDeveloped by Bloober Team, the remake is promising an experience that remains faithful to the source material as far as the overarching main story is concerned, while also refining, tweaking, improving, and expanding the experience in other ways, with everything from the visuals and the combat to the puzzles and more seeing a variety of different upgrades and enhancements. \n\nWith the Silent Hill 2 remake set to launch not long from now, here, we are going to go over all of those details and more.", "id": 1137887, "language": null, "link": "https://www.youtube.com/watch?v=WfISGLdudh4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/WfISGLdudh4/hqdefault.jpg", "title": "Silent Hill 2 Remake - 15 Things You NEED TO KNOW Before You Buy", "vote": 0}]