[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T20:55:37.430488+00:00", "description": "Apple's elaborate new ad campaign promises that Safari is \"a browser that protects your privacy.\" And the Washington Post says Apple \"deserves credit for making many privacy protections automatic with Safari...\" \n\n\n\"But Albert Fox Cahn, executive director of the Surveillance Technology Oversight Project, said Safari is no better than the fourth-best web browser for your privacy.\"\n\n\n\"If browser privacy were a sport at the Olympics, Apple isn't getting on the medal stand,\" Cahn said. (Apple did not comment about this.) \nSafari stops third-party cookies anywhere you go on the web. So do Mozilla's Firefox and the Brave browser... Chrome allows third-party cookies in most cases unless you turn them off... Even without cookies, a website can pull information like the resolution of your computer screen, the fonts you have installed, add-on software you use and other technical details that in aggregate can help identify your device and what you're doing on it. The measures, typically called \"", "id": 970979, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/03/0441234/when-it-comes-to-privacy-safari-is-only-the-fourth-best-browser?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "When It Comes to Privacy, Safari Is Only the Fourth-Best Browser", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T20:55:35.719297+00:00", "description": "The planet Mercury could have \"a layer of diamonds,\" reports CNN, citing new research suggesting that about 310 miles (500 kilometers) below the surface...could be a layer of diamonds 11 miles (18 kilometers) thick. \n\nAnd the study's co-author believes lava might carry some of those diamonds up to the surface:\n\n\nThe diamonds might have formed soon after Mercury itself coalesced into a planet about 4.5 billion years ago from a swirling cloud of dust and gas, in the crucible of a high-pressure, high-temperature environment. At this time, the fledgling planet is believed to have had a crust of graphite, floating over a deep magma ocean. \n\nA team of researchers recreated that searing environment in an experiment, with a machine called an anvil press that's normally used to study how materials behave under extreme pressure but also for the production of synthetic diamonds. \"It's a huge press, which enables us to subject tiny samples at the same high pressure and high temperature that we wo", "id": 970978, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/02/2225203/are-there-diamonds-on-mercury?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Are There Diamonds on Mercury?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T20:55:34.022616+00:00", "description": "An anonymous reader shared this report from BleepingComputer:\nA Chinese hacking group tracked as StormBamboo has compromised an undisclosed internet service provider (ISP) to poison automatic software updates with malware. Also tracked as Evasive Panda, Daggerfly, and StormCloud, this cyber-espionage group has been active since at least 2012, targeting organizations across mainland China, Hong Kong, Macao, Nigeria, and various Southeast and East Asian countries. \n\nOn Friday, Volexity threat researchers revealed that the Chinese cyber-espionage gang had exploited insecure HTTP software update mechanisms that didn't validate digital signatures to deploy malware payloads on victims' Windows and macOS devices... To do that, the attackers intercepted and modified victims' DNS requests and poisoned them with malicious IP addresses. This delivered the malware to the targets' systems from StormBamboo's command-and-control servers without requiring user interaction. \nVolexity's blog post says ", "id": 970977, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/03/1854257/how-chinese-attackers-breached-an-isp-to-poison-insecure-software-updates-with-malware?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How Chinese Attackers Breached an ISP to Poison Insecure Software Updates with Malware", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T18:19:58.803737+00:00", "description": "\"As media bosses scramble to decide if and how they should partner with AI companies, workers are increasingly concerned that the technology could imperil their jobs or degrade their work...\" reports the Washington Post. \nThe latest example? \"Two months after the Atlantic reached a licensing deal with OpenAI, staffers at the storied magazine are demanding the company ensure their jobs and work are protected.\" (Nearly 60 journalists have now signed a letter demanding the company \"stop prioritizing its bottom line and champion the Atlantic's journalism.\")\n\nThe unionized staffers want the Atlantic bosses to include AI protections in the union contract, which the two sides have been negotiating since 2022. \"Our editorial leaders say that The Atlantic is a magazine made by humans, for humans,\" the letter says. \"We could not agree more...\" \n\nThe Atlantic's new deal with OpenAI grants the tech firm access to the magazine's archives to train its AI tools. While the Atlantic in return will hav", "id": 970707, "language": "en-us", "link": "https://slashdot.org/story/24/08/03/020259/journalists-at-the-atlantic-demand-assurances-their-jobs-will-be-protected-from-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Journalists at 'The Atlantic' Demand Assurances Their Jobs Will Be Protected From OpenAI", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T17:18:00.171760+00:00", "description": "\"Generation X and millennials are at an increased risk of developing certain cancers compared with older generations,\" reports the Washington Post, \"a shift that is probably due to generational changes in diet, lifestyle and environmental exposures, a large new study suggests.\" \nResearchers from the American Cancer analyzed data from more than 23.5 million patients who had been diagnosed with 34 types of cancer from 2000 to 2019 &mdash; and also studied mortality data that included 7 million deaths in the U.S. from 25 types of cancer among people ages 25 to 84.\n\n[The researchers reported] that cancer rates for 17 of the 34 most common cancers are increasing in progressively younger generations. The findings included: \n\n- Cancers with the most significant increased risk are kidney, pancreatic and small intestine, which are two to three times as high for millennial men and women as baby boomers.\n- Millennial women also are at higher risk of liver and bile duct cancers compared with baby", "id": 970528, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/03/0117232/gen-x-and-millennials-at-higher-cancer-risk-than-older-generations?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Gen X and Millennials at Higher Cancer Risk Than Older Generations", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T16:14:56.782723+00:00", "description": "A professor at Brigham Young University \"has figured out a way to shave critical years off the complicated design and licensing processes for modern nuclear reactors,\" according to an announcement from the university. \n\n\"AI is teaming up with nuclear power.\"\n\nThe typical time frame and cost to license a new nuclear reactor design in the United States is roughly 20 years and $1 billion. To then build that reactor requires an additional five years and between $5 and $30 billion. By using AI in the time-consuming computational design process, [chemical engineering professor Matt] Memmott estimates a decade or more could be cut off the overall timeline, saving millions and millions of dollars in the process &mdash; which should prove critical given the nation's looming energy needs.... \"Being able to reduce the time and cost to produce and license nuclear reactors will make that power cheaper and a more viable option for environmentally friendly power to meet the future demand....\" \n\n\nEng", "id": 970136, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/08/03/0555236/could-ai-speed-up-the-design-of-nuclear-reactors?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Could AI Speed Up the Design of Nuclear Reactors?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T16:14:52.186179+00:00", "description": "Thursday Go's long-time tech lead Russ Cox made an announcement:\n\nStarting September 1, Austin Clements will be taking over as the tech lead of Go: both the Go team at Google and the overall Go project. Austin is currently the tech lead for what we sometimes call the \"Go core\", which encompasses compiler toolchain, runtime, and releases. Cherry Mui will be stepping up to lead those areas. \n\nI am not leaving the Go project, but I think the time is right for a change... I will be shifting my focus to work more on Gaby [or \"Go AI bot,\" an open-source contributor agent] and Oscar [an open-source contributor agent architecture], trying to make useful contributions in the Go issue tracker to help all of you work more productively. I am hopeful that work on Oscar will uncover ways to help open source maintainers that will be adopted by other projects, just like some of Go's best ideas have been adopted by other projects. At the highest level, my goals for Oscar are to build something useful,", "id": 970135, "language": "en-us", "link": "https://developers.slashdot.org/story/24/08/02/2127209/go-tech-lead-russ-cox-steps-down-to-focus-on-ai-powered-open-source-contributor-bot?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Go Tech Lead Russ Cox Steps Down to Focus on AI-Powered Open-Source Contributor Bot", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T10:43:17.295709+00:00", "description": "A proposed European Union law seeks to ensure that video games sold or licensed in the EU remain playable even if servers are shut down or studios close. The law would require publishers of sold and free-to-play games with microtransactions to provide resources to keep games functional, such as allowing players to host their own servers. Through a process called the \"European Citizens Initiative,\" the petition needs one million signatures just to have a chance at becoming law. PC Gamer reports: \"An increasing number of publishers are selling videogames that are required to connect through the internet to the game publisher, or 'phone home' to function,\" the petition reads. \"While this is not a problem in itself, when support ends for these types of games, very often publishers simply sever the connection necessary for the game to function, proceed to destroy all working copies of the game, and implement extensive measures to prevent the customer from repairing the game in any way.\"\n \n", "id": 969126, "language": "en-us", "link": "https://games.slashdot.org/story/24/08/03/0027201/initiative-aims-to-require-eu-game-publishers-to-make-retired-games-playable?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Initiative Aims To Require EU Game Publishers To Make Retired Games Playable", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T07:57:34.636892+00:00", "description": "New preliminary evidence for phosphine and ammonia in Venus's atmosphere deepens the mystery of their origins, suggesting the possibility of a biological source. The detections, made using the James Clerk Maxwell Telescope and the Green Bank Telescope, point to potential microbial life in Venus's clouds despite the planet's extreme surface conditions. Space.com reports: The new detections of phosphine and ammonia were obtained by a team led by Jane Greaves of the University of Cardiff using submillimeter radio wavelength data collected by the James Clerk Maxwell Telescope (JCMT) in Hawaii and the Green Bank Telescope in West Virginia. \"We don't know how you make phosphine or ammonia in an oxygenating atmosphere like that of Venus,\" said team member and astrophysicist Dave Clements of Imperial College, London, in an interview with Space.com. Then again, it's not clear why biology on Earth produces phosphine, either.\" Whether it's in penguin poop or badger guts, we don't know why bacter", "id": 968710, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/03/0014247/venus-may-be-able-to-support-life-new-atmospheric-evidence-suggests?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Venus May Be Able To Support Life, New Atmospheric Evidence Suggests", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T04:15:47.993219+00:00", "description": "An anonymous reader quotes a report from Ars Technica: The US government will pay Moderna $176 million to develop an mRNA vaccine against a pandemic influenza -- an award given as the highly pathogenic bird flu virus H5N1 continues to spread widely among US dairy cattle. The funding flows through BARDA, the Biomedical Advanced Research and Development Authority, as part of a new Rapid Response Partnership Vehicle (RRPV) Consortium. The program is intended to set up partnerships with industry to help the country better prepare for pandemic threats and develop medical countermeasures, the Department of Health and Human Services said in a press announcement Tuesday.\n \nIn its own announcement on Tuesday, Moderna noted that it began a Phase 1/2 trial of a pandemic influenza virus vaccine last year, which included versions targeting H5 and H7 varieties of bird flu viruses. The company said it expects to release the results of that trial this year and that those results will direct the desig", "id": 968295, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/02/2053247/us-prepares-for-bird-flu-pandemic-with-176-million-moderna-vaccine-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Prepares For Bird Flu Pandemic With $176 Million Moderna Vaccine Deal", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T01:42:37.507308+00:00", "description": "Meta's Twitter rival, Threads, has reached a new milestone of 200 million active users, according to Instagram head Adam Mosseri. \"I'm excited to share that we crossed the 200M milestone on @threads,\" Mosseri wrote. \"My hope is that Threads can inspire ideas that bring people together and this amazing community continues to grow.\" TechCrunch reports: Growth for Threads has been strong. The text-focused social media platform, which launched in July 2023, reached 150 million users in April 2024 and 175 million users in July on its one-year anniversary, before another growth spurt led it to hit 200 million a month later. [...]\n \nLast year, Zuckerberg suggested Threads has a \"good chance\" of becoming a platform with more than a billion users. On the latest earnings call, the Meta CEO also described the platform as being on a good growth trajectory. \"We're making steady progress towards building what looks like it's going to be another major social app. And we are seeing deeper engagement,", "id": 967857, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/02/2014209/metas-threads-crosses-200-million-active-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta's Threads Crosses 200 Million Active Users", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T01:42:29.207106+00:00", "description": "The Japanese government has released details of an app that verifies the legitimacy of its troubled My Number Card -- a national identity document. From a report: Beginning in 2015, every resident of Japan was assigned a 12 digit My Number that paved the way for linking social security, taxation, disaster response and other government services to both the number itself and a smartcard. The plan was to banish bureaucracy and improve public service delivery -- but that didn't happen. \n\nMy Number Card ran afoul of data breaches, reports of malfunctioning card readers, and database snafus that linked cards to other citizens' bank accounts. Public trust in the scheme fell, and adoption stalled. Now, according to Japan's Digital Ministry, counterfeit cards are proliferating to help miscreant purchase goods -- particularly mobile phones -- under fake identities. Digital minister Taro Kono yesterday presented his solution to the counterfeits: a soon to be mandatory app that confirms the legit", "id": 967856, "language": "en-us", "link": "https://slashdot.org/story/24/08/02/2022212/japan-mandates-app-to-ensure-national-id-cards-arent-forged?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Japan Mandates App To Ensure National ID Cards Aren't Forged", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T01:42:24.354629+00:00", "description": "AI music generators Suno and Udio responded to the lawsuits filed by the major recording labels, arguing that their platforms are tools for making new, original music that \"didn't and often couldn't previously exist.\"\n \n\"Those genres and styles -- the recognizable sounds of opera, or jazz, or rap music -- are not something that anyone owns,\" the companies said. \"Our intellectual property laws have always been carefully calibrated to avoid allowing anyone to monopolize a form of artistic expression, whether a sonnet or a pop song. IP rights can attach to a particular recorded rendition of a song in one of those genres or styles. But not to the genre or style itself.\" TorrentFreak reports: \"[The labels] frame their concern as one about 'copies' of their recordings made in the process of developing the technology -- that is, copies never heard or seen by anyone, made solely to analyze the sonic and stylistic patterns of the universe of pre-existing musical expression. But what the major ", "id": 967855, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/08/02/2033236/suno-udio-to-riaa-your-music-is-copyrighted-you-cant-copyright-styles?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Suno &amp; Udio To RIAA: Your Music Is Copyrighted, You Can't Copyright Styles", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-03T01:42:08.391650+00:00", "description": "Apple reported a new June quarter revenue record of $85.8 billion, up 5 percent from a year ago, fueled largely by new iPad sales. iPad \"saw the biggest category increase for the quarter, up from $5.8 billion to $7.2 billion year-over-year,\" reports TechCrunch. It helped counter slowed iPhone revenue, \"which dropped from $39.7 billion to $39.3 billion year-on-year.\" From the report: In spite of a drop for the quarter, iPhone remained Apple's most important category by a wide margin, followed by service, which includes software offerings like iCloud, Apple TV+ and Apple Music. That category continued to grow, up to $24.2 billion from $21.2 billion over the same three-month period last year. Much of the iPhone slowdown can be attributed to the greater China region. Overall, the region dropped from $15.8 billion to $14.7 billion for the quarter. Canalys figures from last week show a marked decline in iPhone sales, down 6.7% from 10.4 million to 9.7 million for the quarter, Reuters report", "id": 967854, "language": "en-us", "link": "https://apple.slashdot.org/story/24/08/02/2046211/ipad-sales-help-bail-out-apple-amid-a-continued-iphone-slide?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "iPad Sales Help 'Bail Out' Apple Amid a Continued iPhone Slide", "user": null, "vote": 0}]