[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-28T17:30:04+00:00", "description": "Every genre has its followers, but in terms of encompassing so many different titles, very few can match the popularity of role-playing games. Whether it's their epic stories, cinematic combat, number-crunching min-maxing or dynamic worlds, RPGs are still some of the most well-regarded titles.\n\nThey aren't without their issues, however. Lovable characters can turn sour and decide to leave the party. Decisions can ultimately lead to nothing or have little bearing on the plot. Enemies can scale with your level, negating any real sense of progression.\n\nIt can even be something as simple as the senseless grind for materials or failing continuously to get that one perfect roll on your loot of choice. Here are 16 things we can't stand in role-playing games despite ordinarily enjoying them so much.", "language": null, "link": "https://www.youtube.com/watch?v=PDmYQtgZR2o", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/PDmYQtgZR2o/hqdefault.jpg", "title": "16 Things We CAN'T STAND IN RPGs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-28T13:30:12+00:00", "description": "Video games as a medium are renowned for pushing boundaries. We’re not just talking graphical prowess here, but in narrative delivery, subject matter, gameplay, or controls, video games have proven time and again that they know how to push the envelope. \n\nThe 14 games on this rundown don’t represent an exhaustive list, as how could they? There are so many titles to choose from, games that demonstrate genuine innovation, that pave the way for further innovation, and thus push the medium onwards. \n\nThat said, if there’s a theme running through each of the games featured here it’s maybe that they represent a form of bravery from the developers. Of them trusting us, the players, to interpret and understand what they were trying to achieve without it being spoon-fed.", "language": null, "link": "https://www.youtube.com/watch?v=Y4VLGDL-ckk", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/Y4VLGDL-ckk/hqdefault.jpg", "title": "14 Single Player Games That Were Way Ahead of Their Time", "user": null, "vote": 0}]