[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-28T16:44:00+00:00", "description": "<p>Following the launch of original Marvel series on Disney+ in 2021, there have been more than a few fans complaining about the number of MCU shows to stay on top of, in addition to multiple movies per year. However, there's only one Marvel Studios movie in 2024: Deadpool &amp; Wolverine. And according to director Shawn Levy, you won't need to watch any previous MCU show or movie to enjoy the sequel.</p><p>\"I was a good student in school,\" related Levy during an interview with the <a href=\"https://apnews.com/article/deadpool-wolverine-shawn-levy-summer-movie-preview-41837da894418c635f96784f06241d7d\">Associated Press</a>. \"I'll do my homework as an adult. But I am definitely not looking to do homework when I go to the movies. I very much made this film with certainly a healthy respect and gratitude towards the rabid fan base that has peak fluency in the mythology and lore of these characters and this world. But I didn't want to presume that. This movie is built for entertainment, with", "language": "en-US", "link": "https://www.gamespot.com/articles/deadpool-wolverine-director-says-sequel-doesnt-need-any-prior-mcu-knowledge/1100-6523007/?ftag=CAD-01-10abi2f", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.gamespot.com/feeds/mashup", "source_obj__id": 126, "status_code": 0, "tags": [], "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1837/18375603/4294682-deadpoolandwolverine.jpg", "title": "Deadpool & Wolverine Director Says Sequel Doesn't Need Any Prior MCU Knowledge", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-28T16:44:00+00:00", "description": "<p>There have been plenty of church scandals over the decades, but this might be the very first one that involves Candy Crush. Via <a href=\"https://www.inquirer.com/crime/lawrence-kozak-priest-theft-st-thomas-more-pottstown-video-games-20240426.html\">The Philadelphia Inquirer</a>, Reverend Lawrence Kozak was arrested in Pottstown, Pennsylvania on April 25 and charged with stealing over $40,000 in funds from his former parish, St. Thomas More Church. According to the report, Kozak's vice of choice was mobile gaming, especially Candy Crush and Mario Kart.</p><p>The Archdiocese of Philadelphia removed Kozak from his parish in November 2022 after an internal investigation determined that he spent \"an astronomical amount of Apple transactions\" on the church's credit card. The charges span from September 2019 to July 2022. Kozak is also said to have used church funds to buy gifts for his goddaughter.</p><p>Kozak reportedly told investigators in 2022 that the money was used to \"power up\" and", "language": "en-US", "link": "https://www.gamespot.com/articles/priest-arrested-for-using-church-funds-on-candy-crush-and-other-mobile-games/1100-6523008/?ftag=CAD-01-10abi2f", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.gamespot.com/feeds/mashup", "source_obj__id": 126, "status_code": 0, "tags": [], "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1837/18375603/4294687-candycrush.jpg", "title": "Priest Arrested For Using Church Funds On Candy Crush And Other Mobile Games", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-28T16:40:00+00:00", "description": "<p>2024 is shaping up to be a big year for the live-action Sonic The Hedgehog franchise. The Knuckles miniseries premiered on Paramount+ earlier this week, and Sonic The Hedgehog 3 is coming to theaters during the Christmas season. However, that may be far from the end of the road for Sega's iconic characters. During an interview with <a href=\"https://www.gamesradar.com/sonic-spin-off-future-plans-toby-ascher/\">GamesRadar+</a>, Knuckles showrunner and executive producer Toby Ascher hinted at more Sonic spin-offs to come.</p><p>\"We have a really good plan for the future of Sonic,\" said Ascher. \"As we grow these characters, what television has provided us with Knuckles is a moment to do a deep-dive character study into them. As we find stories we're excited about, we're going to hopefully continue to do this again.\"</p><p>GamesRadar+ speculates that Shadow the Hedgehog may be the character next in line for a show. And Shadow is the logical pick. His live-action debut already happened in", "language": "en-US", "link": "https://www.gamespot.com/articles/knuckles-showrunner-teases-more-sonic-the-hedgehog-tv-spin-offs/1100-6523006/?ftag=CAD-01-10abi2f", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.gamespot.com/feeds/mashup", "source_obj__id": 126, "status_code": 0, "tags": [], "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1837/18375603/4294681-knuckles.jpg", "title": "Knuckles Showrunner Teases More Sonic The Hedgehog TV Spin-Offs", "user": null, "vote": 0}]