[{"title": "Alone In The Dark Review - The Final Verdict", "link": "https://www.youtube.com/watch?v=ndZU2_NU-PE", "thumbnail": "https://i3.ytimg.com/vi/ndZU2_NU-PE/hqdefault.jpg", "date_published": "2024-03-19T14:00:42+00:00", "dead": false, "artist": null, "page_rating": 94, "comments": [], "language": null, "page_rating_visits": 0, "source_obj__id": 129, "page_rating_contents": 94, "vote": 0, "page_rating_votes": 0, "permanent": false, "age": null, "tags": [], "bookmarked": false, "user": null, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "description": "The Alone in the Dark franchise has missed the mark more than a few times with its releases over the years, and though its newest reboot attempt isn’t the disaster as some of its precursors has been, it’s not exactly an unequivocal win either. \n\nWith solid level design that constantly encourages exploration, an atmospheric setting, and rewarding, enjoyable puzzle design, the game does have its fair share of redeeming qualities, but it feels too rough around the edges in some ways and too underbaked in others to ever truly be able to live up to its very obvious potential. \n\nFans of the genre will find some things to enjoy here, but those who were hoping for a glorious return to form for a survival horror IP with such an immense legacy are probably going to be disappointed."}, {"title": "15 Unexpected Video Game Hits THAT CAME OUT OF NOWHERE", "link": "https://www.youtube.com/watch?v=6F8owq3qxAE", "thumbnail": "https://i3.ytimg.com/vi/6F8owq3qxAE/hqdefault.jpg", "date_published": "2024-03-19T11:00:07+00:00", "dead": false, "artist": null, "page_rating": 94, "comments": [], "language": null, "page_rating_visits": 0, "source_obj__id": 129, "page_rating_contents": 94, "vote": 0, "page_rating_votes": 0, "permanent": false, "age": null, "tags": [], "bookmarked": false, "user": null, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "description": "The games industry has been growing at a rapid pace, and we are seeing plenty of new games releasing left, right, and center in a very short span. With such a high influx of releases, it often happens that the lesser known titles crumble under the weight of the heavily anticipated IPs. \n\nBut every now and then, there comes a game that challenges this notion by turning out to be a surprise hit that no one really expected. We are talking about games like Helldivers 2, Hi-Fi Rush, and Palworld and many more. With this video, we will be counting down 15 such games that came out of nowhere but instantly caught the love and attention of hundreds of thousands of fans."}, {"title": "Outcast: A New Beginning Review - A Disappointment", "link": "https://www.youtube.com/watch?v=Qjw3iskf8kg", "thumbnail": "https://i2.ytimg.com/vi/Qjw3iskf8kg/hqdefault.jpg", "date_published": "2024-03-19T06:15:01+00:00", "dead": false, "artist": null, "page_rating": 94, "comments": [], "language": null, "page_rating_visits": 0, "source_obj__id": 129, "page_rating_contents": 94, "vote": 0, "page_rating_votes": 0, "permanent": false, "age": null, "tags": [], "bookmarked": false, "user": null, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "description": "Outcast – A New Beginning is a follow-up to what is widely considered to be one of the first fully-3D open world games to have ever been released, the original Outcast back in 1999. As a modern video game release, Outcast – A New Beginning boasts an impressive new jetpack that hopes to give new life to the act of exploration in a massive open world.\n\nWhile the combat and traversal in Outcast – A New Beginning can be a lot of fun, especially thanks to the unique approach to weapon customization and the jetpack, the game is filled with archaic design decisions that can be frustrating. Even the story feels incredibly badly done, despite having some characters that ooze charm and sincerity."}]