[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T17:00:49+00:00",
        "description": "Indiana Jones and the Great Circle releases on December 9th, signalling the latest and greatest Xbox exclusive from MachineGames and Bethesda. With an emphasis on exploration and archeological adventuring, The Great Circle bears more than a couple similarities to the lauded Uncharted series. \n\nPerhaps most obvious is the everyman main characters between the two games. Nathan Drake is inspired by Indy, so Uncharted fans will find a lot to enjoy regarding Troy Baker’s take on the classic hero. Indiana Jones and the Great Circle differentiates itself from the Uncharted series despite its obvious similarities. \n\nIt shares the adventure, exploration, and puzzle- solving elements of Uncharted, but with a stronger focus on stealth and slow-paced environmental interactions. One major departure from its Uncharted inspiration is the first-person camera perspective. \n\nWe’re excited to explore the many historical environments in this immersive first- person perspective. With the Vatican, Giza Py",
        "id": 1668550,
        "language": null,
        "link": "https://www.youtube.com/watch?v=mY4qvqMI_DM",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/mY4qvqMI_DM/hqdefault.jpg",
        "title": "Indiana Jones And The Great Circle Is An Excellent Mix of Chronicles of Riddick And Uncharted",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T13:30:22+00:00",
        "description": "Every year there are games which dominate the limelight, becoming pinnacle examples of must-play titles through exceptional marketing, high player counts, or just being novel experiences that resonate with many. \n\nOn the flipside, every year there are games which should gather a large share of the limelight, but for whatever reason fail to drum up an audience. This feature aims to shine a light on fifteen such titles, for maybe they didn’t review as well as they should, were overshadowed via releasing in a schedule packed full of larger titles, didn’t sell well, don’t have the marketing clout behind them, or have simply been overlooked because they didn’t catch on with a large enough player base. \n\nWhatever the reason, these underrated, underappreciated games deserve your attention.",
        "id": 1667661,
        "language": null,
        "link": "https://www.youtube.com/watch?v=UEOkrKAJeDg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UEOkrKAJeDg/hqdefault.jpg",
        "title": "15 Most Underrated Games of 2024 Everyone IGNORED",
        "vote": 0
    }
]