[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T22:34:35.730874+00:00",
        "description": "\"Generative AI is transforming software development by enabling natural language prompts to generate code, reducing the need for traditional programming skills,\" argues Analytics India magazine.\n\n\nTraditionally, coding was the bastion of the select few who had mastered mighty languages like C++, Python, or Java. The idea of programming seemed exclusively reserved for those fluent in syntax and logic. However, the narrative is now being challenged by natural language coding being implemented in AI tools like GitHub Copilot. Andrej Karpathy, senior director of AI at Tesla predicted this trend last year.... English is emerging as the universal coding language. \n\nNVIDIA CEO Jensen Huang believes that English is becoming a new programming language thanks to AI advancements. Speaking at the World Government Summit, Huang explained, \"It is our job to create computing technology such that nobody has to program and that the programming language is human\"... He calls this a \"miracle of AI,\" em",
        "id": 1669778,
        "language": null,
        "link": "https://developers.slashdot.org/story/24/12/08/2154224/thanks-to-ai-the-hottest-new-programming-language-is-english?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Thanks to AI, the Hottest New Programming Language is... English ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T21:28:38.532794+00:00",
        "description": "Peter Jackson is co-executive producer of a new animated Lord of the Rings prequel called The War of the Rohirrim. \"Set in an epic world 183 years before the events of The Lord of the Rings trilogy, the King of Rohan is forced into a last stand in ancient Hornburg after a sudden attack...\" explains The Hollywood Reporter. \n\nBut Variety writes that the movie \"fizzled\" in its overseas debut this weekend:\n\n\"Moana 2\" has notched $600 million in global ticket sales, standing as the sixth-biggest movie of the year after just two weeks of release. Disney's animated sequel, which was developed as a TV series before pivoting to theaters, has generated $300 million overseas and $300 million domestically... Among new offerings, the Warner Bros. anime fantasy film \"The Lord of the Rings: The War of the Rohirrim,\" faltered with $2 million from 3,410 screens in 31 territories... [The movie] opens in North America and an additional 42 offshore markets on Dec. 13. Top earning territories were Spain ",
        "id": 1669577,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/24/12/08/2033205/disney-beats-tolkein-anime-lord-of-the-rings-prequel-outpaced-by-moana-2?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Disney Beats Tolkein?  Anime 'Lord of the Rings' Prequel Outpaced by 'Moana 2'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T20:26:11.315514+00:00",
        "description": "An anonymous reader shared this report from Engadget:\n\n\nOn Saturday, a new image generator called Aurora became available for some Grok users, many of whom shared the tool's results on X touting their photorealism. [One user posted an image of Mickey Mouse fighting Luigi from Super Mario.] But as of Sunday afternoon, Aurora appears to be gone. While it briefly showed up as an option in Grok's model selection menu as \"Grok 2 + Aurora (beta),\" it's since been replaced with \"Grok 2 + Flux (beta).\" It looks like Aurora may have gone public before it was meant to. In a tweet replying to one user who shared images of Tesla's Cybertruck created with Aurora, Elon Musk said, \"This is our internal image generation system. Still in beta, but it will improve fast.\"\n \n\nWhen it was live, TechCrunch noted that Aurora \"appears to have few restrictions,\" generating images of public and copyrighted figures, while it \"seems to excel at photorealistic images, including images of landscapes and still lif",
        "id": 1669330,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/08/1944206/elon-musks-x-upgrades-grok-ai-chatbot-with-image-generating?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Elon Musk's X Upgrades Grok AI Chatbot with Image Generating",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T18:16:12.405263+00:00",
        "description": "This year Marvell's stock rose 95%, giving it a $100 billion market capitalization, according to the Wall Street Journal. \n\n\"The latest gains have even put Marvell's market cap ahead of much-beleaguered Intel, which still generates 10 times as much annual revenue.\"\n\n\nMarvell's recent trajectory suggests that the revenue gap will continue to narrow. The explosive growth of its data center business has finally reached a point where it can more fully offset weakness in the company's more legacy segments, which sell chips used in goods such as telecommunications gear, cable TV boxes and autos. Data center sales nearly doubled year over year to $1.1 billion in the just-ended quarter, and Marvell's projection for the current period indicates the company will end its fiscal year in January with the data center unit encompassing about 72% of its total revenue, up from 40% in the previous year. \n\nThe next year is looking bright as well. Marvell's latest deal with Amazon is a five-year \"multig",
        "id": 1668804,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/08/1753204/small-ai-chip-maker-marvell-is-now-more-valuable-than-intel?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Small AI Chip Maker Marvell is Now More Valuable Than Intel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T17:11:05.839523+00:00",
        "description": "The head of America's FCC \"has drafted plans to regulate the cybersecurity of telecommunications companies,\" reports the Washington Post, and the plans could include financial penalties phone network operators with insufficient security &mdash; \"the first time the agency has asserted such powers under federal wiretapping law.\"\n\n\nRosenworcel said the FCC's authority in this matter comes from Section 105 of the Communications Assistance for Law Enforcement Act [passed in 1994] &mdash; a single sentence that stipulates, without elaboration, that telecommunications carriers should ensure systems security \"in accordance with regulations prescribed by the Commission.\" As one of the measures, she is seeking to require network providers to submit an annual certification to the FCC that they are implementing a cybersecurity risk management plan. In addition to imposing fines, the FCC could coordinate with other agencies to pursue criminal penalties against carriers deemed too careless on cybe",
        "id": 1668514,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/08/0157212/americas-phone-networks-could-soon-face-financial---and-criminal---penalties-for-insecure-networks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's Phone Networks Could Soon Face Financial - and Criminal - Penalties for Insecure Networks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T16:06:07.506061+00:00",
        "description": "Not every tech \"advent calendar\" involves programming puzzles. Instead the geek tradition of programming-language advent calendars \"seems to have started way back in 2000,\" according to one history, \"when London-based programmer Mark Fowler launched a calendar highlighting a different Perl module each day.\" \nSo the tradition continues...\n\nNearly a quarter of a century later, there's still a Perl Advent Calendar, celebrating tips and tricks like \"a few special packages waiting under the tree that can give your web applications a little extra pep in their step.\"\nAnd of course there's a separate advent calendar for Raku programmers.\nSince 2009 web performance consultant (and former Yahoo and Facebook engineer) Stoyan Stefanov has been pulling together an annual Web Performance calendar with helpful blog posts. \nThere's also a JVM Advent calendar with daily helpful hints for Java programmers.\nAnother advent calendar promises daily posts about C#.\nThe HTMHell site &mdash; which bills itse",
        "id": 1668237,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/24/12/04/0143242/the-2024-advent-calendars-offering-programming-language-tips-space-photos-and-memories?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The 2024 'Advent Calendars' Offering Programming Language Tips, Space Photos, and Memories",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T11:45:54.638573+00:00",
        "description": "The Washington Post details a vision of home security \"pitched by Sauron, a Silicon Valley start-up boasting a waiting list of tech CEOs and venture capitalists.\"\n\nIn the future, your home will feel as safe from intruders as a state-of-the-art military base. Cameras and sensors surveil the perimeter, scanning bystanders' faces for potential threats. Drones from a \"deterrence pod\" scare off trespassers by projecting a searchlight over any suspicious movements. A virtual view of the home is rendered in 3D and updated in real time, just like a Tesla's digital display. And private security agents monitor alerts from a central hub.... By incorporating technology developed for autonomous vehicles, robotics and border security, Sauron has built a supercharged burglar alarm [argued Sauron co-founder Kevin Hartz, a tech entrepreneur and former partner at Peter Thiel's venture firm Founders Fund]... \n\n\nFor many tech elites, security is both a national priority and a growing concern in their pe",
        "id": 1667164,
        "language": null,
        "link": "https://slashdot.org/story/24/12/08/034238/drones-surveillance-and-facial-recognition-startup-named-sauron-pitches-military-style-home-security?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Drones, Surveillance, and Facial Recognition:  Startup Named 'Sauron' Pitches Military-Style Home Security",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T09:37:09.770664+00:00",
        "description": "China-linked spies may still be lurking in U.S. telecommunications networks &mdash; but the breach could be much, much wider. In fact, a \"couple dozen\" countries were hit by the attack, the Wall Street Journal reported this week, citing a top U.S. national security adviser. \"Chinese government hackers have compromised telecommunications infrastructure across the globe as part of a massive espionage campaign...\"\n\nSpeaking during a press briefing Wednesday, Anne Neuberger, President Biden's deputy national security adviser for cyber and emerging technology, said the so-called Salt Typhoon campaign is ongoing and that at least eight telecommunications firms in the U.S. had been breached... The Journal previously identified Verizon, AT&amp;T, T-Mobile and Lumen Technologies among the victims... [M]etadata grabs appeared to be \"regional\" in focus, and were likely a means to identify phone lines of valuable senior government officials, which the hackers then targeted to steal encrypted tex",
        "id": 1666732,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/08/0124213/dozens-of-countries-hit-in-chinese-telecom-hacking-campaign-top-us-official-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dozens of Countries Hit in Chinese Telecom Hacking Campaign, Top US Official Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T05:15:29.147632+00:00",
        "description": "\"OpenAI is partnering with defense tech company Anduril,\" wrote the Verge this week, noting that OpenAI \"used to describe its mission as saving the world.\"\n\nIt was Anduril founder Palmer Luckey who advocated for a \"warrior class\" and autonomous weapons during a talk at Pepperdine University, saying society's need people \"excited about enacting violence on others in pursuit of good aims.\" The Verge notes it's OpenAI's first partnership with a defense contractor \"and a significant reversal of its earlier stance towards the military.\"\n\n OpenAI's terms of service once banned \"military and warfare\" use of its technology, but it softened its position on military use earlier this year, changing its terms of service in January to remove the proscription.\n \n\nHours after the announcement, some OpenAI employees \"raised ethical concerns about the prospect of AI technology they helped develop being put to military use,\" reports the Washington Post. \"On an internal company discussion forum, employ",
        "id": 1666127,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/08/0022207/openai-partners-with-anduril-leaving-some-employees-concerned-over-militarization-of-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Partners with Anduril, Leaving Some Employees Concerned Over Militarization of AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T03:06:52.743262+00:00",
        "description": "\"In September 2024, U.S. scientists made key advances towards building a nuclear clock &mdash; a step beyond an atomic clock,\" according to ScienceAlert:\n\nIn contrast to the atomic clock, the transition measured by this new device happens in the nucleus, or core, of the atom (hence the name), which gives it an even higher frequency. Thorium-229, the atom used for this study, offers a nuclear transition that can be excited by ultraviolet light. The team working on the nuclear clock overcame the technological challenge of building a frequency comb that works at the relatively high frequency range of ultraviolet light. This was a big step forward because nuclear transitions usually only become visible at much higher frequencies &mdash; like those of gamma radiation. But we are not able to accurately measure transitions in the gamma range yet. \n\nThe thorium atom transition has a frequency roughly one million times higher than the caesium atom's. This means that, although it has been meas",
        "id": 1665862,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/08/0223243/from-atomic-to-nuclear-clocks---and-a-leap-in-timekeeping-accuracy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "From Atomic to Nuclear Clocks -  and a Leap in Timekeeping  Accuracy?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-08T00:53:31.132700+00:00",
        "description": "60-year-old Chinese virologist Shi Zhengli led the Wuhan Institute of Virology's group studying bat coronaviruses (prompting Science magazine to call her \"Bat Woman\"). In June of 2020 Scientific American described Zhengli as \"distressed because stories from the Internet and major media have repeated a tenuous suggestion that SARS-CoV-2 accidentally leaked from her lab &mdash; despite the fact that its genetic sequence does not match any her lab had previously studied.\" \n\nMore than four years later, Nature writes Friday that Zhengli \"reported that none of the viruses stored in her freezers are the most recent ancestors of the virus SARS-CoV-2,\" presenting data at a conference in Japan \"on dozens of new coronaviruses collected from bats in southern China.\"\n\nShi has consistently said that SARS-CoV-2 was never seen or studied in her lab. But some commentators have continued to ask whether one of the many bat coronaviruses her team collected in southern China over decades was closely rela",
        "id": 1665515,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/07/2124249/wuhan-lab-researcher-fully-sequences-genomes-of-coronavirus-samples-from-2004-to-2021-finds-no-close-relatives-to-sars-cov-2?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Wuhan Lab Researcher Fully Sequences Genomes of Coronavirus Samples From 2004 to 2021, Finds No Close Relatives to SARS-CoV-2",
        "vote": 0
    }
]