[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T17:30:05+00:00", "description": "Greedfall 2's early access issues are hampering the experience, like weapons suddenly disappearing amid combat, fast travel mysteriously disappearing, and a black screen that occurs when skipping through dialogue with the Spacebar. Once again, all of these can be fixed with time. It's the more deep-rooted issues with the visuals, combat, UI, and polish which will take longer to address.\n\nWhether fans are willing to give it that much time is unknown, especially when there are many other compelling RPGs to experience. Maybe it'll surprise me down the line and hone in on all those aspects that shine while ensuring its fundamentals are more polished and enjoyable. For now, GreedFall 2: The Dying World needs more time in the oven.", "id": 1230920, "language": null, "link": "https://www.youtube.com/watch?v=dbWgtGv_Ejw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/dbWgtGv_Ejw/hqdefault.jpg", "title": "Greedfall 2 Early Access Review - Needs More Time To Cook", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T17:30:01+00:00", "description": "The Legend of Zelda: Echoes of Wisdom's quibbles are bothersome, but they never feel disruptive, and they never detract from what the game is achieving elsewhere. While I would argue the combat’s weaknesses hold the game back from achieving the incredible highs that the last three titles have, everything else about the game is the series firing on all cylinders, taking a tried and tested, beloved format, and then tweaking it with a dash of new without getting rid of what it is players loved about the original formula to begin with. \n\nZelda fans old and new will find a lot to love with Echoes of Wisdom, which launched under a lot of scrutiny and expectations, but manages to live up to almost all of them. The future is bright for 2D Zelda - hopefully, though, the next one won’t take over a decade to come.", "id": 1230921, "language": null, "link": "https://www.youtube.com/watch?v=Du7cdiVVIa4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/Du7cdiVVIa4/hqdefault.jpg", "title": "The Legend of Zelda: Echoes of Wisdom Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T15:30:16+00:00", "description": "Shattered Space is Starfield’s first big expansion, coming hot a full year after its launch in 2023. The DLC releases on September 30th, but we can’t wait to see what additions it can add to Starfield’s base experience, and if it’s enough to change the game’s fortunes going forward. \n\nThe development team at Bethesda hasn’t been shy about their intent to right the wrongs inherent in Starfield. They specifically cite empty locations and aimless story as aspects that are vastly improved in Shattered Space. \n\nWhat is least expected is the shift in tone that Shattered Space exhibits. The DLC takes on a much darker, almost horror-infused style, emphasizing spider- like creatures that ambush the player from behind. It’ll be interesting to see what direction this mysterious fantastical story takes when we enter the game on September 30th .", "id": 1230462, "language": null, "link": "https://www.youtube.com/watch?v=maDpjVbWMts", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/maDpjVbWMts/hqdefault.jpg", "title": "A YEAR LATER, Can Shattered Space Change Starfield's Fortunes?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T13:30:29+00:00", "description": "The question, then, is this- when exactly is Metal Gear Solid Delta Snake Eater going to come out? What is perhaps an even bigger question for some, however, is why Konami hasn't revealed its release date (or even window) yet. \nClearly, the game is quite far along in development- we keep seeing it at regular intervals, and every time we do see it, it looks impressively pristine and polished. There were certainly some who assumed that at Tokyo Game Show, we would be getting more information on when the game will be coming out. At the very least, we'd be getting a release window, right?", "id": 1230066, "language": null, "link": "https://www.youtube.com/watch?v=qEY0xpjkK1g", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qEY0xpjkK1g/hqdefault.jpg", "title": "Metal Gear Solid Delta Snake Eater Is Looking STUNNING, But Where Is The RELEASE DATE?", "vote": 0}]