[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T23:16:26.152359+00:00", "description": "Long-time Slashdot reader dmitrygr writes: Debian Linux booted on a 4-bit intel microprocessor from 1971 &mdash; the first microprocessor in the world &mdash; the 4004. It is not fast, but it is a real Linux kernel with a Debian rootfs on a real board whose only CPU is a real intel 4004 from the 1970s. \n\nThere's a detailed blog post about the experiment. (Its title? \"Slowly booting full Linux on the intel 4004 for fun, art, and absolutely no profit.\") \n\nIn the post dmitrygr describes testing speed optimizations with an emulator where \"my initial goal was to get the boot time under a week...\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=How+I+Booted+Linux+On+an+Intel+4004+from+1971%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F09%2F28%2F2238229%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.", "id": 1231851, "language": null, "link": "https://linux.slashdot.org/story/24/09/28/2238229/how-i-booted-linux-on-an-intel-4004-from-1971?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "How I Booted Linux On an Intel 4004 from 1971", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T22:11:24.032955+00:00", "description": "Past studies have suggested a major ocean current could collapse, quickly changing temperatures and climate patterns, reports the Washington Post. \n\"But scientists disagree on whether the the Atlantic Meridional Overturning Circulation (AMOC) is already slowing, and questions remain as to whether a variety of proxy measurements actually indicate a slowdown\" &mdash; including a new analysis arguing that the current \"has remained remarkably stable.\"\nOne way to detect AMOC weakening is to monitor the strength of its components such as the Florida Current, which flows swiftly from the Gulf of Mexico into the North Atlantic. The current is a \"major contributor\" to the AMOC, the researchers write, and a slowdown of the current might indicate a slowdown of the AMOC. Scientists have been tracking its strength since the 1980s using a submarine cable that measures the volume of water it transports. \n\nIn the current study, researchers reconsider the data, correcting for a gradual shift in Earth'", "id": 1231720, "language": null, "link": "https://news.slashdot.org/story/24/09/28/0455257/despite-predictions-of-collapse-for-ocean-current-researchers-find-a-key-component-is-remarkably-stable?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Despite Predictions of Collapse for Ocean Current, Researchers Find a Key Component is 'Remarkably Stable'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T22:11:23.936825+00:00", "description": "\"After complaining that Gen Z grads are difficult to work with for the best part of two years, bosses are no longer all talk, no action &mdash; now they're rapidly firing young workers who aren't up to scratch just months after hiring them,\" writes Fortune. \n\n\"According to a new report, six in 10 employers say they have already sacked some of the Gen Z workers they hired fresh out of college earlier this year.\"\n\nIntelligent.com, a platform dedicated to helping young professionals navigate the future of work, surveyed nearly 1,000 U.S. leaders... After experiencing a raft of problems with young new hires, one in six bosses say they're hesitant to hire college grads again. Meanwhile, one in seven bosses have admitted that they may avoid hiring them altogether next year. Three-quarters of the companies surveyed said some or all of their recent graduate hires were unsatisfactory in some way... \n\nEmployers' gripe with young people today is their lack of motivation or initiative &mdash; 50%", "id": 1231719, "language": null, "link": "https://it.slashdot.org/story/24/09/28/2115224/gen-z-grads-are-being-fired-months-after-being-hired?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Gen Z Grads Are Being Fired Months After Being Hired", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T20:55:48.247983+00:00", "description": "How were the Pyramids built? NBC News reported on \"a possible answer\" after new evidence was published earlier this year in the journal Communications Earth &amp; Environment. \nThe theory? \"[A]n extinct branch of the Nile River once weaved through the landscape in a much wetter climate.\"\n\nDozens of Egyptian pyramids across a 40-mile-long range rimmed the waterway, the study says, including the best-known complex in Giza. The waterway allowed workers to transport stone and other materials to build the monuments, according to the study. Raised causeways stretched out horizontally, connecting the pyramids to river ports along the Nile's bank. \n\nDrought, in combination with seismic activity that tilted the landscape, most likely caused the river to dry up over time and ultimately fill with silt, removing most traces of it. \n\nThe research team based its conclusions on data from satellites that send radar waves to penetrate the Earth's surface and detect hidden features. It also relied on s", "id": 1231504, "language": null, "link": "https://build.slashdot.org/story/24/09/28/204238/did-canals-help-build-egypts-pyramids?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Did Canals Help Build Egypt's Pyramids?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T19:41:53.060253+00:00", "description": "Ars Technica reports NASA officials operating the International Space Station \"are seriously concerned about a small Russian part of the station\" &mdash; because it's leaking. \nThe \"PrK\" tunnel connecting a larger module to a docking port \"has been leaking since September 2019... In February of this year NASA identified an increase in the leak rate from less than 1 pound of atmosphere a day to 2.4 pounds a day, and in April this rate increased to 3.7 pounds a day.\"\n A new report, published Thursday by NASA's inspector general, provides details not previously released by the space agency that underline the severity of the problem... \n\nDespite years of investigation, neither Russian nor US officials have identified the underlying cause of the leak. \"Although the root cause of the leak remains unknown, both agencies have narrowed their focus to internal and external welds,\" the report, signed by Deputy Inspector General George A. Scott, states. The plan to mitigate the risk is to keep th", "id": 1231293, "language": null, "link": "https://science.slashdot.org/story/24/09/28/1850224/an-international-space-station-leak-is-getting-worse-nasa-confirms?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "An International Space Station Leak Is Getting Worse, NASA Confirms", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T18:30:02.262881+00:00", "description": "The world's oldest and largest cancer research association \"found excessive levels of alcohol consumption increase the risk for six different types of cancer,\" reports CBS News:\n\n\"Some of this is happening through chronic inflammation. We also know that alcohol changes the microbiome, so those are the bacteria that live in your gut, and that can also increase the risk,\" Dr. C&eacute;line Gounder, CBS News medical contributor and editor-at-large for public health at KFF Health News, recently said on \"CBS Mornings.\" \n\nBut how much is too much when it comes to drinking? We asked experts what to know. \"Excessive levels of alcohol\" equates to about three or more drinks per day for women and four or more drinks per day for men, Gounder said... Other studies have shown, however, there is no \"safe amount\" of alcohol, Gounder said, particularly if you have underlying medical conditions. \"If you don't drink, don't start drinking. If you do drink, really try to keep it within moderation,\" she sa", "id": 1231072, "language": null, "link": "https://science.slashdot.org/story/24/09/28/1735259/alcohol-can-increase-your-cancer-risk-researchers-find?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Alcohol Can Increase Your Cancer Risk, Researchers Find", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T17:24:20.506659+00:00", "description": "Slashdot reader Hmmmmmm shared this report from NBC News:\n\n\nOctopuses don't always hunt alone &mdash; but their partners aren't who you'd expect. A new study shows that some members of the species Octopus cyanea maraud around the seafloor in hunting groups with fish, which sometimes include several fish species at once. \nThe research, published in the journal Nature on Monday, even suggests that the famously intelligent animals organized the hunting groups' decisions, including what they should prey upon. What's more, the researchers witnessed the cephalopod species &mdash; often called the big blue or day octopus &mdash; punching companion fish, apparently to keep them on task and contributing to the collective effort... \"If the group is very still and everyone is around the octopus, it starts punching, but if the group is moving along the habitat, this means that they're looking for prey, so the octopus is happy. It doesn't punch anyone...\" [said Eduardo Sampaio, a postdoctoral rese", "id": 1230868, "language": null, "link": "https://science.slashdot.org/story/24/09/28/0550239/octopuses-recorded-hunting-with-fish---and-punching-those-that-dont-cooperate?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Octopuses Recorded Hunting With Fish - and Punching Those That Don't Cooperate", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T16:19:51.550230+00:00", "description": "Researchers propose a \"deceptively simple\" way to sequester carbon, reports the Washington Post: burying wood underground:\n\nForests are Earth's lungs, sucking up six times more carbon dioxide (CO2) than the amount people pump into the atmosphere every year by burning coal and other fossil fuels. But much of that carbon quickly makes its way back into the air once insects, fungi and bacteria chew through leaves and other plant material. Even wood, the hardiest part of a tree, will succumb within a few decades to these decomposers. What if that decay could be delayed? Under the right conditions, tons of wood could be buried underground in wood vaults, locking in a portion of human-generated CO2 for potentially thousands of years. \n\nWhile other carbon-capture technologies rely on expensive and energy-intensive machines to extract CO2, the tools for putting wood underground are simple: a tractor and a backhoe. \n\nFinding the right conditions to impede decomposition over millennia is the to", "id": 1230620, "language": null, "link": "https://news.slashdot.org/story/24/09/28/0418244/a-cheap-low-tech-solution-for-storing-carbon-researchers-suggest-burying-wood?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "A Cheap, Low-Tech Solution For Storing Carbon?  Researchers Suggest Burying Wood", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T15:14:13.797445+00:00", "description": "When it comes to professional certifications, the long-running nonprofit Linux Professional Institute boasts they've issued 250,000, making them the world's largest Linux/Open Source certification body. And last week they announced a \"strategic alliance\" with the Open Source Initiative (OSI), which will now be \"participating in development and maintenance of these programs.\" \n\nThe announcement points out that the Open Source Initiative already has many distinct responsibilities. Besides creating the Open Source Definition &mdash; and certifying that Open Source licenses meet the requirements of Open Source software &mdash; the OSI's mission is to \"encourage the growth of Open Source communities around the world,\" which includes \"educational and outreach efforts to spread Open Source principles.\" \n\nSo the ultimate goal is \"strengthening Linux and Open Source communities,\" according to the announcement, by \"nurturing the growth of more highly skilled professionals,\" with the OSI encoura", "id": 1230385, "language": null, "link": "https://news.slashdot.org/story/24/09/28/038242/open-source-initiative-announces-alliance-with-nonprofit-certifications-group?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Open Source Initiative Announces Alliance with Nonprofit Certifications Group", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T14:09:17.215518+00:00", "description": "An anonymous reader quotes a report from Reuters: A federal judge in California has ordered the U.S. Environmental Protection Agency to strengthen regulations for fluoride in drinking water, saying the compound poses an unreasonable potential risk to children at levels that are currently typical nationwide. U.S. District Judge Edward Chen in San Francisco on Tuesday sided (PDF) with several advocacy groups, finding the current practice of adding fluoride to drinking water supplies to fight cavities presented unreasonable risks for children's developing brains.\n \nChen said the advocacy groups had established during a non-jury trial that fluoride posed an unreasonable risk of harm sufficient to require a regulatory response by the EPA under the Toxic Substances Control Act. \"The scientific literature in the record provides a high level of certainty that a hazard is present; fluoride is associated with reduced IQ,\" wrote Chen, an appointee of Democratic former President Barack Obama. But", "id": 1230185, "language": null, "link": "https://news.slashdot.org/story/24/09/28/0114227/epa-must-address-fluoridated-waters-risk-to-childrens-iqs-us-judge-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "EPA Must Address Fluoridated Water's Risk To Children's IQs, US Judge Rules", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T10:53:55.191628+00:00", "description": "Black hole jets, which spew near-light-speed particle beams, can trigger nearby white dwarf stars to explode by igniting hydrogen layers on their surfaces. \"We don't know what's going on, but it's just a very exciting finding,\" said Alec Lessing, an astrophysicist at Stanford University and lead author of a new study describing the phenomenon, in an ESA release. Gizmodo reports: In the recent work -- set to publish in The Astrophysical Journal and is currently hosted on the preprint server arXiv -- the team studied 135 novae in the galaxy M87, which hosts a supermassive black hole of the same name at its core. M87 is 6.5 billion times the mass of the Sun and was the first black hole to be directly imaged, in work done in 2019 by the Event Horizon Telescope Collaboration. The team found twice as many novae erupting near M87's 3,000 light-year-long plasma jet than elsewhere in the galaxy. The Hubble Space Telescope also directly imaged M87's jet, which you can see below in luminous blue", "id": 1229431, "language": null, "link": "https://science.slashdot.org/story/24/09/28/016242/jets-from-black-holes-cause-stars-to-explode-hubble-reveals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Jets From Black Holes Cause Stars To Explode, Hubble Reveals", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T07:39:24.190125+00:00", "description": "Longtime Slashdot reader penciling_in shares a report from CircleID: Starlink, SpaceX's satellite-based internet service, has hit a major milestone by surpassing 4 million subscribers worldwide. SpaceX confirmed the news on Thursday after company President Gwynne Shotwell hinted earlier in the week that the service would reach the mark within days. Since its beta launch in October 2020, Starlink has rapidly scaled, growing from 1 million subscribers by December 2022, to 2 million by September 2023, and now 4 million just months later. The service operates through a vast constellation of nearly 6,000 satellites, providing satellite internet to users in almost 100 countries, including expanding into previously underserved regions like Africa and the Pacific islands. [While competition from OneWeb and Amazon's Project Kuiper looms, Starlink remains the market leader. However, challenges like slowing U.S. growth and concerns over satellite interference with radio astronomy persist.] Starl", "id": 1228833, "language": null, "link": "https://tech.slashdot.org/story/24/09/28/0054257/starlink-surpasses-4-million-subscribers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Starlink Surpasses 4 Million Subscribers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T04:23:39.882061+00:00", "description": "An anonymous reader quotes a report from TorrentFreak: The Dutch Supreme Court has requested guidance from the EU's top court on geo-blocking, VPNs, and copyright in a case involving the online publication of Anne Frank's manuscripts. The CJEU's response has the potential to reshape the online content distribution landscape, impacting streaming platforms and other services that rely on geo-blocking. VPNs services will monitor the matter with great interest too. [...] While early versions are presumably in the public domain in several countries, the original manuscripts are protected by copyright in the Netherlands until 2037. As a result, the copies published by the Dutch Anne Frank Stichting, are blocked for Dutch visitors. \"The scholarly edition of the Anne Frank manuscripts cannot be made available in all countries, due to copyright considerations,\" is the message disallowed visitors get to see.\n \nThis blocking effort is the result of a copyright battle. Ideally, Anne Frank Stichti", "id": 1228445, "language": null, "link": "https://yro.slashdot.org/story/24/09/27/2310247/anne-frank-copyright-dispute-triggers-vpn-geoblocking-questions-at-eus-highest-court?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'Anne Frank' Copyright Dispute Triggers VPN, Geoblocking Questions At EU's Highest Court", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T03:18:21.543620+00:00", "description": "A U.S. Trademark Office tribunal canceled Marvel and DC's jointly owned \"Super Hero\" trademarks after the companies failed to respond to a request by London-based Superbabies Ltd, which argued the marks couldn't be owned collectively or monopolize the superhero genre. The ruling was \"not just a win for our client but a victory for creativity and innovation,\" said Superbabies attorney Adam Adler of Reichman Jorgensen Lehman &amp; Feldberg. \"By establishing SUPER HEROES' place in the public domain, we safeguard it as a symbol of heroism available to all storytellers.\"\nReuters reports: Rivals Marvel and DC jointly own four federal trademarks covering the terms \"Super Hero\" and \"Super Heroes,\" the oldest of which dates back to 1967. Richold writes comics featuring a team of super-hero babies called the Super Babies. According to Richold, DC accused his company of infringing the \"Super Hero\" marks and threatened legal action after Superbabies Ltd applied for U.S. trademarks covering the \"S", "id": 1228305, "language": null, "link": "https://yro.slashdot.org/story/24/09/27/233217/us-trademark-office-cancels-marvel-dcs-super-hero-trademarks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Trademark Office Cancels Marvel, DC's 'Super Hero' Trademarks", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T02:13:37.503351+00:00", "description": "The Register's Tobias Mann reports: Oracle could choose to take control of Ampere Computing, the Arm processor designer it has backed and uses in its cloud. A proxy statement [PDF] filed on Wednesday reveals that Oracle held 29 percent stake in Ampere as of May 31, 2024, and has the option to gain majority control over the chip house in 2027. \"The total carrying value of our investments in Ampere, after accounting for losses under the equity method of accounting, was $1.5 billion as of May 31, 2024,\" the filing reads. Oracle also revealed it extended $600 million in loans in the form of convertible debt to Ampere during its 2024 fiscal year, on top of $400 million in debt given during the prior fiscal year. Ampere's debts are set to mature beginning June 2026, when Oracle will have the option of converting those investments into additional equity in the chip startup. \"If either of such options is exercised by us or our co-investors, we would obtain control of Ampere and consolidate it", "id": 1228175, "language": null, "link": "https://developers.slashdot.org/story/24/09/27/2257245/oracle-owns-nearly-a-third-of-arm-chip-house-ampere-could-take-control-in-2027?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Oracle Owns Nearly a Third of Arm Chip House Ampere, Could Take Control In 2027", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T01:09:04.675577+00:00", "description": "An anonymous reader quotes a report from 404 Media: Jack Ryan from San Diego was recently being interviewed for a job. On a video call, the interviewer, a woman with red hair, said, \"I find it helps when candidates tell me a story in answering the questions.\" \"I'm looking for examples from your work experience,\" the woman added. During the conversation, Ryan had a smirk on his face. That's because the woman is not real. She is an AI avatar from a company called Fairgo.ai, which uses AI agents to interview job candidates on behalf of other companies.\n \nOn its website, Fairgo says its AI agent \"talks to candidates any time, any where.\" The company claims that it can \"Ensure every candidate is evaluated on a level playing field with consistent and unbiased interview practices.\" Julian Bright, founder and CEO of Fairgo, told 404 Media in an email that after an introductory video voiced by the AI avatar, candidate interviews are done by an audio-only AI. \"At no point is any of the video or", "id": 1228086, "language": null, "link": "https://slashdot.org/story/24/09/27/2232220/ai-avatars-are-doing-job-interviews-now?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Avatars Are Doing Job Interviews Now", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T01:09:04.593064+00:00", "description": "At its Connect event earlier this week, Meta said it'll be adding conversational voices to its AI chatbot from celebrities like Awkwafina, John Cena, Dame Judi Dench, Keegan-Michael Key and Kristen Bell. The Verge reports: These celebrity voices will only be available to US users of Meta's apps to start. And if you prefer a voice that is a little more mundane, you can also pick from non-celeb voices with names like \"Aspen,\" \"Atlas,\" or \"Clover.\" [...] Meta is explicitly announcing celebrity partnerships, which likely involve payment or some other deal. Meta hasn't shared those details, but the company has paid each celebrity \"millions of dollars\" for their voices, according to The Wall Street Journal. And in negotiations, some of the people reportedly wanted to limit what their voices could say and to make sure they weren't liable if Meta AI was used. [...]\n \nMeta's AI updates aren't just about voice conversations. Its chatbot will also now \"answer questions about your photos\" when yo", "id": 1228085, "language": null, "link": "https://meta.slashdot.org/story/24/09/27/2254211/metas-ai-can-now-talk-to-you-in-the-voices-of-awkwafina-john-cena-and-judi-dench?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta's AI Can Now Talk To You In the Voices of Awkwafina, John Cena, and Judi Dench", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-28T00:04:42.514540+00:00", "description": "Meta has been fined $101.5 million by the Irish Data Protection Commission (DPC) for storing over half a billion user passwords in plain text for years, with some engineers having access to this data for over a decade. The issue, discovered in 2019, predominantly affected non-US users, especially those using Facebook Lite. AppleInsider reports: Meta Ireland was found guilty of infringing four parts of GDPR, including how it \"failed to notify the DPC of a personal data breach concerning storage of user passwords in plain text.\" Meta Ireland did report the failure, but only some months after it was discovered. \"It is widely accepted that user passwords should not be stored in plaintext, considering the risks of abuse that arise from persons accessing such data,\" said Graham Doyle, Deputy Commissioner at the DPC, in a statement about the fine. \"It must be borne in mind, that the passwords the subject of consideration in this case, are particularly sensitive, as they would enable access t", "id": 1227869, "language": null, "link": "https://yro.slashdot.org/story/24/09/27/2226229/meta-fined-102-million-for-storing-600-million-passwords-in-plain-text?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Fined $102 Million For Storing 600 Million Passwords In Plain Text", "vote": 0}]