[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T18:02:52+00:00", "description": "The Current’s Emerging Artists Showcase brings together musicians from communities across our region to showcase and develop the next generation of songwriters and performers. The 2024 event was held Saturday, Jan. 20, at the Duluth Masonic Temple.\n\nOn the bill was folk musician Nolen Sellwood. Currently a student at the University of Minnesota, Duluth, Sellwood is a young artist with an old soul. His beautifully crafted singing and songwriting skills are captured on his debut album, Otherwise, with a second studio album, Cadence to the Flame, coming soon. Playing alongside him as a trio are his middle school and now college friends, Sam Hovda and Owen Reinert Nash. With a deep inspiration to earlier British artists such as Nick Drake and John Martyn, Sellwood has strong musical aspirations. “I just want to make more of a bigger impact into making folk more widely accepted, especially for the younger generation,” he says. “It’s so sensitive, it’s so raw, and it exposes you a lot … It’", "language": null, "link": "https://www.youtube.com/watch?v=8CYqoiPJmTo", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "source_obj__id": 335, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/8CYqoiPJmTo/hqdefault.jpg", "title": "Emerging Artist Series Duluth: Nolen Sellwood (full performance)", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T17:10:46+00:00", "description": "The hotly anticipated London singer-songwriter Lola Young performed for a sold-out Minneapolis crowd on Wednesday, March 27. (She visited The Current for an interview earlier in the day.) The audience was singing “Conceited” as she came out. The show was in support of Young’s debut album, My Mind Wanders and Sometimes Leaves Completely, as well as the new single “Intrusive Thoughts.” North Carolina singer chlothegod opened up with a charismatic performance.\n\nVideo by Bump Opera", "language": null, "link": "https://www.youtube.com/watch?v=X8pzin3Fr8U", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "source_obj__id": 335, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/X8pzin3Fr8U/hqdefault.jpg", "title": "Lola Young at 7th St. Entry ✨❣️ @LolaYounggg #lolayoung #chlothegod #livemusic #minneapolis #music", "user": null, "vote": 0}]