[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T20:00:16+00:00", "description": "The mobile game industry has been growing at a rapid pace as of late, and the last few years have been really generous with the release of some great games of this ilk coming out left, right, and center on the platform. \n\nThere's no shortage of games that have showcased the true potential that the platform holds. With this video, we will be taking a look at Project: The Outcast - an upcoming action adventure game based on Hitori No Shita which is a popular Donghua. \n\nIt impresses with its fast and frenetic combat and great attention to visual detail. We will be discussing what makes this game tick and why it could be a really important game for the mobile gaming scene.", "language": null, "link": "https://www.youtube.com/watch?v=U4qglSsJBcU", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/U4qglSsJBcU/hqdefault.jpg", "title": "This Martial Arts Action Game Looks INSANELY Good", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T16:00:36+00:00", "description": "Senua's Saga: Hellblade 2 is the next big game for Microsoft, a company which has struggled with exclusives, and one of its more anticipated. As the follow-up to the acclaimed Hellblade: Senua's Sacrifice, it sports much more fidelity, fully motion-captured combat and some incredible facial animation.\n\nDespite how impressive it's looked over the past several years of gameplay showings, the sequel - and the Xbox Series X/S - has attracted some flak. Hellblade 2 runs at a locked 30 FPS on both Xbox Series X and S, with no options for a 60 FPS Performance Mode. If you want anything higher than 30 FPS, you have to play on PC.\n\nThough noted to have been done for \"cinematic\" purposes, this decision has once again raised the question of current-gen games running at such a frame rate. Is it really that important? Find out here.", "language": null, "link": "https://www.youtube.com/watch?v=drbi40YYMoM", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/drbi40YYMoM/hqdefault.jpg", "title": "Is Hellblade 2's 30 FPS Lock On Xbox A DEALBREAKER?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T11:00:47+00:00", "description": "Nothing guarantees a longer shelf life than its fanbase being split on whether or not they even like it. Games that tend to divide opinion and provoke strong reactions from fans one way or another tend to live long in the memory, with discussions about their merits (or the lack thereof) showing signs of life even years after the games themselves have come out. \n\nOver the years, there has been no shortage of such games, and here, that’s what we’re turning our attention to. Join us as we take a look at a number of single-player titles that are notable for their divisiveness- people are going to either love these games or hate them, but chances are they will have a strong reaction one way or another.", "language": null, "link": "https://www.youtube.com/watch?v=sB-L7WM1xow", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/sB-L7WM1xow/hqdefault.jpg", "title": "15 MOST DIVISIVE Single Player Games", "user": null, "vote": 0}]