[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T23:17:48.612854+00:00", "description": "Jon Brodkin reports via Ars Technica: California can keep enforcing its state net neutrality law after the Federal Communications Commission implements its own rules. The FCC could preempt future state laws if they go far beyond the national standard but said that states can \"experiment\" with different regulations for interconnection payments and zero-rating. The FCC scheduled an April 25 vote on Chairwoman Jessica Rosenworcel's proposal to restore net neutrality rules similar to the ones introduced during the Obama era and repealed under former President Trump. The FCC yesterday released the text of the pending order, which could still be changed but isn't likely to get any major overhaul.\n \nState-level enforcement of net neutrality rules can benefit consumers, the FCC said. The order said that \"state enforcement generally supports our regulatory efforts by dedicating additional resources to monitoring and enforcement, especially at the local level, and thereby ensuring greater compl", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/05/2146233/fcc-wont-block-california-net-neutrality-law-says-states-can-experiment?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FCC Won't Block California Net Neutrality Law, Says States Can 'Experiment'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T22:12:38.089980+00:00", "description": "Matthew Connatser reports via The Register: A study has concluded that Apple's privacy practices aren't particularly effective, because default apps on the iPhone and Mac have limited privacy settings and confusing configuration options. The research was conducted by Amel Bourdoucen and Janne Lindqvist of Aalto University in Finland. The pair noted that while many studies had examined privacy issues with third-party apps for Apple devices, very little literature investigates the issue in first-party apps -- like Safari and Siri. The aims of the study [PDF] were to investigate how much data Apple's own apps collect and where it's sent, and to see if users could figure out how to navigate the landscape of Apple's privacy settings.\n \nThe lengths to which Apple goes to secure its ecosystem -- as described in its Platform Security Guide [PDF] -- has earned it kudos from the information security world. Cupertino uses its hard-earned reputation as a selling point and as a bludgeon against Go", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/05/2014205/academics-probe-apples-privacy-settings-and-get-lost-and-confused?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Academics Probe Apple's Privacy Settings and Get Lost and Confused", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T22:12:36.561583+00:00", "description": "Apple is laying off more than 700 employees across the company, including its Micro-LED displays division and the recently shut down Apple Car project. 9to5Mac reports: As seen by 9to5Mac in the latest WARN report provided by the California Employment Development Department, the layoffs affect projects that have been in the news recently. For instance, Apple is laying off 58 employees from one of its offices in Santa Clara. This particular office belonged to LuxVue Technology, a company specializing in Micro-LED displays that Apple acquired in 2014. In recent months, we've heard rumors about Apple canceling its plans to design and produce its own Micro-LED displays for the Apple Watch. Bloomberg recently reported that Apple gave up on the project because the screens \"were difficult to produce in sufficient quantities.\"\n \nThere are also more than 120 layoff notices filed by Apple in San Diego, which aligns with a January report about the company having recently closed a Siri data opera", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/05/2046237/apple-lays-off-more-than-700-workers-including-apple-car-and-microled-teams?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Lays Off More Than 700 Workers, Including Apple Car and MicroLED Teams", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T21:08:13.193604+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Will Google ever launch its \"Find My\" network? The Android ecosystem was supposed to have its own version of Apple's AirTags by now. Google has had a crowd-sourced device-tracking network sitting dormant on 3 billion Android phones since December 2022. Partners have been ready to go with Bluetooth tag hardware since May 2023! This was all supposed to launch a year ago, but Google has been in a holding pattern. The good news is we're finally seeing some progress after a year of silence. The reason for Google's lengthy delay is actually Apple. A week before Google's partners announced their Android network Bluetooth tags, Google and Apple jointly announced a standard to detect \"unknown\" Bluetooth trackers and show users alerts if their phone thinks they're being stalked. Since you can constantly see an AirTag's location, they can be used for stalking by just covertly slipping one into a bag or car; nobody wants that, so everyone's f", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/05/203245/androids-airtag-competitor-gears-up-for-launch-thanks-to-ios-release?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Android's AirTag Competitor Gears Up For Launch, Thanks To iOS Release", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T21:08:11.688075+00:00", "description": "Terraform Labs and its founder Do Kwon have been found liable on civil fraud charges on Friday by a jury in Manhattan. The jury agreed with the SEC that the two misled investors before their stablecoin's 2022 collapse shocked crypto markets around the world. Reuters reports: The SEC accused the company and Kwon of misleading investors in 2021 about the stability of TerraUSD, a stablecoin designed to maintain a value of $1. The regulator also accused them of falsely claiming Terraform's blockchain was used in a popular Korean mobile payment app. SEC attorney Laura Meehan said during closing arguments that the platform's success story was \"built on lies.\" \"If you swing big and you miss, and you don't tell people that you came up short, that is fraud,\" Meehan said.\n \nLouis Pellegrino, an attorney for Terraform, told the jury on Friday the SEC's case relied on statements taken out of context and that Terraform and Kwon had been truthful about their products and how they worked, even when ", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/05/209232/terraform-labs-and-founder-do-kwon-found-liable-in-us-civil-fraud-trial?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Terraform Labs and Founder Do Kwon Found Liable In US Civil Fraud Trial", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T20:02:21.556738+00:00", "description": "An anonymous reader shares a report: Best Buy is conducting mass layoffs of Geek Squad employees this week, according to former employees who lost their jobs. Workers told 404 Media they were told by the company to stay at home Tuesday and to wait for a call from their bosses about whether they had been let go. Best Buy did not respond to a request for comment, so we don't know how many people lost their jobs. But a laid-off worker we talked to said \"it's definitely company wide and bigger than the cuts last summer.\" \n\n[...] The r/GeekSquad subreddit, an unofficial community for Geek Squad workers, is full of posts about the layoffs, with many users posting photos of their Geek Squad badges and noting that they are agents \"going sleeper,\" a Sleeper Cell reference meaning they've been laid off.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Best+Buy+Geek+Squad+Agents+'Going+Sleeper'+After+Mass+Layoffs%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24", "language": "en-us", "link": "https://slashdot.org/story/24/04/05/190225/best-buy-geek-squad-agents-going-sleeper-after-mass-layoffs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Best Buy Geek Squad Agents 'Going Sleeper' After Mass Layoffs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T18:57:37.911240+00:00", "description": "Meta is updating its AI-generated content policy and will add a \"Made with AI\" label beginning next month, the company announced. The policy will apply to content on Instagram, Facebook, and Threads. From a report: Acknowledging that its current policy is \"too narrow,\" Meta says it will start labeling more video, audio, and image content as being AI-generated. Labels will be applied either when users disclose the use of AI tools or when Meta detects \"industry standard AI image indicators,\" though the company didn't provide more detail about its detection system. \n\nThe changes are informed by recommendations and feedback from Meta's Oversight Board and update the manipulated media policy created in 2020. The old policy prohibits videos created or edited using AI tools that make a person say something they didn't but doesn't cover the wide range of AI-generated content that has recently flooded the web. \"In the last four years, and particularly in the last year, people have developed ot", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/05/187205/meta-will-require-labels-on-more-ai-generated-content?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Will Require Labels on More AI-Generated Content", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T18:57:36.395548+00:00", "description": "AMD plans to document and open source its Micro Engine Scheduler (MES) firmware for GPUs, giving users more control over Radeon graphics cards. From a report: It's part of a larger effort AMD confirmed earlier this week about making its GPUs more open source at both a software level in respect to the ROCm stack for GPU programming and a hardware level. Details were scarce with this initial announcement, and the only concrete thing it introduced was a GitHub tracker. \n\nHowever, yesterday AMD divulged more details, specifying that one of the things it would be making open source was the MES firmware for Radeon GPUs. AMD says it will be publishing documentation for MES around the end of May, and will then release the source code some time afterward. For one George Hotz and his startup, Tiny Corp, this is great news. Throughout March, Hotz had agitated for AMD to make MES open source in order to fix issues he was experiencing with his RX 7900 XTX-powered AI server box. He had talked sever", "language": "en-us", "link": "https://slashdot.org/story/24/04/05/1847248/amd-to-open-source-micro-engine-scheduler-firmware-for-radeon-gpus?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AMD To Open Source Micro Engine Scheduler Firmware For Radeon GPUs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T17:52:50.826344+00:00", "description": "An Ethiopian bank has put up posters shaming customers it says have not returned money they gained during a technical glitch. From a report: Notices bearing their names and photos could be seen outside branches of the Commercial Bank of Ethiopia (CBE) on Friday. The bank says it has recovered almost three-quarters of the $14m it lost, its head said last week. He warned that those keeping money that is not theirs will be prosecuted. Last month, an hours-long glitch allowed customers at the CBE, Ethiopia's largest commercial bank, to withdraw or transfer more than they had in their accounts.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Commercial+Bank+of+Ethiopia+Names+and+Shames+Customers+Over+Bank+Glitch+Money%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F04%2F05%2F1630247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/share", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/05/1630247/commercial-bank-of-ethiopia-names-and-shames-customers-over-bank-glitch-money?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Commercial Bank of Ethiopia Names and Shames Customers Over Bank Glitch Money", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T17:52:49.155405+00:00", "description": "An anonymous reader shares a report: Streaming was supposed to kill physical media, and has come very close. The DVD and Blu-ray market fell from $4.7bn in revenue in 2017 to barely $1.5bn in 2022. In September, Netflix ended its movie-by-mail service. Best Buy has removed physical media from its brick-and-mortar stores, and Target and Walmart may follow. Some new films may never be released physically at all. Yet a counterrevolution has been gathering. Some film fans never gave up physical media: they've spent years quietly buying thrift-store discs, discarded by the many US households that no longer have DVD or Blu-ray players, and waiting for their chance to rise again. Other fans, frustrated by streaming's limitations, have recently rediscovered physical media and trickled to join its rear-guard army. \n\nPhysical media will never regain its heights, but it may live to fight a little longer -- supported by loyalists and by a cottage industry of independent and boutique film distribu", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/05/1648258/cinephiles-rallying-to-physical-media?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cinephiles Rallying To Physical Media", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T16:47:52.640045+00:00", "description": "AI will lead to many companies employing fewer people in the next five years, staffing provider Adecco Group said on Friday, in a new survey highlighting the upheaval AI will bring to the workplace. From a report: Some 41% of senior executives expect to have smaller workforces because of AI technology, Adecco said in a report based on a survey of executives at 2,000 large companies worldwide. Generative AI, which can create text, photos and videos in response to open-ended prompts, has spurred both hope it could eliminate repetitive tasks and fear it will make some jobs obsolete. [...] The Adecco survey is one of the largest into the AI topic, and follows a 2023 World Economic Forum study which said 25% of companies expected AI to trigger job losses, while 50% expected the technology to create new roles.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Seen+Cutting+Worker+Numbers%2C+Survey+By+Staffing+Company+Shows%3A+https%3A%2F%2Fslashdot.", "language": "en-us", "link": "https://slashdot.org/story/24/04/05/162234/ai-seen-cutting-worker-numbers-survey-by-staffing-company-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Seen Cutting Worker Numbers, Survey By Staffing Company Shows", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T15:42:40.165693+00:00", "description": "China will attempt to disrupt elections in the US, South Korea and India this year with artificial intelligence-generated content after making a dry run with the presidential poll in Taiwan, Microsoft has warned. From a report: The US tech firm said it expected Chinese state-backed cyber groups to target high-profile elections in 2024, with North Korea also involved, according to a report by the company's threat intelligence team published on Friday. \"As populations in India, South Korea and the United States head to the polls, we are likely to see Chinese cyber and influence actors, and to some extent North Korean cyber actors, work toward targeting these elections,\" the report reads. \n\nMicrosoft said that \"at a minimum\" China will create and distribute through social media AI-generated content that \"benefits their positions in these high-profile elections.\" The company added that the impact of AI-made content was minor but warned that could change. \"While the impact of such content ", "language": "en-us", "link": "https://politics.slashdot.org/story/24/04/05/1442233/china-will-use-ai-to-disrupt-elections-in-the-us-south-korea-and-india-microsoft-warns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China Will Use AI To Disrupt Elections in the US, South Korea and India, Microsoft Warns", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T15:42:38.645032+00:00", "description": "The UK government has admitted its negotiating power over billions of pounds of cloud infrastructure spending has been inhibited by vendor lock-in. From a report: A document from the Cabinet Office's Central Digital &amp; Data Office, circulated within Whitehall, seen by The Register, says the \"UK government's current approach to cloud adoption and management across its departments faces several challenges\" which combined result \"in risk concentration and vendor lock-in that inhibit UK government's negotiating power over the cloud vendors.\" \n\nThe paper also says that if the UK government -- which has spent tens of billions on cloud services in the last decade -- does not change its approach, \"the existing dominance of AWS and Azure in the UK Government's cloud services is set to continue.\" Doing nothing would mean \"leaving the government with minimal leverage over pricing and product options. \n\n\"This path forecasts a future where, within a decade, the public sector could face the end ", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/05/1529251/uk-govt-office-admits-ability-to-negotiate-billions-in-cloud-spending-curbed-by-vendor-lock-in?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "UK Govt Office Admits Ability To Negotiate Billions in Cloud Spending Curbed By Vendor Lock-in", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T14:38:00.578260+00:00", "description": "An anonymous reader writes: Variety reports that following the massive box office success of Dune: Part Two, Legendary has tapped Denis Villeneuve for a third installment that would presumably continue the story of how Paul Atreides goes on to conquer the galaxy. Earlier this year, Villeneuve told Empire that he had already \"put words on paper\" thinking about where he would like to take the Dune franchise going forward. Legendary has yet to announce any sort of timeline for when production on Dune 3 might begin. But the studio intends for the movie to debut before its next project with Villeneuve -- an adaptation of Nuclear War: A Scenario, Annie Jacobsen's 2024 Pulitzer Prize-nominated nonfiction book about how nuclear war scenarios would likely play out.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Denis+Villeneuve+is+Doing+Dune+3%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F04%2F05%2F145230%2F%3Futm_source%3Dtwitter%26utm_m", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/04/05/145230/denis-villeneuve-is-doing-dune-3?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Denis Villeneuve is Doing Dune 3", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T13:32:20.008084+00:00", "description": "An anonymous reader quotes a report from Kotaku: A new patent recently filed by TV and streaming device manufacturer Roku hints toward a possible future where televisions could display ads when you pause a movie or game. For Roku, the time in which the TV is on but users aren't doing anything is valuable. The company has started leasing out ad space in its popular Roku City screensaver -- which appears when your TV is idle -- to companies like McDonald's and movies like Barbie. As tech newsletter Lowpass points out, Roku finds this idle time and its screensaver so valuable that it forbids app developers from overriding the screensaver with their own. But, if you plug in an Xbox or DVD player into the HDMI port on a Roku TV, you bypass the company's screensaver and other ads. And so, Roku has been figuring out a way to not let that happen.\n \nAs reported by Lowpass on April 4, Roku recently filed a patent for a technology that would let it inject ads into third-party content -- like an ", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/04/2236239/rokus-new-hdmi-tech-could-show-ads-when-you-pause-your-game?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Roku's New HDMI Tech Could Show Ads When You Pause Your Game", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T10:18:14.293696+00:00", "description": "Google has introduced a new JPEG library called Jpegli, which reduces noise and improves image quality over traditional JPEGs. Proponents of the technology said it has the potential to make the Internet faster and more beautiful. InfoWorld reports: Announced April 3 and accessible from GitHub, Jpegli maintains high backward compatibility while offering enhanced capabilities and a 35% compression ratio at high-quality compression settings, Google said. Jpegli works by using new techniques to reduce noise and improve image quality. New or improved features include adaptive quantization heuristics from the JPEG XL reference implementation, improved quantization matrix selection, calculation of intermediate results, and the possibility to use more advanced colorspace.\n \nThe library provides an interoperable encoder and decoder complying with the original JPEG standard and its most convenient 8-bit formalism and API/ABI compatibility with libjeg-turbo and MozJPEG. When images are compresse", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/04/2227238/google-rolls-out-new-jpegli-jpeg-coding-library?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Rolls Out New 'Jpegli' JPEG Coding Library", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T08:07:49.282173+00:00", "description": "Elizabeth Rayne reports via Ars Technica: Led by planetary researcher Lonneke Roelofs of Utrecht University in the Netherlands, a team of scientists has found that the sublimation of CO2 ice could have shaped Martian gullies, which might mean the most recent occurrence of liquid water on Mars may have been further back in time than previously thought. That could also mean the window during which life could have emerged and thrived on Mars was possibly smaller. \"Sublimation of CO2 ice, under Martian atmospheric conditions, can fluidize sediment and creates morphologies similar to those observed on Mars,\" Roelofs and her colleagues said in a study recently published in Communications Earth &amp; Environment. [...]\n \nTo recreate a part of the red planet's landscape in a lab, Roelofs built a flume in a special environmental chamber that simulated the atmospheric pressure of Mars. It was steep enough for material to move downward and cold enough for CO2 ice to remain stable. But the team a", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/04/2216215/mars-may-not-have-had-liquid-water-long-enough-for-life-to-form?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mars May Not Have Had Liquid Water Long Enough For Life To Form", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T03:43:14.189925+00:00", "description": "An anonymous reader writes: In the early 70s, young filmmakers John Carpenter and Dan O'Bannon created a spaceship tale for a graduation project -- little knowing it would influence Alien and many other works. Made for $60,000 by film school students, horror maestro John Carpenter's directorial debut Dark Star is now regarded as a sci-fi cult classic. Having just turned 50 years old, it's a world away from much of the sci-fi that came before it and would come after, neither space odyssey nor space opera, rather a bleak, downbeat and often absurd portrait of a group of people cooped together in a malfunctioning interstellar tin can. Arguably its most famous scene consists of an existential debate between an astronaut and a sentient bomb. Dark Star was a collaboration between Carpenter, who directed and scored the film, and Dan O'Bannon, who in addition to co-writing the script, acted as editor, production designer, and visual effects supervisor, as well as playing the volatile, paranoi", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/04/04/228229/how-a-micro-budget-student-film-changed-sci-fi-forever?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How a Micro-Budget Student Film Changed Sci-Fi Forever", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T01:33:11.469387+00:00", "description": "Matthew Connatser reports via The Register: An ASIC designed to display the infamous Rickroll meme is here, alongside 164 other assorted functions. The project is a product of Matthew Venn's Zero to ASIC Course, which offers prospective chip engineers the chance to \"learn to design your own ASIC and get it fabricated.\" Since 2020, Zero to ASIC has accepted several designs that are incorporated into a single chip called a multi-project wafer (MPW), a cost-saving measure as making one chip for one design would be prohibitively expensive. Zero to ASIC has two series of chips: MPW and Tiny Tapeout. The MPW series usually includes just a handful of designs, such as the four on MPW8 submitted in January 2023. By contrast, the original Tiny Tapeout chip included 152 designs, and Tiny Tapeout 2 (which arrived last October) had 165, though could bumped up to 250. Of the 165 designs, one in particular may strike a chord: Design 145, or the Secret File, made by engineer and YouTuber Bitluni. His", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/04/2144244/rickroll-meme-immortalized-in-custom-asic-that-includes-164-hardcoded-programs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Rickroll Meme Immortalized In Custom ASIC That Includes 164 Hardcoded Programs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T01:33:09.922610+00:00", "description": "Plex is a multi-functional streaming platform that allows users to watch, organize, and curate their favorite media entertainment. Sharing Plex libraries is also an option; one that comes with piracy concerns. In an effort to \"avoid the growth of piracy,\" Plex asked GitHub to remove a repository that allows people to reshare libraries that were not originally theirs. TorrentFreak reports: The Swiss company, which is headquartered in the U.S., asked GitHub to remove a \"Plex Reshare\" repository, alleging that it may contribute to its piracy problem. \"Plex Reshare\" doesn't host any copyright-infringing material and, as far as we've seen, it doesn't reference any either. Its main purpose is to allow Plex users to make shared Plex directories browsable on the web, which allows people to \"reshare\" them without being the original owner. \"The reason behind this project is to make available your PLEX shares to other friends unrelated to the person who owns the original library,\" Plex Reshare d", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/04/2152224/plex-asks-github-to-take-down-reshare-repository-over-piracy-fears?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Plex Asks GitHub to Take Down 'Reshare' Repository Over Piracy Fears", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-05T00:28:07.205911+00:00", "description": "In an interview with Roblox Studio head Stefano Corazza, Eurogamer asked about the reputation Roblox has gained and the notion that it was exploitative of young developers, since it takes a cut from work sometimes produced by children. Here's what he had to say: \"I don't know, you can say this for a lot of things, right?\" Corazza said. \"Like, you can say, 'Okay, we are exploiting, you know, child labour,' right? Or, you can say: we are offering people anywhere in the world the capability to get a job, and even like an income. So, I can be like 15 years old, in Indonesia, living in a slum, and then now, with just a laptop, I can create something, make money and then sustain my life. \"There's always the flip side of that, when you go broad and democratized - and in this case, also with a younger audience,\" he continued. \"I mean, our average game developer is in their 20s. But of course, there's people that are teenagers -- and we have hired some teenagers that had millions of players on", "language": "en-us", "link": "https://games.slashdot.org/story/24/04/04/2133237/roblox-executive-says-children-making-money-on-the-platform-isnt-exploitation-its-a-gift?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Roblox Executive Says Children Making Money On the Platform Isn't Exploitation, It's a Gift", "user": null, "vote": 0}]