[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T17:18:39+00:00",
        "description": "<p>One last item on Acorn 8. Whether you are a longtime Acorn user (<a href=\"https://daringfireball.net/linked/2007/09/10/acorn\">like me</a>), or a would-be new user, you should set aside some time to actual read Acorn’s documentation. It’s a full user manual, and it not only describes, in detail, what every feature in the app does and how to use them, but also a vast array of “how-to” tutorials, many of them videos.</p>\n\n<p>In broad strokes, there are two approaches to documenting a serious, professional-level app or software system. One was is a comprehensive functional reference resource. That’s a way that you, the user, can teach yourself how to use a feature, refresh your memory about a feature you haven’t used in a while, or even just check to see if a certain feature even exists. The other is a narrative, storytelling, tutorial approach. That’s not teaching yourself — that’s letting an expert teach you, and today that’s often a visual approach through video.</p>\n\n<p>Acorn’s do",
        "id": 1736364,
        "language": null,
        "link": "https://flyingmeat.com/acorn/docs",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Acorn 8’s Documentation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T16:10:27+00:00",
        "description": "<p>Dan Moren, writing at Six Colors:</p>\n\n<blockquote>\n  <p>The <a href=\"https://flyingmeat.com/blog/\">newly released Acorn 8</a> adds a bunch of great\nfeatures to the mix. A few of them will be familiar to Apple\nplatform users: subject selection uses machine learning to let\nyou quickly isolate and grab the subject of a picture (there’s\nalso a corresponding “Remove Background” feature to simplify\nthat task) and a Live Text tool allows you to select and copy\ntext within an image.</p>\n\n<p>For me, the star of the show is the fascinating Data Merge, which\nis a bit like Mail Merge for images. If you’ve ever needed to\ncreate the same image several times but with different information — nametags, for example, or personalized gift cards — this is a\nlife-saver. You open your template image, identify your variables,\nthen hand Acorn a CSV file with the relevant data and it will\nprocess through them, assigning text where needed and even putting\nimages in assigned layers. It’s the kind of wild au",
        "id": 1735520,
        "language": null,
        "link": "https://sixcolors.com/post/2024/12/acorn-8-brings-subject-selection-live-text-data-merge-more",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Dan Moren on Acorn 8",
        "vote": 0
    }
]