[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T15:45:01+00:00",
        "description": "We're ready to bid farewell to another year, and once again, as is tradition, before we look to the horizons and what 2025 will bring, first, we're going to pause, look back, and reassess. \n\nAfter what was an all-timer year in 2023, 2024 was relatively less densely packed, but though it definitely did feel like the industry was taking a collective breath after the insanity that was the preceding year, the last twelve months nonetheless managed to deliver an incredible mix of games. \n\nOver the course of the year, we've been treated to a bevy of stellar games, each impressing in unique ways and to different degrees, yes, but making a solid mark, nonetheless. In fact, so spoiled were we for choices in our efforts to narrow down our favourite games of the year to a collection of just 30, there were many that ended up missing that arguably may have deserved the spotlight as well. \n\nEven so, even with the usual yearly heartbreak of having to leave out excellent games deserving of recogniti",
        "id": 1735410,
        "language": null,
        "link": "https://www.youtube.com/watch?v=SkR_QyDwqZA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SkR_QyDwqZA/hqdefault.jpg",
        "title": "Top 30 BEST Games of 2024 - Including Our Game of the Year 2024",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T05:45:03+00:00",
        "description": "We're talking about Grand Theft Auto 6. You know the one – Rockstar North's next magnum opus. The open-world game that will seemingly redefine the genre. It did appear at The Game Awards but only to win the Most Anticipated Game award, beating the likes of Ghost of Yotei and Monster Hunter Wilds. \n\nThere was otherwise no new trailer or even a tease. And to be fair, this isn't unexpected. Before it unveiled the first trailer roughly one year ago, Rockstar informed fans in advance that it was dropping. We're not concerned because we expected something that it never really promised. No, the trepidation comes from the lack of a new trailer over a year since the first debuted.",
        "id": 1731331,
        "language": null,
        "link": "https://www.youtube.com/watch?v=oqM_Cnks1zw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oqM_Cnks1zw/hqdefault.jpg",
        "title": "GTA 6 Trailer 2 - Where The Hell Is It?",
        "vote": 0
    }
]