[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T23:49:11.008870+00:00",
        "description": "According to Bloomberg's Mark Gurman, Apple is no longer developing a hardware subscription service for iPhones that would let subscribers upgrade devices every year. Gurman first reported Apple's work on the service in 2022, noting it was delayed due to \"software bugs and regulatory concerns.\" The Verge reports: While the hardware subscription service apparently won't see the light of day, Apple offers installment plans you can use to pay for an iPhone over time. The iPhone Upgrade Program spreads the payments of a loan for a new iPhone (and AppleCare Plus) over 24 months, and you can upgrade to a new phone after you pay the equivalent of 12 months. If you have an Apple Card, you can also pay for a new iPhone (and other Apple products) using Apple Card Monthly Installments.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Reportedly+Won't+Launch+an+iPhone+Subscription+Service%3A+https%3A%2F%2Fapple.slashdot.or",
        "id": 1739156,
        "language": null,
        "link": "https://apple.slashdot.org/story/24/12/18/2225212/apple-reportedly-wont-launch-an-iphone-subscription-service?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Apple Reportedly Won't Launch an iPhone Subscription Service",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T23:49:10.811276+00:00",
        "description": "The CDC has confirmed the first case of severe bird flu in the United States. NPR reports: Louisiana health officials initially reported the infection last week, saying a person was hospitalized after being exposed to sick and dead birds in backyard flocks. On Wednesday, the Centers for Disease Control and Prevention shared their findings that indicate the H5N1 virus responsible for the illness belongs to a genetic lineage that's circulating in wild birds and poultry -- different from what's spreading in dairy cattle and driving the majority of infections in agricultural workers.\n \nIn the U.S., more than 60 people have been infected so far, although some research suggests the official tally may be an undercount. The illnesses linked to dairy cattle have largely led to mild illnesses in humans.\n \nThe version of the virus in the Louisiana case is the so-called \"D1.1 genotype.\" It has previously popped up in poultry workers in Washington state, who developed mild symptoms after testing ",
        "id": 1739155,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/18/2233242/cdc-confirms-first-human-case-of-severe-bird-flu-in-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CDC Confirms First Human Case of Severe Bird Flu In US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T22:43:39.435305+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: GPS tracking firm Hapn is exposing the names of thousands of its customers due to a website bug, TechCrunch has learned. A security researcher alerted TechCrunch in late November to customer names and affiliations -- such as the name of their workplace -- spilling from one of Hapn's servers, which TechCrunch has seen.\n \nHapn, formerly known as Spytec, is a tracking company that allows users to remotely monitor the real-time location of internet-enabled tracking devices, which can be attached to vehicles or other equipment. The company also sells GPS trackers to consumers under its Spytec brand, which rely on the Hapn app for tracking. Spytec touts its GPS devices for tracking the locations of valuable possessions and \"loved ones.\" According to its website, Hapn claims to track more than 460,000 devices and counts customers within the Fortune 500.\n \nThe bug allows anyone to log in with a Hapn account to view the exposed data using t",
        "id": 1738778,
        "language": null,
        "link": "https://it.slashdot.org/story/24/12/18/2220247/tracker-firm-hapn-spilling-names-of-thousands-of-gps-tracking-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tracker Firm Hapn Spilling Names of Thousands of GPS Tracking Customers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T21:38:27.621130+00:00",
        "description": "The world's coal use is expected to reach a fresh high of 8.7bn tonnes this year, and remain at near-record levels for years as a result of a global gas crisis triggered by Russia's invasion of Ukraine. From a report: There has been record production and trade of coal and power generation from coal since Russia's full-scale invasion of Ukraine inflated global gas market prices, according to the International Energy Agency (IEA). \n\nThe IEA said the coal rebound, after a slump during the global Covid pandemic, means consumption of the fossil fuel is now on track to rise to a new peak of 8.77bn tonnes by the end of the year -- and could remain at near-record levels until 2027. \n\nThe Paris-based agency blamed power plants for the growing use of coal over the last year, particularly in China which consumes 30% more of the polluting fuel than the rest of the world put together. In developed economies such as the US and the European Union coal power generation has already passed its peak, t",
        "id": 1738382,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/18/1914207/coal-use-to-reach-new-peak---and-remain-at-near-record-levels-for-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Coal Use To Reach New Peak - And Remain at Near-Record Levels For Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T21:38:27.537139+00:00",
        "description": "An anonymous reader shares a report: In preparation for the summer Olympics in 2008, the authorities in Beijing, the host city and China's capital, launched a campaign to teach English to residents likely to come in contact with foreign visitors. Police, transit workers and hotel staff were among those targeted. One aim was to have 80% of taxi drivers achieve a basic level of competency. Today, though, any foreigner visiting Beijing will notice that rather few people are able to speak English well. \n\nThe 80% target proved a fantasy: most drivers still speak nothing but Chinese. Even the public-facing staff at the city's main international airport struggle to communicate with foreigners. Immigration officers often resort to computer-translation systems. For much of the 40 years since China began opening up to the world, \"English fever\" was a common catchphrase. People were eager to learn foreign languages, English most of all. Many hoped the skill would lead to jobs with international",
        "id": 1738381,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/18/191234/china-is-losing-interest-in-english?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China is Losing Interest in English",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T20:34:26.708699+00:00",
        "description": "The U.S. government is urging senior government officials and politicians to ditch phone calls and text messages following intrusions at major American telecommunications companies blamed on Chinese hackers. From a report: In written guidance, opens new tab released on Wednesday, the Cybersecurity and Infrastructure Security Agency said \"individuals who are in senior government or senior political positions\" should \"immediately review and apply\" a series of best practices around the use of mobile devices. \n\nThe first recommendation: \"Use only end-to-end encrypted communications.\" End-to-end encryption -- a data protection technique which aims to make data unreadable by anyone except its sender and its recipient -- is baked into various chat apps, including Meta's WhatsApp, Apple's iMessage, and the privacy-focused app Signal. Neither regular phone calls nor text messages are end-to-end encrypted, which means they can be monitored, either by the telephone companies, law enforcement, o",
        "id": 1737897,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/18/1926207/us-government-tells-officials-politicians-to-ditch-regular-calls-and-texts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Government Tells Officials, Politicians To Ditch Regular Calls and Texts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T19:28:52.046564+00:00",
        "description": "An anonymous reader shares a report: ChatGPT is coming to phones. No, not smartphones -- landlines. Call 1-800-242-8478 (1-800-CHATGPT), and OpenAI's AI-powered assistant will respond as of Wednesday afternoon. \n\nThe experience is more or less identical to Advanced Voice Mode, OpenAI's real-time conversational feature for ChatGPT -- minus the multimodality. ChatGPT responds to the questions users ask over the phone, and can handle tasks such as translating a sentence into a different language. OpenAI is offering 15 minutes of free calling for U.S. users. Beginning Wednesday, ChatGPT is also available on WhatsApp for those who prefer to text the AI assistant.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Brings+ChatGPT+To+Landline%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F18%2F1835222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a cla",
        "id": 1737419,
        "language": null,
        "link": "https://slashdot.org/story/24/12/18/1835222/openai-brings-chatgpt-to-landline?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Brings ChatGPT To Landline",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T19:28:51.813986+00:00",
        "description": "The US Environmental Protection Agency has granted a pair of waivers to California, allowing the Golden State to continue regulating vehicle-caused air pollution within its borders. From a report: The first is for the California Air Resources Board's Advanced Clean Cars II regulations, which apply to light- and medium-duty vehicles like passenger cars, SUVs, and smaller trucks. The second waiver is for regulations that control the amount of nitrogen oxides (NOx) that can be emitted by heavy-duty vehicles as well as off-road vehicles. \n\nThe Clean Air Act allows states to apply for a waiver from the EPA to set their own emissions standards in cases where the federal regulations are insufficient to prevent deleterious pollution. The state applied for the latest waivers late in 2023, and after a public comment period and then a review by the agency, the EPA decided to approve them. \n\n\"California has longstanding authority to request waivers from EPA to protect its residents from dangerou",
        "id": 1737418,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/18/1838234/epa-lets-california-set-its-own-stricter-emissions-standards-until-2035?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "EPA Lets California Set Its Own Stricter Emissions Standards Until 2035",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T18:22:52.534495+00:00",
        "description": "An anonymous reader shares a report: Australia's chief cyber security agency has decided local orgs should stop using the tech that forms the current cryptographic foundation of the internet by the year 2030 -- years before other nations plan to do so -- over fears that advances in quantum computing could render it insecure. \n\nThe Land Down Under's plans emerged last week when the Australian Signals Directorate (ASD) published guidance for High Assurance Cryptographic Equipment (HACE) -- devices that send and/or receive sensitive information -- that calls for disallowing the cryptographic algorithms SHA-256, RSA, ECDSA and ECDH, among others, by the end of this decade. \n\nBill Buchanan, professor in the School of Computing at Edinburgh Napier University, wrote a blog post in which he expressed shock that the ASD aims to move so quickly. \"Basically, these four methods are used for virtually every web connection that we create, and where ECDH is used for the key exchange, ECDSA or RSA i",
        "id": 1736840,
        "language": null,
        "link": "https://it.slashdot.org/story/24/12/18/173242/australia-moves-to-drop-some-cryptography-by-2030?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Australia Moves To Drop Some Cryptography By 2030",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T18:22:52.381745+00:00",
        "description": "Nebraska's attorney general has sued Change Healthcare over a massive data breach that exposed sensitive medical information of more than 100 million Americans following a February ransomware attack. The lawsuit alleges the UnitedHealth-owned company failed to implement basic security measures, including multi-factor authentication, allowing hackers to breach its systems using credentials from a customer support employee that were posted on Telegram. \n\nThe Russian-speaking ALPHV ransomware group accessed personal health records, financial data and treatment information across Change Healthcare's poorly segmented network, according to the complaint filed by Attorney General Mike Hilgers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nebraska+Sues+UnitedHealth+Unit+Over+100+Million+Patient+Data+Breach%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F12%2F18%2F1723209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"",
        "id": 1736839,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/18/1723209/nebraska-sues-unitedhealth-unit-over-100-million-patient-data-breach?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Nebraska Sues UnitedHealth Unit Over 100 Million Patient Data Breach",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T17:19:34.858744+00:00",
        "description": "A cybersquatting scheme targeting prominent writers and entrepreneurs has exposed flaws in Bluesky's domain-based verification system, newsletter Tedium reports, citing users. \n\nBloomberg columnist Conor Sen reported receiving an extortion attempt this week when an anonymous user who had purchased his namesake domain demanded payment to transfer ownership. The episode has unraveled wider revelations of similar attacks targeting at least five other well-known users, including political blogger Matt Yglesias and The Hustle founder Sam Parr. \n\nThe platform's moderation team initially banned Parr's legitimate account while leaving the impersonator active, Sen told Tedium. The fake account was only removed after users escalated the issue to senior Bluesky staff.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bluesky+Has+an+Extortion+Problem%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F18%2F1345236%2F%3Futm_sou",
        "id": 1736135,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/18/1345236/bluesky-has-an-extortion-problem?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bluesky Has an Extortion Problem",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T16:13:22.335815+00:00",
        "description": "Microsoft is significantly shifting its Xbox strategy, moving away from console exclusives in a bid to reach gamers across all platforms, Windows Central reports. The company's \"Project Latitude\" initiative will make previously Xbox-exclusive titles available on PlayStation and other platforms, with even flagship franchises like Halo no longer guaranteed exclusivity. \n\nThis strategic pivot comes as Microsoft faces both opportunities and challenges in the gaming industry. While Xbox is seeing record users, according to company statements, the broader gaming market faces stagnant growth and rising development costs. Microsoft CEO Satya Nadella frames this as \"redefining what it means to be an Xbox fan,\" emphasizing accessibility across devices rather than hardware loyalty.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Abandons+Xbox+Exclusivity+in+Risky+Gaming+Strategy+Shift%3A+https%3A%2F%2Fgames.slashdot.",
        "id": 1735374,
        "language": null,
        "link": "https://games.slashdot.org/story/24/12/18/136229/microsoft-abandons-xbox-exclusivity-in-risky-gaming-strategy-shift?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Abandons Xbox Exclusivity in Risky Gaming Strategy Shift",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T16:13:21.761847+00:00",
        "description": "A new MIT study reveals why legal documents are so hard to read: Both lawyers and non-lawyers instinctively use complex language to signal authority, similar to how magic spells use archaic terms. The research, published in PNAS, found that even laypeople default to convoluted \"center-embedded\" clauses when writing laws, but switch to plain language for other tasks. From a report:\n\n[Edward] Gibson's [an MIT professor of brain and cognitive sciences] research group has been studying the unique characteristics of legalese since 2020, when Martinez came to MIT after earning a law degree from Harvard Law School. In a 2022 study, Gibson, Martinez, and Mollica analyzed legal contracts totaling about 3.5 million words, comparing them with other types of writing, including movie scripts, newspaper articles, and academic papers. \n\nThat analysis revealed that legal documents frequently have long definitions inserted in the middle of sentences -- a feature known as \"center-embedding.\" Linguists",
        "id": 1735373,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/18/1317249/legal-language-is-deliberately-arcane-to-signal-power-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Legal Language Is Deliberately Arcane To Signal Power, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T15:08:06.462268+00:00",
        "description": "Microsoft bought twice as many of Nvidia's flagship chips as any of its largest rivals in the US and China this year, as OpenAI's biggest investor accelerated its investment in artificial intelligence infrastructure. From a report: Analysts at Omdia, a technology consultancy, estimate that Microsoft bought 485,000 of Nvidia's \"Hopper\" chips this year. That put Microsoft far ahead of Nvidia's next biggest US customer Meta, which bought 224,000 Hopper chips, as well as its cloud computing rivals Amazon and Google. \n\nWith demand outstripping supply of Nvidia's most advanced graphics processing units for much of the past two years, Microsoft's chip hoard has given it an edge in the race to build the next generation of AI systems. This year, Big Tech companies have spent tens of billions of dollars on data centres running Nvidia's latest chips, which have become the hottest commodity in Silicon Valley since the debut of ChatGPT two years ago kick-started an unprecedented surge of investme",
        "id": 1734600,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/18/1159209/microsoft-acquires-twice-as-many-nvidia-ai-chips-as-tech-rivals?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Acquires Twice as Many Nvidia AI Chips as Tech Rivals",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T13:51:52.620907+00:00",
        "description": "U.S. authorities are investigating Chinese router manufacturer TP-Link over national security risks and considering banning its devices, WSJ reported Wednesday, citing sources familiar with the matter. The Commerce, Defense and Justice departments have launched separate probes into the company, which controls approximately 65% of the U.S. home and small business router market. \n\nMicrosoft reported in October that Chinese hackers had compromised thousands of TP-Link routers to launch cyberattacks against Western targets, including government organizations and Defense Department suppliers. The company's routers are widely used across federal agencies, including the Defense Department and NASA. The Justice Department is also examining whether TP-Link's significantly lower pricing violates federal anti-monopoly laws, the report said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Weighs+Banning+TP-Link+Router+Over+N",
        "id": 1733858,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/18/1249207/us-weighs-banning-tp-link-router-over-national-security-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Weighs Banning TP-Link Router Over National Security Concerns",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T13:51:52.526114+00:00",
        "description": "An anonymous reader quotes a report from CNBC: Salesforce will hire 2,000 people to sell artificial intelligence software to clients, CEO Marc Benioff said on Tuesday, double the number the company indicated it was planning to add a month ago. The cloud software company, which targets sales reps, marketers and customer service agents, is among the many technology companies hoping to boost revenue with generative AI features. \"We're adding another couple of thousand salespeople to help sell these products,\" Benioff said at a company event in San Francisco. \"We already had 9,000 referrals for the 2,000 positions that we've opened up. It's amazing.\"\n \nLast month, Benioff told Bloomberg that it planned to hire 1,000 salespeople focusing on AI. On Tuesday, Salesforce said the second generation of its Agentforce technology creating and operating AI agents will become available to customers in February 2025. Agentforce will be able to tackle sophisticated questions in Salesforce's Slack com",
        "id": 1733857,
        "language": null,
        "link": "https://slashdot.org/story/24/12/18/0520238/salesforce-will-hire-2000-people-to-sell-ai-products?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Salesforce Will Hire 2,000 People To Sell AI Products",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T11:42:35.536421+00:00",
        "description": "Scripps Research scientists sent stem-cell-derived brain organoids to the ISS to study the effects of microgravity on brain cells, finding that the organoids matured faster and showed signs of specialization compared to Earth-grown controls. The findings have been published in the journal Stem Cells Translational Medicine. Phys.Org reports: To examine how the space environment impacts cellular functions, the team compared the cells' RNA expression patterns -- a measure of gene activity -- to identical \"ground control\" organoids that had remained on Earth. Surprisingly, they found that the organoids grown in microgravity had higher levels of genes associated with maturity and lower levels of genes associated with proliferation compared to the ground controls, meaning that the cells exposed to microgravity developed faster and replicated less than those on Earth. \"We discovered that in both types of organoids, the gene expression profile was characteristic of an older stage of developm",
        "id": 1732553,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/18/0512211/brain-cells-mature-faster-in-space-but-stay-healthy-iss-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Brain Cells Mature Faster In Space But Stay Healthy, ISS Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T08:06:01.552278+00:00",
        "description": "SpaceX has filed a petition to incorporate its Starbase facility in South Texas as a new city, aiming to streamline infrastructure development and support the growing workforce needed for Starship production and testing. Space.com reports: \"To continue growing the workforce necessary to rapidly develop and manufacture Starship, we need the ability to grow Starbase as a community,\" SpaceX said in the petition, which was shared in a post on X (formally Twitter). \"That is why we are requesting that Cameron County call an election to enable the incorporation of Starbase as the newest city in the Rio Grande Valley.\"\n \nThe petition was addressed to Cameron County Judge Eddie Trevino Jr., the county's top elected official. The next step will be for officials to review the petition to determine if it complies with statutory requirements. Then, an election would be held to incorporate Starbase. [...] With Starship expected to \"fundamentally alter humanity's access to space,\" SpaceX aims to ma",
        "id": 1731763,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/18/055234/spacex-wants-starbase-to-become-an-official-city-in-texas?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SpaceX Wants Starbase To Become an Official City In Texas",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T03:43:31.904177+00:00",
        "description": "An anonymous reader quotes a report from The Guardian: The UK's first driverless bus service, originally heralded as a breakthrough of global significance, is being withdrawn from service because too few passengers used it. The autonomous buses, operated by Stagecoach, have been running between Fife and Edinburgh along a 14-mile route over the Forth road bridge since May 2023 to relieve the heavy congestion which can bring traffic to a standstill.\n \nThe CAVForth service, a collaboration between Fusion Processing, the coach-building company Alexander Dennis, Napier University in Edinburgh and the Bristol Robotics Lab -- a joint venture between the University of Bristol and the University of the West of England -- was touted as the most ambitious and complex in the world. Built at an estimated cost of more than 6 million pounds, partly funded by the UK government, the fleet of five single-decker buses had the capacity to carry 10,000 passengers a week but needed two crew on board for s",
        "id": 1731020,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/17/2315236/driverless-bus-service-in-scotland-to-be-withdrawn-due-to-lack-of-interest?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Driverless Bus Service In Scotland To Be Withdrawn Due To Lack of Interest",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T02:39:04.329918+00:00",
        "description": "The Register's Simon Sharwood reports: Tech distribution behemoth Ingram Micro will stop doing business with Broadcom and its VMware range in many territories next year. In a statement sent to The Register, an Ingram spokesperson told us: \"We were unable to reach an agreement with Broadcom that would help our customers deliver the best technology outcomes now and in the future while providing an appropriate shareholder return.\" That decision means that from \"early January 2025, Ingram Micro will no longer be doing business with Broadcom and have limited engagement with VMware in select regions.\"\n \nThe distie told us this change is not material to its business, and customers and other vendors have been informed. \"For us and the more than 1,500 vendors and 161,000 customers we work with, the future of business is focused on transforming relationships, not just transacting sales,\" the spokesperson explained. Ingram's decision is a challenge to Broadcom, which after acquiring VMware deci",
        "id": 1730843,
        "language": null,
        "link": "https://slashdot.org/story/24/12/17/2310222/ingram-micro-to-stop-doing-business-with-broadcom-downgrade-to-limited-engagement-on-vmware?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ingram Micro To 'Stop Doing Business' With Broadcom, Downgrade To 'Limited Engagement' On VMware",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T01:34:04.736731+00:00",
        "description": "The European Commission has launched formal proceedings against TikTok over concerns about its failure to limit election interference, particularly in last month's Romanian presidential vote. Reuters reports: The Commission said it will request information and look into TikTok's policy on political advertisements and paid-for political content as well as TikTok's systems to generate recommendations and the risks of them being manipulated. The opening of formal proceedings empowers the Commission to take further enforcement steps and to accept commitments made by TikTok. There is no specific deadline to complete proceedings.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=EU+Opens+Investigation+Into+TikTok+Over+Election+Interference%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F17%2F230211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=",
        "id": 1730667,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/17/230211/eu-opens-investigation-into-tiktok-over-election-interference?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "EU Opens Investigation Into TikTok Over Election Interference",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T01:34:04.505367+00:00",
        "description": "Spain's leftwing government has introduced a bill requiring digital platforms and social media influencers with large followings to publish corrections to false or harmful information. The law intends to \"[make] life more difficult for those who dedicate themselves to lies and spreading fake news every day,\" said justice minister Felix Bolanos. The Guardian reports: The draft law replaces legislation from 1984 and targets internet users who have more than 100,000 followers on a single platform or 200,000 across several, the justice ministry said in a statement. These outlets and the platforms that host them must have a mechanism to facilitate citizens' right to ask that false or inaccurate information that harms them be corrected publicly, the ministry said. The correction request will no longer have to be addressed to the outlet's director because confirming their identity is difficult for many \"pseudo media,\" justice minister Felix Bolanos told a press conference.<p><div class=\"sha",
        "id": 1730666,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/17/235225/spain-introduces-bill-to-combat-online-fake-news?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Spain Introduces Bill To Combat Online Fake News",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T00:27:46.902930+00:00",
        "description": "A San Francisco jury convicted tech entrepreneur Nima Momeni of second-degree murder for the April 2023 stabbing death of Cash App's founder Bob Lee. He faces 15 years to life in prison. The BBC reports: Momeni was found not guilty of the more serious charge of first-degree murder, which denotes a pre-meditated killing. [...] The six-week trial featured dramatic testimony, and details of Mr Lee's drug-fueled final night. According to prosecutors, Momeni stabbed Mr Lee with a kitchen paring knife because he was upset that he had introduced his sister, Khazar Momeni, to a man who gave her GHB, a so-called date rape drug.\n \nLike the prosecution, Nima Momeni's defense team said he had been partying with his sister and Mr Lee on the night of his murder. But they said Momeni had been acting in self-defense. Mr Lee, Momeni said, had lunged at him with a knife over what Momeni described as a \"bad joke\" at the expense of Mr Lee's family, according to CBS News, the BBC's US partner. Prosecutor",
        "id": 1730455,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/17/213224/tech-entrepreneur-found-guilty-of-cash-app-founder-bob-lees-murder?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tech Entrepreneur Found Guilty of Cash App Founder Bob Lee's Murder",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-18T00:27:46.810226+00:00",
        "description": "An anonymous reader quotes a report from The Register: China's Electronics Video Industry Association last week signed off on a standard for a universal remote control -- a gadget Beijing thinks locals need because they're struggling with multiple remotes, but which is also a little more significant in other ways. The standard requires remote controls to allow voice control, and to use one of three means of wireless comms: Bluetooth, infrared, and Star Flash -- more on that later. It has been hailed as a boon for consumers who apparently struggle to find the right remote control to use as they navigate between televisions and set-top boxes.\n \nThis standard reportedly detects which device a user wants to control, makes the connection, and eases the chore of directing a stream from a set-top box to a display. Device-makers have been told that televisions and set-top boxes must support the standard, and they've quickly complied: local media report that Chinese consumer electronics outfi",
        "id": 1730454,
        "language": null,
        "link": "https://mobile.slashdot.org/story/24/12/17/2112227/china-kicks-off-homebrew-bluetooth-alternative-star-flash-as-it-pushes-universal-remotes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "China Kicks Off Homebrew Bluetooth Alternative 'Star Flash' As It Pushes Universal Remotes",
        "vote": 0
    }
]