[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Ark: Survival Ascended Early Access Review - The Final Verdict", "description": "Studio Wildcard is no stranger to controversy, especially with Ark: Survival Ascended. Meant as a free upgrade to Survival Evolved, it would eventually launch as a separate title in Steam Early Access with only The Island available for fans to experience.\n\nAs a remake of Survival Evolved, it offers gorgeous new visuals courtesy of Unreal Engine 5.2, new physics and animations, and various quality-of-life features from a new map system to improved building. It doesn't completely overhaul the base game, with some issues - like odd dinosaur pathfinding AI and average combat - still present. That's before discussing the remake's technical state on PC.\n\nNevertheless, Ark: Survival Ascended builds upon the original in several ways while presenting a fun, somewhat grindy, but altogether massive experience.", "link": "https://www.youtube.com/watch?v=ANmE9gbXwW8", "date_published": "2023-11-16T15:30:02+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/ANmE9gbXwW8/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Suicide Squad: Kill The Justice League - 10 NEW DETAILS You Need To Know", "description": "Rocksteady Studios and WB Games have finally graced us with some new information on Suicide Squad: Kill the Justice League. We learned more about its story, how the squad ended up in Metropolis fighting Brainiac's forces, and more combat details.\n\nThough it's still very much a third-person shooter, each character has different playstyles and traversal skills. Harley Quinn is about grappling around and bashing enemies; Deadshot fights at long-range with a jetpack; King Shark is the tank who favors close-range combat; and Captain Boomerang is a pseudo-speedster. New mechanics like Juggle Kill, Suicide Strike, and Counter Shot have also been revealed.\n\nSuicide Squad: Kill the Justice League is out on February 2nd, 2024, for Xbox Series X/S, PS5 and PC, with its Standard and Deluxe Editions available to pre-order. Here are ten new things you need to know about it.", "link": "https://www.youtube.com/watch?v=kfwNUQKTIfg", "date_published": "2023-11-16T13:30:29+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/kfwNUQKTIfg/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Top 30 Best Open World Games of All Time You NEED TO PLAY [2023 Edition]", "description": "It's incredible to look back on the open-world genre and see how far it's come. There was a point when causing chaos in Grand Theft Auto 3 was revolutionary.  However, the genre has evolved. From the narrative genius of Red Dead Redemption 2 and the freedom, depth, and fidelity of Horizon Forbidden West, there have been massive strides over the years. Narrowing down the best is tough, but there are some clear winners.\n\nHere are the 30 best open-world games available today and why they're worth playing.", "link": "https://www.youtube.com/watch?v=Y9nL1a9-24g", "date_published": "2023-11-16T09:30:07+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/Y9nL1a9-24g/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]