[{"source": "https://www.arabnews.com/rss.xml", "title": "UK charity Penny Appeal announces ‘Beauty and the Balaah’ panto — a Halal twist on the classic tale", "description": "LONDON: International humanitarian charity Penny Appeal has announced this year’s “Great Muslim Panto,” promising audiences across Britain “a heartwarming and culturally rich” production.\n\n\t“’Beauty and the Balaah’ is a captivating Muslim Panto with a unique Halal twist on Disney’s timeless classic, ‘Beauty and the Beast’,” the UK-based organization said in a statement.", "link": "https://www.arabnews.com/node/2414441/offbeat", "date_published": "2023-11-24T09:11:05+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Third Saudi Media Forum to be held in February 2024", "description": "LONDON: The third Saudi Media Forum will be held from Feb. 19-21, 2024, the Saudi Broadcasting Authority, SBA, announced on Wednesday.\n\n\tCommemorating World Television Day, the three-day event will include a range of topics related to the sector’s growth and future, covering areas such as visual, audio, print and digital mediums.\n\n\tThe forum will also discuss the media’s role in society, politics and the economy on a global scale.", "link": "https://www.arabnews.com/node/2414631/media", "date_published": "2023-11-24T06:11:49+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Riyadh hosts Asian Paralympic General Assembly on Saturday", "description": "RIYADH: For the first time in its history, Riyadh will host the forum and the electoral General Assembly of the Asian Paralympic Committee, with the participation of more than 200 attendees representing 45 Asian countries.\n\tSeveral heads of international and regional Paralympic federations are also expected to attend the four-day forum, according to a media statement on Friday.\n\tPrince Fahad bin Jalawi, the Saudi Olympic and Paralympic Committee’s vice president, will inaugurate the forum’s first day on behalf of SOPC’s President Prince Abdulaziz bin Turki Al-Faisal.", "link": "https://www.arabnews.com/node/2414646/saudi-sport", "date_published": "2023-11-24T06:11:44+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Inaugural smart cities expo to support urban living in Saudi Arabia", "description": "RIYADH: Saudi Arabia, as the fastest growing G20 economy according to the IMF, is experiencing a rapid surge in urban population, with about 85 percent of its population living in metropolitan areas.\n\tThe infrastructure ecosystem in the Kingdom is rapidly evolving with the increasing population. The launch of the Smart Cities Saudi Expo, co-located with the Saudi Infrastructure Expo and the Global Water Expo next year, complements the Kingdom’s advancement in urban and smart city development.", "link": "https://www.arabnews.com/node/2414601/saudi-arabia", "date_published": "2023-11-24T05:11:56+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Harvard journal allegedly censors article holding Israel responsible for genocide", "description": "LONDON: Editors of the renowned journal Harvard Law Review are under scrutiny for censorship following their decision not to publish an academic article claiming Israel committed genocide in Gaza after initially approving it.\n\n\tOnline chairs of the journal, which is run by the university’s student body, commissioned an essay from Rabea Eghbariah, a Palestinian doctoral candidate at Harvard Law School and a human rights lawyer.", "link": "https://www.arabnews.com/node/2414611/media", "date_published": "2023-11-24T05:11:17+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Al-Rajhi, Al-Balooshi and Al-Tuwaijri lead car, motorcycle and quad battle after opening stage of Rally Qassim Toyota 2023", "description": "BURAIDAH: Yazeed Al-Rajhi, Mohammed Al-Balooshi and Haitham Al-Tuwaijri extended their advantages in the car, motorcycle and quad categories after the Ash Shimasiyah desert stage of 186 km at Rally Qassim Toyota 2023 on Friday morning.\n\tAfter winning the Prologue on Thursday afternoon, Al-Rajhi and his German co-driver Timo Gottschalk opted to start the first of two desert stages from 10th on the road, and the Saudi used that starting position to full advantage to win the day’s test in his Overdrive Racing Toyota Hilux and extend his lead to 2 minutes 41 seconds.", "link": "https://www.arabnews.com/node/2414606/saudi-sport", "date_published": "2023-11-24T05:11:05+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "14 meters to freedom: Final push to free Indian tunnel workers", "description": "SILKYARA TUNNEL, India: Just a few meters of rock and earth separate Indian rescue teams from 41 workers who have been trapped inside a collapsed road tunnel for nearly two weeks, officials said Friday, saying they were optimistic of success within hours.After a series of rapid advances, hopes that the men’s freedom was imminent were dashed late Wednesday when the drilling machine powering through tons of rock and concrete ran into metal rods, but those have now been cleared.", "link": "https://www.arabnews.com/node/2414321/world", "date_published": "2023-11-24T05:11:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Cuban-Khaleeji Project keeps Dhahran clapping", "description": "DHAHRAN: On a cool, breezy Dhahran night, the Cuban-Khaleeji Project brought its fusion of musical cultures to Ithra on Thanksgiving.\n\tOriginally commissioned by The Arts Center at New York University Abu Dhabi in early 2019, this is the first time an audience has heard the ensemble play live outside of New York and the UAE. The final performance at the Ithra Theater will take place on Nov. 25.", "link": "https://www.arabnews.com/node/2414596/saudi-arabia", "date_published": "2023-11-24T04:11:30+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Thai PM says 12 Thai hostages released by Hamas", "description": "BANGKOK: Thai Prime Minister Srettha Thavisin said 12 Thai hostages kidnapped by Palestinian militants during Hamas’s October 7 raids into Israel were released on Friday, hours after a truce in the Israel-Hamas war began.\n\t“It has been confirmed by the security side and the Ministry of Foreign Affairs that 12 Thai hostages are already released,” he posted on X.\n\t“Embassy officials are on their way to pick them up in another hour. Their names and details should be known. Please stay tuned.”", "link": "https://www.arabnews.com/node/2414591/world", "date_published": "2023-11-24T04:11:14+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Philippines considers return to ‘fold’ of International Criminal Court", "description": "MANILA: The Philippines is considering resuming membership of the International Criminal Court (ICC) nearly five years after it withdrew over objections to a bid by the court to investigate a bloody anti-narcotics campaign, the president said on Friday.\n\t“There is also a question, should we return under the fold of the ICC, so that’s again under study. So we’ll just keep looking at it and see what our options are,” President Ferdinand Marcos Jr. told reporters.", "link": "https://www.arabnews.com/node/2414306/world", "date_published": "2023-11-24T04:11:12+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Australian warship sails through Taiwan Strait", "description": "TAIPEI: Taiwan said on Friday that an Australian warship had sailed through the Taiwan Strait, the sensitive and narrow waterway that separates the democratically governed island from China.\n\tThe island’s defense ministry did not name the ship but said it entered the strait on Thursday and sailed through it in a southerly direction, adding that Taiwan’s military kept watch throughout. It gave no more details.\n\tAn Australian official confirmed the ship, the Toowoomba, transited the international waters of the Taiwan Strait as part of its regional deployment.", "link": "https://www.arabnews.com/node/2414301/world", "date_published": "2023-11-24T04:11:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Hamas sources say Israel hostages handed over to Egypt", "description": "GAZA STRIP, Palestinian Territories: Two Hamas sources told AFP that some of the hostages seized in the October 7 raids on Israel were on Friday handed over to the Red Cross for return to Israel, via Egypt.\n\t“Half an hour ago, the prisoners were handed to the Red Cross who will take them to the Egyptians” at the Rafah crossing, one of the sources said.\n\t“They were handed over to the Egyptian side,” the source added.\n\tA source in the military wing of Hamas confirmed the handover, adding: “This is the first group under the agreement.”", "link": "https://www.arabnews.com/node/2414581/middle-east", "date_published": "2023-11-24T03:11:22+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Egypt’s El-Sisi calls for recognition of Palestinian state", "description": "CAIRO: Egypt’s President Abdel Fattah El-Sisi on Friday appeared to discredit the moribund Israel-Palestinian peace process and instead called on the international community to recognize the Palestinian state.\n\tDuring a joint news conference with the prime ministers of Spain and Belgium in Cairo, El-Sisi said reviving the process aimed at ending the Israel-Palestinian conflict “may not be what is required.”\n\t“The results of this path faltering for 30 years tells us that we must” adopt a different approach, he said.", "link": "https://www.arabnews.com/node/2414576/middle-east", "date_published": "2023-11-24T03:11:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Snap introduces new content creator programs, initiatives", "description": "LONDON: Snap Inc. has unveiled new programs and features in a strategic move expected to further bolster the creator economy in the Middle East and North Africa region.\n\n\tThe initiatives include innovative monetization options and enhanced reach and relevance on the platform.\n\n\tJulie Bogaert, head of Talent Partnerships EMEA (Europe, the Middle East and Africa) at Snap Inc., spoke of the initiatives’ focus on empowering creators, fostering sustainable businesses, and expanding audience engagement.", "link": "https://www.arabnews.com/node/2414571/media", "date_published": "2023-11-24T02:11:39+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Djokovic sets up mouth-watering Sinner clash in Davis Cup semifinals", "description": "MALAGA, Spain: Novak Djokovic steered Serbia into the Davis Cup semifinals as he beat Cameron Norrie 6-4, 6-4 to secure a 2-0 triumph over Great Britain on Thursday, setting up a mouth-watering clash with Italy’s Jannik Sinner.\n\n\tItaly defeated the Netherlands 2-1 and will face Serbia in the second semifinal on Saturday in Malaga, after last year’s runners-up Australia face Finland Friday.\n\n\tWorld No. 1 Djokovic played with his typical relentless quality and then rebuked British fans at the end of the match as they tried to drown out his victory speech with drums.", "link": "https://www.arabnews.com/node/2414286/tennis", "date_published": "2023-11-24T02:11:25+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Brazil forward Rodrygo denounces racist abuse on social media after match against Argentina", "description": "MADRID: Brazil forward Rodrygo has been the target of racist abuse on social media following the World Cup qualifying game against Argentina.\n\n\t“The racists are always out there,” Rodrygo, who is Black, said in a message posted Thursday. “My social networks have been invaded with insults and all kinds of absurdity. It’s all there for everyone to see.”\n\n\tThe player said many of the racist messages included photos and emoticons of monkeys or bananas.", "link": "https://www.arabnews.com/node/2414291/football", "date_published": "2023-11-24T02:11:20+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "US-Canada border at Niagara Falls reopens after car blast", "description": "WASHINGTON: The US-Canada border crossing at Niagara Falls that was the scene of a deadly car explosion reopened Thursday, officials said.\n\tThe day before, a car traveling at high speed crashed into a checkpoint barrier at Rainbow Bridge and exploded into flames — triggering border closures and sparking a massive security alert on the eve of a major holiday.\n\tThe regional FBI field office concluded the blast, which occurred about 400 miles (640 kilometers) northwest of New York City, was not linked to terrorism.", "link": "https://www.arabnews.com/node/2414296/world", "date_published": "2023-11-24T02:11:19+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi defense minister, UK counterpart discuss Gaza situation", "description": "RIYADH: Saudi Defense Minister Prince Khalid bin Salman discussed the situation in Gaza with Grant Shapps, UK secretary of state for defense.\n\tPrince Khalid wrote on X: “I stressed the need to end military operations, protect civilians and allow unimpeded flow of humanitarian aid.”\n\tPrince Khalid said they also reviewed the two nation’s strategic defense partnership and explored ways to strengthen cooperation.", "link": "https://www.arabnews.com/node/2414281/saudi-arabia", "date_published": "2023-11-24T01:11:27+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "OPEC+ to hold next meeting virtually", "description": "The next meeting of the Organization of the Petroleum Exporting Countries and its allies, known as OPEC+, will be held virtually, it has been announced.\n\n\tThe group was due to meet on Nov. 26, but this has been delayed until Nov. 30 – the same day the UN climate change conference, known as COP28, begins in Dubai.\n\n\tThe alliance is mulling over further production cuts, having agreed in June to limit supply into 2024.", "link": "https://www.arabnews.com/node/2414491/business-economy", "date_published": "2023-11-24T00:11:46+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi authorities seize multimillion-dollar drug haul", "description": "RIYADH: Saudi Arabia’s Zakat, Tax and Customs Authority thwarted an attempt to smuggle 416,250 Captagon pills hidden in a curtain shipment.\n\n\tThe pills were seized at Jeddah Islamic Port, the Saudi News Agency reported.", "link": "https://www.arabnews.com/node/2414501/saudi-arabia", "date_published": "2023-11-24T00:11:32+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]