[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "I Didn’t Know I Needed This Game In My Life...", "description": "RoboCop: Rogue City is stuffed with attention to detail. The shooting is fantastic too, demonstrating the awesome unstoppable firepower of our metal-clad hero perfectly.\n\nRoboCop: Rogue City is a remarkable achievement, delivering grisly brutality and intriguing gameplay mechanics in equal measure, with engaging, exciting FPS that’ll entertain even non-fans of the genre throughout its campaign and side missions. \n\nGiven the history of Teyon’s track record, the bar wasn’t especially high, but RoboCop: Rogue City absolutely delivers and is definitely worth playing.", "link": "https://www.youtube.com/watch?v=ztTj6Kt7T2Y", "date_published": "2023-11-24T15:30:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/ztTj6Kt7T2Y/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 Best Open World Games SET IN REAL PLACES", "description": "There’s obviously undeniable appeal to any game that takes players to a richly imagined and immaculately realized fictional world with its own rules, but there’s also no doubting the impact that a game can have by transporting you to a virtual recreation of a place that exists (or existed) in the real world. \n\nThat can come in many different forms – from games that strive to be authentic recreations of certain locations to those that take creative liberties in their takes on real-world places – and when done right, there’s a great deal of enjoyment to be had in those open world settings. \n\nTo that end, here, we’re going to talk about a few standout open world games that have taken us to real places.", "link": "https://www.youtube.com/watch?v=jcA5qPysEyg", "date_published": "2023-11-24T13:30:16+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/jcA5qPysEyg/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]