[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-17T15:30:02+00:00", "description": "Metal Gear Solid: Delta has been unanimously praised with recent showings, and for good reason. The faithfulness to the original MGS3 is very lovingly done here in Metal Gear Solid Delta. The gameplay trailer showcases multiple 1-for-1 scene shots, displaying just how brilliantly the Unreal Engine 5 graphics enhance the swampy jungles of the original. \n\nSnake’s facial expressions are phenomenally executed with this remake, with separate iris movement in the eyes and a total lack of uncanny valley. The inclusion of the overhead legacy control scheme in addition to the new over-the-shoulder ‘new style’ controls is awesome. Healing has undergone a complete redesign. Wounds will stay on Snake’s body in real-time even after healing him. It’ll be fun seeing other players’ battered versions of Snake and comparing them. Overall, Metal Gear Solid Delta looks like a stunning ode to the classic game while fixing the rough gameplay elements.", "id": 727439, "language": null, "link": "https://www.youtube.com/watch?v=E-5EOzsXjn8", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/E-5EOzsXjn8/hqdefault.jpg", "title": "Metal Gear Solid: Delta Snake Eater Is on Track to Be One of the Greatest Remakes of All Time", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-17T13:00:29+00:00", "description": "The Chinese Room has delivered a string of solid horror (or horror adjacent) titles in the past and though Still Wakes the Deep doesn’t necessarily touch some of their heights, it’s still another notch on the belt for the studio. \n\nBoasting an intriguing setting, Still Wakes the Deep builds a strong sense of place and atmosphere. Even though it doesn’t fulfil its setting’s potential from a horror perspective, it succeeds in telling a story that will keep you sufficiently engaged until the credits roll. It’s a pretty brief experience that is light on the gameplay side of things, but with a solid story, strong atmosphere, and excellent visuals, it’s still a game worth experiencing.", "id": 726595, "language": null, "link": "https://www.youtube.com/watch?v=Y8t4ZsJMlNQ", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/Y8t4ZsJMlNQ/hqdefault.jpg", "title": "Still Wakes The Deep Review - A Solid Horror Story", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-17T10:30:10+00:00", "description": "Certain gaming franchises cement themselves in the history books of the medium as eternal fan favourites because of how consistently they keep blowing expectations out of the water, but even for the best of the best franchises, it can be difficult to have a completely spotless track record. \n\nEven some of the biggest and most beloved franchises have stumbled in some pretty significant ways over the years, and here, that is exactly what we are going to be talking about. Join us as we take a look at a few video game franchises that have had some noticeable dips, while also talking about what exactly those dips were, and what they did to their respective franchise.", "id": 725519, "language": null, "link": "https://www.youtube.com/watch?v=V_f3t9OPW7c", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/V_f3t9OPW7c/hqdefault.jpg", "title": "15 Video Game Franchises With At Least ONE BAD GAME", "user": null, "vote": 0}]