[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-26T17:30:06+00:00", "description": "Lever Games' No More Room for Hell carved out a niche as a Half-Life 2 mod and standalone release. It offered a more grounded, survival-focused co-op zombie experience where players constantly communicate and work together to survive. Though the team is now at Torn Banner Studios, it always planned for No More Room for Hell 2 to offer a larger experience.\n\nThis would include a bigger map with distinct locations and, perhaps most intriguing, permadeath for characters. Unfortunately, as it stands in early access, the title is little more than a routine extraction shooter. The gameplay loop is one-note with only a single means to complete the map. Zombies shuffle and rubber-band all over the place. Performance and stability are iffy at best.\n\nEven the permadeath, annoying as it is with the randomly generated responders, isn't the worst. Instead, it attempts to mash two conflicting gameplay loops with little success.", "id": 1393630, "language": null, "link": "https://www.youtube.com/watch?v=m8tTdFwTiX8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/m8tTdFwTiX8/hqdefault.jpg", "title": "No More Room in Hell 2 Early Access Review - A Long Way To Go", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-26T15:45:00+00:00", "description": "LEGO Horizon Adventures releases on November 14th for PS5, Switch, and PC. Yes, you read that correctly, the PlayStation exclusive Horizon IP is coming to a Nintendo console and it’s looking really promising to boot. \n\nThis LEGO game differentiates itself from past titles in a number of ways. Most notably, the graphics really highlight the PS5’s power to render many particles at once on screen. This is exemplified by the fully brick-built environments. \n\nThe team was inspired by The Lego Movie to craft an experience that could be built entirely of individual LEGO bricks. It’s also voice acted, with Ashly Burch returning as Aloy, lending cinematic flair to the game. But don’t expect it to follow Horizon Zero Dawn’s story beat by beat, it’s a re-imagining rather than a retelling, as the designers point out. We’ll see if the magic of LEGO in game form can captivate us all over again when LEGO Horizon Adventures releases on November 14th.", "id": 1393351, "language": null, "link": "https://www.youtube.com/watch?v=0nUdbJOFlJQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/0nUdbJOFlJQ/hqdefault.jpg", "title": "LEGO Horizon Adventures - 15 Things You Need To Know Before You Buy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-26T13:30:29+00:00", "description": "The current generation of gaming offers more games than ever before. Free-to-play titles, AA releases, $70 premium titles, indies - there's so much to play that it's unfeasible to keep track of it all. Yet one area that has seemingly plateaued early is visuals. Suddenly, the previous generations' leaps in visual quality are looking positively astronomical compared to the current generation.\n\nThere are still some very good-looking titles, but the phasing out of cross-gen titles is taking much longer. Meanwhile, the previous generation saw the likes of DriveClub, Ghost of Tsushima, Quantum Break, Mad Max, and much more, which pushed the limits of their hardware.\n\nWhat are some of the most noteworthy titles that can compete with the current generation in visual fidelity (and sometimes look even better)? Check out 15 of our picks here.", "id": 1392832, "language": null, "link": "https://www.youtube.com/watch?v=VP8Uwihmhbs", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/VP8Uwihmhbs/hqdefault.jpg", "title": "15 Last-Gen Games That Still Look GRAPHICALLY INCREDIBLE YEARS LATER", "vote": 0}]