[{"thumbnail": "https://i3.ytimg.com/vi/fPgElIUoEfM/hqdefault.jpg", "page_rating": 94, "description": "Outcast – A New Beginning is a follow-up to what is widely considered to be one of the first fully-3D open world games to have ever been released, the original Outcast back in 1999. As a modern video game release, Outcast – A New Beginning boasts an impressive new jetpack that hopes to give new life to the act of exploration in a massive open world.\n\nWhile the combat and traversal in Outcast – A New Beginning can be a lot of fun, especially thanks to the unique approach to weapon customization and the jetpack, the game is filled with archaic design decisions that can be frustrating. Even the story feels incredibly badly done, despite having some characters that ooze charm and sincerity.", "user": null, "page_rating_visits": 0, "page_rating_contents": 94, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "age": null, "comments": [], "artist": null, "permanent": false, "link": "https://www.youtube.com/watch?v=fPgElIUoEfM", "language": null, "album": "", "bookmarked": false, "tags": [], "source_obj__id": 129, "page_rating_votes": 0, "vote": 0, "dead": false, "date_published": "2024-03-18T21:30:04+00:00", "title": "Outcast: A New Beginning Review - A Disappointment"}, {"thumbnail": "https://i2.ytimg.com/vi/ulBXrY9JP1U/hqdefault.jpg", "page_rating": 94, "description": "After months of rumors, Tango Gameworks' Hi-Fi Rush is available on PS5. It carries all of the post-launch updates and leverages the console as you would expect. While it signals a shift for Microsoft to a new multi-platform strategy, it still stands out as one of the best first-party titles.\n\nAs Chai, players battle through a rhythm-based hack-and-slash adventure with enemies, environmental objects and more moving to the beat. The colorful presentation and incredible attention to detail hide a deep combat system with multitudes of options. It also doesn't hurt that the story, level design and overall writing are consistently on point.\n\nHi-Fi Rush may face extensive competition this week, with AAA games coming up. Nevertheless, it's a stellar journey that PS5 players should check out.", "user": null, "page_rating_visits": 0, "page_rating_contents": 94, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "age": null, "comments": [], "artist": null, "permanent": false, "link": "https://www.youtube.com/watch?v=ulBXrY9JP1U", "language": null, "album": "", "bookmarked": false, "tags": [], "source_obj__id": 129, "page_rating_votes": 0, "vote": 0, "dead": false, "date_published": "2024-03-18T14:00:47+00:00", "title": "Hi-Fi Rush PS5 Review - A MUST Play For PS5 Players"}, {"thumbnail": "https://i2.ytimg.com/vi/9REhr20dq4s/hqdefault.jpg", "page_rating": 94, "description": "Sony's PlayStation 4 is one of the most successful consoles ever, with 117.2 million units sold since it launched in 2013. It's also perhaps its most consistent regarding quality titles, with hits like Horizon Zero Dawn and many more.\n\nHowever, as the PS5 hits 50 million consoles sold, the sun is quickly setting on the PS4's lifespan. The good news is that there are still some big titles for the latter this year. From recently released games like The Outlast Trials, and WWE 2K24 to upcoming titles like Little Nightmares 3, the System Shock remake, Elden Ring: Shadow of the Erdtree and many more, there's plenty to look forward to.\n\nCheck out some of the biggest PS4 titles of 2024.", "user": null, "page_rating_visits": 0, "page_rating_contents": 94, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "age": null, "comments": [], "artist": null, "permanent": false, "link": "https://www.youtube.com/watch?v=9REhr20dq4s", "language": null, "album": "", "bookmarked": false, "tags": [], "source_obj__id": 129, "page_rating_votes": 0, "vote": 0, "dead": false, "date_published": "2024-03-18T11:00:06+00:00", "title": "16 BIGGEST And NEW PS4 Games of 2024"}, {"thumbnail": "https://i2.ytimg.com/vi/yQtS9NiaiVY/hqdefault.jpg", "page_rating": 94, "description": "A lot of what Contra: Operation Galuga does poorly can be ignored, at least by those looking for a good run and gun or Contra experience. This game isn’t as good as the classics that it is inspired from, or not even as good as the peak of the modern era, which was Contra 4. But it is a good, well playing, fun entry into the canon, one that retains all the strengths of the franchise, and executes on them well enough to invite plays and replays by those that like this style of game. \n\nIt won’t ever top anyone’s list of favorite Contra or run and gun game, and it will certainly not convert anyone who was not already a fan of the IP or the genre, but to those already in the know? It’s a good enough title to be worth checking out, even with all the flaws and caveats that come bundled with the recommendation.", "user": null, "page_rating_visits": 0, "page_rating_contents": 94, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "age": null, "comments": [], "artist": null, "permanent": false, "link": "https://www.youtube.com/watch?v=yQtS9NiaiVY", "language": null, "album": "", "bookmarked": false, "tags": [], "source_obj__id": 129, "page_rating_votes": 0, "vote": 0, "dead": false, "date_published": "2024-03-18T09:00:45+00:00", "title": "Contra: Operation Galuga Review - IS CONTRA FINALLY BACK?"}]