[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T21:23:01.298402+00:00", "description": "An anonymous reader quotes a report from NBC News: The former CEO of a small Kansas bank was sentenced to more than 24 years in prison for looting the bank of $47 million -- which he sent to cryptocurrency wallets controlled by scammers who had duped him in a \"pig butchering\" scheme that appealed to his greed, federal prosecutors said. The massive embezzlement by ex-CEO Shan Hanes in a series of wire transfers over just eight weeks last year led to the collapse and FDIC takeover of Heartland Tri-State Bank in Elkhart, one of only five U.S. banks that failed in 2023. Hanes, 53, also swindled funds from a local church and investment club -- and a daughter's college savings account -- to transfer money, purportedly to buy cryptocurrency as the scammers insisted they needed more funds to unlock the supposed returns on his investments, according to records from U.S. District Court in Wichita, Kansas. But Hanes never realized any profit and lost all of the money he stole as a result of the ", "id": 1044809, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/22/2028203/crypto-pig-butchering-scam-wrecks-kansas-bank-sends-ex-ceo-to-prison-for-24-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Crypto 'Pig Butchering' Scam Wrecks Kansas Bank, Sends Ex-CEO To Prison For 24 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T21:22:57.178500+00:00", "description": "Android Authority's Mishaal Rahman reports: Security vulnerabilities are lurking in most of the apps you use on a day-to-day basis; there's just no way for most companies to preemptively fix every possible security issue because of human error, deadlines, lack of resources, and a multitude of other factors. That's why many organizations run bug bounty programs to get external help with fixing these issues. The Google Play Security Reward Program (GPSRP) is an example of a bug bounty program that paid security researchers to find vulnerabilities in popular Android apps, but it's being shut down later this month. Google announced the Google Play Security Reward Program back in October 2017 as a way to incentivize security searchers to find and, most importantly, responsibly disclose vulnerabilities in popular Android apps distributed through the Google Play Store. [...]\n \nThe purpose of the Google Play Security Reward Program was simple: Google wanted to make the Play Store a more secur", "id": 1044808, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/22/2042250/google-play-will-no-longer-pay-to-discover-vulnerabilities-in-popular-android-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Play Will No Longer Pay To Discover Vulnerabilities In Popular Android Apps", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T19:12:01.490204+00:00", "description": "Over the next 50 years, people will push further into wildlife habitats across more than half the land on Earth, scientists have found, threatening biodiversity and increasing the chance of future pandemics. From a report: Humans have already transformed or occupied between 70% and 75% of the world's land. Research published in Science Advances on Wednesday found the overlap between human and wildlife populations is expected to increase across 57% of the Earth's land by 2070, driven by human population growth. \n\n[...] As humans and animals share increasingly crowded landscapes, the bigger overlap could result in higher potential for disease transmission, biodiversity loss, animals being killed by people and wildlife eating livestock and crops, the researchers said. Biodiversity loss is the leading driver of infectious disease outbreaks. About 75% of emerging diseases in humans are zoonotic, meaning they can be passed from animals to humans, and many diseases concerning global health a", "id": 1044116, "language": "en-us", "link": "https://news.slashdot.org/story/24/08/22/187237/humans-to-push-further-into-wildlife-habitats-across-more-than-50-of-land-by-2070-study-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Humans To Push Further Into Wildlife Habitats Across More Than 50% of Land by 2070, Study Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T19:11:57.527298+00:00", "description": "A newly discovered bug causes iPhones and iPads to briefly crash. All you need to trigger the bug are just four characters. From a report: On Wednesday, a security researcher found that typing \"\":: can cause the Apple mobile user interface, called Springboard, to crash. TechCrunch verified those characters do crash Springboard when typed into the Search bar in the Settings app, as well as if you swipe all the way to the right on your home screen and type them into the App Library search bar. \n\nAs others noted, all that's needed is actually \"\": and any other character. Triggering the bug briefly crashes Springboard, then reloads to your lock screen. In other tests, the bug flashed the screen black for a second. Researchers tell TechCrunch the bug does not appear to be a security issue. \"It's not a security bug,\" said Ryan Stortz, an iOS security researcher who analyzed the bug. Patrick Wardle, who also researches iOS and founded security startup DoubleYou, agreed.<p><div class=\"share_s", "id": 1044115, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/22/1829253/bug-in-apple-devices-crashes-ui-with-four-character-input?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Bug in Apple Devices Crashes UI With Four-Character Input", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T18:05:59.221723+00:00", "description": "Gartner is warning that any prospect of Artificial General Intelligence (AGI) is at least 10 years away and perhaps not certain to ever arrive. It might not even be a worthwhile pursuit, the analyst says. From a report: AGI has become a controversial topic in the last couple of years as builders of large language models (LLMs), such as OpenAI, make bold claims that they've established a near-term path toward human-like intelligence. At the same time, others from the discipline of cognitive science have scorned the idea, arguing that the concept of AGI is poorly understood and the LLM approach is insufficient. \n\nIn its Hype Cycle for Emerging Technologies, 2024, Gartner says it distills \"key insights\" from more than 2,000 technologies and, using its framework, produces a succinct set of \"must-know\" emerging technologies that have the potential to deliver benefits over the next two to ten years. The consultancy notes that GenAI -- the subject of volumes of industry hype and billions in ", "id": 1043505, "language": "en-us", "link": "https://slashdot.org/story/24/08/22/1539228/agi-is-on-clients-radar-but-far-from-reality-says-gartner?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AGI is On Clients' Radar But Far From Reality, Says Gartner", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T18:05:56.477044+00:00", "description": "Microsoft will begin sending a revised version of its controversial Recall feature to Windows Insider PCs beginning in October, according to an update published to the company's original blog post about the Recall controversy. From a report: The company didn't elaborate further on specific changes it's making to Recall beyond what it already announced in June. \n\nFor those unfamiliar, Recall is a Windows service that runs in the background on compatible PCs, continuously taking screenshots of user activity, scanning those screenshots with optical character recognition (OCR), and saving the OCR text and the screenshots to a giant searchable database on your PC. The goal, according to Microsoft, is to help users retrace their steps and dig up information about things they had used their PCs to find or do in the past.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Will+Try+the+Data-Scraping+Windows+Recall+Feature+Again+in+October%3A+htt", "id": 1043504, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/22/1648253/microsoft-will-try-the-data-scraping-windows-recall-feature-again-in-october?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Will Try the Data-Scraping Windows Recall Feature Again in October", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T18:05:53.423876+00:00", "description": "Apple will change how users choose browser options in the European Union, add a dedicated section for changing default apps, and make more apps deletable, the company said on Thursday. From a report: The iPhone maker came under pressure from regulators to make changes after the EU's sweeping Digital Markets Act took effect on March 7, forcing it to offer mobile users the ability to select from a list of available web browsers on a \"choice screen\" the first time they open Safari. In an update later this year, Apple users will be able to select a default browser directly from the choice screen after going through a mandatory list of options. \n\nA randomly ordered list of 12 browsers per EU country will be shown to the user with short descriptions, and the chosen one will be automatically downloaded, Apple said. The choice screen will also be available on iPads through an update later this year. Apple released a previous update in response to the new rules in March, but browser companies ", "id": 1043503, "language": "en-us", "link": "https://apple.slashdot.org/story/24/08/22/1720209/apple-will-allow-eu-users-to-delete-safari-messages-and-app-store-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Will Allow EU Users To Delete Safari, Messages and App Store Apps", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T15:45:57.526260+00:00", "description": "In a blog post on Wednesday, Neuralink said its second human recipient is using the brain chip to play Counter-Strike 2 and develop 3D designs in CAD software. \"Alex\" was given the brain chip last month to help restore his autonomy after a spinal cord injury. PCMag reports: Like the first Neuralink patient, Noland Arbaugh, Alex has also been using the brain chip to play his favorite computer games, such as Counter-Strike 2. Before, Alex had to use a mouth-operated controller, called a QuadStick, to play the first-person shooter. But even then, the controller limited him to only moving or aiming his weapon at a single time, never simultaneously like a normal Counter-Strike player. In other words, Alex had to essentially switch back and forth between the mouse and keyboard functions while playing the game. But thanks to Neuralink, he can now aim with the implant, and simultaneously move while using the QuadStick. [...]\n \nIn the blog post, Neuralink also addressed a problem the company f", "id": 1042552, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/22/0136248/second-human-to-receive-neuralink-brain-chip-uses-it-to-play-counter-strike-2?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Second Human To Receive Neuralink Brain Chip Uses It To Play Counter-Strike 2", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T15:45:55.989918+00:00", "description": "Phoronix's Michael Larabel benchmarked AMD's latest Ryzen 9 9950X in several different Linux distros and found that the Zen 5 chip performs up to 16% faster with the Intel-optimized Clear Linux distro. Here's an excerpt from the report: The Linux distributions for this round of testing on the AMD Ryzen 9 9950X included Arch Linux, CachyOS, Clear Linux, Fedora Workstation 40, Ubuntu 24.04 LTS, and a recent daily snapshot of Ubuntu 24.10 in its current development form. Intel's Clear Linux is the one most interesting for looking at on the new AMD Zen 5 hardware. While there hasn't been so much Clear Linux news in recent times, it remains the most well optimized x86_64 Linux distribution out of the box. Clear Linux makes use of compiler function multi versioning, performance-minded defaults, aggressive compiler CFLAGS/CXXFLAGS defaults, optional AVX-512 usage for more libraries, and many other patches and optimizations in the name of delivering the greatest x86_64 Linux performance. And ", "id": 1042551, "language": "en-us", "link": "https://linux.slashdot.org/story/24/08/21/1958234/ryzen-9-9950x-performs-16-faster-on-intel-optimized-linux-distro?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ryzen 9 9950X Performs 16% Faster On Intel-Optimized Linux Distro", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T15:45:54.411153+00:00", "description": "Lionsgate is recalling its latest trailer for Francis Ford Coppola's epic \"Megalopolis,\" which featured a littany of fabricated quotes from famous film critics. From a report: \"Lionsgate is immediately recalling our trailer for 'Megalopolis,'\" a Lionsgate spokesperson said in a statement provided to Variety. \"We offer our sincere apologies to the critics involved and to Francis Ford Coppola and American Zoetrope for this inexcusable error in our vetting process. We screwed up. We are sorry.\" \n\nThe trailer, released on Wednesday morning, aimed to position Coppola's latest film as a work of art that would withstand the test of time, much like his previous masterpieces \"The Godfather\" and \"Apocalypse Now.\" The video included several quotes from critics panning Coppola's previous work -- but none of the phrases, attributed to the likes of Roger Ebert and Pauline Kael, could be found in any of their reviews.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home", "id": 1042550, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/08/22/123238/lionsgate-pulls-megalopolis-trailer-offline-due-to-made-up-critic-quotes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Lionsgate Pulls 'Megalopolis' Trailer Offline Due To Made-Up Critic Quotes", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T15:45:52.401191+00:00", "description": "An anonymous reader quotes a report from Bloomberg: Blue Origin sustained failures in recent weeks of testing including a factory mishap that damaged a portion of a future New Glenn rocket, the long-awaited centerpiece of the Jeff Bezos-backed startup's push to take on SpaceX. The upper portion of one rocket crumpled into itself, in part due to worker error, while it was being moved to a storage hangar, according to people familiar with the situation.\n \nIn a separate incident, another upper rocket portion failed during stress testing and exploded, the people said. Repairs are underway, another person said, noting there were no injuries during either episode. The previously unreported incidents illustrate the hurdles Blue Origin is grappling with while ramping up production of New Glenn, which is four years overdue. At the same time, new Chief Executive Officer Dave Limp has hired a slate of executives to shake the company out of a years-long R&amp;D slump.<p><div class=\"share_submissi", "id": 1042549, "language": "en-us", "link": "https://slashdot.org/story/24/08/22/0152220/bezos-blue-origin-suffers-fiery-setback-building-new-rocket?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Bezos' Blue Origin Suffers Fiery Setback Building New Rocket", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T15:45:50.852402+00:00", "description": "Epic Games launched its alternative app store in the European Union last week, capitalizing on new regulations opening up iOS. The store aims to offer developers lower commissions and greater payment flexibility compared to Apple's App Store. However, Apple's new terms for alternative marketplaces present significant challenges for developers. Apple imposes a 50 euro cent per user per year installation fee, a 10% commission on external sales, and a 5% fee on purchases within a year of installation. \n\nThese fees apply on top of Epic's 12% commission, potentially making the alternative store less attractive for many developers, The Verge writes. While Epic can likely absorb these costs for its hit game Fortnite, smaller developers face a steeper hurdle. Some industry insiders express skepticism about the viability of the new ecosystem for most app creators. Epic plans to offer a curated selection of third-party games on its mobile store by December, but widespread adoption remains uncer", "id": 1042548, "language": "en-us", "link": "https://apple.slashdot.org/story/24/08/22/148244/apple-is-still-standing-in-the-way-of-epics-app-store?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple is Still Standing in the Way of Epic's App Store", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T15:45:49.300394+00:00", "description": "Peloton on Thursday said it will start charging new subscribers a one-time $95 activation fee if they bought their hardware on the secondary market as more consumers snag lightly used equipment for a fraction of the typical retail price. From a report: The used equipment activation fee for subscribers in the U.S. and Canada comes as Peloton starts to see a meaningful increase in new members who bought used Bikes or Treads from peer-to-peer markets such as Facebook Marketplace. During its fiscal fourth quarter, which ended June 30, Peloton said it saw a \"steady stream of paid connected fitness subscribers\" who bought hardware on the secondary market. The company said the segment grew 16% year over year. \n\n\"We believe a meaningful share of these subscribers are incremental, and they exhibit lower net churn rates than rental subscribers,\" the company said in a letter to shareholders. \"It's also worth highlighting that this activation fee will be a source of incremental revenue and gross ", "id": 1042547, "language": "en-us", "link": "https://slashdot.org/story/24/08/22/1447234/peloton-to-start-charging-subscribers-with-used-equipment-95-activation-fee?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Peloton To Start Charging Subscribers With Used Equipment $95 Activation Fee", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T15:45:47.707496+00:00", "description": "Software engineers at Microsoft earn an average total compensation ranging from $148,436 to $1,230,000 annually, depending on their level, according to a leaked spreadsheet viewed by Business Insider. The data, voluntarily shared by hundreds of U.S.-based Microsoft employees, includes information on salaries, performance-based raises, promotions, and bonuses. The highest-paid engineers work in Microsoft's newly formed AI organization, with average total compensation of $377,611. Engineers in Cloud and AI, Azure, and Experiences and Devices units earn between $242,723 and $255,126 on average.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Engineers'+Pay+Data+Leaked%2C+Reveals+Compensation+Details%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F08%2F22%2F1510217%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=ht", "id": 1042546, "language": "en-us", "link": "https://slashdot.org/story/24/08/22/1510217/microsoft-engineers-pay-data-leaked-reveals-compensation-details?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Engineers' Pay Data Leaked, Reveals Compensation Details", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T07:00:16.800217+00:00", "description": "Phoronix's Michael Larabel reports: As part of Intel's Scalable Video Technology (SVT) initiative they had been developing SVT-HEVC as a BSD-licensed high performance H.265/HEVC video encoder optimized for Xeon Scalable and Xeon D processors. But recently they've changed course and the project has been officially discontinued. [...] The SVT-AV1 project a while ago was already punted to the Alliance for Open Media (AOMedia) project and one of its lead maintainers having joined Meta from Intel two years ago. SVT-AV1 continues excelling great outside the borders of Intel but SVT-HEVC (and SVT-VP9) have remained Intel open-source projects but at least officially SVT-HEVC has ended.\n \nSVT-HEVC hadn't seen a new release since 2021 and there are already several great open-source H.265 encoders out there like x265 and Kvazaar. But as of a few weeks ago, SVT-HEVC upstream is now discontinued. The GitHub repository was put into a read-only state [with a discontinuation notice]. Meanwhile SVT-VP", "id": 1039794, "language": "en-us", "link": "https://news.slashdot.org/story/24/08/21/1929224/intel-discontinues-high-speed-open-source-h265hevc-encoder-project?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Discontinues High-Speed, Open-Source H.265/HEVC Encoder Project", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T07:00:15.218857+00:00", "description": "Rotten Tomatoes and Fandango are rolling out a new \"Verified Hot\" rating for users who actually bought a ticket to the movie being reviewed. \"The designation is only given to theatrical movies that have reached an audience score above 90 percent among user ratings,\" adds IndieWire. From the report: Movie ticketing app Fandango is the parent company to Rotten Tomatoes, so if you bought your ticket through Fandango and then rated a movie using that same user info on Rotten Tomatoes, RT is able to confirm you bought a ticket and can filter out anyone else who may just be rating things blindly. A rep for RT tells IndieWire the goal is to work with other partners so that other people who don't use Fandango can still be considered verified.\n \nRotten Tomatoes also expanded its Popcornmeter designations. Anything with an audience score above 60 percent of people rating it as 3.5 stars or higher will be labeled \"Hot,\" and movies below that 60 percent threshold are now \"Stale.\" The \"Certified F", "id": 1039793, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/08/21/1937201/rotten-tomatoes-introduces-a-new-audience-rating-for-people-who-actually-bought-a-ticket?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Rotten Tomatoes Introduces a New Audience Rating For People Who Actually Bought a Ticket", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T07:00:13.639374+00:00", "description": "An anonymous reader quotes a report from Dark Reading: Researchers have exploited a vulnerability in Microsoft's Copilot Studio tool allowing them to make external HTTP requests that can access sensitive information regarding internal services within a cloud environment -- with potential impact across multiple tenants. Tenable researchers discovered the server-side request forgery (SSRF) flaw in the chatbot creation tool, which they exploited to access Microsoft's internal infrastructure, including the Instance Metadata Service (IMDS) and internal Cosmos DB instances, they revealed in a blog post this week. Tracked by Microsoft as CVE-2024-38206, the flaw allows an authenticated attacker to bypass SSRF protection in Microsoft Copilot Studio to leak sensitive cloud-based information over a network, according to a security advisory associated with the vulnerability. The flaw exists when combining an HTTP request that can be created using the tool with an SSRF protection bypass, accordin", "id": 1039792, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/21/1947215/microsoft-copilot-studio-exploit-leaks-sensitive-cloud-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Copilot Studio Exploit Leaks Sensitive Cloud Data", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T07:00:12.085529+00:00", "description": "In a tragic update to Monday's story, authorities have recovered the bodies of former Autonomy CEO Mike Lynch and his teenage daughter Hannah. The Register reports: Italian divers are said to have found the billionaire father and his daughter, 18, inside one of the sunken vessel's cabins, according to The Telegraph. The capsized ship presently rests 49 meters below the surface, about half a mile from the coast. [...] Angela Bacares, Lynch's wife, was rescued at sea and is recovering.\n \nCanadian Broadcasting Company News has reported that the body of Recaldo Thomas, a Canadian-born man who resided in Antigua and served as the ship's cook, has been recovered. Other missing individuals have been identified by The Independent as: Christopher Morvillo, a lawyer who had represented Lynch and wife Neda Morvillo; Jonathan Bloomer, chairman of investment bank Morgan Stanley International and wife Judy Bloomer.\n The Register has published an obituary for Mike Lynch.<p><div class=\"share_submissi", "id": 1039791, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/21/222220/it-tycoon-mike-lynch-daughter-hannah-found-dead?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "IT Tycoon Mike Lynch, Daughter Hannah Found Dead", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T07:00:10.038228+00:00", "description": "Google has reached a groundbreaking deal with California lawmakers to contribute millions to local newsrooms, aiming to support journalism amid its decline as readers migrate online and advertising dollars evaporate. The agreement also includes a controversial provision for artificial intelligence funding. Politico reports: California emulated a strategy that other countries like Canada have used to try and reverse the journalism industry's decline as readership migrated online and advertising dollars evaporated. [...] Under the deal, the details of which were first reported by POLITICO on Monday, Google and the state of California would jointly contribute a minimum of $125 million over five years to support local newsrooms through a nonprofit public charity housed at UC Berkeley's journalism school. Google would contribute at least $55 million, and state officials would kick in at least $70 million. The search giant would also commit $50 million over five years to unspecified \"existi", "id": 1039790, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/21/2228258/google-agrees-to-250-million-deal-to-fund-california-newsrooms-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Agrees To $250 Million Deal To Fund California Newsrooms, AI", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T07:00:08.462760+00:00", "description": "According to Bloomberg's Mark Gurman (paywalled), App Store vice president Matt Fischer is departing the company in October as Apple prepares for organizational changes in response to regulatory pressure. MacRumors reports: Apple plans to split its App Store group into two teams, one that handles the App Store and a second team that oversees alternative app distribution. As of earlier this year, Apple has supported iOS app downloads from alternative app stores and from websites in the European Union, a change that the company had to make to comply with the Digital Markets Act. To handle ongoing compliance with EU regulations for app distribution and alternative payment methods, App Store chief Phil Schiller is changing the App Store's hierarchy.\n \nFischer joined Apple in 2003 to oversee iTunes marketing, but he has served as the vice president of the App Store since 2010. In an email to Apple employees today, Fischer said that he had been thinking about leaving Apple for some time, an", "id": 1039789, "language": "en-us", "link": "https://apple.slashdot.org/story/24/08/21/2215250/app-store-vp-departs-as-apple-prepares-organizational-changes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "App Store VP Departs As Apple Prepares Organizational Changes", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T07:00:06.926346+00:00", "description": "The old Sonos app won't be making a return to replace the buggy new version. According to Sonos CEO Patrick Spence, rereleasing the old app would make things worse now that updated software has already been sent out to the company's speakers and cloud infrastructure. The Verge reports: In a Reddit AMA response posted Tuesday, Sonos CEO Spence says that he was hopeful \"until very recently\" that the company could rerelease the app, confirming a report from The Verge that the company was considering doing so. [...] Since the new app was released on May 7th, Spence has issued a formal apology and announced in August that the company would be delaying the launch of two products \"until our app experience meets the level of quality that we, our customers, and our partners expect from Sonos.\" \"The trick of course is that Sonos is not just the mobile app, but software that runs on your speakers and in the cloud too,\" writes Spence in the Reddit AMA. \"In the months since the new mobile app laun", "id": 1039788, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/21/231243/sonos-ceo-says-the-old-app-cant-be-rereleased?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Sonos CEO Says the Old App Can't Be Rereleased", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T07:00:05.382294+00:00", "description": "A sophisticated extortion campaign has targeted 110,000 domains by exploiting misconfigured AWS environment files, security firm Cyble reports. The attackers scanned for exposed .env files containing cloud access keys and other sensitive data. Organizations that failed to secure their AWS environments found their S3-stored data replaced with ransom notes. \n\nThe attackers used a series of API calls to verify data, enumerate IAM users, and locate S3 buckets. Though initial access lacked admin privileges, they created new IAM roles to escalate permissions. Cyble researchers noted the attackers' use of AWS Lambda functions for automated scanning operations.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=110K+Domains+Targeted+in+'Sophisticated'+AWS+Cloud+Extortion+Campaign%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F08%2F22%2F0214202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a", "id": 1039787, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/22/0214202/110k-domains-targeted-in-sophisticated-aws-cloud-extortion-campaign?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "110K Domains Targeted in 'Sophisticated' AWS Cloud Extortion Campaign", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T07:00:03.826470+00:00", "description": "An anonymous reader quotes a report from Reuters: U.S. oilfield services firm Halliburton on Wednesday was hit by a cyberattack, according to a person familiar with the matter. Halliburton said it was aware of an issue affecting certain systems at the company and was working to determine the cause and impact of the problem. The company was also working with \"leading external experts\" to fix the issue, a spokesperson said in an emailed statement.\n \nThe attack appeared to impact business operations at the company's north Houston campus, as well as some global connectivity networks, the person said, who declined to be identified because they were not authorized to speak on the record. The company has asked some staff not to connect to internal networks, the person said. Houston, Texas-based Halliburton is one of the largest oilfield services firms in the world, providing drilling services and equipment to major energy producers around the globe. It had nearly 48,000 employees and operate", "id": 1039786, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/21/2250229/top-us-oilfield-firm-halliburton-hit-by-cyberattack-source-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Top US Oilfield Firm Halliburton Hit By Cyberattack, Source Says", "user": null, "vote": 0}]