[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T18:30:02+00:00", "description": "Since the moment we first laid eyes on it, Crimson Desert – Pearl Abyss’ single-player offshoot of MMO Black Desert – has looked like an exciting prospect, thanks in no small part to how ridiculously ambitious it’s looking. \n\nExcitement and curiosity surrounding the game have continued to mount at a steady pace, and recently at Gamescom, Pearl Abyss showed off a hefty amount of new gameplay footage- which is continuing to look promising. \n\nFour new boss fights, a host of new gameplay footage, significant new details on the gameplay and, more specifically, the combat- plenty has been revealed for Crimson Desert at Gamescom, and with the game looking as promising as it is, here, we’re going to go over some of those key details.", "id": 1043973, "language": null, "link": "https://www.youtube.com/watch?v=3HbKP8tsCAM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/3HbKP8tsCAM/hqdefault.jpg", "title": "Crimson Desert Boss Gameplay Is Looking Absolutely Stunning - 10 NEW DETAILS", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-22T06:45:02+00:00", "description": "Black Myth: Wukong has been out for roughly a day on PS5 and PC, and to call it a massive success would be an understatement. It saw over 2.2 million peak concurrent players on Steam - the second highest on the platform. It reportedly sold over 4.5 million copies within the first 24 hours.\n\nThe extensive hype behind the title is one reason for its success, alongside the sizable player base from China. However, it's also seen a positive reception from critics and players worldwide. What made it such a massive success? Is the single-player nature without any microtransactions or hang-ups?\n\nIs it the fact that it's the best adaptation of Journey to the West seen in video games to date? Or that it's a great game that fulfils the developer's vision to perfection, even if several elements aren't revolutionary? Find out here.", "id": 1040219, "language": null, "link": "https://www.youtube.com/watch?v=jOPTRWaqoGY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/jOPTRWaqoGY/hqdefault.jpg", "title": "Why Do MILLIONS of Gamers Love Black Myth: Wukong?", "user": null, "vote": 0}]