[
    {
        "age": null,
        "album": "",
        "author": "GameSpot",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-25T17:00:14+00:00",
        "description": "In this episode of Star Players, Matt Mercer joins host Lucy James to walk through his gaming journey from testing games to voicing iconic characters like Vincent Valentine and Ganondorf.\n\nMatt Mercer has voiced some of gaming's most iconic characters from Final Fantasy VII Rebirth's Vincent Valentine, to The Legend of Zelda's Ganondorf. But it wasn't always that way for Mercer. In this episode of Start Players, Matt Mercer guides host Lucy James through his gaming journey, where he started as a game tester for games like Casper: Friends Around the World and the original God of War. It wasn't until later that Matt stumbled into voice acting, where he quickly found himself filling the shoes of Mark Hamill for Goro Majima in the Yakuza series, and contributing his voice to over 400 games and anime.",
        "id": 1583175,
        "language": null,
        "link": "https://www.youtube.com/watch?v=JPVv4E09nTU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 127,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JPVv4E09nTU/hqdefault.jpg",
        "title": "How Matt Mercer Went From Testing Games To Voicing Legends",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GameSpot",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-25T14:56:05+00:00",
        "description": "SHOWTIME. Watch the new trailer for #SonicMovie3, and get your tickets now.\n\nSonic the Hedgehog returns to the big screen this holiday season in his most thrilling adventure yet. Sonic, Knuckles, and Tails reunite against a powerful new adversary, Shadow, a mysterious villain with powers unlike anything they have faced before. With their abilities outmatched in every way, Team Sonic must seek out an unlikely alliance in hopes of stopping Shadow and protecting the planet.",
        "id": 1582537,
        "language": null,
        "link": "https://www.youtube.com/watch?v=dL-1JGZZkvQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 127,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dL-1JGZZkvQ/hqdefault.jpg",
        "title": "Sonic the Hedgehog 3 - Official Second Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GameSpot",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-25T14:54:01+00:00",
        "description": "DEEP ROCK GALACTIC: ROGUE CORE is a 1-4 player co-op FPS roguelite featuring 100% destructible environments and procedurally-generated caves. \n\nDEEP ROCK GALACTIC: ROGUE CORE is a spinoff of Deep Rock Galactic with a roguelite twist.  \n\nThe roguelite twist means you start from basics in each mission and cooperatively build up powers and abilities for the team, sometimes leading to insanely overpowered builds and other times to spectacular fails\n\nExpenite - a new mineral of incredible value and use has been discovered on planet Hoxxes! Space mining company Deep Rock Galactic immediately sets up covert mining operations deeper than ever, to harvest this precious material. Suddenly and without warning - all the dig sites go dark, and all contact is abruptly lost.\n\nIn this action-packed 1-4 player co-op roguelite, take on the role of a team of elite dwarven Reclaimers called to planet Hoxxes IV to deal with the situation. Bring the lost dig sites back online, unravel the mystery of The G",
        "id": 1582538,
        "language": null,
        "link": "https://www.youtube.com/watch?v=oJYwQxQ6Bzk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 127,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/oJYwQxQ6Bzk/hqdefault.jpg",
        "title": "Deep Rock Galactic: Rogue Core - Pre-Alpha Gameplay Teaser",
        "vote": 0
    }
]