[{"thumbnail": null, "comments": [], "title": "Will FTX Customers Fully Recoup Their Money?", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://news.slashdot.org/story/24/02/10/2113238/will-ftx-customers-fully-recoup-their-money?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Former FTX customers \"have reasons to believe they could actually recoup their money,\" reports CNBC:\n\nBankman-Fried, who could spend the rest of his life behind bars, was found guilty in November on seven criminal counts after roughly $10 billion in customer funds from his company went missing. Some of that money went to pay for Bankman-Fried's lavish lifestyle, but much of it went towards other investments that have, of late, appreciated dramatically in value. Lawyers representing the bankruptcy estate of FTX told a judge in Delaware last week that they expect to fully repay customers and creditors with legitimate claims. Bankruptcy attorney Andrew Dietderich, who works with FTX's new leadership team, said \"there is still a great amount of work and risk\" ahead in getting all the money back to clients, but that the team has a \"strategy to achieve it.\" \n\nIt's a welcome development for the many thousands of customers (reportedly up to a million) who collectively lost billions o", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T23:17:36.988708+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "In Big Tech's Backyard, a California State Lawmaker Unveils a Landmark AI Bill", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://yro.slashdot.org/story/24/02/10/0559248/in-big-techs-backyard-a-california-state-lawmaker-unveils-a-landmark-ai-bill?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader shared this report from the Washington Post:\n\nA California state lawmaker introduced a bill on Thursday aiming to force companies to test the most powerful artificial intelligence models before releasing them &mdash; a landmark proposal that could inspire regulation around the country as state legislatures increasingly tackle the swiftly evolving technology. \n\n The new bill, sponsored by state Sen. Scott Wiener, a Democrat who represents San Francisco, would require companies training new AI models to test their tools for \"unsafe\" behavior, institute hacking protections and develop the tech in such a way that it can be shut down completely, according to a copy of the bill. AI companies would have to disclose testing protocols and what guardrails they put in place to the California Department of Technology. If the tech causes \"critical harm,\" the state's attorney general can sue the company. \n\nWiener's bill comes amid an explosion of state bills addressing ", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T23:17:32.867405+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "Nvidia is Forming a New Business Unit to Make Custom Chips", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://hardware.slashdot.org/story/24/02/10/2251229/nvidia-is-forming-a-new-business-unit-to-make-custom-chips?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader shared this report from Reuters:\n\nNvidia is building a new business unit focused on designing bespoke chips for cloud computing firms and others, including advanced AI processors, nine sources familiar with its plans told Reuters. The dominant global designer and supplier of AI chips aims to capture a portion of an exploding market for custom AI chips and shield itself from the growing number of companies pursuing alternatives to its products. \n\nThe Santa Clara, California-based company controls about 80% of high-end AI chip market, a position that has sent its stock market value up 40% so far this year to $1.73 trillion after it more than tripled in 2023. Nvidia's customers, which include ChatGPT creator OpenAI, Microsoft, Alphabet, and Meta Platforms, have raced to snap up the dwindling supply of its chips to compete in the fast-emerging generative AI sector. Its H100 and A100 chips serve as a generalized, all-purpose AI processor for many of those major", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T23:17:23.606951+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "EFF Challenges 'Legal Bullying' of Sites Reporting on Alleged Appin 'Hacking-for-Hire'", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://yro.slashdot.org/story/24/02/10/0732205/eff-challenges-legal-bullying-of-sites-reporting-on-alleged-appin-hacking-for-hire?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Long-time Slashdot reader v3rgEz shared this report from MuckRock:\n\nFounded in 2003, Appin has been described as a cybersecurity company and an educational consulting firm. Appin was also, according to Reuters reporting and extensive marketing materials, a prolific \"hacking for hire\" service, stealing information from politicians and militaries as well as businesses and even unfaithful spouses. \n\nLegal letters, being sent to newsrooms and organizations around the world, are trying to remove that story from the internet &mdash; and are often succeeding. \n\n\nReuters investigation, published in November, was based in part on corroborated marketing materials, detailing a range of \"hacking for hire\" services Appin provided. After publication, Reuters was targeted by a legal campaign to shut down critical reporting, an effort which expanded to target news organizations around the world, including MuckRock. With the help of the Electronic Frontier Foundation, MuckRock is now sharing ", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T21:39:04.862998+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "New Hutter Prize Awarded  for Even Smaller Data Compression Milestone", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://hardware.slashdot.org/story/24/02/10/0516222/new-hutter-prize-awarded-for-even-smaller-data-compression-milestone?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Since 2006 Baldrson (Slashdot reader #78,598) has been part of the team verifying \"The Hutter Prize for Lossless Compression of Human Knowledge,\" an ongoing challenge to compress a 100-MB excerpt of Wikipedia (approximately the amount a human can read in a lifetime). \n\n\"The intention of this prize is to encourage development of intelligent compressors/programs as a path to Artificial General Intelligence,\" explains the project's web site. 15 years ago, Baldrson wrote a Slashdot post explaining the logic (titled \"Compress Wikipedia and Win AI Prize\"):\n\nThe basic theory, for which Hutter provides a proof, is that after any set of observations the optimal move by an AI is find the smallest program that predicts those observations and then assume its environment is controlled by that program. Think of it as Ockham's Razor on steroids. \n\n\nThe amount of the prize also increases based on how much compression is achieved. (So if you compress the 1GB file x% better than the current re", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T21:39:00.093572+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "After 1.5-Degree Temperature Rise, What Happens Next?", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://news.slashdot.org/story/24/02/10/2040212/after-15-degree-temperature-rise-what-happens-next?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Earth had its first year-long, 1.5-degree rise in temperature. But does this mean we've already missed our goal of limiting temperature increases to 1.5 degrees? \n\nNo, argues the Washington Post:\nThere's actually some disagreement about what exactly counts as breaching that threshold &mdash; but scientists and policymakers agree that it has to be a multiyear average, not a single 12-month period. Scientists estimate that without dramatic emissions reductions, that will happen sometime in the 2030s. But there could be other single years or 12-month periods that cross the line before then. \nCan we still avoid passing 1.5C? \n\nMost scientists say passing 1.5C is inevitable. \"The 1.5-degree limit is deader than a doornail,\" Columbia University climate scientist James Hansen said in a call with reporters late last year.... The Washington Post analyzed 1,200 modeled pathways for the world to shift to clean energy and found that only four of them showed the world hitting the 1.5C tar", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T21:38:56.782049+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "To Help Rust/C++ Interoperability, Google Gives Rust Foundation $1M", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://developers.slashdot.org/story/24/02/09/216222/to-help-rustc-interoperability-google-gives-rust-foundation-1m?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous Slashdot reader shared this report from SiliconANGLE:\n\n\nThe Rust Foundation, which supports the development of the popular open-source Rust programming language... shared that Google LLC had made a $1 million contribution specifically earmarked for a C++/Rust interoperability effort known as the \"Interop Initiative.\" The initiative aims to foster seamless integration between Rust and the widely used C++ programming language, addressing one of the significant barriers to Rust's adoption in legacy systems entrenched in C++ code. \n\nRust has the ability to prevent common memory errors that plague C++ programs and offers a path toward more secure and reliable software systems. However, transitioning from C++ to Rust presents notable challenges, particularly for organizations with extensive C++ codebases. The Interop Initiative seeks to mitigate these challenges by facilitating smoother transitions and enabling organizations to leverage Rust's advantages without comple", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T18:09:09.411590+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "Microsoft Relents, Will Support VS Code On Ubuntu 18.04 For One More Year", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://developers.slashdot.org/story/24/02/10/051239/microsoft-relents-will-support-vs-code-on-ubuntu-1804-for-one-more-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Last week Microsoft's Visual Studio Code editor suddenly stopped supporting Ubuntu 18.04 LTS. \n\nBut now Microsoft \"has announced a temporary reprieve for developers who use VS Code to connect to servers, clouds, container, and other devices running on Ubuntu 18.04 LTS,\" according to the blog OMG Ubuntu:\n\nMicrosoft [had] pushed out an update to VS Code that bumps its glibc requirement, dropping support for Ubuntu 18.04 LTS (which uses an older version of glibc) in the process. Innocuous though it sounds, that move had a huge impact, leaving thousands of developers who use VS Code unable to connect to/work with devices running Ubuntu 18.04 LTS or other Linux distros using glibc 2.27, including RHEL 7, CentOS 7, and Amazon Linux 2. \n\n &mdash; \"Screwed\" was the term many of those affected used! \n\nWell, good news: Microsoft says it plans to release a 'recovery' update for VS Code soon. This will restore the ability for developers to use the text editor's remote dev tools to connec", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T16:44:39.376919+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "Recycling Plants Start Installing Trash-Spotting AI Systems", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://news.slashdot.org/story/24/02/10/0641250/recycling-plants-start-installing-trash-spotting-ai-systems?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "The world's biggest builder of recycling plants has teamed with a startup to install AI-powered systems for sorting recycling, reports the Washington Post. And now over the next few years, \"The companies plan to retrofit thousands of recycling facilities around the world with computers that can analyze and identify every item that passes through a waste plant, they said Wednesday.\"\n\n\n\"[S]orted\" recyclables, particularly plastic, wind up contaminated with other forms of trash, according to Lokendra Pal, a professor of sustainable materials engineering at North Carolina State University... [W]aste plants don't catch everything. [AI startup] Greyparrot has already installed over 100 of its AI trash spotters in about 50 sorting facilities around the world, and [co-founder Ambarish] Mitra said as much as 30 percent of potentially recyclable material winds up getting lumped in with the trash that's headed for the landfill. Failing to recycle means companies have to make more things", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T16:44:34.611941+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "California Bill Would Ban All Plastic Shopping Bags At Grocery Stores", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://news.slashdot.org/story/24/02/10/0238240/california-bill-would-ban-all-plastic-shopping-bags-at-grocery-stores?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader quotes a report from the San Francisco Standard: California would ban all plastic shopping bags in 2026 under a new bill announced Thursday in the state Legislature. California already bans thin plastic shopping bags at grocery stores and other shops, but shoppers at checkout can purchase bags made with a thicker plastic that purportedly makes them reusable and recyclable. Democratic state Sen. Catherine Blakespear said people are not reusing or recycling those bags. She points to a state study that found the amount of plastic shopping bags trashed per person grew from 8 pounds per year in 2004 to 11 pounds per year in 2021. \"It shows that the plastic bag ban that we passed in this state in 2014 did not reduce the overall use of plastic. It actually resulted in a substantial increase in plastic,\" Blakespear, a Democrat from Encinitas, said Thursday. \"We are literally choking our planet with plastic waste.\"\n \nWhile California's bag ban would apply statewide", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T13:47:33.892338+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "Gen Z Turns To Physical Books and Libraries", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://news.slashdot.org/story/24/02/10/0244210/gen-z-turns-to-physical-books-and-libraries?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Gen Z is reviving the trend of reading physical books over digital ones, with a notable increase in library visits and book purchases, as evidenced by celebrities like Kaia Gerber and Kendall Jenner promoting literature and book clubs. The Guardian reports: This week the 22-year-old model Kaia Gerber launched her own book club, Library Science. Gerber, who this month appears on the cover of British Vogue alongside her supermodel mum, Cindy Crawford, describes it as \"a platform for sharing books, featuring new writers, hosting conversations with artists we admire -- and continuing to build a community of people who are as excited about literature as I am.\" \"Books have always been the great love of my life,\" she added. \"Reading is so sexy.\"\n \nGerber isn't alone. Last year in the UK 669m physical books were sold, the highest overall level ever recorded. Research from Nielsen BookData highlights that it is print books that gen Z favour, accounting for 80% of purchases from Novemb", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T12:14:24.240368+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "Fusion Research Facility's Final Tritium Experiments Yield New Energy Record", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://science.slashdot.org/story/24/02/10/0231255/fusion-research-facilitys-final-tritium-experiments-yield-new-energy-record?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "schwit1 quotes a report from Phys.Org: The Joint European Torus (JET), one of the world's largest and most powerful fusion machines, has demonstrated the ability to reliably generate fusion energy, while simultaneously setting a world record in energy output. These notable accomplishments represent a significant milestone in the field of fusion science and engineering. In JET's final deuterium-tritium experiments (DTE3), high fusion power was consistently produced for five seconds, resulting in a ground-breaking record of 69 megajoules using a mere 0.2 milligrams of fuel.\n \nJET is a tokamak, a design which uses powerful magnetic fields to confine a plasma in the shape of a doughnut. Most approaches to creating commercial fusion favor the use of two hydrogen variants -- deuterium and tritium. When deuterium and tritium fuse together they produce helium and vast amounts of energy, a reaction that will form the basis of future fusion powerplants. Dr. Fernanda Rimini, JET Senior ", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T07:04:18.196620+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "Nine US States Are Teaming Up To Accelerate the Adoption of Heat Pumps", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://news.slashdot.org/story/24/02/09/2143235/nine-us-states-are-teaming-up-to-accelerate-the-adoption-of-heat-pumps?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader quotes a report from Wired: Death is coming for the old-school gas furnace -- and its killer is the humble heat pump. They're already outselling gas furnaces in the US, and now a coalition of states has signed an agreement to supercharge the gas-to-electric transition by making it as cheap and easy as possible for their residents to switch. Nine states have signed a memorandum of understanding that says that heat pumps should make up at least 65 percent of residential heating, air conditioning, and water-heating shipments by 2030. (\"Shipments\" here means systems manufactured, a proxy for how many are actually sold.) By 2040, these states -- California, Colorado, Maine, Maryland, Massachusetts, New Jersey, New York, Oregon, and Rhode Island -- are aiming for 90 percent of those shipments to be heat pumps.\n \n\"It's a really strong signal from states that they're committed to accelerating this transition to zero-emissions residential buildings,\" says Emily Lev", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T04:13:24.875897+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "Instagram and Threads Will Stop Recommending Political Content", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://tech.slashdot.org/story/24/02/09/2136246/instagram-and-threads-will-stop-recommending-political-content?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "In a blog post today, Meta announced that it'll stop showing political content across Instagram and Threads unless users explicitly choose to have it recommended to them. The Verge reports: Meta announced that it's expanding an existing Reels policy that limits political content from people you're not following (including posts about social issues) from appearing in recommended feeds to more broadly cover the company's Threads and Instagram platforms. \"Our goal is to preserve the ability for people to choose to interact with political content, while respecting each person's appetite for it,\" said Instagram head Adam Mosseri, announcing on Threads that the changes will be applied over the next few weeks. Facebook is also expected to roll out these new controls at a later, undisclosed date.\n \nUsers who still want to have content \"likely to mention governments, elections, or social topics that affect a group of people and/or society at large\" recommended to them can choose to tu", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T02:48:49.451306+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "With Miami Move, Jeff Bezos Proves Zip Codes Do Matter", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://news.slashdot.org/story/24/02/09/2154258/with-miami-move-jeff-bezos-proves-zip-codes-do-matter?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Longtime Slashdot reader theodp writes: Our goal,\" Amazon founder Jeff Bezos explained in a Feb. 2021 Instagram post announcing the location of a second tuition-free @BezosAcademy preschool in Tacoma, WA, \"is to unlock the potential in kids to become creative leaders, original thinkers, and lifelong learners -- regardless of their zip code.\"\n \nThree years later, a new Amazon SEC filing reveals how much zip codes can matter, even to Bezos, the third richest person in the world. GeekWire reports: \"A new Amazon [SEC] filing, detailing Jeff Bezos' plan to sell a slice of his stake in the company, sheds fresh light on his move from Seattle to Miami -- and his ability to avoid Washington state's capital gains tax [ironically, earmarked to be funneled into early-childhood education programs and school construction] in the process. The filing reveals that the Amazon founder and executive chairman adopted a trading plan Nov. 8 to sell up to 50 million Amazon shares during a period end", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T02:48:40.059175+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "David Kahn, Leading Historian of Code and Code Breaking, Dies At 93", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://it.slashdot.org/story/24/02/09/2147245/david-kahn-leading-historian-of-code-and-code-breaking-dies-at-93?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Clay Risen reports via the New York Times: David Kahn, whose 1967 book, \"The Codebreakers,\" established him as the world's pre-eminent authority on cryptology -- the science of making and breaking secret codes -- died on Jan. 24 in the Bronx. He was 93. His son Michael said the death, at a senior-living facility, was from the long-term effects of a stroke in 2015.\n \nBefore Mr. Kahn's book, cryptology itself was something of a secret. Despite an explosion in cryptological technology and techniques during the 20th century and the central role they played during World War II, the subject was typically overlooked by historians, if only because their possible sources were still highly classified. \"Codebreaking is the most important form of secret intelligence in the world today,\" Mr. Kahn wrote in his book's preface. \"Yet it has never had a chronicler.\"\n \nOver the course of more than 1,000 pages, along with some 150 pages of notes, Mr. Kahn laid out cryptology's long history, star", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T02:48:27.689810+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "Ring Video Doorbell Customers Angry At 43% Price Hike", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://news.slashdot.org/story/24/02/09/2125224/ring-video-doorbell-customers-angry-at-43-price-hike?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Longtime Slashdot reader Alain Williams shares a report from the BBC: Users of Ring video doorbells have reacted angrily to a huge price hike being introduced in March. After buying the devices, customers can pay a subscription to store footage on the cloud, download clips and get discounted products. That subscription is going up 43%, from $44 to $63 per device, per year, for basic plan customers. The firm, which is owned by Amazon, insisted it still provided \"some of the best value in the industry.\" Its customers appear not to to agree.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ring+Video+Doorbell+Customers+Angry+At+43%25+Price+Hike%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F02%2F09%2F2125224%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F02%2F09%", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T01:13:45.875054+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "Huawei's Offices In France Raided By Financial Prosecutors", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://slashdot.org/story/24/02/09/2119251/huaweis-offices-in-france-raided-by-financial-prosecutors?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "The French offices of Chinese tech giant Huawei were raided by financial prosecutors this week, the company confirmed Friday. CNN reports: A French judicial source told CNN Thursday that the raid had been carried out as part of a preliminary probe launched by the financial prosecutor's office over alleged \"breach of probity,\" a broad term concerning offenses such as acts of corruption, favoritism and influence peddling. The source did not provide any further details about the investigation. A preliminary investigation does not imply any wrongdoing.\n \n\"Huawei has been in France for over 20 years, and has been in compliance with the laws and regulations applicable in the country. While Huawei France does not wish to comment on an ongoing investigation, the company remains confident about its conclusions,\" a spokesperson said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Huawei's+Offices+In+France+Raided+By+Financial+Prosecutors%3A+ht", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T01:13:43.149106+00:00", "language": "en-us"}, {"thumbnail": null, "comments": [], "title": "Security Flaw In a Popular Smart Helmet Allowed Silent Location Tracking", "age": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "user": null, "page_rating": 0, "permanent": false, "link": "https://yro.slashdot.org/story/24/02/09/2132201/security-flaw-in-a-popular-smart-helmet-allowed-silent-location-tracking?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader quotes a report from TechCrunch: The maker of a popular smart ski and bike helmet has fixed a security flaw that allowed the easy real-time location tracking of anyone wearing its helmets. Livall makes internet-connected helmets that allow groups of skiers or bike riders to talk with each other using the helmet's in-built speaker and microphone, and share their real-time location in a friend's group using Livall's smartphone apps. Ken Munro, founder of U.K. cybersecurity testing firm Pen Test Partners, said Livall's smartphone apps had a simple flaw allowing easy access to any group's audio chats and location data. Munro says the two apps, one for skiers and one for bike riders, collectively have about a million users.\n \nAt the heart of the bug, Munro found that anyone using Livall's apps for group audio chat and sharing their location must be part of the same friends group, which could be accessed using only that group's six-digit numeric code. \"That 6-di", "page_rating_votes": 0, "page_rating_contents": 0, "source_obj__id": 607, "dead": false, "tags": [], "vote": 0, "artist": "help@slashdot.org", "album": "", "bookmarked": false, "page_rating_visits": 0, "date_published": "2024-02-10T01:13:38.535207+00:00", "language": "en-us"}]