[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T23:43:00.604146+00:00", "description": "Friday America's Federal Trade Commission brought action against three companies for \"anticompetitive and unfair\" practices \"that have artificially inflated the list price of insulin.\" \n\nFor years, many of the millions of Americans who need insulin to survive \"have been forced to pay exorbitant prices for a product that's inexpensive to make,\" writes NPR. \"Now, the federal government is targeting one part of the system behind high insulin prices.\"\n\n\nWhile out-of-pocket costs have gone down for many people to $35 a month, questions remain on how the drug became so expensive in the first place. In a new lawsuit filed Friday, the Federal Trade Commission said it's going after one link in the chain: pharmacy benefit managers. The FTC brought action against the top pharmacy benefit managers (PBMs) &mdash; CVS Health's Caremark Rx, Cigna's Express Scripts, and United Health Group's OptumRx &mdash; saying the companies created a \"perverse drug rebate system\" that artificially inflates the co", "id": 1188968, "language": null, "link": "https://science.slashdot.org/story/24/09/21/2249241/americas-ftc-sues-insulin-middlemen-who-artificially-inflated-drug-price?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "America's FTC Sues Insulin Middlemen Who 'Artificially Inflated' Drug Price", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T22:38:22.522607+00:00", "description": "It's hypothetically capable of \"delivering an exquisite portrait of the detailed surface features of any exoplanet within 100 light-years...\" writes Space.com. \n\n\"It would be better than any telescope we could possibly build in any possible future for the next few hundred years...\"\n\n\nWhile the sun may not look like a traditional lens or mirror, it has a lot of mass. And in Einstein's theory of general relativity, massive objects bend space-time around them. Any light that grazes the surface of the sun gets deflected and, instead of continuing in a straight line, heads toward a focal point, together with all the other light that grazes the sun at the same time... The \"solar gravitational lens\" leads to an almost unbelievably high resolution. It's as if we had a telescope mirror the width of the entire sun. An instrument positioned at the correct focal point would be able to harness the gravitational warping of the sun's gravity to allow us to observe the distant universe with a jaw-dro", "id": 1188850, "language": null, "link": "https://science.slashdot.org/story/24/09/21/0634254/could-we-turn-the-sun-into-an-extremely-powerful-telescope?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Could We Turn the Sun Into an Extremely Powerful Telescope?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T21:34:43.286533+00:00", "description": "X's struggles in Brazil got this update from the Guardian Wednesday:\n\nIn a statement tweeted from X's global government affairs account, the company said the restoration of service was an \"inadvertent and temporary\" side-effect of switching network providers. \n\nBut Friday \"After defying court orders in Brazil for three weeks, Mr. Musk's social network, X, has capitulated,\" writes the New York Times. \"In a court filing on Friday night, the company's lawyers said that X had complied with orders from Brazil's Supreme Court in the hopes that the court would lift a block on its site.\" \n\n\"The company's lawyers said X had complied with the court's orders &mdash; blocking designated accounts, paying fines, and naming a new formal representative in the country,\" writes TechCrunch (citing reporting by the New York Times):\n\nIn a filing of its own, the Supreme Court reportedly responded by telling X it had not provided the proper paperwork and giving it five days to do so.... \n\nX came back online", "id": 1188686, "language": null, "link": "https://yro.slashdot.org/story/24/09/21/2018239/new-x-court-filing-says-its-complying-with-brazils-orders-to-block-accounts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "New X Court Filing Says It's Complying with Brazil's Orders to Block Accounts", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T20:29:50.925787+00:00", "description": "The Washington Post reports:\n\nAn international team of scientists published a peer-reviewed paper Thursday saying genetic evidence indicates the coronavirus pandemic most likely originated with a natural spillover from an animal or animals sold in a market in Wuhan, China, where many of the first human cases of covid-19 were identified. The paper, which appears in the journal Cell, does not claim to prove conclusively that the pandemic began in the Huanan Seafood Wholesale Market, and it is unlikely to end the acrimonious and politicized debate over the coronavirus's origin... \"The results we see are consistent with infected animals, but we cannot prove that they were,\" said Florence D&eacute;barre, an evolutionary biologist at the French National Center for Scientific Research and a co-author of the new paper... \n\nMany of the 23 authors of the paper are known to have long supported a market origin for the virus. In an informal report in March 2023, they presented a central feature of", "id": 1188452, "language": null, "link": "https://science.slashdot.org/story/24/09/21/0354252/scientists-again-link-covid-pandemic-origin-to-wuhan-market-animals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Scientists Again Link Covid Pandemic Origin to Wuhan Market Animals", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T19:24:43.679820+00:00", "description": "Slashdot first covered Saul Justin Newman's work in 2019. \n\nNow a senior research fellow at the Centre for Longitudinal Studies at University College London, Newman was recognized last week for research finding that most claims of people living over 105 are wrong. Newman's research was honored with an Ig Nobel Prize (awarded for research that makes people \"laugh then think\") &mdash; which led to a thought-provoking interview in the Conversation:\n\n\nNewman: In general, the claims about how long people are living mostly don't stack up. I've tracked down 80% of the people aged over 110 in the world (the other 20% are from countries you can't meaningfully analyse). Of those, almost none have a birth certificate. In the U.S. there are over 500 of these people; seven have a birth certificate. Even worse, only about 10% have a death certificate. \n\nThe epitome of this is blue zones, which are regions where people supposedly reach age 100 at a remarkable rate. For almost 20 years, they have bee", "id": 1188268, "language": null, "link": "https://science.slashdot.org/story/24/09/21/065251/researcher-wins-award-for-debunking-longer-life-expectancies-in-blue-zones?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Researcher Wins Award For Debunking Longer Life Expectancies in 'Blue Zones'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T18:19:46.258614+00:00", "description": "Meta (the parent company of Facebook, Instagram, and Threads) announced Monday that Russian state media outlets like RT are now \"banned from our apps globally for foreign interference activity,\" reports CNN. \n\nCNN adds that Meta is alleging that the \"Kremlin-controlled networks\" have \"engaged in deceptive influence operations and attempted to evade detection... Prior to Monday's ban, RT had 7.2 million followers on Facebook and 1 million followers on Instagram.\"\n\nThe move comes days after the US Justice Department announced charges against two RT employees for funneling nearly $10 million into a US company, identified by CNN as Tenet Media, to create and amplify content that aligned with Russian interests. The covert influence campaign was aimed at the American public ahead of the 2024 US presidential election, US officials said. \n\nLast week the U.S. State department \"revealed declassified U.S. intelligence findings that suggest RT is fully integrated into Russia's intelligence operat", "id": 1188066, "language": null, "link": "https://tech.slashdot.org/story/24/09/21/0430237/meta-and-youtube-ban-russian-state-media-for-foreign-interference?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta and YouTube Ban Russian State Media for 'Foreign Interference'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T17:14:43.922566+00:00", "description": "\"In the era of the open source rug pull, the role of open source foundations is more important than ever,\" argues the co-founder of the developer-focused industry analyst firm RedMonk:\n\n\n The \"rug pull\" here refers to companies that have used open source as a distribution mechanism, building a community and user base, before changing the license to be restricted, rather than truly open source. \"This is capitalism, yo. We've got shareholders to satisfy. It's time to relicense that software, move to a Business Source license.\" [...] Where open source used to be a sustainable commitment, today too often it feels like a short term tactic. Commercial open source isn't what it used to be. \n\nWhich means that open source foundations, which provide ongoing governance and intellectual property management for open source projects, are in an interesting position, in some cases becoming more adversarial than they historically have been with vendors.... [T]he Apache Software Foundation (ASF) has do", "id": 1187813, "language": null, "link": "https://news.slashdot.org/story/24/09/21/0530234/as-companies-try-open-source-rug-pull-open-source-foundations-considered-helpful?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "As Companies Try 'Open Source Rug Pull', Open Source Foundations Considered Helpful", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T16:10:12.525003+00:00", "description": "Friday the Wall Street Journal reported Qualcomm recently \"made a takeover approach\" to Intel, which has a market value of roughly $90 billion (\"according to people familiar with the matter...\")\nA deal is far from certain, the people cautioned. Even if Intel is receptive, a deal of that size is all but certain to attract antitrust scrutiny, though it is also possible it could be seen as an opportunity to strengthen the U.S.'s competitive edge in chips... Both Intel and Qualcomm have become U.S. national champions of sorts as chip-making gets increasingly politicized. Intel is in line to get up to $8.5 billion of potential grants for factories in the U.S. as Chief Executive Pat Gelsinger tries to build up a business making chips on contract for outsiders... \nBoth Intel and Qualcomm have been \"overshadowed\" by Nvidia's success in powering the AI boom, the article points out. \n\nBut \"To get the deal done, Qualcomm could intend to sell assets or parts of Intel to other buyers... A deal wou", "id": 1187624, "language": null, "link": "https://hardware.slashdot.org/story/24/09/21/1035249/qualcomm-approached-intel-about-a-takeover?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Qualcomm Approached Intel About a Takeover", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T15:04:52.211374+00:00", "description": "Instead of eliminating jobs, self-service kiosks at McDonald's and other fast-food chains \"have added extra work for kitchen staff,\" reports CNN &mdash; and as a bonus, \"pushed customers to order more food than they do at the cash register...\"\n\n\nKiosks \"guarantee that the upsell opportunities\" like a milkshake or fries are suggested to customers when they order, Shake Shack CEO Robert Lynch said on an earnings call last month. \"Sometimes that is not always a priority for employees when you've got 40 people in line. You're trying to get through it as quick as possible.\" Kiosks also shift employees from behind the cash register to maintaining the dining area, delivering food to customers or working in the kitchen, he said. [Although a study from Temple University researchers found long lines at a kiosk stress customers &mdash; making them order less.] \n\nSome McDonald's franchisees &mdash; which own and operate 95% of McDonald's in the United States &mdash; are now rolling out kiosks tha", "id": 1187353, "language": null, "link": "https://it.slashdot.org/story/24/09/21/0212212/do-self-service-kiosks-actually-increase-employment-at-fast-food-restaurants?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Do Self-Service Kiosks Actually Increase Employment at Fast-Food Restaurants? ", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T12:56:28.347049+00:00", "description": "The world's biggest technology companies have embarked on a final push to persuade the European Union to take a light-touch approach to regulating AI as they seek to fend off the risk of billions of dollars in fines. From a report: EU lawmakers in May agreed the AI Act, the world's first comprehensive set of rules governing the technology, following months of intense negotiations between different political groups. But until the law's accompanying codes of practice have been finalised, it remains unclear how strictly rules around \"general purpose\" AI (GPAI) systems, such as OpenAI's ChatGPT will be enforced and how many copyright lawsuits and multi-billion dollar fines companies may face. \n\nThe EU has invited companies, academics, and others to help draft the code of practice, receiving nearly 1,000 applications, an unusually high number according to a source familiar with the matter who requested anonymity because they were not authorised to speak publicly. The AI code of practice wi", "id": 1186878, "language": null, "link": "https://tech.slashdot.org/story/24/09/20/1753208/tech-giants-push-to-dilute-europes-ai-act?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Tech Giants Push To Dilute Europe's AI Act", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T11:51:48.288699+00:00", "description": "American Battery Technology and lithium-producer Albemarle are among 25 companies getting more than $3 billion in funding from the Biden administration to boost domestic production of advanced batteries and components. From a report: The funding -- part of a broader White House goal of creating an American battery supply chain -- is going to projects that are building, expanding or retrofitting facilities to process critical minerals, build components and batteries and recycle materials, the Energy Department said Friday. \n\nAmerican Battery Technology received $150 million to build a commercial-scale lithium-ion battery recycling facility in South Carolina. Albemarle is getting $67 million to retrofit a facility to manufacture commercial anode material for next-generation lithium-ion batteries around Charlotte, North Carolina. Other projects included $50 million for Cabot and $225 million for SWA Lithium, a joint venture of Standard Lithium and Equinor.\nBatteries -- which are used for", "id": 1186648, "language": null, "link": "https://news.slashdot.org/story/24/09/20/1723225/us-awards-3-billion-to-boost-domestic-battery-production?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Awards $3 Billion To Boost Domestic Battery Production", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T08:36:04.527504+00:00", "description": "A massive Antarctic glacier, dubbed the \"Doomsday Glacier,\" is melting at an accelerating rate and could be approaching irreversible collapse, international researchers are reporting. The Thwaites Glacier, holding enough ice to raise global sea levels by over two feet, has seen rapid retreat in the past 30 years. \n\nScientists from the International Thwaites Glacier Collaboration used ice-breaking ships and underwater robots to study the glacier up close since 2018. Their findings reveal warm ocean water funneling through deep cracks in the ice, causing unexpected melting patterns. While computer modeling suggests catastrophic cliff collapse is less likely than feared, researchers project Thwaites and the Antarctic Ice Sheet could disintegrate within 200 years. This collapse could ultimately lead to 10 feet of sea level rise, devastating coastal communities worldwide.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=An", "id": 1186003, "language": null, "link": "https://news.slashdot.org/story/24/09/20/190253/antarctic-doomsday-glacier-melting-faster-scientists-warn?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Antarctic 'Doomsday Glacier' Melting Faster, Scientists Warn", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T05:21:19.434545+00:00", "description": "A national \"butterfly emergency\" has been declared by Butterfly Conservation after the lowest Big Butterfly Count since records began. From a report: An average of just seven butterflies per 15-minute count were recorded by participants in this summer's butterfly count, the lowest in the survey's 14-year history. It was the worst year on record for once-ubiquitous species, including the common blue, small tortoiseshell, small white and green-veined white. Eight out of the 10 most-seen species have declined -- in many cases dramatically -- over the count's history. Previous lowest-ever numbers of butterflies-per-count were logged in 2022, 2021 and 2020. \n\nButterfly Conservation is calling for the government to declare a \"nature emergency\" and ban insect-killing neonicotinoid pesticides, with no exceptions. Britain and the EU banned neonicotinoids in 2018 but the UK government has authorised an exemption for the pesticides to be used on sugar beet every year since 2021. Before the elect", "id": 1185570, "language": null, "link": "https://news.slashdot.org/story/24/09/20/180221/butterfly-emergency-declared-as-uk-summer-count-hits-record-low?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'Butterfly Emergency' Declared as UK Summer Count Hits Record Low", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T02:06:17.452249+00:00", "description": "Sandvine, the makers of surveillance-ware that allowed authoritarian countries to censor the internet and spy on their citizens, announced that it is leaving dozens of \"non-democratic\" countries as part of a major overhaul of the company. From a report: The company, which was founded in Canada, published a statement on Thursday, claiming that it now wants to be \"a technology solution leader for democracies.\" As part of this new strategy, Sandvine said it has already left 32 countries and is in the process of leaving another 24 countries. \n\nSandvine did not name the 56 countries, apart from Egypt, where Sandvine promised to leave by the end of March 2025. For the remaining countries -- including non-government customers in Egypt -- the \"end-of-service\" date will be the end of 2025. This change in the company's direction comes after years of investigations by Bloomberg, which reported that Sandvine had sold its internet surveillance products to authoritarian regimes, including Belarus, ", "id": 1185201, "language": null, "link": "https://yro.slashdot.org/story/24/09/20/1944244/internet-surveillance-firm-sandvine-says-its-leaving-56-non-democratic-countries?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Internet Surveillance Firm Sandvine Says It's Leaving 56 'Non-Democratic' Countries", "vote": 0}]