[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T15:30:03+00:00", "description": "Havik has never really been one of the more prominent Mortal Kombat characters, to the extent that, in terms of pure screen time, he actually hasn’t been around too much. But as series fans know very well, the amount of time a Mortal Kombat character gets on screen isn’t always representative of how interesting that character is, or how popular they are. \n\nHavik is certainly one such character. The self- dubbed agent of chaos has been around for a while, but hasn’t been around too often. With the upcoming Mortal Kombat 1 expansion, Khaos Reigns, Havik is set to take on a much more prominent role though, so ahead of its release, here, we’re going to go over the character’s full story across the entire Mortal Kombat series so far.", "id": 1187466, "language": null, "link": "https://www.youtube.com/watch?v=JGvH718cWjw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/JGvH718cWjw/hqdefault.jpg", "title": "The Komplete Story of Havik - Before You Play Mortal Kombat 1: Khaos Reigns [4K]", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T13:30:11+00:00", "description": "Final Fantasy 16 is a dark fantasy game that revolves around Clive Rosfield who, after being betrayed by his own family, sets off to get revenge on the person he believes is responsible for the death of his brother. \n\nAlong the way, Clive meets Cid and starts aiding his efforts to help NPCs escape and make a life for themselves. While Final Fantasy 16 is already (rightfully) accepted as a fantastic new entry in the genre, the PC version is also a great release that will undoubtedly bring more players to it than the original PS5-exclusive release could manage. \n\nThe PC version also gives players plenty of options, and runs fantastically with smooth frame rates and excellent visuals.", "id": 1186990, "language": null, "link": "https://www.youtube.com/watch?v=K7hpH8XfSqQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/K7hpH8XfSqQ/hqdefault.jpg", "title": "Final Fantasy 16 PC Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T11:30:26+00:00", "description": "Factory-building and automation games aren't for everyone. The focus isn't on story or characterization, though Satisfactory isn't necessarily barren in either department. The presentation is gorgeous, with incredible environments, lighting effects, shadows, and animations, while the map is full of unique places to explore.\n\nBut none of that is the point. The point is gathering resources, manufacturing, shipping, and expanding further. Creating networks of conveyor belts and pipes, automating processes, battling hostile creatures, building better tools, researching new materials, optimizing the process and ensuring greater efficiency.\n\nIt's an addictive gameplay loop that Factorio fans will know well. Satisfactory is no slouch in that regard, offering an extensive array of buildings and tools to unlock, new technologies to harness, and even more ways to grow the factory. You'll sink a lot of time into it to complete the \"story\", but the gameplay and pay-off make it all worth it.\n\nNote", "id": 1186630, "language": null, "link": "https://www.youtube.com/watch?v=Wpm7GQgoHcU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/Wpm7GQgoHcU/hqdefault.jpg", "title": "Satisfactory Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-21T09:30:19+00:00", "description": "By now, many are aware of Firewalk Studios' Concord, a multiplayer hero shooter with a Guardians of the Galaxy-esque cast and original sci-fi setting. Despite eight years in development, it was pulled from sale and servers taken down in less than two weeks after reportedly selling 25,000 copies.\n\nIt's a failure, for sure, and one of Sony's biggest in years, but that's not all. Reports indicate that director Ryan Ellis has stepped down, and the team is unsure of the studio's future. Maybe it could become a development partner for other PlayStation Studios projects, but fears of Firewalk Studios shutting down are reportedly circulating internally.\n\nAmid all this is an alleged peak at how things may have gone wrong. Join us as we delve deeper into the post-shuttering of Concord and why it may not make a triumphant return after all.", "id": 1186297, "language": null, "link": "https://www.youtube.com/watch?v=xn1wn1jlf7c", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/xn1wn1jlf7c/hqdefault.jpg", "title": "Concord's Fate Has Seemingly Gone From Bad To Worse", "vote": 0}]