[{"source": "https://www.gamespot.com/feeds/mashup", "title": "The Best Co-Op Games Of 2023 According To Metacritic", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4235903-best-reviewed-co-op-games_gs-best-of_2023_1.jpg\" /><br /><h3><p dir=\"ltr\">Video games at their best are shared social events, and in 2023, there were a ton of great games focused on co-op fun. While we've seen plenty of competitive multiplayer games this year like Street Fighter 6, Counter-Strike 2, and Mortal Kombat 1, some of the most memorable moments of the year came from games that encouraged teamwork and cooperation. Yes, some of them encouraged violent tag-team action as you explored the depths of hell and hostile alien worlds, but many of the best co-op games also encouraged fun and freedom.</p><p>Thanks to all the data gatherby our sister site Metacritic, we can see exactly which games rose to the top of the co-op pile. Plenty of review outlets across the globe were busy engaging in some online fun, and the list below reveals a surprisingly mixed collection of genres and well-known game franchi", "link": "https://www.gamespot.com/gallery/the-best-co-op-games-of-2023-according-to-metacritic/2900-4999", "date_published": "2023-12-17T19:00:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GameSpot", "album": "GameSpot", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "2023's Hidden Gems: The Best Games You May Have Missed", "description": "<p><h2>There are many lesser-known games also worth your time and attention.</h2><img src=\"https://www.gamespot.com/a/uploads/scale_large/1179/11799911/4236130-hiddem-gems_gs-best-of_2023_1.jpg\" /><br /><h3><p dir=\"ltr\">As a fan of games, it can be challenging not to get caught up in the hype. Whether it's because it's part of an established franchise, the publisher had a huge marketing budget, or whatever else, some games are inescapable.</p><p>Having named our picks for the <a href=\"https://www.gamespot.com/gallery/gamespots-10-best-games-of-2023/2900-4972/\">10 best games of 2023</a>, as well as our <a href=\"https://www.gamespot.com/gallery/best-of-2023-our-favorite-games-that-didnt-make-the-top-10/2900-4993/\">personal favorites that didn't make that list</a>, we also wanted to be sure to call attention to some <em>more </em>of the year's best games, with a focus on games you might have missed or otherwise haven't heard of. There's no perfect formula for determining such a category", "link": "https://www.gamespot.com/gallery/2023s-hidden-gems-the-best-games-you-may-have-missed/2900-5003", "date_published": "2023-12-17T18:00:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GameSpot", "album": "GameSpot", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "Why Pop Culture Loves The RPG-7 - Loadout", "description": "<img height=\"480\" src=\"https://www.gamespot.com/a/uploads/square_medium/1571/15719603/4234933-loadout_rpg7_site.jpg\" width=\"480\" /> From Call of Duty to Resident Evil, the RPG-7 is the quintessential pop culture rocket launcher. It’s a weapon that has often been used to dial up the explosive action in movies and video games for decades even if those depictions haven’t always been entirely accurate.  With the help of Keeper of Firearms &amp; Artillery, Jonathan Ferguson, we’ve come to the Royal Armouries museum in the UK to learn more about  the RPG-7’s real world and pop culture history, and examine how games portray this iconic weapon.", "link": "https://www.gamespot.com/videos/why-pop-culture-loves-the-rpg-7-loadout/2300-6463087", "date_published": "2023-12-17T15:00:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GameSpot", "album": "GameSpot", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.gamespot.com/feeds/mashup", "title": "The Best RPGs of 2023 According To Metacritic", "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4234883-best-reviewed-rpgs_gs-best-of_2023_1.jpg\" /><br /><h3><p>Video games are a great form of escapist entertainment, and within them, it's hard to beat RPGs when it comes to distancing yourself from reality. Games of fantasy and magic, sci-fi adventures, and grim descents into new territory are where the RPG genre flexes its versatile muscles. A healthy mix of games saw fans revel in modern takes on beloved classics, bold reinventions of established franchises, and spin-offs that explored new ground.</p><p>While some of the entries on the list are completely expected, you'll also find several surprises below. In fact, a vast chunk of the entries below consist of games that were largely overshadowed by the constant release of AAA games. They might be niche games, but to the people who adore this genre, several of them were the best entries yet in long-running franchises. We've gathered up all of the games th", "link": "https://www.gamespot.com/gallery/the-best-rpgs-of-2023-according-to-metacritic/2900-4991", "date_published": "2023-12-17T14:00:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GameSpot", "album": "GameSpot", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]