[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-19T17:00:13+00:00", "description": "<p>The first half of 2024 has proven to be yet another brilliant year for fans of dark and grimdark fantasy and science fiction. From brutal vampire societies, to AI cities dying, insects at war, and some good ol&#8217; fashioned dragon slaying, there is something on our list for just about everybody. We are incredibly fortunate to have been provided with heaps of amazing review opportunities so far this year, and from that we give you our team&#8217;s choices for the best of dark and grimdark SFF so far in 2024. Empire of the Damned by Jay Kristoff Empire of the Damned delivers many moments of high-intensity, including memorable showdowns, exchanges, and unpredictability, with very little going the way expected or in Gabriel’s favour. Certain scenes may arguably be over the top yet Empire of the Damned is an undeniably addictive and fun read. Read the rest of our review, here. About the book From holy cup comes holy light; The faithful hands sets world aright. And in the Seven Martyr", "id": 896040, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/the-best-dark-fantasy-and-science-fiction-books-of-2024-so-far", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "The best dark fantasy and science fiction books of 2024 so far", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-19T04:25:35+00:00", "description": "<p>The Hod King is the third volume in Josiah Bancroft’s masterful Books of Babel tetralogy, combining the best features of the first two books of the series, Senlin Ascends and Arm of the Sphinx, while bringing new emotional depth to this tragic story. The lead protagonist of the series is Thomas Senlin, a rural schoolteacher on his honeymoon at the famed Tower of Babel. Although Senlin considers himself to be well-educated on all things Babel-related, his scholarly knowledge is no match for the overwhelming chaos of the real Tower. Senlin’s hubris gets the best of him as he immediately loses his bride, Marya, near the entrance of the Tower. The main plotline of the series concerns Senlin’s quest to rescue Marya from the labyrinthine Tower. The Tower of Babel is an overwhelmingly massive structure, taller than any modern skyscraper. The building is divided into layers called “ringdoms,” each with its own peculiar culture and politics. In the first book, Senlin Ascends, our hero strug", "id": 892525, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-the-hod-king-by-josiah-bancroft", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: The Hod King by Josiah Bancroft", "user": null, "vote": 0}]