[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T23:44:56.607168+00:00", "description": "OpenAI and Microsoft will give grants of up to $10 million to bring more AI tools into the newsroom. The grants will go to Chicago Public Media, the Minnesota Star Tribune, Newsday (in Long Island, NY), The Philadelphia Inquirer and The Seattle Times. \"Each of the publications will hire a two-year AI fellow to develop projects for implementing the technology and improving business sustainability,\" reports Engadget. \"Three more outlets are expected to receive fellowship grants in a second round.\" From the report: OpenAI and Microsoft are each contributing $2.5 million in direct funding as well as $2.5 million in software and enterprise credits. The Lenfest Institute of Journalism is collaborating with OpenAI and Microsoft on the project, and announced the news today.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI%2C+Microsoft+Funding+%2410+Million+In+Grants+For+AI-Powered+Journalism%3A+https%3A%2F%2Fnews.slash", "id": 1371933, "language": null, "link": "https://news.slashdot.org/story/24/10/22/2045216/openai-microsoft-funding-10-million-in-grants-for-ai-powered-journalism?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI, Microsoft Funding $10 Million In Grants For AI-Powered Journalism", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T23:44:56.325773+00:00", "description": "An anonymous reader quotes a report from Wired: When Canadian developer Peter Todd found out that a new HBO documentary, Money Electric: The Bitcoin Mystery, was set to identify him as Satoshi Nakamoto, the creator of Bitcoin, he was mostly just pissed. \"This was clearly going to be a circus,\" Todd told WIRED in an email. The identity of the person -- or people -- who created Bitcoin has been the subject of speculation since December 2010, when they disappeared from public view. The mystery has proved all the more irresistible for the trove of bitcoin Satoshi is widely believed to have controlled, suspected to be worth many billions of dollars today. When the documentary was released on October 8, Todd joined a long line of alleged Satoshis.\n \nDocumentary maker Cullen Hoback, who in a previous film claimed to have identified the individual behind QAnon, laid out his theory to Todd on camera. The confrontation would become the climactic scene of the documentary. But Todd nonetheless cl", "id": 1371932, "language": null, "link": "https://slashdot.org/story/24/10/22/217235/peter-todd-in-hiding-after-being-unmasked-as-bitcoin-creator-satoshi-nakamoto?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Peter Todd In Hiding After Being 'Unmasked' As Bitcoin Creator Satoshi Nakamoto", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T22:40:06.665675+00:00", "description": "The FAA has released final regulations for electric vertical takeoff and landing (eVTOL) vehicles, introducing a new category of aircraft for the first time in nearly 80 years. These rules provide a framework for pilot training and operational requirements, addressing industry concerns while aiming to support the future of advanced air mobility. The Verge reports: The FAA says these &#226;oepowered-lift&#226; vehicles will be the first completely new category of aircraft since helicopters were introduced in 1940. These aircraft will be used for a variety of services, including air taxis, cargo delivery, and rescue and retrieval operations. The final rules published today contain guidelines for pilot training as well as operational requirements regarding minimum safe altitudes and visibility. [...] Powered lift includes aircraft described by industry watchers as electric vertical takeoff and landing, or eVTOL. Using tilt rotors, eVTOL aircraft are designed to take off and land vertical", "id": 1371597, "language": null, "link": "https://news.slashdot.org/story/24/10/22/2038234/air-taxis-and-other-electric-powered-aircraft-cleared-for-takeoff?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Air Taxis and Other Electric-Powered Aircraft Cleared For Takeoff", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T21:35:09.850362+00:00", "description": "On July 4, 2012, CERN physicist Fabiola Gianotti announced a major quantum field theory discovery using a PowerPoint presentation in Comic Sans, sparking both mockery and debate. The font, created by Vincent Connare for Microsoft Bob in 1994, featured deliberately imperfect letters inspired by comic books. Comic Sans shipped with Windows 95 and exploded in popularity as personal computing democratized typography. A backlash emerged as the font appeared on everything from funeral notices to museum signs, culminating in Dave and Holly Combs's \"Ban Comic Sans\" campaign.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Comic+Sans+Got+the+Last+Laugh%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F10%2F22%2F1913222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.or", "id": 1371299, "language": null, "link": "https://science.slashdot.org/story/24/10/22/1913222/comic-sans-got-the-last-laugh?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Comic Sans Got the Last Laugh", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T21:35:09.749306+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Qualcomm has a new chip for flagship phones, and the best part is that it uses an improved version of the Oryon CPU architecture that the Snapdragon X Elite chips brought to Windows PCs earlier this year. The Snapdragon 8 Elite is the follow-up to last year's Snapdragon 8 Gen 3 -- yet another change to the naming convention that Qualcomm uses for its high-end phone chips, though, as usual, the number 8 is still involved. The 8 Elite uses a \"brand-new, 2nd-generation Qualcomm Oryon CPU\" with clock speeds up to 4.32 GHz, which Qualcomm says will improve performance by about 45 percent compared to the Snapdragon 8 Gen 3.\n \nRather than a mix of large, medium, and small CPU cores as it has used in the past, the 8 Elite has two \"Prime\" cores for hitting that high peak clock speed, while the other six are all \"Performance\" cores that peak at a lower 3.53 GHz. But it doesn't look like Qualcomm is using a mix of different CPU architectures", "id": 1371298, "language": null, "link": "https://hardware.slashdot.org/story/24/10/22/2027218/qualcomm-brings-laptop-class-cpu-cores-to-phones-with-snapdragon-8-elite?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Qualcomm Brings Laptop-Class CPU Cores To Phones With Snapdragon 8 Elite", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T20:30:20.549328+00:00", "description": "More than 10,500 artists and creators -- including ABBA's Bjorn Ulvaeus, actress Julianne Moore, actors Kevin Bacon and F. Murray Abraham, as well as former Saturday Night Live star Kate McKinnon, author James Patterson and Radiohead's Thom Yorke -- signed a statement condemning AI companies' unauthorized use of creative works for training their models. The initiative, led by former AI executive Ed Newton-Rex, demands an end to unlicensed training data collection amid mounting legal challenges against tech firms. \"The unlicensed use of creative works for training generative AI is a major, unjust threat to the livelihoods of the people behind those works, and must not be permitted,\" reads the statement. \n\nThe protest comes as major artists and publishers battle AI developers in court. Authors John Grisham and George R.R. Martin are suing OpenAI, while record labels Universal, Sony and Warner have filed lawsuits against AI music creators Suno and Udio. The signatories reject proposed \"o", "id": 1370905, "language": null, "link": "https://tech.slashdot.org/story/24/10/22/194248/more-than-10500-artists-unite-in-fight-against-ai-companies-unjust-use-of-creative-works?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "More Than 10,500 Artists Unite in Fight Against AI Companies' 'Unjust' Use of Creative Works", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T19:27:12.702917+00:00", "description": "The first cracks are starting to show in Netflix's push into gaming. The Verge: First reported in Game File and confirmed by Netflix, the streaming company has quietly closed of one of its studios, the first in the three years since the company began its foray into gaming. \n\nAccording to Game File, the shuttered studio was known as Blue. In 2022, Netflix announced it hired former Overwatch executive producer Chacko Sonny to run the studio. Since then, Blue had brought on a number of game industry veterans with experience working on high profile franchises including Halo and God of War. Reportedly, Blue was developing a multi-platform AAA game for an original IP but was closed before the game could be announced or released.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Netflix+Closes+AAA+Game+Studio+Before+It+Ever+Released+a+Game%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F10%2F22%2F1829256%2F%3Futm_source%3D", "id": 1370571, "language": null, "link": "https://games.slashdot.org/story/24/10/22/1829256/netflix-closes-aaa-game-studio-before-it-ever-released-a-game?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Netflix Closes AAA Game Studio Before It Ever Released a Game", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T19:27:12.427860+00:00", "description": "The UK parliament is considering clamping down on how young people use smartphones. A bill brought forward by a Labour member of parliament proposes both banning phones in schools and raising the age at which children can consent to social media companies using their data. Wired: Calls for smartphone bans have been growing in the UK, driven by fears that the devices are driving a decline in kids' mental health and ability to focus. Smartphone Free Childhood, a prominent pressure group inspired by Jonathan Haidt's book The Anxious Generation, calls for parents to delay getting smartphones for their children until they are at least 13. Florida has already passed a law that bans under-14s from holding social media accounts, and Australia is considering similar restrictions. \n\nBut academics warn that smartphone and social media bans are unlikely to be a catch-all solution to the problems facing young people. Experts on the impact of digital technologies argue that the legislation could en", "id": 1370570, "language": null, "link": "https://news.slashdot.org/story/24/10/22/1848224/uk-considers-new-smartphone-bans-for-children?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "UK Considers New Smartphone Bans for Children", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T18:25:06.151557+00:00", "description": "The Financial Times: In the paediatric centre at one of London's largest hospitals, doctors are confounded each day by a ward computer that is not connected to a printer. The computer is used for managing the daily list of patients. Doctors can only access and update the list, using one shared account. So twice a day, two doctors on the ward said one of them had to log in to this computer, update the patient list, send the list to themselves via NHS email, and then log in to another nearby computer to print it off for the team. \"I am at a top London hospital and yet at times I feel as though we are operating in the Stone Age,\" said one paediatrician on the ward. \n\nTackling the frustrating delays caused by outdated technology [Editor's note: non-paywalled link] is one of health secretary Wes Streeting and Prime Minister Sir Keir Starmer's core missions, having vowed to shift the service \"from an analogue to a digital NHS.\" The monumental task of moving the world's largest publicly fund", "id": 1370217, "language": null, "link": "https://news.slashdot.org/story/24/10/22/1717236/operating-in-the-stone-age-nhs-staffs-daily-struggle-with-outdated-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'Operating in the Stone Age': NHS Staff's Daily Struggle With Outdated Tech", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T18:25:05.710382+00:00", "description": "An anonymous reader shares a post: EVs are still winning. But they haven't won yet; only 4% of the global passenger car fleet, 23% of the bus fleet, and less than 1% of delivery trucks are electrified. \n\nBut at this point I think the writing is on the wall. The phenomenon of a superior technology displacing an older, inferior technology is not uncommon, and it generally looks like the EV transition is looking now. When a new technology passes a 5% adoption rate, it almost never turns out to be inferior to what came before; with EVs, that threshold has now been reached in dozens of countries. \n\nIn fact, we don't have to rely on trend-based forecasting to understand why EVs are just going to win. There are a number of fundamental factors that make EVs simply better than combustion vehicles. The longer time goes on, the more these inherent advantages will make themselves felt in the market. \n\nThe first of these is price. Currently, EVs often require government subsidies in order to be pr", "id": 1370216, "language": null, "link": "https://tech.slashdot.org/story/24/10/22/1810240/evs-are-just-going-to-win?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "EVs Are Just Going To Win", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T17:18:17.614353+00:00", "description": "A federal rule banning fake online reviews is now in effect. The Federal Trade Commission issued the rule in August banning the sale or purchase of online reviews. The rule, which went into effect Monday, allows the agency to seek civil penalties against those who knowingly violate it. AP: \"Fake reviews not only waste people's time and money, but also pollute the marketplace and divert business away from honest competitors,\" FTC Chair Lina Khan said about the rule in August. She added that the rule will \"protect Americans from getting cheated, put businesses that unlawfully game the system on notice, and promote markets that are fair, honest, and competitive.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FTC's+Rule+Banning+Fake+Online+Reviews+Goes+Into+Effect%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F10%2F22%2F1615217%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter", "id": 1369729, "language": null, "link": "https://news.slashdot.org/story/24/10/22/1615217/ftcs-rule-banning-fake-online-reviews-goes-into-effect?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "FTC's Rule Banning Fake Online Reviews Goes Into Effect", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T16:15:22.028923+00:00", "description": "Democratic senators Elizabeth Warren, Ron Wyden, Richard Blumenthal and Representative Katie Porter are demanding the Justice Department prosecute tax preparation companies for allegedly sharing sensitive taxpayer data with Meta and Google through tracking pixels. The lawmakers' call follows a Treasury Inspector General audit confirming their earlier investigation into TaxSlayer, H&amp;R Block, and Tax Act. The audit found multiple companies failed to properly obtain consent before sharing tax return information via advertising tools. Violations could result in one-year prison terms and $1,000 fines per incident, potentially reaching billions in penalties given the scale of affected users. \n\nIn a letter shared with The Verge, the lawmakers said: \"Accountability for these tax preparation companies -- who disclosed millions of taxpayers' tax return data, meaning they could potentially face billions of dollars in criminal liability -- is essential for protecting the rule of law and the p", "id": 1369241, "language": null, "link": "https://news.slashdot.org/story/24/10/22/1511245/democrats-press-for-criminal-charges-against-tax-prep-firms-over-data-sharing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Democrats Press For Criminal Charges Against Tax Prep Firms Over Data Sharing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T16:15:21.576097+00:00", "description": "Anthropic has released an upgraded version of its AI model Claude 3.5 Sonnet and announced a new model, Claude 3.5 Haiku, alongside a public beta feature enabling AI to operate computers like humans. The enhanced Sonnet model improved its coding capabilities, scoring 49% on the SWEbench Verified benchmark, surpassing OpenAI and other competitors. The Haiku model matches the performance of Anthropic's previous flagship Claude 3 Opus while maintaining lower costs and faster speeds. \n\nThe computer use feature, available through Anthropic's API and cloud partners, allows Claude to perform tasks like navigating web browsers, filling forms, and manipulating data. Early adopters include Asana, DoorDash, and Replit, though Anthropic -- backed by investors including Google and Amazon -- acknowledges the feature remains experimental and error-prone. Claude 3.5 Haiku will launch later this month, initially supporting text-only inputs with image capabilities to follow.<p><div class=\"share_submiss", "id": 1369240, "language": null, "link": "https://slashdot.org/story/24/10/22/168256/anthropics-ai-model-gains-computer-control-in-new-upgrade?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Anthropic's AI Model Gains Computer Control in New Upgrade", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T15:01:52.820846+00:00", "description": "Session, a small but increasingly popular encrypted messaging app, is moving its operations outside of Australia after the country's federal law enforcement agency visited an employee's residence and asked them questions about the app and a particular user. 404 Media reports: Now Session will be maintained by an entity in Switzerland. The move signals the increasing pressure on maintainers of encrypted messaging apps, both when it comes to governments seeking more data on app users, as well as targeting messaging app companies themselves, like the arrest of Telegram's CEO in August. \"Ultimately, we were given the choice between remaining in Australia or relocating to a more privacy-friendly jurisdiction, such as Switzerland. For the project to continue, it could not be centred in Australia,\" Alex Linton, president of the newly formed Session Technology Foundation (STF) which will publish the Session app, told 404 Media in a statement. The app will still function in Australia, Linton a", "id": 1368739, "language": null, "link": "https://it.slashdot.org/story/24/10/22/142225/encrypted-chat-app-session-leaves-australia-after-visit-from-police?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Encrypted Chat App 'Session' Leaves Australia After Visit From Police", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T15:01:52.617839+00:00", "description": "Companies hiring specialized AI talent are seeing better stock market returns, according to new Barclays research. Analysis shows firms with higher ratios of specialized AI roles to general IT positions outperformed the market, with the top quintile returning 31.78% since October 2023, beating the S&amp;P 500 Equal Weighted index. The findings suggest that targeted recruitment of \"wonky IT people\" with specific skills in natural language processing, computer vision, and specialized frameworks like TensorFlow could be a subtle indicator of future stock performance, offering investors a new lens for identifying companies poised to capitalize on AI productivity gains.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=If+You+Want+Your+Company's+Stock+To+Go+Up%2C+Hire+Wonkier+IT+People%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F10%2F22%2F1448225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fs", "id": 1368738, "language": null, "link": "https://tech.slashdot.org/story/24/10/22/1448225/if-you-want-your-companys-stock-to-go-up-hire-wonkier-it-people?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "If You Want Your Company's Stock To Go Up, Hire Wonkier IT People", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T10:30:44.082786+00:00", "description": "WordPress sites are being compromised through malicious plugins that display fake software updates and error messages, leading to the installation of information-stealing malware. BleepingComputer reports: Since 2023, a malicious campaign called ClearFake has been used to display fake web browser update banners on compromised websites that distribute information-stealing malware. In 2024, a new campaign called ClickFix was introduced that shares many similarities with ClearFake but instead pretends to be software error messages with included fixes. However, these \"fixes\" are PowerShell scripts that, when executed, will download and install information-stealing malware.\n \nLast week, GoDaddy reported that the ClearFake/ClickFix threat actors have breached over 6,000 WordPress sites to install malicious plugins that display the fake alerts associated with these campaigns. \"The GoDaddy Security team is tracking a new variant of ClickFix (also known as ClearFake) fake browser update malwar", "id": 1367109, "language": null, "link": "https://it.slashdot.org/story/24/10/22/0415228/over-6000-wordpress-hacked-to-install-plugins-pushing-infostealers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Over 6,000 WordPress Hacked To Install Plugins Pushing Infostealers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T07:14:50.867328+00:00", "description": "NASA will rely on SpaceX's Crew Dragon for two crewed missions to the ISS in 2025 while evaluating whether Boeing's Starliner requires another test flight for certification. SpaceNews reports: In an Oct. 15 statement, NASA said it will use Crew Dragon for both the Crew-10 mission to the ISS, scheduled for no earlier than February 2025, and the Crew-11 mission scheduled for no earlier than July. Crew-10 will fly NASA astronauts Anne McClain and Nichole Ayers along with astronaut Takuya Onishi from the Japanese space agency JAXA and Roscosmos cosmonaut Kirill Peskov. NASA has not yet announced the crew for the Crew-11 mission.\n \nEarlier this year, NASA had hoped that Boeing's CST-100 Starliner would be certified in time to fly the early 2025 mission. Problems with the Crew Flight Test mission, which launched in June with NASA astronauts Butch Wilmore and Suni Williams on board, led NASA to conclude in July that the spacecraft would not be certified in time. It delayed that Starliner-1 m", "id": 1366337, "language": null, "link": "https://science.slashdot.org/story/24/10/22/0356253/nasa-further-delays-first-operational-starliner-flight?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA Further Delays First Operational Starliner Flight", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T03:59:40.194773+00:00", "description": "An anonymous reader quotes a report from Ars Technica: 37Signals is not a company that makes its policy or management decisions quietly. The productivity software company was an avowedly Mac-centric shop until Apple's move to kill home screen web apps (or Progressive Web Apps, or PWAs) led the firm and its very-public-facing co-founder, David Heinemeier Hansson, to declare a \"Return to Windows,\" followed by a stew of Windows/Mac/Linux. The company waged a public battle with Apple over its App Store subscription policies, and the resulting outcry helped nudge Apple a bit. 37Signals has maintained an active blog for years, its co-founders and employees have written numerous business advice books, and its blog and social media posts regularly hit the front pages of Hacker News.\n \nSo when 37Signals decided to pull its seven cloud-based apps off Amazon Web Services in the fall of 2022, it didn't do so quietly or without details. Back then, Hansson described his firm as paying \"an at times ", "id": 1365723, "language": null, "link": "https://news.slashdot.org/story/24/10/21/2316217/basecamp-maker-37signals-says-its-cloud-exit-will-save-it-10-million-over-5-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Basecamp-Maker 37Signals Says Its 'Cloud Exit' Will Save It $10 Million Over 5 Years", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T02:57:33.592521+00:00", "description": "Amazon has reached its goal set earlier this year to completely get rid of plastic air pillows at its warehouses by the end of the year. \"As of October 2024, we've removed all plastic air pillows from our delivery packaging used at our global fulfillment centers,\" the e-commerce giant said in an October 9th blog post. The Verge reports: It's a welcome change following years of pressure from environmental groups to stop plastic pollution flooding into oceans. The company is still working to reduce the use of single-use plastics more broadly in its packaging. The most prolific type of plastic litter near coastlines is plastic film -- a material that makes up those once ubiquitous air pillows, according to Oceana. That film also happens to be the \"deadliest\" type of plastic pollution for large mammals like whales and dolphins that might ingest it, Oceana says.\n \nThe company swapped out plastic air pillows and single-use delivery bags for paper and cardboard alternatives in Europe in 2022", "id": 1365585, "language": null, "link": "https://news.slashdot.org/story/24/10/21/233222/amazon-ditches-plastic-air-pillows?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Ditches Plastic Air Pillows", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T01:50:01.076259+00:00", "description": "TikTok's parent company, ByteDance, fired an intern for \"maliciously interfering\" with the training of one of its AI models. However, the firm \"rejected claims about the extent of the damage caused by the unnamed individual, saying they 'contain some exaggerations and inaccuracies,'\" reports the BBC. From the report: The Chinese technology giant's Doubao ChatGPT-like generative AI model is the country's most popular AI chatbot. \"The individual was an intern with the [advertising] technology team and has no experience with the AI Lab,\" ByteDance said in a statement. \"Their social media profile and some media reports contain inaccuracies.\" Its commercial online operations, including its large language AI models, were unaffected by the intern's actions, the company added.\n \nByteDance also denied reports that the incident caused more than $10 million of damage by disrupting an AI training system made up of thousands of powerful graphics processing units (GPU). As well as firing the person", "id": 1365393, "language": null, "link": "https://slashdot.org/story/24/10/21/2249257/tiktok-owner-sacks-intern-for-sabotaging-ai-project?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "TikTok Owner Sacks Intern For Sabotaging AI Project", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T01:50:00.419080+00:00", "description": "According to an internal Border Patrol memo, nearly one-third of the surveillance cameras along the U.S.-Mexico border don't work. \"The nationwide issue is having significant impacts on [Border Patrol] operations,\" reads the memo. NBC News reports: The large-scale outage affects roughly 150 of the 500 cameras perched on surveillance towers along the U.S.-Mexico border. It was due to \"several technical problems,\" according to the memo. The officials, who spoke on the condition of anonymity to discuss a sensitive issue, blamed outdated equipment and outstanding repair issues.\n \nThe camera systems, known as Remote Video Surveillance Systems, have been used since 2011 to \"survey large areas without having to commit hundreds of agents in vehicles to perform the same function.\" But according to the internal memo, 30% were inoperable. It is not clear when the cameras stopped working.Two Customs and Border Protections officials said that some repairs have been made this month but that there a", "id": 1365392, "language": null, "link": "https://tech.slashdot.org/story/24/10/21/2258227/one-third-of-dhss-border-surveillance-cameras-are-broken-memo-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "One-Third of DHS's Border Surveillance Cameras Are Broken, Memo Says", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T00:42:23.688891+00:00", "description": "Disney has appointed former Morgan Stanley CEO James Gorman to replace Nike Executive Chairman Mark Parker as board chairman starting in January 2024, \"as the media giant lays the groundwork to name a successor for CEO Bob Iger in early 2026,\" reports CNBC. Iger's contract has been extended until the end of 2026 to ensure the company finds the right fit. CNBC reports: Gorman joined Disney's board less than a year ago and was named the head of the succession planning committee in August. He will continue to lead that committee after he takes over as board chairman from Nike Executive Chairman Parker. \"The Disney board has benefited tremendously from James Gorman's expertise and guidance, and we are lucky to have him as our next chairman -- particularly as the board continues to move forward with the succession process,\" Iger said in a statement. \"I'm extremely grateful to Mark Parker for his many years of board service and leadership, which have been so valuable to this company and its", "id": 1365162, "language": null, "link": "https://slashdot.org/story/24/10/21/2146211/disney-to-name-bob-igers-successor-in-early-2026?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Disney To Name Bob Iger's Successor In Early 2026", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T00:42:23.425212+00:00", "description": "An anonymous reader writes: T-Mobile and AT&amp;T say US regulators should drop a plan to require unlocking of phones within 60 days of activation, claiming that locking phones to a carrier's network makes it possible to provide cheaper handsets to consumers. \"If the Commission mandates a uniform unlocking policy, it is consumers -- not providers -- who stand to lose the most,\" T-Mobile alleged in an October 17 filing with the Federal Communications Commission. The proposed rule has support from consumer advocacy groups who say it will give users more choice and lower their costs.\n \nT-Mobile has been criticized for locking phones for up to a year, which makes it impossible to use a phone on a rival's network. T-Mobile claims that with a 60-day unlocking rule, \"consumers risk losing access to the benefits of free or heavily subsidized handsets because the proposal would force providers to reduce the line-up of their most compelling handset offers.\" If the proposed rule is enacted, \"T-M", "id": 1365161, "language": null, "link": "https://mobile.slashdot.org/story/24/10/21/2153237/t-mobile-att-oppose-unlocking-rule-claim-locked-phones-are-good-for-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "T-Mobile, AT&amp;T Oppose Unlocking Rule, Claim Locked Phones Are Good For Users", "vote": 0}]