[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T17:00:07+00:00", "description": "Read the IBV Book: The Great Tech Reset → https://ibm.biz/Bdasnq\nSchedule a personal discovery session & learn more about Hybrid by Design → https://ibm.biz/Bdasnf\n\nThe explosion of AI over the past two years has tipped the scales in a long-developing paradigm shift: technology is no longer just a tool to support business objectives, but a fundamental driver of business value. To maximize this value, organizations need a purposefully designed IT foundation to leverage and scale AI.\n\nIn this video, Edward Walsh explores how a hybrid-by-design strategy enables organizations to align critical architectural choices with business priorities. Orchestrating consistent and intentional choices across technology, platforms, processes, and people to harness the power of Hybrid with and for Generative AI, to maximize business outcomes.\n\nDownload the guide: Maximize the value of hybrid cloud in the generative AI era → https://ibm.biz/Bdasny", "id": 1370083, "language": null, "link": "https://www.youtube.com/watch?v=B46EuwxPkHo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 432, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKWaEZ-_VweaEx1j62do_vQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/B46EuwxPkHo/hqdefault.jpg", "title": "Transforming Business with AI and Hybrid Cloud: A Hybrid by Design Approach", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T11:00:41+00:00", "description": "Explore the podcast → https://ibm.biz/Bdam9S\n\nThere's a vanguard leading the charge to make AI accessible to all, and others are still catching up. Yet, amidst this progress, a concerning reality exists: a gender gap is forming in the field of AI. As much as we talk about reducing AI bias and promoting AI diversity, women and lower income populations are being left out, avoiding AI or in some cases using it without knowing they are. The good news is, it’s not too late. Listen to Reshma Saujani, Founder & CEO of Girls Who Code, talk about “aspirational AI” and what we can do to close the gap\n\nRead the Ai in Action 2024 Report → https://ibm.biz/Bdam9v\n \nThe opinions expressed in this podcast are solely those of the participants and do not necessarily reflect the views of IBM or any other organization or entity.", "id": 1367739, "language": null, "link": "https://www.youtube.com/watch?v=bdUqke_km3s", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 432, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKWaEZ-_VweaEx1j62do_vQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/bdUqke_km3s/hqdefault.jpg", "title": "Leaders v. learners: It all comes down to AI accessibility", "vote": 0}]