[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T15:30:30+00:00", "description": "Video games can be extremely tough to create; it’s a careful balancing act of different elements related to art, technology, and music. One of the most important aspects of this balancing act has to be the pacing, which has the potential to make a middling game great and turn a great game into a mediocre version of itself. \n\nWe have seen plenty of examples over the years when an otherwise great game gets affected through poor pacing, through strong and eventful first few hours followed by a long and uninteresting stretch. \n\nWith this video, we will be taking a look at 10 such games and discuss where they exactly went wrong. Again, this doesn’t mean that these are bad games - but they did fall short of their potential due to this particular reason.", "id": 1369363, "language": null, "link": "https://www.youtube.com/watch?v=saTiNbexa40", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/saTiNbexa40/hqdefault.jpg", "title": "10 Games That STARTED STRONG But Lost Their Way Later", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-22T13:30:05+00:00", "description": "PlayStation has debuted several new franchises in the previous generation, dominating the minds and hearts of critics and fans alike. That undoubtedly includes Guerrilla's Horizon series, which began with Zero Dawn in 2017 for the PS4. For better or worse, it's getting the remastered treatment, with Horizon Zero Dawn Remastered launching on October 31st for PS5 and PC.\n\nThough deemed unnecessary, Guerrilla and Nixxes have put in a lot of work to improve on the original. Taking cues from the sequel, Horizon Forbidden West, the remaster includes the same accessibility options (and some new ones), overhauled foliage and environmental details, more lively environments with added NPCs, and much more.\n\nIt even features over 10 hours of additional motion capture data for overhauling animations and cutscenes. Horizon Zero Dawn Remastered will retail for $49.99 when it launches ($9.99 for owners of the original). Here are 15 things you should know before buying it.", "id": 1368304, "language": null, "link": "https://www.youtube.com/watch?v=A37jV8AMKl0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/A37jV8AMKl0/hqdefault.jpg", "title": "Horizon Zero Dawn Remastered - 15 Things You Absolutely NEED TO KNOW Before You Buy", "vote": 0}]