[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-09T02:08:35.570905+00:00", "description": "FTX has been ordered to pay $12.7 billion in relief to its customers, according to the Commodity Futures Trading Commission (CFTC). In a statement, CFTC Chairman Rostin Behnam said the crypto exchange drew customers in with \"an illusion that it was a safe and secure place to access crypto markets,\" then misappropriated their customer deposits to make its own risky investments. Reuters reports: The repayment order implements a settlement between the CFTC and the bankrupt crypto exchange, which has committed to a bankruptcy liquidation that will repay customers whose deposits were locked during its late 2022 collapse. FTX has said that its customers will receive 100% recovery on their claims against the company, based on the value of their accounts at the time it filed for bankruptcy. The CFTC agreement resolves a potential roadblock to that repayment, ensuring that the government's lawsuit against FTX will not reduce the funds available to its customers. The CFTC agreed not to collect ", "id": 1001263, "language": "en-us", "link": "https://slashdot.org/story/24/08/09/0022231/ftx-ordered-to-pay-127-billion-to-customers-us-cftc-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FTX Ordered To Pay $12.7 Billion To Customers, US CFTC Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-09T01:01:31.351493+00:00", "description": "According to Bloomberg's Mark Gurman (paywalled), Apple plans to launch a completely redesigned Mac mini with M4 and M4 Pro chips later this year. MacRumors reports: The new Mac mini will be the first major design change to the machine since 2010, making it Apple's smallest ever desktop computer. The new Mac mini will apparently approach the size of an Apple TV, but it may be slightly taller than the current model, which is 1.4 inches high. It will continue to feature an aluminum shell. Individuals working on the new device apparently say that it is \"essentially an iPad Pro in a small box.\"\n \nApple is said to have tested Mac mini models with at least three USB-C ports on the back, as well as an area for the power cable and an HDMI port. There will continue to be two versions of the Mac mini: one with the standard M4 chip, similar to the iPad Pro, and one with an M4 Pro chip. The base model is set to begin shipping from suppliers this month ahead of release later in the year, while the", "id": 1001086, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/08/08/219233/m4-mac-mini-to-become-apples-smallest-ever-computer-with-complete-redesign?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "M4 Mac Mini To Become Apple's Smallest Ever Computer With Complete Redesign", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-09T01:01:29.023160+00:00", "description": "Dan Robinson writes via The Register: Hyperscalers are forecast to account for more than 60 percent of datacenter space by 2029, a stark reversal on just seven years ago when the majority of capacity was made up of on-premises facilities. This trend is the result of demand for cloud services and consumer-oriented digital services such as social networking, e-commerce and online gaming pushing growth in hyperscale bit barns, those operated by megacorps including Amazon, Microsoft and Meta. The figures were published by Synergy Research Group, which says they are drawn from several detailed quarterly tracking research services to build an analysis of datacenter volume and trends.\n \nAs of last year's data, those hyperscale companies accounted for 41 percent of the entire global data dormitory capacity, but their share is growing fast. Just over half of the hyperscaler capacity is comprised of own-build facilities, with the rest made up of leased server farms, operated by providers such a", "id": 1001085, "language": "en-us", "link": "https://slashdot.org/story/24/08/08/2122203/cloud-growth-puts-hyperscalers-on-track-to-60-of-data-capacity-by-2029?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cloud Growth Puts Hyperscalers On Track To 60% of Data Capacity By 2029", "user": null, "vote": 0}]