[{"user": null, "comments": [], "date_published": "2024-02-07T14:30:15+00:00", "link": "https://www.youtube.com/watch?v=TPUiNyHqH14", "tags": [], "vote": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_visits": 0, "thumbnail": "https://i1.ytimg.com/vi/TPUiNyHqH14/hqdefault.jpg", "album": "", "language": null, "title": "Rise of the Ronin - 15 Things To Know Before You Buy This BIG PS5 EXCLUSIVE", "page_rating_votes": 0, "source_obj__id": 208, "description": "Partnering with PlayStation Studios, Nioh developer Team Ninja is set to bring a new action RPG exclusively to the PS5 in the form of Rise of the Ronin. \n\nFrom its open world setting and its traversal mechanics to its focus on player choice and more, in more ways than one, the game is looking like an interesting evolution over the sort of games the developer has traditionally been known for over the years. \n\nWith its launch not far away now, Rise of the Ronin has received plenty of details on its world, gameplay, story, and more, plenty of which also arrived courtesy of its recent State of Play showing. As such, here, we’re going to go over a few key details that you should know about the action RPG.", "dead": false, "page_rating_contents": 0, "bookmarked": false, "artist": "GamingBolt", "page_rating": 0, "age": null}, {"user": null, "comments": [], "date_published": "2024-02-07T10:30:17+00:00", "link": "https://www.youtube.com/watch?v=gJ35J2ElJC0", "tags": [], "vote": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_visits": 0, "thumbnail": "https://i4.ytimg.com/vi/gJ35J2ElJC0/hqdefault.jpg", "album": "", "language": null, "title": "15 Amazing Single Player Games YOU CAN FINISH IN 10 HOURS", "page_rating_votes": 0, "source_obj__id": 208, "description": "Today's games are pretty big, be it an open-world title with heaps of activities and systems or a role-playing game with multiple routes and many side quests to distract you. You have games where players can spend months diving into and still discover new things.\n\nHowever, for every title that promises so much in terms of playtime, some focus on tighter experiences. Sure, they have collectibles, unlocks and their share of extras, but these single-player titles provide the lion's share of their experience up front.\n\nIt's possible to complete them in 10 hours or less and walk away completely satisfied. Check out 15 single-player titles that fall into this category and why they're worth jumping into.", "dead": false, "page_rating_contents": 0, "bookmarked": false, "artist": "GamingBolt", "page_rating": 0, "age": null}]