[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T23:53:08.156094+00:00",
        "description": "Long-time Slashdot reader schwit1 writes: The Dubai-based startup LEAP71, focused on using AI software to quickly develop rocket engine designs it can then 3D print, has successfully test fired a prototype aerospike engine on December 18, 2024 during a static fire test campaign conducted in the United Kingdom. \n\nAlong the way they tackled a problem with bell-shaped rocket nozzles, writes New Atlas. \"A rocket that works very well on liftoff will work less well as it rises in the atmosphere and the air pressure decreases. This is why second- and third-stage rocket engines are different from those of the first stage.\"\n\nIdeally, engineers want an engine that can adjust itself automatically to changes in air pressure. An aerospike does this by shaping the engine into a spike or plug with a curve like that of the inside of a rocket bell. As the combustion gases flow from the engine over the spike, the curve acts as one side of the bell and the surrounding air as the outside curve. As the a",
        "id": 1795947,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/28/2312227/leap-71-hot-fires-advanced-aerospike-rocket-engine-designed-by-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "LEAP 71 Hot-Fires Advanced Aerospike Rocket Engine Designed by AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T22:47:34.026511+00:00",
        "description": "Long-time Slashdot reader theodp writes:\n\n\n\nBack in January, Rice University professor and former CACM Editor-in-Chief Moshe Y. Vardi wrote of the unintended consequences of social media and mobile computing in \"Computing, You Have Blood on Your Hands!\" To close out the year, Vardi addresses the role tech workers play in enabling dubious Big Tech business models &mdash; including now-powered-by-AI Big Tech Surveillance Capitalism &mdash; in an opinion piece titled \"I Was Wrong about the Ethics Crisis.\" Vardi writes: \"The belief in the magical power of the free market always to serve the public good has no theoretical basis. In fact, our current climate crisis is a demonstrated market failure. To take an extreme example, Big Tobacco surely does not support the public good, and most of us would agree that it is unethical to work for Big Tobacco. The question, thus, is whether Big Tech is supporting the public good, and if not, what should Big Tech workers do about it. Of course, there ",
        "id": 1795761,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/28/2030223/communications-of-the-acm-asks-is-it-ethical-to-work-for-big-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Communications of the ACM Asks: Is It Ethical To Work For Big Tech?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T21:42:17.136283+00:00",
        "description": "A Linux Foundation project focused on understanding the health of the open source community just studied the outcomes for three projects that switched to \"more restrictive\" licenses and then faced community forks. \n\nThe data science director for the project &mdash; known as Community Health Analytics in Open Source Software (or CHAOSS) &mdash; is also an OpenUK board member, and describes the outcomes for OpenSearch, Redis with fork Valkey, and Terraform:\n\n\nThe relicensed project (Redis) had significant numbers of contributors who were not employed by the company, and the fork (Valkey) was created by those existing contributors as a foundation project... The Redis project differs from Elasticsearch and Terraform in the number of contributions to the Redis repository from people who were not employees of Redis. In the year leading up to the relicense, when Redis was still open source, there were substantial contributions from employees of other companies: Twice as many non-Redis emplo",
        "id": 1795564,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/28/2012251/what-happens-to-relicensed-open-source-projects-and-their-forks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What Happens to Relicensed Open Source Projects and Their Forks?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T21:42:16.906634+00:00",
        "description": "Business Insider reports:\n\nThe lead researcher for Sam Altman's basic-income study says guaranteed no-strings payments are not a silver bullet for issues facing lower-income Americans. Elizabeth Rhodes, the research director for the Basic Income Project at Open Research, told Business Insider that while basic-income payments are \"beneficial in many ways,\" the programs also have \"clear limitations....\" \n\nRhodes headed up one of the largest studies in the space, which focused specifically on those on low incomes rather than making universal payments to adults across all economic demographics. The three-year experiment, backed by OpenAI boss Altman, provided 1,000 low-income participants with $1,000 a month without any stipulations for how they could spend it.... The initial findings, released in July, found that recipients put the bulk of their extra spending toward basic needs such as rent, transportation, and food. They also worked less on average but remained engaged in the workforc",
        "id": 1795563,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/28/0535244/universal-basic-income-isnt-a-silver-bullet-says-lead-researcher-on-sam-altmans-study?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Universal Basic Income' Isn't a Silver Bullet, Says Lead Researcher on Sam Altman's Study",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T20:37:20.698580+00:00",
        "description": "Magnus Carlsen quit the World Rapid Chess Championship on Friday, reports CNN, \"after he refused to change out of the jeans he was wearing...\" \n\n\"Carlsen, the world champion from 2013 until 2023, allegedly replied, 'I'm out, f*** you,' after being informed that he would not be permitted to continue,\" reports the Hindustan Times. \n\nThe International Chess Federation (or FIDE) \"said in a statement that Carlsen breached the tournament's dress code by wearing jeans,\" reports CNN:\n\n\nAs a result, Carlsen would not have been paired for round nine, though he could have returned for the rest of the tournament had he not decided to walk away, per Chess.com. Since he had performed poorly in the earlier rounds, there was little chance that Carlsen could have defended his title regardless.... \n\nThe standoff became \"a matter of principle\" for Carlsen, he told chess channel Take Take Take. \"I haven't appealed, honestly I'm too old at this point to care too much, if this is what they want to do ... ",
        "id": 1795346,
        "language": null,
        "link": "https://games.slashdot.org/story/24/12/28/1759232/magnus-carlsen-quits-chess-tournament-after-refusing-to-change-out-of-jeans?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Magnus Carlsen Quits Chess Tournament After Refusing to Change Out of Jeans",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T19:33:10.711511+00:00",
        "description": "Thursday New York's governor signed new legislation \"to hold polluters responsible for the damage done to our environment\" by establishing a Climate Superfund that's paid for by big fossil-fuel companies. \n\nThe money will be used for \"climate change adaptation,\" according to New York state senator Liz Krueger, who notes that the legislation follows \"the polluter-pays model\" used in America's already-existing federal and state superfund laws. Spread out over 25 years, the legislation collects an average of $3 billion each year &mdash; or $75 billion &mdash; \"from the parties most responsible for causing the climate crisis &mdash; big oil and gas companies.\" \n\n\"The Climate Change Superfund Act is now law, and New York has fired a shot that will be heard round the world: the companies most responsible for the climate crisis will be held accountable,\" said Senator Krueger. \"Too often over the last decade, courts have dismissed lawsuits against the oil and gas industry by saying that the ",
        "id": 1795089,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/28/0613231/new-york-passes-law-making-fossil-fuel-companies-pay-75-billion-for-climate-superfund?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New York Passes Law Making Fossil Fuel Companies Pay $75 Billion for 'Climate Superfund'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T18:27:36.508076+00:00",
        "description": "Slashdot reader DevNull127 writes: This year the London Stock Exchange got a new listing for \"Raspberry Pi Holdings plc.\" It's the computer-making commercial subsidiary of their larger educational charity, the Raspberry Pi Foundation. \"Access to the public market will enable us to build more of the products you love, faster,\" explained CEO Eben Upton in June. And in May Foundation head Philip Colligan added that beyond the $50 million already donated to their educational charity by the commercial subsidiary, the IPO would allow the conversion of some stock sales to \"an endowment that we will use to fund our educational programmes... The Foundation will use any funds that we raise through the sale of shares at the IPO &mdash; or subsequently &mdash; to advance our ambitious global strategy to enable every young person to realise their full potential through the power of computing and digital technologies.\" \n\nSo how's that working out? A finance site called Proactive Investors UK repor",
        "id": 1794843,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/28/0440235/raspberry-pi-holdings-stock-price-nearly-doubles-in-december?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Raspberry Pi Holdings' Stock Price Nearly Doubles In December",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T17:22:35.869875+00:00",
        "description": "ewhac (Slashdot reader #5,844) writes: \n\nRetraction Watch is reporting that the entire editorial staff (save one) for the Journal of Human Evolution has resigned in protest over creeping harmful changes imposed by its publisher, Elsevier. \n\nIn an open letter posted to social media, the editors recount Elsevier's changes to their journal's scientific and editorial processes (inserting itself into those processes) &mdash; along with staff and budget reductions negatively impacting their ability to review and publish submissions. The letter alleges that when the editorial board complained of Elsevier's eliminating support for a copy editor, Elsevier responded that the editors shouldn't be paying attention to language, grammar, readability, consistency, or accuracy of proper nomenclature or formatting. When the editors fiercely protested Elsevier's ending of JHE's dual-editor model, Elsevier allegedly responded that it would support a dual-editor model by cutting the compensation rate by",
        "id": 1794574,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/28/053216/journals-editors-resign-over-elsevier-meddling-budget-cuts-and-errors-introduced-by-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Journal's Editors Resign Over Elsevier Meddling, Budget Cuts, and Errors Introduced by AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T16:16:32.580365+00:00",
        "description": "Valerie Warner is 71 years old &mdash; and owes $268,000 in student loans. \n\nRoughly 40 years ago she went to law school, but was only able to find work as a legal aid and later work in the public school system, which the Washington Post calls \"a rewarding job but one that didn't pay enough to wipe out her loans.\" Later she earned a masters of education degree:\nAll told, Warner borrowed a total of about $60,000 for her two advanced degrees. The amount seemed reasonable given the career trajectory that both credentials promised, but that path never materialized. Working a series of low-wage jobs, she went in and out of forbearance before ultimately defaulting. The balance ballooned to the current $268,000 total over the years due to collection fees and interest capitalization. \n\nAnd she's not the only one in debt. \"On a dreary December afternoon, a group of senior citizens stood in the rain outside the Education Department pleading for relief from a debt that many fear will burden the",
        "id": 1794308,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/28/0423232/millions-of-us-seniors-still-owe-student-loan-debt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Millions of US Seniors Still Owe Student Loan Debt",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T13:52:08.073193+00:00",
        "description": "An anonymous reader quotes a report from TechCrunch: Lyft is suing the city of San Francisco, claiming the city unfairly charged the ride-hailing company over $100 million in taxes, Bloomberg reports. The lawsuit alleges that, over the course of five years, San Francisco unfairly labeled money earned by Lyft drivers as company revenue. In the complaint, Lyft maintains that its drivers are its customers, not employees. \"Accordingly, Lyft recognizes revenue from rideshare as being comprised of fees paid to Lyft by drivers, not charges paid by riders to drivers,\" the complaint reads.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Lyft+Says+San+Francisco+Overcharged+It+%24100+Million+In+Taxes%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F12%2F27%2F2259223%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sh",
        "id": 1793770,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/27/2259223/lyft-says-san-francisco-overcharged-it-100-million-in-taxes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Lyft Says San Francisco Overcharged It $100 Million In Taxes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T10:36:59.842330+00:00",
        "description": "A new report reveals that the VW Group left sensitive data for 800,000 electric vehicles from Audi, VW, Seat, and Skoda poorly secured on an Amazon cloud, exposing precise GPS locations, battery statuses, and user habits for months. Carscoops reports: It gets worse. A more tech-savvy user could reportedly connect vehicles to their owners' personal credentials, thanks to additional data accessible through VW Group's online services Crucially, in 466,000 of the 800,000 cases, the location data was so precise that anyone with access could create a detailed profile of each owner's daily habits. As reported by Spiegel, the massive list of affected owners isn't just a who's-who of regular folks. It includes German politicians, entrepreneurs, Hamburg police officers (the entire EV fleet, no less), and even suspected intelligence service employees. Yes, even spies may have been caught up in this digital debacle.\n \nThis glaring error originated from Cariad, a VW Group company that focuses on ",
        "id": 1793107,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/27/2256234/massive-vw-data-leak-exposed-800000-ev-owners-movements?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Massive VW Data Leak Exposed 800,000 EV Owners' Movements",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T07:22:03.200743+00:00",
        "description": "Accidental missile attacks on commercial airliners have become the leading cause of aviation fatalities in recent years (Warning: source paywalled; alternative source), driven by rising global conflicts and the proliferation of advanced antiaircraft weaponry. Despite improvements in aviation safety overall, inconsistent risk assessments, political complexities, and rapid military escalations make protecting civilian flights in conflict zones increasingly difficult. The Wall Street Journal reports: The crash Wednesday of an Azerbaijan Airlines jetliner in Kazakhstan, if officially confirmed as a midair attack, would be the third major fatal downing of a passenger jet linked to armed conflict since 2014, according to the Flight Safety Foundation's Aviation Safety Network, a global database of accidents and incidents. The tally would bring to more than 500 the number of deaths from such attacks during that period. Preliminary results of Azerbaijan's investigation into the crash indicate",
        "id": 1792551,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/27/2249249/missiles-are-now-the-biggest-killer-of-airline-passengers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Missiles Are Now the Biggest Killer of Airline Passengers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T04:08:55.861889+00:00",
        "description": "An anonymous reader quotes a report from The Independent: The two professions associated with the lowest levels of death due to Alzheimer's disease may be surprising. Taxi and ambulance drivers were found to have the lowest proportion of deaths of more than 440 occupations that were considered in a new observation-based study from Massachusetts physicians. Alzheimer's disease is a type of dementia that affects memory, thinking, and behavior. It impacts millions of Americans and is one of the top 10 causes of death in the US.\n \nWhile the study's findings cannot confirm a direct link between the professions and reduced risk, its researchers said they raise the possibility that memory-intensive driving occupations could be associated with some protection. \"We view these findings not as conclusive, but as hypothesis-generating,\" they said, noting that no resolute conclusions can be drawn about cause and effect. The jobs require frequent spatial and navigational processing: the ability to",
        "id": 1792144,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/27/2240227/taxi-drivers-offer-a-clue-to-lowering-alzheimers-risk?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Taxi Drivers Offer a Clue to Lowering Alzheimer's Risk",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T03:03:24.185960+00:00",
        "description": "BrianFagioli shares a report from BetaNews: It might sound unbelievable, but the human brain processes information at just 10 bits per second! Yes, folks, that's slower than the internet speeds many of us endured during the early days of dial-up. While our senses take in billions of bits of data every second, our brain intelligently sifts through the chaos, letting through only what's important.\n \nThis is no accident. Researchers Jieyu Zheng and Markus Meister explain in their study, The Unbearable Slowness of Being, that the brain is built this way for survival. Instead of getting overwhelmed by a flood of details, the brain has a system to focus on what matters most. It ensures we act quickly and effectively without being bogged down by unnecessary information. [...] The slow pace of the human brain might seem like a drawback in today's fast-paced world, but it has been sufficient for survival throughout human history. Evolution prioritized efficiency over speed, enabling the brain",
        "id": 1792000,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/27/2042226/why-do-we-live-at-10bitss?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Why Do We Live at 10bits/s?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T01:59:20.071090+00:00",
        "description": "jjslash shares a report from TechSpot: A Valve employee recently provided PC Gamer with a rough calculation of the company's per-employee income, revealing that Valve generates more money per person than several of the world's largest companies. While the data is a few years old and doesn't account for some significant recent trends in the tech sector, Valve's ranking in this metric likely hasn't shifted much over that time. Exact figures for Valve's per-hour and per-employee net income remain redacted. However, a chart from 2018 confirms that Valve's per-employee income exceeded that of companies like Facebook, Apple, Netflix, Alphabet/Google, Microsoft, Intel, and Amazon. Facebook ranks second with a high revenue per employee of $780,400 annually, or $89 per hour, surpassing competitors like Apple and Microsoft due to its relatively smaller workforce of under 70,000. Amazon, by contrast, with over 1.5 million employees, earns significantly less per employee at $15,892 annually, or ",
        "id": 1791835,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/27/2037230/valve-makes-more-money-per-employee-than-amazon-microsoft-and-netflix-combined?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Valve Makes More Money Per Employee Than Amazon, Microsoft, and Netflix Combined",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T00:52:31.201239+00:00",
        "description": "On Christmas Day, the social media app Bluesky added a list of Trending topics to its mobile app, allowing users to see which subjects are popular among its community. The Verge reports: The new feature can be found by selecting the search icon (the magnifying glass), which appears at the bottom of the screen on the mobile app and on the left sidebar on the web. Lists of Trending and Recommended subjects now appear below the search bar. Tap on any topic, and you will be able to access the associated posts. [...] According to the announcement, the new feature is \"V1\" (it is marked as a Beta on the app) and \"we will be iterating with your feedback.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bluesky+Adds+Trending+Topics%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F27%2F2026230%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpo",
        "id": 1791666,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/27/2026230/bluesky-adds-trending-topics?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bluesky Adds Trending Topics",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T00:52:30.972070+00:00",
        "description": "The implementation of the Corporate Transparency Act -- a law aimed at getting shell companies to disclose their true ownership -- was paused again just days before a reporting deadline was set to take effect, as a federal appeals court handed the case to a panel for further consideration. From a report: In a court filing late Thursday, the Fifth Circuit Court of Appeals vacated a stay on a national injunction the court had issued Monday that reinstated the Jan. 1 reporting deadline for millions of companies. The lifting of the stay means the January filing deadline will be postponed once again and bars the government and the Treasury Department from enforcing the law, pending oral arguments before the court's so-called merits panel, a group of judges tasked with considering appeals. \n\nThe Corporate Transparency Act, a bipartisan law passed in 2021 to curtail the use of anonymous shell companies and help track flows of illicit money, would require companies to file beneficial ownersh",
        "id": 1791665,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/27/2031202/new-law-requiring-businesses-to-report-who-owns-them-is-put-on-hold-again?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Law Requiring Businesses To Report Who Owns Them Is Put on Hold Again",
        "vote": 0
    }
]