[
    {
        "age": null,
        "album": "",
        "author": "Magia Natury",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-28T10:00:24+00:00",
        "description": "Tropić w naturze ogromne, dzikie warany, to dla miłośnika przyrody nie lada gratka. Na Sri Lance warany są co prawda tak często spotykane jak u nas sroki - spotkać je można nawet w mieście. Zobaczyć jednak te największe, drugie co do wielkości jaszczurki świata - warany wodne, które wielkością i siłą ustępują tylko waranom z Komodo, to już nie takie łatwe zadanie, te są rzadsze, wyglądają jak prehistoryczne gady i z reguły trzymają się trudniej dostępnych terenów.\n\nMimo wszystko, dzięki miejscowym, udało mi się zrealizować ten plan. Miałem także okazję podziwiać dzikie słonie, bawoły wodne, a także z bliska sfilmować dziką, śmiertelnie jadowitą kobrę. Jeździłem także na słoniu, korzystałem z każdej okazji by przyjrzeć się tutejszym zwierzętom, także tym oswojonym i pokazywanym przez miejscowych jako atrakcja turystyczna. Przyroda wdziera się tu wszędzie, nawet na hotelowy taras, a zatem okazji do przyrodniczych obserwacji było bez liku. Oto moja relacja z pobytu w tym bajkowym miejsc",
        "id": 1793032,
        "language": null,
        "link": "https://www.youtube.com/watch?v=UVSKe0EZs_0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 461,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfDX69pxC4q6yKSaugs196g",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/UVSKe0EZs_0/hqdefault.jpg",
        "title": "Ścigam Warany, Kobry, Jeżdżę na Słoniu - SRI LANKA - Raj Przyrodnika",
        "vote": 0
    }
]