[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T23:20:18.500059+00:00", "description": "Amazon has confirmed that employee data was compromised after a \"security event\" at a third-party vendor. From a report: In a statement given to TechCrunch on Monday, Amazon spokesperson Adam Montgomery confirmed that employee information had been involved in a data breach. \"Amazon and AWS systems remain secure, and we have not experienced a security event. We were notified about a security event at one of our property management vendors that impacted several of its customers including Amazon. The only Amazon information involved was employee work contact information, for example work email addresses, desk phone numbers, and building locations,\" Montgomery said. \n\nAmazon declined to say how many employees were impacted by the breach. It noted that the unnamed third-party vendor doesn't have access to sensitive data such as Social Security numbers or financial information and said the vendor had fixed the security vulnerability responsible for the data breach. The confirmation comes a", "id": 1496683, "language": null, "link": "https://it.slashdot.org/story/24/11/11/2124251/amazon-confirms-employee-data-stolen-after-hacker-claims-moveit-breach?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Confirms Employee Data Stolen After Hacker Claims MOVEit Breach", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T23:20:18.107677+00:00", "description": "With iOS 18.2, Apple will allow you to share the location of a lost AirTag with other people and with more than 15 different airlines. The Verge reports: When using the feature, you can generate a Share Item Location link within the Find My app on an iPhone, iPad, or Mac. Once you share the link with someone, they can click on it to view an interactive map with the location of your lost item. Apple will update the website automatically when the lost item moves, and it will also display a timestamp when it moved last. Apple will turn off the feature once you find your lost item. You can also manually stop sharing the location of an AirTag at any time, or the link will \"automatically expire after seven days.\" [...]\n \nAs part of the rollout, Apple is partnering with over 15 airlines, including Delta, United, Virgin Atlantic, Lufthansa, Air Canada, and more. All of these airlines will be able to \"privately and securely\" accept links to lost items, as \"access to each link will be limited ", "id": 1496682, "language": null, "link": "https://news.slashdot.org/story/24/11/11/2129223/apple-will-let-you-share-airtag-locations-with-a-link?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Will Let You Share AirTag Locations With a Link", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T22:15:30.948523+00:00", "description": "Google will require all new mobile chipsets launching with Android 15 to support its Android Virtualization Framework (AVF), a significant shift in the operating system's security architecture. The mandate, reports AndroidAuthority that got a hold of Android's latest Vendor Software Requirements document, affects major chipmakers including Qualcomm, MediaTek, and Samsung's Exynos division. New processors like the Snapdragon 8 Elite and Dimensity 9400 must implement AVF support to receive Android certification. \n\nAVF, introduced with Android 13, creates isolated environments for security-sensitive operations including code compilation and DRM applications. The framework also enables full operating system virtualization, with Google demonstrating Chrome OS running in a virtual machine on Android devices.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Android+15's+Virtual+Machine+Mandate+is+Aimed+at+Improving+Security", "id": 1496357, "language": null, "link": "https://it.slashdot.org/story/24/11/11/1748241/android-15s-virtual-machine-mandate-is-aimed-at-improving-security?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Android 15's Virtual Machine Mandate is Aimed at Improving Security", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T22:15:30.859075+00:00", "description": "The Biden administration plans to support a controversial cybercrime treaty at the United Nations this week despite concerns that it could be misused by authoritarian regimes, Bloomberg News reported Monday, citing senior government officials. From the report: The agreement would be the first legally binding UN agreement on cybersecurity and could become a global legal framework for countries to cooperate on preventing and investigating cybercriminals. However, critics fear it could be used by authoritarian states to try to pursue dissidents overseas or collect data from political opponents. Still, the officials said there are persuasive reasons to support the treaty. For instance, it would advance the criminalization of child sexual-abuse material and nonconsensual spreading of intimate images, they said. \n\nIn addition, the wider involvement of member states would make cybercrime and electronic evidence more available to the US, one official said. If all the members sign the agreeme", "id": 1496356, "language": null, "link": "https://news.slashdot.org/story/24/11/11/1821230/biden-administration-to-support-controversial-un-cyber-treaty?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Biden Administration To Support Controversial UN Cyber Treaty", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T22:15:30.768977+00:00", "description": "An anonymous reader quotes a report from Ars Technica: A few months ago, Anthropic quietly hired its first dedicated \"AI welfare\" researcher, Kyle Fish, to explore whether future AI models might deserve moral consideration and protection, reports AI newsletter Transformer. While sentience in AI models is an extremely controversial and contentious topic, the hire could signal a shift toward AI companies examining ethical questions about the consciousness and rights of AI systems. Fish joined Anthropic's alignment science team in September to develop guidelines for how Anthropic and other companies should approach the issue. The news follows a major report co-authored by Fish before he landed his Anthropic role. Titled \"Taking AI Welfare Seriously,\" the paper warns that AI models could soon develop consciousness or agency -- traits that some might consider requirements for moral consideration. But the authors do not say that AI consciousness is a guaranteed future development.\n \n\"To be", "id": 1496355, "language": null, "link": "https://slashdot.org/story/24/11/11/2112231/is-ai-welfare-the-new-frontier-in-ethics?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Is 'AI Welfare' the New Frontier In Ethics?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T22:15:30.678914+00:00", "description": "The FTX estate has filed a lawsuit against Binance and former CEO Changpeng Zhao, seeking to recover $1.76 billion, alleging a \"fraudulent\" 2021 share deal that involved funding from FTX's insolvent Alameda Research. The suit also accuses Zhao of misleading social media posts that allegedly spurred customer withdrawals and contributed to FTX's collapse. CNBC reports: In a Sunday filing with a Delaware court, FTX cites a 2021 transaction in which Binance, Zhao and others exited their investment in FTX, selling a 20% stake in the platform and a 18.4% stake in its U.S.-based entity West Realm Shires back to the company. The FTX estate alleges that the share repurchase was funded by FTX's Alameda Research division through a combination of the company's and Binance's exchange tokens, as well as Binance's dollar-pegged stablecoin.\n \n\"Alameda was insolvent at the time of the share repurchase and could not afford to fund the transaction,\" the suit claims, labeling the deal agreed with FTX co", "id": 1496354, "language": null, "link": "https://yro.slashdot.org/story/24/11/11/2116250/ftx-sues-crypto-exchange-binance-and-its-former-ceo-zhao-for-18-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "FTX Sues Crypto Exchange Binance and Its Former CEO Zhao For $1.8 Billion", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T17:55:50.922479+00:00", "description": "A University of Zagreb virologist treated her own recurring breast cancer by injecting laboratory-grown viruses into her tumor, sparking debate about self-experimentation in medical research. Beata Halassy discovered her stage 3 breast cancer in 2020 at age 49, recurring at the site of a previous mastectomy. Rather than undergo another round of chemotherapy, she developed an experimental treatment using oncolytic virotherapy (OVT). \n\nOver two months, Halassy administered measles and vesicular stomatitis viruses directly into the tumor. The treatment caused the tumor to shrink and detach from surrounding tissue before surgical removal. Post-surgery analysis showed immune cell infiltration, suggesting the viruses had triggered an immune response against the cancer. Halassy has been cancer-free for four years. OVT remains unapproved for breast cancer treatment worldwide. Nature adds: Halassy felt a responsibility to publish her findings. But she received more than a dozen rejections fro", "id": 1494825, "language": null, "link": "https://science.slashdot.org/story/24/11/11/1649216/self-experimenting-virologist-defeats-breast-cancer-with-lab-grown-virus-treatment?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Self-Experimenting Virologist Defeats Breast Cancer With Lab-Grown Virus Treatment", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T17:55:50.435341+00:00", "description": "Google's head of research Yossi Matias maintains that learning to code remains \"as important as ever\" despite AI's growing role in software development. While AI tools have reduced coding time for some developers -- and Alphabet CEO Sundar Pichai noting that AI now generates a quarter of all code, Matias stressed that human engineers still review and approve AI-generated code. \n\nThe Google executive, who also serves as a company VP, acknowledged that junior professionals have faced challenges gaining experience as AI handles entry-level tasks. Google has launched initiatives to support early-career employees through this transition. Matias compared coding literacy to basic mathematics, arguing it provides crucial understanding of technology regardless of career path.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Research+Chief+Says+Learning+To+Code+'as+Important+as+Ever'%3A+https%3A%2F%2Fdevelopers.slashdot", "id": 1494824, "language": null, "link": "https://developers.slashdot.org/story/24/11/11/1735220/google-research-chief-says-learning-to-code-as-important-as-ever?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Research Chief Says Learning To Code 'as Important as Ever'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T16:51:19.021364+00:00", "description": "Cryptocurrency backers continue to bid up Bitcoin prices, pushing the digital token to a new high of about $84,000 on Monday. The New York Times: The cryptocurrency has surged since Election Day, on investor hopes that President-elect Donald J. Trump and his appointees would be friendlier to the industry after the Biden administration's aggressive enforcement of securities law that targeted several crypto companies. \n\nCryptocurrencies have become a major component of the so-called Trump trade. Bitcoin exchange-traded funds, which got the regulatory green light to trade this year, have been booming over the past week. Crypto-related companies have also jumped in value: Riot Platforms, a Bitcoin miner, is up 68 percent since Election Day and Coinbase, a crypto exchange, is up 69 percent over the same period.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bitcoin+Sets+Another+Record+as+Bullish+Bets+Continue%3A+https%3", "id": 1494384, "language": null, "link": "https://slashdot.org/story/24/11/11/1545205/bitcoin-sets-another-record-as-bullish-bets-continue?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Bitcoin Sets Another Record as Bullish Bets Continue", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T15:46:44.125770+00:00", "description": "The year 2024 is on track to be the warmest year on record after an extended streak of exceptionally high monthly global mean temperatures, the World Meteorological Organisation (WMO) has announced.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=2024+On+Track+To+Be+Hottest+Year+on+Record+as+Warming+Temporarily+Hits+1.5C%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F11%2F1450240%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F11%2F1450240%2F2024-on-track-to-be-hottest-year-on-record-as-warming-temporarily-hits-15c%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/11/11/1450240/2024-on-track-to-be-hottest-year-on-r", "id": 1493987, "language": null, "link": "https://news.slashdot.org/story/24/11/11/1450240/2024-on-track-to-be-hottest-year-on-record-as-warming-temporarily-hits-15c?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "2024 On Track To Be Hottest Year on Record as Warming Temporarily Hits 1.5C", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T15:46:44.037409+00:00", "description": "Most companies are starting to figure out how AI will change the way they do business. Chegg is trying to avoid becoming its first major victim. WSJ: The online education company was for many years the go-to source for students who wanted help with their homework, or a potential tool for plagiarism. The shift to virtual learning during the pandemic sent subscriptions and its stock price to record highs. \n\nThen came ChatGPT. Suddenly students had a free alternative to the answers Chegg spent years developing with thousands of contractors in India. Instead of \"Chegging\" the solution, they began canceling their subscriptions and plugging questions into chatbots. Since ChatGPT's launch, Chegg has lost more than half a million subscribers who pay up to $19.95 a month for prewritten answers to textbook questions and on-demand help from experts. Its stock is down 99% from early 2021, erasing some $14.5 billion of market value. Bond traders have doubts the company will continue bringing in e", "id": 1493986, "language": null, "link": "https://news.slashdot.org/story/24/11/11/1525223/how-chatgpt-brought-down-an-online-education-giant?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "How ChatGPT Brought Down an Online Education Giant", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T14:41:37.312403+00:00", "description": "AI companies like OpenAI are seeking to overcome unexpected delays and challenges in the pursuit of ever-large language models by developing training techniques that use more human-like ways for algorithms to \"think.\" From a report: A dozenAI scientists, researchers and investors told Reuters they believe that these techniques, which are behind OpenAI's recently released o1 model, could reshape the AI arms race, and have implications for the types of resources that AI companies have an insatiable demand for, from energy to types of chips. \n\nAfter the release of the viral ChatGPT chatbot two years ago, technology companies, whose valuations have benefited greatly from the AI boom, have publicly maintained that \"scaling up\" current models through adding more data and computing power will consistently lead to improved AI models. But now, some of the most prominent AI scientists are speaking out on the limitations of this \"bigger is better\" philosophy. Ilya Sutskever, co-founder of AI la", "id": 1493542, "language": null, "link": "https://tech.slashdot.org/story/24/11/11/144206/openai-and-others-seek-new-path-to-smarter-ai-as-current-methods-hit-limitations?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI and Others Seek New Path To Smarter AI as Current Methods Hit Limitations", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T13:36:34.175136+00:00", "description": "A new article at Reason.com argues that U.S. courts \"are coming for digital libraries.\"\n\nIn September, a federal appeals court dealt a major blow to the Internet Archive &mdash; one of the largest online repositories of free books, media, and software &mdash; in a copyright case with significant implications for publishers, libraries, and readers. The U.S. Court of Appeals for the 2nd Circuit upheld a lower court ruling that found the Internet Archive's huge, digitized lending library of copyrighted books was not covered by the \"fair use\" doctrine and infringed on the rights of publishers. Agreeing with the Archive's interpretation of fair use \"would significantly narrow &mdash; if not entirely eviscerate &mdash; copyright owners' exclusive right to prepare derivative works,\" the 2nd Circuit ruled. \"Were we to approve [Internet Archive's] use of the works, there would be little reason for consumers or libraries to pay publishers for content they could access for free.\" \n\nOthers disag", "id": 1493170, "language": null, "link": "https://news.slashdot.org/story/24/11/11/0112229/are-americas-courts-going-after-digital-libraries?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Are America's Courts Going After Digital Libraries?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T09:15:59.275472+00:00", "description": "On its 20th anniversary, Firefox \"is still going strong, and it is a better browser today than it ever was,\" according to TechCrunch. \n\nIn an interview, Mozilla's interim CEO says one of the first things they did when was to \"unlock a bunch of money towards Firefox product development... I've been in enough places where people tend to forget about the core business, and they stop investing in it, because they get distracted by shiny things &mdash; and then they regret it.\"\n\n\n\n\"Firefox is incredibly important, and it is our core. We've actually put more investment into it this year and into connecting with our communities, into bringing out and testing features that are positive and creating good experiences for folks. That's been a huge priority for me and for the company this year, and it's showing up in the results.\" \n\nShe acknowledged that Mozilla doesn't have the device distribution that benefits many of Firefox's competitors, especially on mobile, but she did note that the Digit", "id": 1491980, "language": null, "link": "https://news.slashdot.org/story/24/11/11/0148222/firefox-gets-more-investment-in-new-features-prioritizing-people-and-privacy-over-profit?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Firefox Gets More Investment in New Features, Prioritizing People (and Privacy) Over Profit", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T06:01:04.415103+00:00", "description": "Renew Home says they're building a \"virtual power plant\" in Texas by \"enabling homes to easily reduce and shift the timing of energy use.\" Thursday they announced a 10-year project distributing hundreds of thousands of smart thermostats to customers of Texas-based power utility NRG Energy, starting next spring. (Bloomberg calls them \"AI-enabled thermostats that use Alphabet Inc.'s Google Cloud technology.\") The ultimate goal? \"Create a nearly 1-gigawatt, AI-powered virtual power plant\" &mdash; equivalent to 1.9 million solar panels, enough to power about 200,000 homes during peak demand. \n\nOne NRG executive touted the move as \"cutting-edge, AI-driven solutions that will bolster grid resilience and contribute to a more sustainable future.\"\n\n\n[Residential virtual power plants] work by aggregating numerous, small-scale distributed energy resources like HVAC systems controlled by smart thermostats and home batteries and coordinating them to balance supply and demand... NRG, in partnershi", "id": 1491453, "language": null, "link": "https://hardware.slashdot.org/story/24/11/10/2253250/can-ai-enabled-thermostats-create-a-virtual-power-plant-in-texas?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Can AI-Enabled Thermostats Create a 'Virtual Power Plant' in Texas?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T03:51:08.886893+00:00", "description": "Wednesday Cuba was hit by a major hurricane which took down its entire power grid again, this time for about 24 hours, according to CNN:\n\n\nVideos of the aftermath showed power infrastructure turned into a mangled mess and power poles down on streets. Hundreds of technicians were mobilized Thursday to reestablish power connections, according to state media... Operations at two electrical plants were partially restored and parts of eastern and central Cuba had electricity back up by Thursday afternoon, state media reported... The country's power grid has collapsed multiple times, including when Hurricane Oscar hit in October and killed at least 7 people. \nIn the capital of Havana, where 2 million people live, power had been restored to less than 20% of the city by late Friday afternoon, . \"Authorities had not yet given an estimate for when power would be fully restored...\" \nThen tonight, CNN reported:\n\nA 6.8 magnitude earthquake struck off the coast of eastern Cuba on Sunday, causing m", "id": 1491152, "language": null, "link": "https://hardware.slashdot.org/story/24/11/11/0243251/cubas-power-grid-collapses-again-after-second-hurricane-and-then-an-earthquake-hit?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Cuba's Power Grid Collapses Again After Second Hurricane.  And Then an Earthquake Hit", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T02:45:58.005459+00:00", "description": "When a volcano erupted in 1980 about 70 miles from Portland, \"lava incinerated anything living for miles around,\" remembers an announcement from the University of California at Riverside. But \"As an experiment, scientists later dropped gophers onto parts of the scorched mountain for only 24 hours. \n\n\"The benefits from that single day were undeniable &mdash; and still visible 40 years later.\"\n\nOnce the blistering blast of ash and debris cooled, scientists theorized that, by digging up beneficial bacteria and fungi, gophers might be able to help regenerate lost plant and animal life on the mountain. Two years after the eruption, they tested this theory. \"They're often considered pests, but we thought they would take old soil, move it to the surface, and that would be where recovery would occur,\" said UC Riverside microbiologist Michael Allen. \n\nThey were right. But the scientists did not expect the benefits of this experiment would still be visible in the soil today, in 2024. A paper o", "id": 1491034, "language": null, "link": "https://science.slashdot.org/story/24/11/10/2326249/how-gophers-restored-plant-life-to-a-volcano-ravaged-mountain---in-one-day?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "How Gophers Restored Plant Life to a Volcano-Ravaged Mountain - in One Day.", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T00:29:47.569645+00:00", "description": "When a volcano erupted in 1980 about 70 miles from Portland, \"lava incinerated anything living for miles around,\" remembers an announcement from the University of California at Riverside. But \"As an experiment, scientists later dropped gophers onto parts of the scorched mountain for only 24 hours. \n\n\"The benefits from that single day were undeniable &mdash; and still visible 40 years later.\"\n\nOnce the blistering blast of ash and debris cooled, scientists theorized that, by digging up beneficial bacteria and fungi, gophers might be able to help regenerate lost plant and animal life on the mountain. Two years after the eruption, they tested this theory. \"They're often considered pests, but we thought they would take old soil, move it to the surface, and that would be where recovery would occur,\" said UC Riverside microbiologist Michael Allen. \n\nThey were right. But the scientists did not expect the benefits of this experiment would still be visible in the soil today, in 2024. A paper o", "id": 1490695, "language": null, "link": "https://science.slashdot.org/story/24/11/10/2326249/how-gophers-restored-plant-life-to-a-volcano-ravage-mountain---in-one-day?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "How Gophers Restored Plant Life to a Volcano-Ravage Mountain - in One Day.", "vote": 0}]