[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T22:45:02+00:00", "description": "The Mario and Luigi franchise has been dormant for a while, and series developer AlphaDream doesn’t even exist anymore, but it has returned with a long overdue new instalment in Mario and Luigi: Brothership- and honestly, we couldn’t have hoped for a better return. \n\nExcellent writing, oodles of charm and humour, a truly gorgeous visual style, consistently enjoyable combat, and genuinely rewarding exploration and progression come together in what is yet another major win for the Switch in the tail end of its lifecycle.", "id": 1496721, "language": null, "link": "https://www.youtube.com/watch?v=Q4EF7f5zdX8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/Q4EF7f5zdX8/hqdefault.jpg", "title": "Mario And Luigi Brothership Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T22:45:01+00:00", "description": "It may not seem like it now, but Frontier Developments' Planet Coaster was a big deal at launch. As a spiritual successor to the Rollercoaster Tycoon series, it finally provided a contemporary template for fans to create the roller coasters they desired. To say that a sequel is highly anticipated would be an understatement.\n\nFrom the outset, Planet Coaster 2 looked enticing with improved visuals, new water attractions (from flumes to lazy rivers), and more. Unfortunately, it's all pushed by the wayside due to the unintuitive UI, which requires too much menu navigation, even for most basic tasks. It's bad enough that it brings the Career Mode (sporting intriguing objectives and annoying writing) down.\n\nThen there's the annoying pathing, the distinct lack of polish, the lackluster themes, and other features missing from the original. You can still have fun with Planet Coaster 2, with improvements forthcoming. However, for now, it's hard to recommend.", "id": 1496722, "language": null, "link": "https://www.youtube.com/watch?v=oRd-lY9zxuE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/oRd-lY9zxuE/hqdefault.jpg", "title": "Planet Coaster 2 Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T15:30:07+00:00", "description": "MachineGames has earned enough fans with the Wolfenstein series that excitement surrounding its next game was going to be high no matter what it was but add the Indiana Jones license on top of that, and you get genuine, palpable hype, which is continuing to build as we approach Indiana Jones and the Great Circle's release. \n\nAs we count the days down to its launch, then, here, we're going to go over a few things that we cannot wait to do in the game when we finally have the chance to dive in and play it for ourselves.", "id": 1494050, "language": null, "link": "https://www.youtube.com/watch?v=CSoT86NerdU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/CSoT86NerdU/hqdefault.jpg", "title": "Indiana Jones And The Great Circle - 10 Things WE CAN'T WAIT TO DO", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-11T13:30:08+00:00", "description": "Despite launching only four years ago, the Xbox Series X/S has received some pretty noteworthy titles. On the first-party front, there's Halo Infinite, Senua's Saga: Hellblade 2, Forza Horizon 5, Hi-Fi Rush, and Microsoft Flight Simulator. Each stands out as a noteworthy reason to own the console.\n\nHowever, there are numerous multiplatform and third-party titles worth experiencing. Be it long-awaited games like Dragon's Dogma 2, Psychonauts 2, Warhammer 40,000: Space Marine 2, and EA Sports College Football 25 or blockbusters like Baldur's Gate 3, Elden Ring, and Cyberpunk 2077, the amount of variety is pretty stunning.\n\nCheck out the top 30 best Xbox Series X/S titles as of 2024. Regardless of the future, it's a pretty good time to pick up the consoles (outside of leveraging Game Pass and its ever-burgeoning library of titles).", "id": 1493209, "language": null, "link": "https://www.youtube.com/watch?v=9vMyi9mR0OE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/9vMyi9mR0OE/hqdefault.jpg", "title": "Top 30 GREATEST Xbox Series X | S Games You NEED TO PLAY [2024 Edition]", "vote": 0}]