[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 Big Ways Video Game Graphics WILL NEVER BE THE SAME", "description": "The last couple of years have been amongst the most technologically disruptive on record, with leaps in artificial intelligence and procedural generation providing an ever-expanding toolset for game developers to enhance the fidelity and lifelikeness of their video games. \n\nThere are, of course, concerns that emergent tech might have drastic implications in some areas but as things stand right now there’s no replacement for the personal touch. \n\nAfter all, much of the technological leaps featured in this rundown aim to streamline the game creation process; a smoother game development cycle will allow studios to finetune their experiences, resulting in more immersive gameplay in addition to enhancements in graphics, environments, and lighting.", "link": "https://www.youtube.com/watch?v=5qKvs3V8FTY", "date_published": "2023-11-28T15:30:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/5qKvs3V8FTY/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Top 15 Best Role Playing Games (RPGs) of All Time - 2023 Edition", "description": "The medium of games is home to a slew of amazing genres, which includes but is not limited to role playing games. There's just something special about a good RPG that features best in class writing, compelling characters and an engaging progression loop that just keeps you hooked to the experience through and through.  \n\nThe last couple of years have seen plenty of new RPGs that has consistently impressed us with fresh mechanics and have quickly gone on to become some of our favorites. With this feature - we will be taking a look at 15 of the best RPGs of all time ranging from timeless classics to recent masterpieces and everything in between.", "link": "https://www.youtube.com/watch?v=b8kjRBkwOCQ", "date_published": "2023-11-28T13:30:24+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/b8kjRBkwOCQ/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]