[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmKurapML4BF9Bjtj4RbvXw", "title": "Bring A Torch, Jeanette, Isabella (Jon Schmidt Christmas) The Piano Guys", "description": "Discover the enchanting world of Jon Schmidt's piano masterpiece with his unique arrangement of \"Bring A Torch, Jeanette, Isabella.\" Immerse yourself in the melodic brilliance as Jon weaves a captivating narrative through his piano keys, bringing a fresh perspective to this timeless carol. Whether you're a piano enthusiast or a lover of classic holiday tunes, Jon Schmidt's rendition adds a modern twist to the traditional melody. Share the magic with friends and family, and let the piano notes transport you to a festive realm where the spirit of \"Bring A Torch, Jeanette, Isabella\" comes alive.\n\nDownload the Album \"Jon Schmidt Christmas\" https://thepianoguys.com/collections/albums/products/jon-schmidt-christmas-cd?variant=1990100156460\n\n👉 Subscribe to our channel https://bit.ly/2XH4GCF for more heartwarming melodies that capture the spirit of the season. May \"Bring A Torch, Jeanette, Isabella\" become a part of your holiday traditions, creating lasting memories for years to come.\n\nWE’RE", "link": "https://www.youtube.com/watch?v=JrpXWxp02SY", "date_published": "2023-11-28T18:18:16+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Piano Guys", "album": "The Piano Guys", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/JrpXWxp02SY/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmKurapML4BF9Bjtj4RbvXw", "title": "Simple Gifts (Steven Sharp Nelson/Christmas Cello) The Piano Guys", "description": "Dive into the timeless beauty of \"Simple Gifts\" with Steven Sharp Nelson's soulful cello rendition, capturing the essence of this classic melody's origins. Transport yourself to a world of simplicity and grace as Steve breathes new life into the traditional Shaker hymn. Whether you're a music enthusiast or a seeker of cultural treasures, this enchanting performance delves into the roots of \"Simple Gifts,\" embracing the purity of its message. Share the musical journey with friends and explore the rich history behind the melody, as Steven Sharp Nelson unveils the heart and soul of \"Simple Gifts\" through the resonating tones of his cello. \n\nDownload the Album \"Christmas Cello\" https://thepianoguys.com/collections/albums/products/christmas-cello?variant=1990084231212\n\n👉 Subscribe to our channel https://bit.ly/2XH4GCF for more heartwarming melodies that capture the spirit of the season. May \"Simple Gifts\" become a part of your holiday traditions, creating lasting memories for years to com", "link": "https://www.youtube.com/watch?v=7hQlYXR66ZA", "date_published": "2023-11-28T04:33:59+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Piano Guys", "album": "The Piano Guys", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/7hQlYXR66ZA/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]