[{"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Emanuel Maiberg reports via 404 Media: Dozens of Ghost kitchens, restaurants that serve food exclusively by delivery on apps like DoorDash and Grubhub, are selling food that they promote to customers with AI-generated images. It's common for advertisements to stage or edit pictures of food to make it look more enticing, but in these cases the ghost kitchens are showing people pictures of food that literally doesn't exist, and looks nothing like the actual items they're selling, sometimes because the faulty AI is producing physically impossible food items. [...] Some ghost kitchens exist as unmarked commercial kitchens with no actual restaurant you can visit that simply fulfill orders for a variety of brands that only exist on the food delivery services. Other ghost kitchens piggyback on existing, real restaurant kitchens to fulfill orders for those brands that exist only on food delivery apps.\n \n[The food from a business on DoorDash called Pasta Lovers] actually comes from To", "link": "https://slashdot.org/story/24/02/27/2138240/ghost-kitchens-are-advertising-ai-generated-food-on-doordash-and-grubhub?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Ghost Kitchens Are Advertising AI-Generated Food On DoorDash and Grubhub", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T23:48:05.726696+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "An anonymous reader quotes a report from Ars Technica: Meta will soon begin \"collecting anonymized data\" from users of its Quest headsets, a move that could see the company aggregating information about hand, body, and eye tracking; camera information; \"information about your physical environment\"; and information about \"the virtual reality events you attend.\" In an email sent to Quest users Monday, Meta notes that it currently collects \"the data required for your Meta Quest to work properly.\" Starting with the next software update, though, the company will begin collecting and aggregating \"anonymized data about... device usage\" from Quest users. That anonymized data will be used \"for things like building better experiences and improving Meta Quest products for everyone,\" the company writes.\n \nA linked help page on data sharing clarifies that Meta can collect anonymized versions of any of the usage data included in the \"Supplemental Meta Platforms Technologies Privacy Policy,", "link": "https://yro.slashdot.org/story/24/02/27/2116258/meta-will-start-collecting-anonymized-data-about-quest-headset-usage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Meta Will Start Collecting 'Anonymized' Data About Quest Headset Usage", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T22:42:35.046991+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Apple has filed a lawsuit against the U.S. Patent and Trademark Office for refusing to grant trademarks covering the company's augmented-reality software development tools \"Reality Composer\" and \"Reality Converter.\" Reuters reports: Apple, whose augmented-reality technology is a centerpiece of its newly released Vision Pro headset, asked the court (PDF) on Friday to reverse the USPTO's decision that the phrases were not distinctive enough to receive federal trademark protection. \"Consumers must exercise imagination to understand how the nonsensical phrases 'reality composer' and 'reality converter' -- which sound like science fiction impossibilities -- relate to Apple's products,\" the complaint said. \"They are suggestive, just as Burger King is a fast-food chain, not an actual monarch.\"\n \nApple's Reality Composer and Reality Converter allow developers to create and alter 3-D augmented-reality content for Apple apps. The content is compatible with Apple devices including the V", "link": "https://yro.slashdot.org/story/24/02/27/2123239/apple-sues-to-win-trademarks-for-augmented-reality-software?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Apple Sues To Win Trademarks For Augmented-Reality Software", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T22:42:33.212684+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "An anonymous reader shares a report: Microsoft is already testing Windows 11 24H2, this fall's big new Windows release. The company has already demonstrated a few new features, like 80Gbps USB4 support and Sudo for Windows, and the new version could also give a significant refresh to the Windows installer for the first time since the Windows Vista days. But there's one big update you might not notice at all. Late last week, Microsoft released \"servicing updates\" with no new features to Windows Insiders in the Dev and Canary channels. The updates were \"designed to test [Microsoft's] servicing pipeline for Windows 11.\" It's pretty common for Insiders to get these kinds of updates-that-exist-only-to-test-the-update-process, but the twist here is that PCs with Virtualization Based Security (VBS) enabled could apply the update without rebooting. \n\nSources speaking to Windows Central say this isn't a fluke -- Microsoft reportedly intends to use a Windows Server feature called hotpa", "link": "https://tech.slashdot.org/story/24/02/27/1849200/windows-security-updates-could-come-with-fewer-reboots-beginning-later-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Windows Security Updates Could Come With Fewer Reboots Beginning Later This Year", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T21:37:59.344424+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Amazon has issued an update to Fire TV streaming devices and televisions that has broken apps that let users bypass the Fire OS home screen. From a report: The tech giant claims that its latest Fire OS update is about security but has refused to detail any potential security concerns. Users and app developers have reported that numerous apps that used to work with Fire TV devices for years have suddenly stopped working. As first reported by AFTVnews, the update has made apps unable to establish local Android Debug Bridge (ADB) connections and execute ADB commands with Fire TV devices. \n\nThe update, Fire OS 7.6.6.9, affects several Fire OS-based TVs, including models from TCL, Toshiba, Hisense, and Amazon's Fire TV Omni QLED Series. Other devices running the update include Amazon's first Fire TV Stick 4K Max, the third-generation Fire TV Stick, as well as the third and second-generation Fire TV Cubes and the Fire TV Stick Lite. A code excerpt shared with AFTVnews by what the p", "link": "https://it.slashdot.org/story/24/02/27/1927226/amazon-bricks-long-standing-fire-tv-apps-with-new-update?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Amazon Bricks Long-Standing Fire TV Apps With New Update", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T21:37:57.263671+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "OpenAI has asked a federal judge to dismiss parts of the New York Times' copyright lawsuit against it, arguing that the newspaper \"hacked\" its chatbot ChatGPT and other AI systems to generate misleading evidence for the case. From a report: OpenAI said in a filing in Manhattan federal court on Monday that the Times caused the technology to reproduce its material through \"deceptive prompts that blatantly violate OpenAI's terms of use.\" \n\n\"The allegations in the Times's complaint do not meet its famously rigorous journalistic standards,\" OpenAI said. \"The truth, which will come out in the course of this case, is that the Times paid someone to hack OpenAI's products.\" OpenAI did not name the \"hired gun\" who it said the Times used to manipulate its systems and did not accuse the newspaper of breaking any anti-hacking laws.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Says+New+York+Times+'Hacked'+ChatGPT+To+Build+Copyright+Lawsui", "link": "https://yro.slashdot.org/story/24/02/27/1817208/openai-says-new-york-times-hacked-chatgpt-to-build-copyright-lawsuit?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "OpenAI Says New York Times 'Hacked' ChatGPT To Build Copyright Lawsuit", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T19:22:31.622181+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Tumblr and Wordpress are preparing to sell user data to Midjourney and OpenAI, 404Media reported Tuesday, citing a source with internal knowledge about the deals and internal documents. From the report: The exact types of data from each platform going to each company are not spelled out in documentation we've reviewed, but internal communications reviewed by 404 Media make clear that deals between Automattic, the platforms' parent company, and OpenAI and Midjourney are imminent. The internal documentation details a messy and controversial process within Tumblr itself. One internal post made by Cyle Gage, a product manager at Tumblr, states that a query made to prepare data for OpenAI and Midjourney compiled a huge number of user posts that it wasn't supposed to. It is not clear from Gage's post whether this data has already been sent to OpenAI and Midjourney, or whether Gage was detailing a process for scrubbing the data before it was to be sent.<p><div class=\"share_submissio", "link": "https://news.slashdot.org/story/24/02/27/191230/tumblr-and-wordpress-are-preparing-to-sell-user-data-to-openai-and-midjourney-report-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Tumblr and Wordpress Are Preparing To Sell User Data To OpenAI and Midjourney, Report Says", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T19:22:28.543558+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Bloomberg News: Apple is canceling a decade-long effort to build an electric car, according to people with knowledge of the matter, abandoning one of the most ambitious projects in the history of the company. Apple made the disclosure internally Tuesday, surprising the nearly 2,000 employees working on the project, said the people, who asked not to be identified because the announcement wasn't public. \n\nThe decision was shared by Chief Operating Officer Jeff Williams and Kevin Lynch, a vice president in charge of the effort, according to the people. The two executives told staffers that the project will begin winding down and that many employees on the team working on the car -- known as the Special Projects Group, or SPG -- will be shifted to the artificial intelligence division under executive John Giannandrea. Those employees will focus on generative AI projects, an increasingly key priority for the company. The Apple car team also has several hundred hardware engineers an", "link": "https://apple.slashdot.org/story/24/02/27/195235/apple-cancels-work-on-electric-car?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Apple Cancels Work on Electric Car", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T19:22:25.900261+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Streaming revenue will overtake pay TV subscription revenue in the U.S. for the first time later in 2024, helped by the addition of ad tiers by various streamers, according to a new forecast. From a report: Total revenues from streaming, including subscription and advertising revenue, will start topping revenue from pay TV subscriptions in the third quarter of 2024, research company Ampere Analysis projects in a new study unveiled on Monday. \"Streaming will continue to race ahead as traditional pay TV declines -- with the value of pay TV in 2028 expected to fall to half the value it saw at its peak in 2017,\" it predicts.\nStreaming subscribers overtook pay TV subs in the U.S. in 2016, but \"streaming's lower average revenue per user (ARPU), which currently sits at around a tenth that of pay TV, means that revenue is only now catching up,\" Ampere explained. U.S. pay TV revenue will still be narrowly ahead of streaming revenue in the second quarter at $17.1 billion to $17 billion", "link": "https://entertainment.slashdot.org/story/24/02/27/162246/streaming-to-overtake-pay-tv-subscription-revenue-for-the-first-time-in-us-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Streaming To Overtake Pay TV Subscription Revenue For the First Time in US This Year", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T18:18:10.619569+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Undersea data cables in the Red Sea have reportedly been damaged, months after Yemeni Houthi rebels threatened to do so. From a report: At least 15 submarine cables pass through the Bab al-Mandab Strait at the southern end of the Red Sea, a body of water just 26km wide at some points. Yemen is the Strait's northern shore. The first reports of damage to submarine cables off the coast of Yemen began emerged on Monday morning, with Israeli news outlet Globes claiming that four cables (EIG, AAE-1, Seacom and TGN-EA) had experienced damage. Seacom has reportedly confirmed damage to a cable it operates on a stretch between Kenya and Egypt. \n\n\"The location of the cable break is significant due to its geopolitical sensitivity and ongoing tensions, making it a challenging environment for maintenance and repair operations,\" Seacom said. \"The team is currently working towards restoration timelines and will communicate these plans with our clients.\" Globes attributed the outages to the I", "link": "https://tech.slashdot.org/story/24/02/27/179240/underwater-cables-in-red-sea-damaged-months-after-houthis-threatened-to-do-just-that?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Underwater Cables in Red Sea Damaged Months After Houthis Threatened To Do Just That", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T18:18:09.096257+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "AI is likely to replace or at least lend a hand in tasks that take up almost three-quarters of the time bank employees now spend working. From a report: That's the conclusion of a new analysis by consultancy Accenture, which said banking has the potential to benefit more from the technology than any other industry. Just 27% of employees' time currently has a low potential of being transformed, according to the analysis. \"There is a reinvention that is happening across banks, a way for firms to step back and re-evaluate ways of working,\" Keri Smith, global banking data and AI lead at Accenture, said in an interview. \n\nThe release of ChatGPT more than a year ago prompted many firms to boost hiring for AI-related positions and test more uses for generative AI, which can summarize documents, write emails and churn out responses to users' questions. The world's biggest banks have been experimenting, spurred by the promise that the technology will boost staffers' productivity and c", "link": "https://slashdot.org/story/24/02/27/1542200/bankers-will-see-ai-transform-three-quarters-of-day-study-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Bankers Will See AI Transform Three-Quarters of Day, Study Says", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T17:13:30.360720+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Nvidia's completely free, no-strings attached trial of its cloud gaming service GeForce Now is about to be very slightly less of a deal. Nvidia says users will now start seeing ads. From a report: They're only for the free tier -- not Priority or Ultimate -- and even then, it sounds like they won't interrupt your gameplay. \"Free users will start to see up to two minutes of ads while waiting in queue to start a gaming session,\" writes Nvidia spokesperson Stephanie Ngo. Currently, the free tier does often involve waiting in line for a remote computer to free up before every hour of free gameplay -- now, I guess there'll be a few ads too. Nvidia says the ads should help pay for the free tier of service, and that it expects the change \"will reduce average wait times for free users over time.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nvidia's+Free-tier+GeForce+Now+Will+Soon+Show+Ads+While+You're+Waiting+To+Play%3A+https%3A%2F%2Fslas", "link": "https://slashdot.org/story/24/02/27/116237/nvidias-free-tier-geforce-now-will-soon-show-ads-while-youre-waiting-to-play?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Nvidia's Free-tier GeForce Now Will Soon Show Ads While You're Waiting To Play", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T16:04:22.713540+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "The U.S. and several international partners endorsed shared principles for developing 6G wireless communication systems, the White House said Monday. From a report: A battle is underway to influence the standards of 6G amid concerns by Western countries and their allies that authoritarian regimes could gain further control over Internet in their countries. Policies around wireless communications influence economic-growth and national security, fueling the race between the U.S. and China -- which claimed earlier this month that it had launched the world's first satellite \"to test 6G architecture,\" per state media. \n\nThe governments of the U.S., Australia, Canada, the Czech Republic, Finland, France, Japan, South Korea, Sweden and the U.K. released a joint statement saying that by working together, \"we can support open, free, global, interoperable, reliable, resilient, and secure connectivity.\" They laid out principles including using systematic approaches to cybersecurity, bei", "link": "https://tech.slashdot.org/story/24/02/27/0825251/6g-principles-endorsed-by-us-and-international-partners?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "6G Principles Endorsed By US and International Partners", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T16:04:20.283803+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Sony's PlayStation division is cutting jobs in the latest round of high-profile layoffs in the video game industry. From a report: By some estimations, 2024 has already seen more than 7,000 video game industry layoffs. Related to these moves, PlayStation is proposing to close its London games studio, which was most recently responsible for developing PlayStation VR games. Cuts are also coming to Sony's other studios, including Firesprite, Insomniac Games, Naughty Dog, and Guerrilla. PlayStation's technology, creative, and support teams are also affected by these measures. In a blog post, outgoing SIE CEO Jim Ryan said it was an \"extremely hard decision\" to make these cuts, which amount to 900 people or about 8% of PlayStation. Ryan is leaving in March.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=PlayStation+Cutting+900+Jobs+In+Video+Game+Industry's+Latest+Round+Of+Big+Cuts%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F02%2F27", "link": "https://games.slashdot.org/story/24/02/27/1342202/playstation-cutting-900-jobs-in-video-game-industrys-latest-round-of-big-cuts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "PlayStation Cutting 900 Jobs In Video Game Industry's Latest Round Of Big Cuts", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T14:53:41.368134+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Optical discs that can store up to 200 TB of data could be possible with a new technology developed in China. If commercialized, it could revive optical media as an alternative to hard disk or tape for cost-effective long-term storage. The Register: Researchers at the University of Shanghai for Science and Technology (USST) and Shanghai Institute of Optics and Fine Mechanics (SIOM) say they have demonstrated that optical storage is possible up to the petabit level by using hundreds of layers, while also claiming to have broken the optical diffraction barrier limiting how close together recorded features can be. \n\nIn an article published in Nature titled \"A 3D nanoscale optical disk memory with petabit capacity,\" the researchers detail how they developed a novel optical storage medium they call dye-doped photoresist (DDPR) with aggregation-induced emission luminogens (AIE-DDPR). When applied as a recording layer, this is claimed to outperform other optical systems and hard dri", "link": "https://hardware.slashdot.org/story/24/02/27/096253/china-breakthrough-promises-optical-discs-that-store-hundreds-of-terabytes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "China Breakthrough Promises Optical Discs That Store Hundreds of Terabytes", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T14:53:39.783055+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "An anonymous reader quotes a report from The Register: A law firm acting on behalf of the Nevada Attorney General Aaron Ford has asked a state court to issue a temporary restraining order (TRO) denying minors access to encrypted communication in Meta's Messenger application. The motion for a TRO follows AG's Ford announcement of civil lawsuits on January 30, 2024 against five social media companies, including Meta [PDF], alleging the companies deceptively marketed their services to young people through algorithms that were designed to promote addiction. Nevada was not a party to the two multi-district lawsuits filed against Meta last October by 42 State Attorney General over claims that the social media company knowingly ignored evidence that its Facebook and Instagram services contribute to the mental harm of children and teens. Meta, which lately has been investing in virtual reality and large language models, is also being sued by hundreds of school districts around the US", "link": "https://meta.slashdot.org/story/24/02/27/0037240/nevada-sues-to-deny-kids-access-to-metas-messenger-encryption?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Nevada Sues To Deny Kids Access To Meta's Messenger Encryption", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T13:48:01.899841+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Robin George Andrews writes via The New York Times: In 2022, when NASA's $325 million spacecraft crashed into an asteroid named Dimorphos at 14,000 miles per hour, cheers and applause erupted back on Earth. NASA's Double Asteroid Redirection Test (DART) mission deliberately targeted Dimorphos to change its orbit around the larger asteroid Didymos as a dress rehearsal of sorts for thwarting a deadly space rock that might someday head toward Earth. The world's first-ever planetary defense experiment was deemed a triumph: The asteroid's orbit shrank by 33 minutes, far above the minimum threshold of 73 seconds. But what the DART team didn't realize then was just how bizarrely Dimorphos responded to that punch. A new study, published on Monday in Nature Astronomy, has concluded that DART hit Dimorphos so hard that the asteroid changed shape.\n \nSimulations of the impact suggest that the spacecraft's death did not excavate a normal, bowl-shaped crater. Instead, it left behind someth", "link": "https://science.slashdot.org/story/24/02/27/0022243/nasas-crash-into-an-asteroid-may-have-altered-its-shape?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "NASA's Crash Into an Asteroid May Have Altered Its Shape", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T10:33:29.571601+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Netflix is severing ties with Apple's App Store billing system for good. From a report: Netflix stopped allowing new and rejoining subscribers to sign up with App Store billing back in 2018, but Netflix subscribers who were paying through Apple at the time were allowed to continue doing so. Now, that's finally about to change. \n\nAs reported by The Streamable, Netflix has started notifying people who currently pay for a subscription through Apple that they need to update their payment method to continue accessing the service. Netflix's support website has also been updated to acknowledge this change: \"Some Apple-billed members in select countries may be prompted to add a new payment method to continue their subscription.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Netflix+Members+With+Older+Subscriptions+Might+Get+Cut+Off+if+They+Don't+Update%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F02%2F26%2F2336247%2F%3Futm_source%3Dtw", "link": "https://apple.slashdot.org/story/24/02/26/2336247/netflix-members-with-older-subscriptions-might-get-cut-off-if-they-dont-update?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Netflix Members With Older Subscriptions Might Get Cut Off if They Don't Update", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T08:21:33.297683+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Alphabet's Google Cloud on Monday ramped up its criticism of Microsoft's cloud computing practices, saying its rival is seeking a monopoly that would harm the development of emerging technologies such as generative AI. From a report: \"We worry about Microsoft wanting to flex their decade-long practices where they had a lot of monopoly on the on-premise software before and now they are trying to push that into cloud now,\" Google Cloud Vice President Amit Zavery said in an interview. \"So they are creating this whole walled garden, which is completely controlled and owned by Microsoft, and customers who want to do any of this stuff, you have to go to Microsoft only,\" he said. \n\n\n\"If Microsoft cloud doesn't remain open, we will have issues and long-term problems, even in next generation technologies like AI as well, because Microsoft is forcing customers to go to Azure in many ways,\" Zavery said, referring to Microsoft's cloud computing platform. He urged antitrust regulators to ", "link": "https://tech.slashdot.org/story/24/02/26/2327241/google-steps-up-microsoft-criticism-warns-of-rivals-monopoly-in-cloud?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Google Steps Up Microsoft Criticism, Warns of Rival's Monopoly in Cloud", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T06:10:18.555294+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "An anonymous reader quotes a report from The Guardian: A global coalition of democracies is being formed to protect their societies from disinformation campaigns by foreign governments, the US special envoy on the issue has said. James Rubin, the special envoy for non-state propaganda and disinformation efforts at the US state department's global engagement centre (GEC), said the coalition hoped to agree on \"definitions for information manipulation versus plain old opinions that other governments are entitled to have even if we disagree with them.\" The US, UK and Canada have already signed up to a formal framework agreement, and Washington hopes more countries will join.\n \nThe GEC focuses solely on disinformation by foreign powers. Apart from trying to develop global strategies, it works to expose specific covert disinformation operations, such as a Russian operation in Africa to discredit US health services. The US, UK and Canada signed the framework to counter foreign state", "link": "https://news.slashdot.org/story/24/02/26/2216240/us-leading-global-alliance-to-counter-foreign-government-disinformation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "US Leading Global Alliance To Counter Foreign Government Disinformation", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T04:00:29.211324+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "Maker Roni Bandini developed a Raspberry Pi project to address his neighbors' loud reggaeton music by creating an AI-driven system that distorts audio on nearby Bluetooth speakers when reggaeton is detected. Tom's Hardware reports: Powering this Bluetooth jamming device is a Raspberry Pi 3 B+. It's connected to a DFRobot OLED display panel, which has a resolution of 128 x 32px. Audio is observed using a USB microphone, while a push button handles when the system will perform a check to listen for any potential reggaeton. According to Bandini, the Pi is running Raspberry Pi OS. The AI system driving the machine learning aspects of the design is Edge Impulse. With this, Bandini was able to train the Pi to listen for music and more specifically identify whether the song playing is classifiable as reggaeton or not. The official project page is available at Hackster.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Hacker+Uses+Raspberry+Pi+", "link": "https://hardware.slashdot.org/story/24/02/26/221255/hacker-uses-raspberry-pi-and-ai-to-block-noisy-neighbors-music?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Hacker Uses Raspberry Pi and AI To Block Noisy Neighbor's Music", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T01:50:44.961518+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "According to a new study, almost half of America's new college graduates are winding up in jobs they didn't need to go to college to get. CBS News reports: If a graduate's first job is in a low-paying field or out-of-line with a worker's interests, it could pigeonhole them into an undesirable role or industry that's hard to escape, according to a new study (PDF) from The Burning Glass Institute and the Strada Institute for the Future of Work. Another study from the HEA Group found that a decade after enrolling in college, attendees of 1 in 4 higher education programs are earning less than $32,000 -- the median annual income for high school graduates. A college degree, in itself, is not a ticket to a higher-paying job, the study shows.\n \n\"Getting a college degree is viewed as the ticket to the American dream,\" said [Burning Glass CEO Matt Sigelman], \"and it turns out that it's a bust for half of students.\" The single greatest determinant of post-graduation employment prospects", "link": "https://news.slashdot.org/story/24/02/26/2210217/half-of-college-graduates-are-working-high-school-level-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Half of College Graduates Are Working High School Level Jobs", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T01:50:41.694407+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}, {"page_rating_visits": 0, "thumbnail": null, "album": "", "vote": 0, "description": "According to the Wall Street Journal (paywalled), Canada has proposed new rules that would compel digital platforms to remove online content that features the sexual exploitation of children or intimate images without consent of the individuals involved. From a report: The rules were years in the making, and represent the third and possibly final installment of measures aimed at regulating digital platforms. Measures introduced since 2022 aim to increase the amount of domestic, Canadian-made content on streaming services, such as Netflix, and require digital platforms to help Canadian news-media outlets finance their newsroom operations. The legislation needs to be approved by Canada's Parliament before it takes effect.\n \nCanada said its rules are based on concepts introduced by the European Union, the U.K. and Australia. Canadian officials say the proposed measures would apply to social-media platforms, adult-entertainment sites where users can upload content, and live-strea", "link": "https://news.slashdot.org/story/24/02/27/0017201/canada-to-compel-digital-platforms-to-remove-harmful-content?utm_source=rss1.0mainlinkanon&utm_medium=feed", "dead": false, "source_obj__id": 607, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Canada To Compel Digital Platforms To Remove Harmful Content", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "date_published": "2024-02-27T01:50:39.017275+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "help@slashdot.org", "user": null, "language": "en-us"}]