[{"page_rating_visits": 0, "thumbnail": "https://i3.ytimg.com/vi/vP6o_3QkSOs/hqdefault.jpg", "album": "", "vote": 0, "description": "It’s safe to say that Sony made a breakthrough hit with the PS1, and the magnitude of the success was such that it solidified the Japanese tech giant as one of the biggest market shareholders in the video game console space. While the quality of the hardware itself was also responsible for the success of the PS1, the majority of the success can be credited to an excellent assortment of releases that paved the way for future household franchises that opened the possibilities to entirely new avenues not seen before in gaming. \n\nWith this video, we count down 15 of the best PS1 releases of all time.", "link": "https://www.youtube.com/watch?v=vP6o_3QkSOs", "dead": false, "source_obj__id": 208, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "15 Amazing PlayStation 1 Games of All Time (Top PS1 Games - 2024 Edition)", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-02-27T20:30:05+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "GamingBolt", "user": null, "language": null}, {"page_rating_visits": 0, "thumbnail": "https://i2.ytimg.com/vi/IuvacvNpchY/hqdefault.jpg", "album": "", "vote": 0, "description": "The developer took multiple massive risks with Final Fantasy 7 Remake, from splitting into a trilogy to doing very much the opposite of sticking to the script, and while it remains to be seen just how good the full trilogy is going to be, based on its first instalment, we can, at the very least, safely say that it's gotten off to a stellar start, and that those aforementioned risks are, so far, paying off. \n\nThe trilogy will soon be continuing with Final Fantasy 7 Rebirth, so ahead of its launch, here, in this video, we're going to recap the entire story of Final Fantasy 7 Remake, as well as Intergrade's Episode INTERmission. Without further ado then, let's dive in.", "link": "https://www.youtube.com/watch?v=IuvacvNpchY", "dead": false, "source_obj__id": 208, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "The Full Story of Final Fantasy 7 Remake - Before You Play Final Fantasy Rebirth [4K]", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-02-27T18:00:10+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "GamingBolt", "user": null, "language": null}, {"page_rating_visits": 0, "thumbnail": "https://i4.ytimg.com/vi/Shlb5wQ3VLs/hqdefault.jpg", "album": "", "vote": 0, "description": "More than a decade on from the launch of the original Brothers: A Tale of Two Sons, Avantgarden and 505 Games have brought it back in the form of a remake. In being as faithful to the source material as it is, the remake successfully captures its biggest strengths – from its incredibly effective storytelling to vibrant, fairy tale-esque setting – but at the same time, its faithfulness also raises questions about whether or not it’s worth a purchase for those who’ve already played the original. \n\nThat Brothers: A Tale of Two Sons is a really good game isn’t in doubt in the slightest, and there’s also no doubt that its remake does a great job of modernizing it for current hardware- but mileage will definitely vary on whether it’s worthy of a pickup.", "link": "https://www.youtube.com/watch?v=Shlb5wQ3VLs", "dead": false, "source_obj__id": 208, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Brothers: A Tale of Two Sons Remake Review - Is This Remake Worth Playing?", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-02-27T16:00:25+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "GamingBolt", "user": null, "language": null}, {"page_rating_visits": 0, "thumbnail": "https://i2.ytimg.com/vi/qkaPYR-_dT4/hqdefault.jpg", "album": "", "vote": 0, "description": "Expeditions: A MudRunner Game is a follow-up to the Spintires series. However, instead of traversing through the mud and snow to deliver cargo, you're now part of a research team. With three unique maps based on real-world locations, players essentially blaze a trail through unknown parts, deliver equipment, gather materials and more. \n\nThe more open approach works with the series' hyper-realistic physics, where one wrong turn into the mud or water can significantly hamper you. The result is an exploration-focused 4x4 title where you plan out routes, choose the right vehicle, modify its loadout with different tools and then set out for an adventure. Here's everything you should know about Expeditions: A MudRunner Game when it launches on March 5th for Xbox Series X/S, PS5, Xbox One, PS4, PC and Switch.", "link": "https://www.youtube.com/watch?v=qkaPYR-_dT4", "dead": false, "source_obj__id": 208, "permanent": false, "age": null, "page_rating_votes": 0, "page_rating": 0, "title": "Expeditions: A MudRunner Game - 13 Things You ABSOLUTELY Need To Know Before You Buy", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-02-27T15:00:49+00:00", "comments": [], "bookmarked": false, "tags": [], "page_rating_contents": 0, "artist": "GamingBolt", "user": null, "language": null}]