[{"source": "https://www.arabnews.com/rss.xml", "title": "Arab artists must collaborate more for global success: Warner music chief", "description": "RIYADH: Artists living in the Middle East and North Africa should collaborate more to boost the industry in the region and globally, says Alfonso Perez Soto, president of emerging markets at Warner Music Group.\n\n\tSoto was speaking Thursday at the XP Music Futures conference currently underway in Riyadh. \n\n\tGrammy-nominated Lebanese singer-songwriter Mayssa Karaa moderated the fireside chat titled “The potential of the region and beyond: A conversation with Alfonso Perez.”", "link": "https://www.arabnews.com/node/2422311/lifestyle", "date_published": "2023-12-08T09:12:37+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "‘Day of Reckoning’ in Riyadh set to reorder boxing’s heavyweight division", "description": "RIYADH: Boxing’s heavyweight division is set for a major reordering when the “Day of Reckoning” takes place in Riyadh on Dec. 23, with a number of top-10 fighters vying for No. 1 status.\n\n\tLeading the pack are Deontay Wilder and Anthony Joshua, who may fight each other after their bouts this month. A bout between the two has long been mooted but negotiations have broken down several times over the past few years.\n\n\tThey are on the same card and seeking to become the No. 1 contender for the World Boxing Council title.", "link": "https://www.arabnews.com/node/2422301/sport", "date_published": "2023-12-08T09:12:27+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Gulf 12 Hours unveils strong GT3 roster for 2023 showdown in Abu Dhabi", "description": "ABU DHABI: Abu Dhabi is gearing up for the return of the Middle East’s premier endurance race, the prestigious Lenovo Gulf 12 Hours championship, at Yas Marina Circuit this weekend.\n\n\tThe 13th edition of the regional classic will feature the strongest lineup yet, with 28 GT3 cars confirmed for multiple championship deciders.\n\n\tStarting on Saturday, Dec. 9, the event will see racing legend Valentino Rossi in action as the Italian star aims to wrap up his season with his first Lenovo Gulf 12 Hours title.", "link": "https://www.arabnews.com/node/2422286/motorsport", "date_published": "2023-12-08T08:12:28+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Escape to Okinawa, Japan’s historic island paradise", "description": "OKINAWA: Located at the intersection of trade routes that linked Japan, China, south-east Asia and the tiny islands that dot the Pacific Ocean, the Japanese prefecture of Okinawa has adopted flavors from all its neighbors, but still managed to remain true to its cultural and historic roots.", "link": "https://www.arabnews.com/node/2422281/lifestyle", "date_published": "2023-12-08T07:12:56+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Hamas says captive Israeli soldier killed in clash with special forces", "description": "DUBAI/JERUSALEM: The armed wing of Palestinian militant group Hamas said an Israeli soldier who had been held hostage was killed early on Friday in a clash between the militants and an Israeli special forces unit that was conducting a rescue operation.\n\tAl-Qassam Brigades said its fighters had discovered the rescue operation and confronted the unit which led to the death and injury of a number of the Israeli forces involved in the operation, without specifying a number.", "link": "https://www.arabnews.com/node/2422276/middle-east", "date_published": "2023-12-08T07:12:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "New era as Women’s U20 ‘Green Falcons’ get their wings", "description": "RIYADH: A new era in Saudi Arabian football begins with the formation of the Women’s U20 National Team, which is expected to play a crucial role in the development of young footballers in the Kingdom.\n\n\tThis initiative is part of the SAFF’s broader strategy to create sustainable and clear career paths for aspiring women footballers, reflecting a commitment to the growth of the sport at all levels.", "link": "https://www.arabnews.com/node/2422031/sport", "date_published": "2023-12-08T06:23:43.021575+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Spanish ace Rahm poised to join LIV Golf: Reports", "description": "LOS ANGELES: Spanish star Jon Rahm is poised to join LIV Golf in a deal worth hundreds of millions of dollars, multiple US media outlets reported on Thursday.\n\tThe 29-year-old two-time major champion, who had previously pledged his loyalty to the PGA Tour during golf’s bitter civil war, could sign for the Saudi-backed circuit by the end of this week, reports said.\n\tThe Wall Street Journal, Sports Illustrated and ESPN all reported on Thursday that the reigning Masters champion was finalizing a deal to quit the PGA Tour for LIV.", "link": "https://www.arabnews.com/node/2422036/sport", "date_published": "2023-12-08T06:23:43.020776+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Putin in flurry of Gulf diplomacy", "description": "MOSCOW: Just a few hours after returning to Moscow from a visit to Saudi Arabia and the UAE, Russian President Vladimir Putin held talks with Omani Crown Prince Theyazin bin Haitham and Iranian President Ebrahim Raisi.\n\n\tThe talks are part of these countries’ efforts to relieve regional tensions in light of the Gaza conflict.\n\n\tPalestine was one of the main topics of discussion between Putin and Raisi. “What is happening in Palestine, in Gaza, is of course genocide and a crime against humanity,” said Raisi.", "link": "https://www.arabnews.com/node/2422041/middle-east", "date_published": "2023-12-08T06:23:43.020016+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "ASEAN strongly condemns Sunday’s ‘heinous terrorist attack’ in Philippines", "description": "MANILA: The Southeast Asian bloc ASEAN on Friday strongly condemned what it called a “heinous terrorist attack” in the southern Philippines at the weekend in which four people were killed in a bombing at a Catholic Mass.\n\tThe bomb went off on Sunday during a service at a university gymnasium in Marawi, a city left in ruins in 2017 by a five-month military campaign to end an occupation by Daesh loyalists that triggered alarm in Asia about the group’s influence.", "link": "https://www.arabnews.com/node/2422191/world", "date_published": "2023-12-08T05:12:57+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Explosions heard near US embassy in Baghdad", "description": "BAGHDAD: Explosions were heard near the US embassy in Baghdad’s heavily fortified Green Zone early on Friday and sirens calling on people to “duck and cover” were activated, according to social media videos from the scene verified by an informed source.\n\tEmbassy spokespeople did not immediately respond to requests for comment.\n\tIt was not immediately clear whether the embassy’s air defense systems were activated or whether there was damage.", "link": "https://www.arabnews.com/node/2422201/middle-east", "date_published": "2023-12-08T05:12:52+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Palestinian poet Refaat Alareer killed in Gaza strike", "description": "GAZA: The Palestinian poet Refaat Alareer, one of the leaders of a young generation of authors in Gaza who chose to write in English to tell their stories, was killed in an Israeli strike, his friends said overnight Thursday.\n\t“My heart is broken, my friend and colleague Refaat Alareer was killed with his family a few minutes ago,” wrote his friend, the Gazan poet Mosab Abu Toha, on Facebook.\n\t“I don’t want to believe this. We both loved to pick strawberries together.”", "link": "https://www.arabnews.com/node/2422211/offbeat", "date_published": "2023-12-08T05:12:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "‘Four Daughters’ wins inaugural Asharq Documentary Award", "description": "DUBAI: Kawthar Ben Haniyeh’s portrait of a Tunisian mother and her four daughters living in a society wracked by extremism has won the inaugural Asharq Documentary Award.\n\n\tThe awards are named after Saudi Research and Media Group’s Arabic free-to-air channel Asharq Documentary. The winning entry was announced during this year’s Red Sea International Film Festival at the Ritz Carlton Hotel in Jeddah.\n\n\t“Four Daughters” uses interviews and reenactments to tell the story of Olfa Hamrouni and her daughters, the two eldest of whom were radicalized and went missing.", "link": "https://www.arabnews.com/node/2422506/media", "date_published": "2023-12-08T05:12:22+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Hunter Biden hit with federal charges for evading tax", "description": "LOS ANGELES: The Department of Justice on Thursday filed new criminal charges against US President Joe Biden’s son, Hunter, accusing him of failing to pay $1.4 million in taxes while spending millions of dollars on a lavish lifestyle.\n\tHunter Biden, 53, was hit with three felony and six misdemeanor tax offenses, according to an indictment filed in US District Court, Central District of California.\n\tHe faces up to 17 years in prison if convicted. The Justice Department said its investigation into Biden is ongoing.", "link": "https://www.arabnews.com/node/2422206/world", "date_published": "2023-12-08T05:12:17+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Jeddah’s fifth book fair sees 1,000 publishers participate", "description": "JEDDAH: More than 1,000 local, Arab and international publishing houses are displaying their products at the fifth Jeddah Book Fair launched on Thursday by the Literature, Publishing and Translation Commission under the slogan “Ports of Culture.”\n\tThe event, being held at Jeddah Superdome until Dec. 16, includes seminars, panel discussions, poetry readings, and workshops on the publication of comics and Japanese manga.\n\tThe inaugural day commenced with the attendance of France’s Ambassador to Saudi Arabia Ludovic Pouille, who is leading a delegation from his country.", "link": "https://www.arabnews.com/node/2422491/saudi-arabia", "date_published": "2023-12-08T04:12:33+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Steven Gerrard: ‘Extremely nice’ to have Moussa Dembele back for Al-Ettifaq", "description": "RIYADH: Al-Ettifaq manager Steven Gerrard said it was “extremely nice” to have Moussa Dembele back in Roshn Saudi League action after his No. 9 made a substitute return following knee surgery.\n\tThe former Fulham, Celtic, Atletico Madrid and Lyon striker played the final 20 minutes of the 0-0 draw at Al-Shabab on Thursday night. The game at the new Al-Shabab Club Stadium in Riyadh saw Ettifaq finish with 10 men following Demarai Gray’s red card, while the hosts ended with nine after Ever Banega and Gustavo Cuellar were both dismissed.", "link": "https://www.arabnews.com/node/2422496/saudi-football", "date_published": "2023-12-08T04:12:31+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Media watchdog calls for release of Gaza correspondent amid growing press safety concerns", "description": "LONDON: The Committee to Protect Journalists has urged Israeli authorities to release Palestinian journalist Diaa Al-Kahlout, who was detained in northern Gaza on Dec. 7.\n\n\tAl-Kahlout, the chief bureau correspondent for the Qatari-funded, London-based Arab newspaper Al-Araby Al-Jadeed, was detained along with family members.\n\n\tCPJ’s Middle East and North Africa Program Coordinator, Sherif Mansour, expressed “deep concern” about the incident and called for Al-Kahlout’s immediate release.", "link": "https://www.arabnews.com/node/2422501/media", "date_published": "2023-12-08T04:12:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Arsenal primed for Emery reunion as Man City fight to end slum", "description": "LONDON: Arsenal’s grip on the Premier League’s top spot will be under threat from their old boss Unai Emery when the leaders travel to surging Aston Villa on Saturday.\n\n\tIf the Gunners slip up, Liverpool will seize pole position with a win against Crystal Palace, while reeling Manchester City aim to get back on track at Luton.\n\n\tHere are the three talking points ahead of this weekend’s action:\n\n\t \n\n\tWhen Unai Emery arrived at Aston Villa in October 2022, his new team were languishing just three points above the relegation zone.", "link": "https://www.arabnews.com/node/2422171/football", "date_published": "2023-12-08T04:12:04+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "COP28: US-UAE climate-friendly farming effort grows to $17bn", "description": "DUBAI: Funding for a joint effort by the US and the UAE to advance climate-friendly farming around the world has grown to more than $17 billion, the countries announced on Friday at the COP28 climate summit in Dubai, according to Reuters.\n\n\tThe Agriculture Innovation Mission for Climate was launched in 2021 at COP26 in Glasgow and its funding comes from governments, companies, and non-governmental organizations.\n\n\tGlobally, food and farming contribute about a third of anthropogenic greenhouse gas emissions, according to the UN’s Food and Agriculture Organization.", "link": "https://www.arabnews.com/node/2422456/business-economy", "date_published": "2023-12-08T03:12:48+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Third KSrelief aid ship for Gaza", "description": "PORT SAID, Egypt: Saudi Arabia’s third ship of aid for Gaza has arrived at Port Said in Egypt.\n\tThe goods will be distributed by the Kingdom’s aid organization, KSrelief, the Saudi Press Agency reported on Thursday.\n\tThe ship carries 300 large containers weighing 1,246 tons. This includes 200 containers with medical supplies, and 100 with food, long-life infant formula, and shelter materials.\n\tA few days ago, two ships dispatched by KSrelief arrived at Port Said carrying similar cargo to help Palestinians affected by Israel’s bombardment.", "link": "https://www.arabnews.com/node/2422461/saudi-arabia", "date_published": "2023-12-08T03:12:45+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Hamas says Israel destroyed historic Gaza mosque", "description": "CAIRO: Hamas said on Friday that Israel had bombed Gaza’s medieval Omari Mosque causing widespread destruction to the building and calling it a “heinous, barbaric crime.”\n\tPhotographs carried by Hamas-run media in Gaza that Reuters could not immediately verify showed massive damage to the mosque, with fallen walls and roofs and a huge crack at the bottom of the stone minaret.\n\tReuters journalists from Gaza identified the minaret in the picture as being that of the Omari Mosque.", "link": "https://www.arabnews.com/node/2422471/middle-east", "date_published": "2023-12-08T03:12:34+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "TikTok makes people 17% more antisemitic, claims ex-South Carolina governor", "description": "DUBAI: Former South Carolina governor Nikki Haley claimed on Wednesday that spending time on social media app TikTok made people “17 percent more antisemitic, more pro-Hamas” every 30 minutes.\n\n\tDuring the Republican presidential primary debate, Haley said: “We really do need to ban TikTok once and for all and let me tell you why.\n\n\t“For every 30 minutes that someone watches TikTok every day they become 17 percent more antisemitic, more pro-Hamas based on doing that.”", "link": "https://www.arabnews.com/node/2422466/media", "date_published": "2023-12-08T03:12:10+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Axel Springer to close Upday in shift towards AI-based news", "description": "BERLIN: Axel Springer is shutting down the news outlet Upday, the German publishing giant said on Friday, in plans to revive the brand as a “trend news generator” driven by artificial intelligence.\n\n\tUpday will close by the end of the year in its current form, with the new service scheduled to launch in the summer of 2024.\n\n\tA spokesperson said jobs at Upday are being eliminated during the transformation process, adding that the company would examine whether staff can continue to work elsewhere in the group.", "link": "https://www.arabnews.com/node/2422476/media", "date_published": "2023-12-08T03:12:05+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Kingdom talks human rights in Beijing", "description": "BEIJING: The deputy head of the Saudi Human Rights Commission recently outlined the Kingdom’s achievements on human rights at an event in Beijing.\n\tSpeaking at an international symposium to mark the 75th anniversary of the Universal Declaration of Human Rights, Dr. Hisham bin Abdulrahman Al Al-Sheikh said Saudi Arabia’s Vision 2030 initiative had charted a clear course, delineating public policies and programs geared toward human rights and achieved rapid progress.", "link": "https://www.arabnews.com/node/2422446/saudi-arabia", "date_published": "2023-12-08T02:12:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "International Philosophy Conference begins in Riyadh", "description": "RIYADH: The third Riyadh International Philosophy Conference, which is organized by the Literature, Publishing and Translation Commission, began in Riyadh on Thursday and runs until Dec. 9.\n\n\tBoasting the theme “Transcultural Values and Ethical Challenges in the Communicative Age,” the event has broad participation from specialists in philosophy and those interested in its modern applications.", "link": "https://www.arabnews.com/node/2422141/saudi-arabia", "date_published": "2023-12-08T01:12:53+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Hundreds more Palestinians killed as Israel pursues Hamas in south Gaza", "description": "GAZA/JERUSALEM: Israel battled Hamas militants in the Gaza Strip’s biggest cities on Thursday, leaving hundreds more Palestinians dead as almost 2 million displaced Gazans struggled to find safe refuge amid critical shortages of food and shelter.\n\tResidents reported fierce battles going on east of Khan Younis, southern Gaza’s largest city and Palestinian health officials said three Gazans were killed in an Israeli air strike on a house in Deir Al-Balah in central Gaza.", "link": "https://www.arabnews.com/node/2422131/middle-east", "date_published": "2023-12-08T01:12:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Italy’s anti-doping tribunal chases four-year ban for Pogba", "description": "ROME: France’s World Cup winner Paul Pogba is facing the possibility of a lengthy ban after Italy’s anti-doping tribunal called for a four-year suspension for the Juventus midfielder, a club source told AFP on Thursday.\n\n\tPogba, 30, was provisionally suspended in September after he tested positive for testosterone.\n\n\tA month later a B sample confirmed the presence of the substance.", "link": "https://www.arabnews.com/node/2422136/football", "date_published": "2023-12-08T01:12:34+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Fears of US veto loom large on eve of UN Security Council vote on Gaza ceasefire call", "description": "NEW YORK CITY: All eyes will be on the US during a meeting of the UN Security Council on Friday, when the 15-member body is due to vote on a draft resolution demanding an immediate ceasefire in Gaza.\n\n\tHowever, Robert Wood, alternate permanent representative of the US to the UN, indicated that Washington continues to dismiss the need for any additional action by the council “at this time.”", "link": "https://www.arabnews.com/node/2422121/middle-east", "date_published": "2023-12-08T01:12:11+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "As aid runs out, Syria’s displaced fear dying of hunger", "description": "ATME, Syria: Displaced people in camps in northeast Syria have expressed fears about their future after the World Food Programme announced the end of food assistance across the war-torn country.\n\t“Stopping aid to the camps will exponentially increase suffering,” said Ali Farahat, the director of the Maram camp for the displaced in the town of Atme near the border with Turkiye.\n\t“Some have told me ‘if aid stops, we will die of hunger’,” he told AFP on Wednesday.", "link": "https://www.arabnews.com/node/2422126/middle-east", "date_published": "2023-12-08T01:12:08+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]