[{"age": null, "language": null, "dead": false, "page_rating_visits": 0, "page_rating": 0, "date_published": "2024-02-05T17:30:03+00:00", "permanent": false, "tags": [], "comments": [], "album": "", "vote": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Silent Hill 2 Remake's Latest Gameplay Trailer Has Left Me CONCERNED", "description": "A remake of a game as beloved as Silent Hill 2 is always going to be under heavy scrutiny, but Konami isn’t helping itself with how it’s handled the remake so far. From the company’s own reputation to a divisive choice for the remake’s developer to how little we’ve seen or heard about the game since its announcement in October 2022, multiple factors have contributed to the general sentiment towards the Silent Hill 2 remake being one of concerned skepticism. \n\nAt the recent State of Play presentation, the game did the exact opposite of allaying some of those concerns, because not only was its combat-focused trailer not what anyone wanted to see for a remake of Silent Hill 2, it also just didn’t look very good. Here, we talk about all of that and more.", "page_rating_contents": 0, "thumbnail": "https://i1.ytimg.com/vi/DINNkDdQdH8/hqdefault.jpg", "artist": "GamingBolt", "link": "https://www.youtube.com/watch?v=DINNkDdQdH8", "source_obj__id": 208, "user": null, "bookmarked": false, "page_rating_votes": 0}, {"age": null, "language": null, "dead": false, "page_rating_visits": 0, "page_rating": 0, "date_published": "2024-02-05T10:00:21+00:00", "permanent": false, "tags": [], "comments": [], "album": "", "vote": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "What The Hell Happened To Suicide Squad: Kill The Justice League?", "description": "Ever since the gameplay reveal of Suicide Squad: Kill the Justice League, many have pondered what happened to Rocksteady. Now that it's finally out on Xbox Series X/S, PS5 and PC, you have to wonder: How could a project like this go so awry?\n\nAfter all, there are some positives, namely the cutscenes, combat, the visuals and the performances by its star-studded cast. How did it all come crumbling down? The live service approach did the game no favors. However, it seems like Kill the Justice League is more a victim of catering to trends and trying desperately to fit into DC's media strategy at some point or another instead of something befitting of Rockstar's strengths.\n\nIt could improve over time, but Suicide Squad: Kill the Justice League has a massive task in staying relevant.", "page_rating_contents": 0, "thumbnail": "https://i3.ytimg.com/vi/bEV5sq9ZrMY/hqdefault.jpg", "artist": "GamingBolt", "link": "https://www.youtube.com/watch?v=bEV5sq9ZrMY", "source_obj__id": 208, "user": null, "bookmarked": false, "page_rating_votes": 0}]