[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-30T15:30:05+00:00", "description": "Inertia from the incredible PS4 generation has allowed Sony to enjoy enduring success with the PS5, while we have, of course, also got a number of undeniably excellent single-player games from the company, but the first four years of this generation have also seen Sony acting like a shining example of disastrous decision-making and cataclysmic mismanagement- and nothing exemplifies that better than the Concord debacle and how Sony has handled its fallout. \n\nBacking Concord and purchasing developer Firewalk Studios were mistakes, but even more egregious is shuttering a studio less than two years after purchasing it, all as part of a misguided live service push that has brought nothing but failures for the company as a whole. Here, we talk about all of that and more.\n\nWe love you PlayStation but at this point you need to get things right.", "id": 1416135, "language": null, "link": "https://www.youtube.com/watch?v=7oshRQZ2c_4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/7oshRQZ2c_4/hqdefault.jpg", "title": "Concord Developer No More...PlayStation, What The Hell Is Going On?!", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-30T13:30:27+00:00", "description": "BioWare's Dragon Age: The Veilguard is finally out on October 31st for Xbox Series X/S, PS5 and PC. As one of this year's biggest games, it's a dream come true for fans who have waited nearly a decade for some continuation. However, reviews have gone live, and despite being primarily positive, the responses have been rather interesting.\n\nIt shouldn't be surprising to anyone following video game reviews over the past several years, but there's a fair amount of agreement, disagreement, backlash, accusations, and outright disdain. You know how it goes, and I'm almost as shocked as you that this continues to be a thing.\n\nSo what's going on? Who's wrong, and who's right? As it turns out, no one. Everyone's opinion has some merit, even if you disagree with it, and the wide range of impressions for The Veilguard reveals how differently people can approach the same aspects.", "id": 1415132, "language": null, "link": "https://www.youtube.com/watch?v=qrsN3qXzE4Q", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qrsN3qXzE4Q/hqdefault.jpg", "title": "Dragon Age The Veilguard Reviews - WHAT THE HELL IS GOING ON?", "vote": 0}]