[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-05T20:30:10+00:00", "description": "For PlayStation, 2024 is an unusual year. We’re not getting any of the big first party blockbusters that the platform has become so strongly associated with, but though the likes of The Last of Us, Marvel’s Spider-Man, Ghost of Tsushima, and what have you are currently waiting in the wings, Sony is filling the void with multiple smaller releases. \n\nAnd in that group of games, one in particular that’s looking like a bigger deal than you would think is Astro Bot. As the first full-fledged console entry for the beloved platforming series, it is generating a fair bit of excitement, which is easy to understand, given how good Astro Bot Rescue Mission and Astro’s Playroom both were. \n\nMeanwhile, what we have seen of Astro Bot itself so far has also looked incredibly promising. For all of these reasons and more, there’s every chance that Astro Bot could end 2024 as one of the best and biggest games of the year.", "id": 979935, "language": null, "link": "https://www.youtube.com/watch?v=nRJ5pQJhLjY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/nRJ5pQJhLjY/hqdefault.jpg", "title": "Astro Bot Is Shaping Up To Be One of The BIGGEST Games of the Year", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-05T16:00:27+00:00", "description": "Games have gotten bigger and more content-rich over the years, but quantity isn’t the only reason we feel compelled to continue playing a title. A game also has to grip us with addicting and rewarding gameplay to keep us from stepping away from boredom.  \n\nA well-told story also keeps us on the edge of our seats waiting to see how things resolve. The games on this list exemplify the best of the best when it comes to huge worlds to explore, incredibly addicting gameplay, and gripping narratives. Here are 15 games that made you stay up all night playing.", "id": 978212, "language": null, "link": "https://www.youtube.com/watch?v=XYaUZCVhjk0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/XYaUZCVhjk0/hqdefault.jpg", "title": "15 Games That Made Us STAY UP All Night Playing", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-05T10:45:01+00:00", "description": "Hero shooters aren't exactly a dime a dozen these days, and even the new ones - like Firewalk Studios' Concord - are having trouble drumming up hype. However, Riot Games' Valorant is a different beast, combining tactical shooting and economy with abilities and Ultimates.\n\nDespite complaints over the years about its slower pace, it's carved an impressive spot in the market. With its recent launch on PS5 and Xbox Series X/S, Riot Games delivers an extensive assortment of Agents and maps, several control settings, solid graphical and online performance, and more.\n\nWhile not every map is a winner, and the very nature of the gameplay can cause frustration, Valorant is an enjoyable competitive first-person shooter that rewards methodical play, quick reflexes, and sharp aiming skills. How the developer will handle console balancing and whatnot remains to be seen. However, for now, it's worth checking out.", "id": 975805, "language": null, "link": "https://www.youtube.com/watch?v=NhE61V-JegY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NhE61V-JegY/hqdefault.jpg", "title": "Valorant PS5 Review - The Final Verdict", "user": null, "vote": 0}]