[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T23:33:37.910298+00:00", "description": "\"SpaceX has received FCC clearance to operate a mysterious 'wireless module' device,\" PC Magazine reported earlier this week, speculating that the device \"might be a new Starlink router.\"\nOn Tuesday, the FCC issued an equipment authorization for the device, which uses the 2.4GHz and 5GHz Wi-Fi radio bands. A document in SpaceX's filing also says it features antennas along with Wi-Fi chips apparently from MediaTek. Another document calls the device by the codename \"UTW-231,\" and defines it as a \"wireless router\" supporting IEEE 802.11b/g/n/ax for Wi-Fi 6 speeds up to 1,300Mbps. But perhaps the most interesting part is an image SpaceX attached, which suggests the router is relatively small and can fit in a person's open hand.... SpaceX CEO Elon Musk has said the \"Starlink mini\" dish is slated to arrive later this year and that it's small enough to fit in a backpack... \n On Wednesday, PCMag also spotted the official Starlink.com site referencing the name \"Mini\" in a specification page fo", "id": 723755, "language": "en-us", "link": "https://mobile.slashdot.org/story/24/06/16/2232219/fcc-approves-mysterious-spacex-device-is-it-for-the-starlink-mini-dish?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FCC Approves Mysterious SpaceX Device: Is It for the Starlink Mini Dish?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T21:22:09.206937+00:00", "description": "In 2016, Phoronix remembered how the early days of Linux kernel mode-setting (KMS) had brought hopes for improved error messages. And one long-awaited feature was errors messages for \"Direct Rendering Manager\" (or DRM) drivers &mdash; something analgous to the \"Blue Screen of Death\" Windows gives for critical errors. \n\nNow Linux 6.10 is introducing a new DRM panic handler infrastructure enabling messages when a panic occurs, Phoronix reports today. \"This is especially important for those building a kernel without VT/FBCON support where otherwise viewing the kernel panic message isn't otherwise easily available.\"\n\nWith Linux 6.10 the initial DRM Panic code has landed as well as wiring up the DRM/KMS driver support for the SimpleDRM, MGAG200, IMX, and AST drivers. There is work underway on extending DRM Panic support to other drivers that we'll likely see over the coming kernel cycles for more widespread support... On Linux 6.10+ with platforms having the DRM Panic driver support, this ", "id": 723368, "language": "en-us", "link": "https://linux.slashdot.org/story/24/06/16/218217/blue-screen-of-death-comes-to-linux?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Blue Screen of Death' Comes To Linux", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T20:16:22.684784+00:00", "description": "Wednesday the annual electric vehicle outlook report was released by market researcher BloombergNEF. And the analyst wrote that \"Our long-term outlook for EVs remains bright,\" according to the Los Angeles Times:\n\nIn 2023, EVs made up 18% of global passenger-vehicle sales. By 2030, according to the report, 45% will be EVs. That number jumps to 73% by 2040 &mdash; still short of what the world needs to reach net zero emissions in transportation, the firm says, but enough to achieve major reductions in climate-changing carbon emissions... \n\n[D]ifferent countries are moving at different speeds and with different levels of commitment. Today, \"China, India and France are still showing signs of healthy growth, but the latest data from Germany, Italy and the U.S. is more concerning,\" BloombergNEF said. Global EV sales \"are set to rise from 13.9 million in 2023 to over 30 million in 2027,\" despite the lagging U.S. [The article points out later that \"For the first quarter in China, EV sales wer", "id": 723215, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/16/1955243/which-way-is-the-ev-market-headed-and-does-the-us-lag-the-world?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Which Way is the EV Market Headed? And Does the US Lag the World?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T19:11:26.634875+00:00", "description": "The Los Angeles Times reports that \"The personal information of more than 200,000 people in Los Angeles County was potentially exposed after a hacker used a phishing email to steal the login credentials of 53 public health employees, the county announced Friday.\"\n\n\nDetails that were possibly accessed in the February data breach include the first and last names, dates of birth, diagnoses, prescription information, medical record numbers, health insurance information, Social Security numbers and other financial information of Department of Public Health clients, employees and other individuals. \"Affected individuals may have been impacted differently and not all of the elements listed were present for each individual,\" the agency said in a news release... \n\nThe data breach happened between Feb. 19 and 20 when employees received a phishing email, which tries to trick recipients into providing important information such as passwords and login credentials. The employees clicked on a link i", "id": 723023, "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/16/1828258/53-la-county-public-health-workers-fall-for-phishing-email-200000-people-may-be-affected?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "53 LA County Public Health Workers Fall for Phishing Email. 200,000 People May Be Affected", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T18:07:02.791581+00:00", "description": "Bloomberg reports:\n\n\nA disease caused by a rare \"flesh-eating bacteria\" that can kill people within 48 hours is spreading in Japan after the country relaxed Covid-era restrictions. Cases of streptococcal toxic shock syndrome (STSS) reached 977 this year by June 2, higher than the record 941 cases reported for all of last year, according to the National Institute of Infectious Diseases, which has been tracking incidences of the disease since 1999. \n\nGroup A Streptococcus (GAS) typically causes swelling and sore throat in children known as \"strep throat,\" but some types of the bacteria can lead to symptoms developing rapidly, including limb pain and swelling, fever, low blood pressure, that can be followed by necrosis, breathing problems, organ failure and death. People over 50 are more prone to the disease. \"Most of the deaths happen within 48 hours,\" said Ken Kikuchi, a professor in infectious diseases at Tokyo Women's Medical University. \"As soon as a patient notices swelling in foot", "id": 722792, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/16/1741243/flesh-eating-bacteria-that-can-kill-in-two-days-spreads-in-japan?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Flesh-Eating Bacteria That Can Kill in Two Days Spreads in Japan", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T17:01:58.569582+00:00", "description": "Building off Friday's release of Wine 9.11, the development team has now also released Wine Staging 9.11 with some 428 patches, reports Phoronix founder Michael Larabel:\n\nCatching my interest was a patch for Bug 7955. That right away catches my attention since the latest Wine bug reports are at a bug ticket number over 56,000.... Yep, Bug 7955 dates back 14 years ago to April 2007. \n\nThe #7955 bug report is over the S-Hoai Windows client displaying an application exception when clicking the \"File\" or \"Projects\" menu. S-Hoai is a Windows application used in Germany by architects and building engineers/contractors for managing estimates and billing according to German laws.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wine+Staging+9.11+Released+with+A+Patch+For+A+17+Year+Old+Bug%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F06%2F16%2F0533221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_lar", "id": 722618, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/16/0533221/wine-staging-911-released-with-a-patch-for-a-17-year-old-bug?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Wine Staging 9.11 Released with A Patch For A 17 Year Old Bug", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T15:57:06.955078+00:00", "description": "Slashdot reader hackertourist shared this announcement from NASA's Jet Propulsion Laboratory:\n\n Edward C. Stone, former director of NASA's Jet Propulsion Laboratory and project scientist of the Voyager mission for 50 years, died on June 9, 2024. He was age 88...\n\n Stone served on nine NASA missions as either principal investigator or a science instrument lead, and on five others as a co-investigator (a key science instrument team member). These roles primarily involved studying energetic ions from the Sun and cosmic rays from the galaxy. He had the distinction of being one of the few scientists involved with both the mission that has come closest to the Sun (NASA's Parker Solar Probe) and the one that has traveled farthest from it (Voyager).\n\n Stone is best known for his work on NASA's longest-running mission, Voyager, whose twin spacecraft launched in 1977 and are still exploring deep space today. He served as Voyager's sole project scientist from 1972 until his retirement in 2022. U", "id": 722386, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/15/1536202/in-memoriam-dr-ed-stone-former-nasa-jpl-director-and-voyager-project-scientist?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "In Memoriam: Dr. Ed Stone, Former NASA JPL Director and Voyager Project Scientist", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T14:51:23.133911+00:00", "description": "The Washington Post reports:\n\n\nCommitments from Big Tech companies to identify and label fake artificial-intelligence-generated images on their platforms won't be enough to keep the tech from being used by other countries to try to influence the U.S. election, said the head of the Cybersecurity and Infrastructure Security Agency. AI won't completely change the long-running threat of weaponized propaganda, but it will \"inflame\" it, CISA Director Jen Easterly said at The Washington Post's Futurist Summit on Thursday. Tech companies are doing some work to try to label and identify deepfakes on their platforms, but more needs to be done, she said. \"There is no real teeth to these voluntary agreements,\" Easterly said. \"There needs to be a set of rules in place, ultimately legislation....\" \n\nIn February, tech companies, including Google, Meta, OpenAI and TikTok, said they would work to identify and label deepfakes on their social media platforms. But their agreement was voluntary and did no", "id": 722153, "language": "en-us", "link": "https://slashdot.org/story/24/06/15/049228/cisa-head-warns-big-techs-voluntary-approach-to-deepfakes-isnt-enough?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "CISA Head Warns Big Tech's 'Voluntary' Approach to Deepfakes Isn't Enough", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T11:37:12.432778+00:00", "description": "ZDNet published a new article this week with their own tips for new Linux users. It begins by arguing that switching to the Linux desktop \"is easier than you think\" and \"you'll find help everywhere\". (And also that \"You won't want for apps.\")\nThat doesn't mean it has everything. For example, there is no version of Adobe Photoshop. There is GIMP (which is just as powerful as Photoshop) but for those of you accustomed to Adobe's de facto standard, you're out of luck. The worst-case scenario is you have to learn a new piece of software to meet your graphic needs. At the same time, you might have to turn to proprietary software. For open-source purists, that's a no-go. But for those who just need to get things done, you'll find a mixture of open-source and proprietary software will give you everything you need to be productive and entertained. \nTheir article also recommends new users should \"weed out Arch-based distributions,\"\n while warning that \"Linux is more secure, but...\"\nThe truth i", "id": 721473, "language": "en-us", "link": "https://linux.slashdot.org/story/24/06/15/2212207/what-advice-would-you-give-a-first-time-linux-user?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "What Advice Would You Give a First-Time Linux User?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T08:21:13.575995+00:00", "description": "\"Titanium that was distributed with fake documentation has been found in commercial Boeing and Airbus jets,\" reports CNN. America's Federal Aviation Administration is now investigating whether those components pose a safety hazard to the public,\" along with the manufacturers of the aircraft and supplier Spirit AeroSystems. \n\n\"A parts supplier found small holes in the material from corrosion,\" the New York Times reported Friday:\n\nBoeing and Airbus both said their tests of affected materials so far had shown no signs of problems. \n\nBoeing said it directly purchased most of the titanium used in its plane production, so most of its supply was unaffected. \"This industrywide issue affects some shipments of titanium received by a limited set of suppliers, and tests performed to date have indicated that the correct titanium alloy was used,\" Boeing said in a statement. \"To ensure compliance, we are removing any affected parts on airplanes prior to delivery. Our analysis shows the in-service fl", "id": 720972, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/16/052243/faa-investigating-how-counterfeit-titanium-got-into-boeing-and-airbus-jets?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FAA Investigating How Counterfeit Titanium Got Into Boeing and Airbus Jets", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T05:05:48.667217+00:00", "description": "It's one of Saturn's 146 moons &mdash; just 310 miles in diameter (or 498 kilometers). Yet the European Space Agency plans to send a robot on a one-billion mile trip to visit it. Why? \nBecause astronomers have discovered Enceladus \"possesses geysers that regularly erupt from its surface and spray water into space,\" reports the Guardian:\n\nEven more astonishing, these plumes contain complex organic compounds, including propane and ethane. \"Enceladus has three key ingredients that are considered to be essential for the appearance of life,\" said astronomer Professor Michele Dougherty of Imperial College London. \"It has got liquid water, organic material and a source of heat. That combination makes it my favourite moon in the whole solar system.\" \nA panel of expert scientists have now recommended the Saturn moon for an ESA mission by 2040, according to the article, \"with the aim of either landing on the moon or flying through the geysers spraying water and carbon chemicals from its surface", "id": 720600, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/16/0415237/is-there-life-on-this-saturn-moon-scientists-plan-a-mission-to-find-out?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is There Life on This Saturn Moon?  Scientists Plan a Mission to Find Out", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T02:55:18.780063+00:00", "description": "Last month TIOBE announced its estimate that the four most popular programming languages were: \n1. Python\n2. C\n3. C++\n4. Java \nBut this month C++ \"overtook\" C for the first time, TIOBE announced, becoming (according to the same methodology) the #2 most popular programming language, with C dropping to #3. \" C++ has never been that high in the TIOBE index,\" says TIOBE Software CEO Paul Jansen in the announcement, \"whereas C has never been that low.\" \n\n1. Python\n2. C++\n3. C\n4. Java \n\n\n C++ started a new life as of 2011 with its consistent 3 yearly updates. Although most compilers and most engineers can't take up with this pace, it is considered a success to see the language evolve. \n\nThe main strengths of C++ are its performance and scalability. Its downside is its many ways to get things done, i.e. its rich idiom of features, which is caused by its long history and aim for backward compatibility. \n\nC++ is heavily used in embedded systems, game development and financial trading software,", "id": 720377, "language": "en-us", "link": "https://developers.slashdot.org/story/24/06/15/1624253/is-c-more-popular-than-c?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is C++ More Popular Than C?", "user": null, "vote": 0}]