[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T15:30:20+00:00", "description": "There are a lot of accessories available that go a long way toward improving your efficiency of playing video games. This list includes monitors, mice, mousepads, chairs, keyboards and more. Anything that contributes to a better gaming experience is here.\n\nMost of the products listed are of the high-end variety with large price points, but we’ve included some budget items as well, since they retain that high quality. \n\nFinally, this list is entirely unique to last year’s list, mostly because new products have been released since then, but also to highlight alternative options like the all-button arcade controller instead of a traditional stick.\n\nLinks to previous parts:\n\nPart 1: https://www.youtube.com/watch?v=wV0lJSSrYDE\n\nPart 2: https://www.youtube.com/watch?v=iT8J5ehQr24", "id": 722293, "language": null, "link": "https://www.youtube.com/watch?v=tJnZnAE4EL8", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/tJnZnAE4EL8/hqdefault.jpg", "title": "15 Things You ABSOLUTELY NEED For That Perfect Gaming Setup (Part 3)", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-16T09:45:00+00:00", "description": "After launching in 2022 to massive critical and commercial acclaim, FromSoftware's Elden Ring remains an incredible experience for experienced players and newcomers. However, things will change significantly when Shadow of the Erdtree, its first expansion, launches on June 21st for consoles and PC.\n\nFrom roughly 100 weapons that present new playstyles (and are usable outside The Land of Shadow) to a denser world design that offers more variety, it's a different yet comforting experience. The fact that players can tune their difficulty in the region is also noteworthy, to say nothing of all the new enemies and bosses that will encourage new strategies.\n\nWhile there's still a lot we don't know, especially considering the purported scale of the expansion, Shadow of the Erdtree looks to offer everything that fans could want on top of expanding into new directions.", "id": 721201, "language": null, "link": "https://www.youtube.com/watch?v=2sjDOUXgi8o", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/2sjDOUXgi8o/hqdefault.jpg", "title": "Elden Ring: Shadow of the Erdtree - WHAT'S CHANGING?", "user": null, "vote": 0}]