[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "The Lord of the Rings: Return to Moria PS5 - 15 Things You ABSOLUTELY NEED TO KNOW Before You Buy", "description": "The Lord of the Rings conjures different images in the video game space, whether leading armies into battle across Middle-earth or assassinating Orcs in Mordor. A game doesn't often delve into the Dwarves or tell a story set in the Fourth Age.\n\nThat is, until now. The Lord of the Rings: Return to Moria sees players venturing to the iconic region, led by Lord Gimli Lockbearer. The goal is to reclaim it, which is easier said than done since a malevolent presence occupies its halls. Whether alone or with three others, players venture through the reaches of Moria, mining and crafting armor and weapons to survive.\n\nOut now on PC and launching on December 5th for PS5, here's what you need to know about the console version.", "link": "https://www.youtube.com/watch?v=uPbCiSowcmg", "date_published": "2023-11-26T15:30:19+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/uPbCiSowcmg/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Top 30 BEST PC GAMES OF ALL TIME - 2023 Edition", "description": "Unlike consoles, games on the PC platform aren’t segregated by generations - which in turn gives players access to a really vast library of excellent video games spanning multiple decades. \n\nWith so many different kinds of games on offer at any given moment, it is naturally difficult to pinpoint what exactly are the best games that the platform has to offer. With this feature, we have tried to put our opinion forward as we run down 30 of the best PC games of all time. \n\nThis feature includes recent hits, all-time classics, underrated gems, and everything in between.", "link": "https://www.youtube.com/watch?v=QCZrPfUdK5U", "date_published": "2023-11-26T09:30:08+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/QCZrPfUdK5U/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 1, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]