[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmKurapML4BF9Bjtj4RbvXw", "title": "It Came Upon A Midnight Clear (Jon Schmidt Christmas Album) The Piano Guys", "description": "Step into the serene embrace of Jon Schmidt's piano solo cover of \"It Came Upon a Midnight Clear\" — a timeless Christmas carol that transcends the ages with its message of hope and peace. Join us on a musical journey as Jon, our maestro of the keys, breathes new life into this classic hymn, weaving a tapestry of tranquility and reflection. Let the delicate notes carry you to a place of serenity, echoing the angelic proclamation of peace on that sacred night.\n\nDon't miss the chance to elevate your holiday spirit. Hit the like button, share the magic with fellow music enthusiasts, and subscribe to Jon's channel for more soul-stirring performances! \n\n👉 Subscribe to our channel https://bit.ly/2XH4GCF for more heartwarming melodies that capture the spirit of the season. May \"It Came Upon A Midnight Clear\" become a part of your holiday traditions, creating lasting memories for years to come. Experience the perfect blend of tradition and innovation as Jon Schmidt invites you to make this re", "link": "https://www.youtube.com/watch?v=xOmJ-aHGOdo", "date_published": "2023-11-26T14:00:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Piano Guys", "album": "The Piano Guys", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/xOmJ-aHGOdo/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmKurapML4BF9Bjtj4RbvXw", "title": "Still Still Still (Steven Sharp Nelson/Christmas Cello) The Piano Guys", "description": "Immerse yourself in the enchanting magic of the season with Steven Sharp Nelson's cello masterpiece, \"Still Still Still.\" This Christmas, let the resonant tones of the cello transport you to a world of tranquility, warmth, and timeless holiday charm. Picture a peaceful winter night, adorned with sparkling lights, as the cello weaves a melody that echoes through the stillness, creating an intimate connection with the spirit of Christmas.\n\nEnhance your holiday playlist with \"Still Still Still\" and let the cello's emotive power bring a touch of elegance to your Christmas celebrations. Share the magic by hitting the like button, leaving a comment about your favorite holiday traditions, and don't forget to spread the joy by sharing this video with fellow Christmas enthusiasts.\n\nDownload the Album \"Christmas Cello\" https://thepianoguys.com/collections/albums/products/christmas-cello?variant=1990084231212\n\n👉 Subscribe to our channel https://bit.ly/2XH4GCF for more heartwarming melodies that", "link": "https://www.youtube.com/watch?v=Bq92tqP4njs", "date_published": "2023-11-26T02:18:05+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Piano Guys", "album": "The Piano Guys", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/Bq92tqP4njs/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]