[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-27T19:30:08+00:00", "description": "Over the last decade and a half, FromSoftware has released some of the most difficult games ever made, so it should come as absolutely no surprise that with the recently released Elden Ring: Shadow of the Erdtree, the studio has stuck to that pattern. \n\nEven by its standards though, the expansion is a grueling, punishing, immensely challenging experience, and is brimming with some of the most devastating boss fights that FromSoftware has delivered across all of its games. That is, of course, incredibly high praise, but Shadow of the Erdtree makes sure that it’s well earned. \n\nHere, we’re going to talk about the bosses in the expansion that are most deserving of that praise and provide some of the stiffest challenge in any FromSoftware game to date.", "id": 779254, "language": null, "link": "https://www.youtube.com/watch?v=jHVA56GEKCk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/jHVA56GEKCk/hqdefault.jpg", "title": "Top 15 HARDEST Elden Ring: Shadow of The Erdtree Bosses That MADE US CRY", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-27T15:30:02+00:00", "description": "Commemorating its two decade anniversary, the developer has released an enhanced remaster of its cult classic, Beyond Good and Evil, and though the interminable wait for its long awaited sequel has left fans of the IP frustrated to no end, this remastered release of the original game is a great way to put some of those frustrations at ease, at least temporarily so. \n\nBoasting upgraded visuals, quality of life upgrades, some new fragments of content, and what have you, Beyond Good and Evil 20th Anniversary Edition is a solid remaster of what is still a timeless game, even if there are parts of the gameplay experience that maybe have not aged too well. \n\nWhether you’re a returning fan or someone who never played the original, Beyond Good and Evil 20th Anniversary Edition is easy to recommend.", "id": 777879, "language": null, "link": "https://www.youtube.com/watch?v=7GQirMddwRw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/7GQirMddwRw/hqdefault.jpg", "title": "Beyond Good And Evil: 20th Anniversary Edition Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-27T10:15:01+00:00", "description": "Don’t call it a Soulslike, Black Myth: Wukong is so much more. Sure, first glimpses a couple of years ago pointed to a game very much FromSoftware in flavor, but thanks to a string of updates plus the testimony from those who’ve recently played the 2-hour demo at Summer Games Fest Black Myth: Wukong has much more going on. \n\nReportedly closer to Metal Gear Rising than Dark Souls, developer Game Science are actually gunning for something new altogether. What we can confidently say now is Black Myth: Wukong looks fantastic; combat looks a thrill, environments awestriking, and a theme that’s not been done to such depth before. Black Myth: Wukong has all the hallmarks of an all-timer, should it continue to impress beyond its demo’s runtime. \n\nAll in all, Black Myth: Wukong is shaping up to be one of the biggest games of 2024.", "id": 775627, "language": null, "link": "https://www.youtube.com/watch?v=N0kpxxEEMBs", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/N0kpxxEEMBs/hqdefault.jpg", "title": "I've Never Seen Anything Quite Like This Game Before...", "user": null, "vote": 0}]