[{"page_rating_contents": 0, "tags": [], "vote": 0, "title": "S.T.A.L.K.E.R.: Legends of the Zone Trilogy Review - The Final Verdict", "page_rating_votes": 0, "artist": "GamingBolt", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "bookmarked": false, "date_published": "2024-03-12T22:15:00+00:00", "permanent": false, "dead": false, "user": null, "page_rating": 0, "thumbnail": "https://i4.ytimg.com/vi/G8_M3W83wNI/hqdefault.jpg", "album": "", "age": null, "comments": [], "link": "https://www.youtube.com/watch?v=G8_M3W83wNI", "page_rating_visits": 0, "source_obj__id": 129, "language": null, "description": "Among the many classic gaming franchises, GSC Game World's S.T.A.L.K.E.R. is perhaps one of the most underrated. Though it's working hard on the upcoming sequel, its trilogy of classics has mostly been relegated to history. Until now, that is.\n\nS.T.A.L.K.E.R.: Legends of the Zone Trilogy packs S.T.A.L.K.E.R.: Shadow of Chornobyl, S.T.A.L.K.E.R.: Clear Sky and S.T.A.L.K.E.R.: Call of Pripyat into one package with a few extra additions. The visuals have seen some slight improvements, including enhanced performance, there are and new control settings. By and large, however, this is the same trilogy that fans know and love.\n\nThough some quirks remain, S.T.A.L.K.E.R.: Legends of the Zone Trilogy is an excellent way to experience the classics. From its uniquely horrifying mood to the compelling survival sandbox, it prompts a new appreciation for the series."}, {"page_rating_contents": 0, "tags": [], "vote": 0, "title": "Horizon Forbidden West: Complete Edition PC – 15 Things To Know Before Buying", "page_rating_votes": 0, "artist": "GamingBolt", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "bookmarked": false, "date_published": "2024-03-12T15:30:02+00:00", "permanent": false, "dead": false, "user": null, "page_rating": 0, "thumbnail": "https://i1.ytimg.com/vi/4jS9WuxbplY/hqdefault.jpg", "album": "", "age": null, "comments": [], "link": "https://www.youtube.com/watch?v=4jS9WuxbplY", "page_rating_visits": 0, "source_obj__id": 129, "language": null, "description": "PlayStation Studios' efforts to bring its first-party exclusives to PC continues, with Guerrilla Games' Horizon Forbidden West Complete Edition out on March 21st. It includes the critically acclaimed base game and the Burning Shores expansion, providing dozens of hours of open-world action for PC players.\n\nWhile its predecessor had a troubled launch on the platform, Forbidden West on PC is looking better. It offers Nvidia DLSS, AMD FSR and XeSS; Ultra-wide screen resolution support, including triple-monitor displays; various graphics options to tweak; uncapped framerates; and much more. You can fully customize mouse and keyboard controls or plug a DualSense to play with haptic feedback and adaptive triggers.\n\nHowever, what should PC players expect with the gameplay, story and open-world activities? How does Horizon Forbidden West Complete Edition improve on its predecessor? Find out here."}, {"page_rating_contents": 0, "tags": [], "vote": 0, "title": "Dragon's Dogma 2 - Is An UNCAPPED 30 FPS A Big Deal?", "page_rating_votes": 0, "artist": "GamingBolt", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "bookmarked": false, "date_published": "2024-03-12T10:15:01+00:00", "permanent": false, "dead": false, "user": null, "page_rating": 0, "thumbnail": "https://i3.ytimg.com/vi/NGrqXXzg3dA/hqdefault.jpg", "album": "", "age": null, "comments": [], "link": "https://www.youtube.com/watch?v=NGrqXXzg3dA", "page_rating_visits": 0, "source_obj__id": 129, "language": null, "description": "Another month, another title courting some controversy for \"only\" offering a 30 FPS frame rate. This month, it's Dragon's Dogma 2.\n\nLaunching on March 22nd for PS5, Xbox Series X/S and PC, it offers everything that players of open world games could want. A larger world, over a thousand NPCs whose actions can influence the overall state of the narrative. Unique events can occur. Suffice it to say, there is a lot for players to sink their teeth into.\n\nHowever, some focus on its uncapped frame rate, which will deliver around or above 30 FPS. Is it a big deal?"}]