[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T15:30:02+00:00", "description": "The instances of video game developers making stupid decisions are numerous. After all, developers are human too, so mistakes should be expected. \n\nSo colossal are some of these decisions though that it’s a wonder they came to fruition at all. The entries in this feature mostly highlight situations that are worse for the consumer, be it they’re expected to pay over the odds for content they’ve already forked out for, jump through pointless hoops in order to keep playing their favorite games, or be presented with games that are simply unplayable. \n\nThis feature isn’t all about the doom though. Each entry also presents situations in which the developer backtracks, making right on their broken promises, but not all U-turns re-establish lost goodwill. That trust is harder to earn back.", "language": null, "link": "https://www.youtube.com/watch?v=BBk6_ZljeKA", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/BBk6_ZljeKA/hqdefault.jpg", "title": "10 Stupid Moves By Game Developers Only For Them To Pull It Off Later", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T11:00:47+00:00", "description": "XDefiant is finally available on Xbox Series X/S, PS5 and PC, and it's...fine in some ways and underwhelming in others. The crossover shooter, announced in 2021, features various factions from the Tom Clancy video game universe (and other titles) battling it for supremacy. Or something - it's never really explained.\n\nThere are five factions, four available at the outset; 14 maps, several well-designed and others not so much; five modes, ranging from deathmatch-focused to objective-based; and a staggering lack of features. The Practice Area is mysteriously locked. You have no limited-time modes, kill cams or even a proper Career page to check your stats.\n\nWhile the gunplay, customization and overall map design of XDefiant are worth checking out, this free-to-play shooter still needs a lot of work, especially with hit registration issues, poor netcode and much more weighing it down.", "language": null, "link": "https://www.youtube.com/watch?v=jltDW6h5tRM", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/jltDW6h5tRM/hqdefault.jpg", "title": "XDefiant Review - Underwhelming", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T09:30:19+00:00", "description": "As we have seen more than a few times over the years, nailing down the right length can be a surprisingly tricky for games to do. Even the best of games have often deemed to be either a bit too long or a bit too short, while those that are particularly brief or lengthy can find themselves on the receiving end of stronger criticism. \n\nThat's why you can never quite take games that know exactly how long they need to be for granted. Here, we'll be talking about a few such games.", "language": null, "link": "https://www.youtube.com/watch?v=ddFIKcCWsjU", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/ddFIKcCWsjU/hqdefault.jpg", "title": "15 SINGLE PLAYER Games That Were The Perfect Length", "user": null, "vote": 0}]