[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T23:37:50.938167+00:00", "description": "OpenAI has reversed its decision requiring former employees to sign a perpetual non-disparagement agreement to retain their vested equity, stating that they will not cancel any vested units and will remove non-disparagement clauses from departure documents. CNBC reports: The internal memo, which was viewed by CNBC, was sent to former employees and shared with current ones. The memo, addressed to each former employee, said that at the time of the person's departure from OpenAI, \"you may have been informed that you were required to execute a general release agreement that included a non-disparagement provision in order to retain the Vested Units [of equity].\" \"Regardless of whether you executed the Agreement, we write to notify you that OpenAI has not canceled, and will not cancel, any Vested Units,\" stated the memo, which was viewed by CNBC.\n \nThe memo said OpenAI will also not enforce any other non-disparagement or non-solicitation contract items that the employee may have signed. \"As", "language": "en-us", "link": "https://slashdot.org/story/24/05/24/227215/openai-releases-former-employees-from-controversial-exit-agreements?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Releases Former Employees From Controversial Exit Agreements", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T23:37:49.063337+00:00", "description": "Emma Roth reports via The Verge: The UK could subject big tech companies to hefty fines if they don't comply with new rules meant to promote competition in digital markets. On Thursday, lawmakers passed the Digital Markets, Competition and Consumer Bill (DMCC) through Parliament, which will let regulators enforce rules without the help of the courts. The DMCC also addresses consumer protection issues by banning fake reviews, forcing companies to be more transparent about their subscription contracts, regulating secondary ticket sales, and getting rid of hidden fees. It will also force certain companies to report mergers to the UK's Competition and Markets Authority (CMA). The European Union enacted a similar law, called the Digital Markets Act (DMA).\n \nOnly the companies the CMA designates as having Strategic Market Status (SMS) have to comply. These SMS companies are described as having \"substantial and entrenched market power\" and \"a position of strategic significance\" in the UK. Th", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/24/2224237/uk-law-will-let-regulators-fine-big-tech-without-court-approval?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "UK Law Will Let Regulators Fine Big Tech Without Court Approval", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T22:32:34.129827+00:00", "description": "An anonymous reader quotes a report from Ars Technica: If you're tired of Google's AI Overview extracting all value from the web while also telling people to eat glue or run with scissors, you can turn it off -- sort of. Google has been telling people its AI box at the top of search results is the future, and you can't turn it off, but that ignores how Google search works: A lot of options are powered by URL parameters. That means you can turn off AI search with this one simple trick! (Sorry.) Our method for killing AI search is defaulting to the new \"web\" search filter, which Google recently launched as a way to search the web without Google's alpha-quality AI junk. It's actually pretty nice, showing only the traditional 10 blue links, giving you a clean (well, other than the ads), uncluttered results page that looks like it's from 2011. Sadly, Google's UI doesn't have a way to make \"web\" search the default, and switching to it means digging through the \"more\" options drop-down after", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/24/222228/google-searchs-udm14-trick-lets-you-kill-ai-search-for-good?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Search's 'udm=14' Trick Lets You Kill AI Search For Good", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T21:28:40.773191+00:00", "description": "Minnesota this week eliminated two laws that made it harder for cities and towns to build their own broadband networks. From a report: The state-imposed restrictions were repealed in an omnibus commerce policy bill signed on Tuesday by Gov. Tim Walz, a Democrat. Minnesota was previously one of about 20 states that imposed significant restrictions on municipal broadband. The number can differ depending on who's counting because of disagreements over what counts as a significant restriction. But the list has gotten smaller in recent years because states including Arkansas, Colorado, and Washington repealed laws that hindered municipal broadband. The Minnesota bill enacted this week struck down a requirement that municipal telecommunications networks be approved in an election with 65 percent of the vote. The law is over a century old, the Institute for Local Self-Reliance's Community Broadband Network Initiative wrote yesterday.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/24/2025256/another-us-state-repeals-law-that-protected-isps-from-municipal-competition?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Another US State Repeals Law That Protected ISPs From Municipal Competition", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T21:28:38.891649+00:00", "description": "Countries around the globe have failed to reach consensus on the terms of a treaty that would unify the world in a strategy against the inevitable next pandemic, trumping the nationalist ethos that emerged during Covid-19. From a report: The deliberations, which were scheduled to be a central item at the weeklong meeting of the World Health Assembly beginning Monday in Geneva, aimed to correct the inequities in access to vaccines and treatments between wealthier nations and poorer ones that became glaringly apparent during the Covid pandemic. Although much of the urgency around Covid has faded since the treaty negotiations began two years ago, public health experts are still acutely aware of the pandemic potential of emerging pathogens, familiar threats like bird flu and mpox, and once-vanquished diseases like smallpox. \n\n\"Those of us in public health recognize that another pandemic really could be around the corner,\" said Loyce Pace, an assistant secretary at the Department of Health", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/24/2036239/countries-fail-to-agree-on-treaty-to-prepare-the-world-for-the-next-pandemic?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Countries Fail To Agree on Treaty To Prepare the World for the Next Pandemic", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T20:22:15.742033+00:00", "description": "As Valve's Steam gaming platform approaches its 21st anniversary, aging PC gamers are grappling with the question of what will happen to their extensive digital game collections after they pass away. Recent inquiries to Steam support have highlighted the platform's policy that accounts and games are non-transferable, even through a last will and testament. While some potential loopholes exist, such as sharing account information with descendants or bequeathing a physical device with games installed, the legal ownership of these digital assets remains murky.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=After+You+Die%2C+Your+Steam+Games+Will+Be+Stuck+in+Legal+Limbo%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F05%2F24%2F1846221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fst", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/24/1846221/after-you-die-your-steam-games-will-be-stuck-in-legal-limbo?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "After You Die, Your Steam Games Will Be Stuck in Legal Limbo", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T19:18:31.080132+00:00", "description": "Apple once designed a Tetris clone that has been found on a prototype version of the third-generation iPod, indicating the company was experimenting with releasing the game on the music player. From a report: It's called Stacker and, obviously, is controlled via the iPod's scroll wheel. The software was spotted by X user AppleDemoYT, who is known for finding rare prototype devices. The prototype iPod is a \"DVT\" device, meaning it was a mid-stage device that was still in \"Design Validation Testing.\" It has a model number of A1023, which is not a known model number of any iPod version. \n\nThe device runs a prototype version of iPodOS 2.0, which is where Stacker comes from. The pieces are moved from left to right using the scroll wheel and they fall when the middle button is pressed. The goal is to clear lines and score points. You know the deal. It's Tetris. It's not the only game found on the prototype iPod. There's something called Block0, which is likely an early version of Brick. The", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/24/1840213/apple-built-a-tetris-clone-for-the-ipod-but-never-released-it?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Built a Tetris Clone For the iPod But Never Released It", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T18:12:29.783261+00:00", "description": "ICQ, a once-popular IM, is shutting down on June 26, it says on its website. It once served tens of millions of users daily.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Messaging+Service+ICQ+To+Shut+Down+Next+Month+After+Nearly+30+Years%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F05%2F24%2F1720214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F05%2F24%2F1720214%2Fmessaging-service-icq-to-shut-down-next-month-after-nearly-30-years%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/05/24/1720214/messaging-service-icq-to-shut-down-next-month-after-nearly-30-years?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slas", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/24/1720214/messaging-service-icq-to-shut-down-next-month-after-nearly-30-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Messaging Service ICQ To Shut Down Next Month After Nearly 30 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T18:12:28.295542+00:00", "description": "Apple has shed more light on the bizarre iOS 17.5 bug that caused long-deleted photos to mysteriously reappear on users' devices. In a statement to 9to5Mac, the iPhone maker clarified that the issue stemmed from a corrupted database on the device itself, not iCloud Photos. This means the photos were never fully erased from the device, but they also weren't synced to iCloud. Interestingly, these files could have hitched a ride to new devices through backups or direct transfers.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Explains+Rare+iOS+17.5+Bug+That+Resurfaced+Deleted+Photos%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F05%2F24%2F1737241%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F05%2F24%2F1737241%2Fapple-explains-rare-ios-175-bug-that-resurfaced-de", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/24/1737241/apple-explains-rare-ios-175-bug-that-resurfaced-deleted-photos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Explains Rare iOS 17.5 Bug That Resurfaced Deleted Photos", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T17:08:53.583794+00:00", "description": "The head of the UK Environment Agency has admitted that freedom of information requests have been buried by the regulator because the truth about the environment in England is \"embarrassing.\" From a report: Philip Duffy, the body's chief executive, told an audience at the UK River Summit in Morden, south London, this week that his officials were \"worried about revealing the true state of what is going on\" with regards to the state of the environment. The regulator holds information including about pollution, the state of England's waterways, the meetings its bosses have with water company CEOs, and other data about the state of nature in the country. \n\nThe Information Commissioner's Office, which oversees the law on the Freedom of Information Act, has warned the regulator that the public have a right to have their requests answered and that transparency should be taken seriously. An ICO spokesperson said: \"People have the legal right to promptly receive information they're entitled to", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/24/1614211/environment-agency-chief-admits-regulator-buries-freedom-of-information-requests?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Environment Agency Chief Admits Regulator Buries Freedom of Information Requests", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T16:04:02.305161+00:00", "description": "Australia's media regulator is taking legal action against telecom carrier Optus, owned by Singapore Telecommunications, over a cyber attack it faced in September 2022, the telecom operator said on Wednesday. From a report: Australia's No.2 telco, had in September 2022 faced a massive data breach which exposed customers' personal information, including home addresses, passport and phone numbers. Following the incident, the country's Prime Minister Anthony Albanese called for tougher privacy rules to force companies to notify banks faster when they experience similar data breaches. \n\nAbout 10 million Australians, 40% of the population, are Optus customers and could not use smartphones, broadband internet or landlines for much of the day of the breach.\nThe Australian Communications and Media Authority is alleging that Optus Mobile failed to protect the confidentiality of personally identifiable information of its customers from unauthorised interference or unauthorised access.<p><div cl", "language": "en-us", "link": "https://slashdot.org/story/24/05/24/1530254/australia-takes-singtel-owned-optus-to-court-over-2022-cyber-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Australia Takes Singtel-owned Optus To Court Over 2022 Cyber Attack", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T16:04:00.592250+00:00", "description": "Messaging app Signal's president Meredith Whittaker criticized rival Telegram's security on Friday, saying Telegram founder Pavel Durov is \"full of s---\" in his claims about Signal. \"Telegram is a social media platform, it's not encrypted, it's the least secure of messaging and social media services out there,\" Whittaker told TechCrunch in an interview. The comments come amid a war of words between Whittaker, Durov and Twitter owner Elon Musk over the security of their respective platforms. Whittaker said Durov's amplification of claims questioning Signal's security was \"incredibly reckless\" and \"actually harms real people.\" \n\n\"Play your games, but don't take them into my court,\" Whittaker said, accusing Durov of prioritizing being \"followed by a professional photographer\" over getting facts right about Signal's encryption. Signal uses end-to-end encryption by default, while Telegram only offers it for \"secret chats.\" Whittaker said many in Ukraine and Russia use Signal for \"actual se", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/24/1542208/signal-slams-telegrams-security?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Signal Slams Telegram's Security", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T14:59:06.331281+00:00", "description": "Hackers have compromised a popular courtroom recording software, JAVS, gaining full control through a backdoored update. Louisville, Kentucky-based Justice AV Solutions, its maker, pulled the compromised software, reset passwords, and audited its systems. Cybersecurity firm Rapid7 found that the corrupted installer grants attackers full access and transmits host system data to a command-and-control server. The Record adds: In its advisory, Rapid7 stressed the need to reimage all endpoints where the software was installed, and to reset credentials on web browsers and for any accounts logged into affected endpoints, both local and remote. \"Simply uninstalling the software is insufficient, as attackers may have implanted additional backdoors or malware. Re-imaging provides a clean slate,\" they wrote. \"Completely re-imaging affected endpoints and resetting associated credentials is critical to ensure attackers have not persisted through backdoors or stolen credentials.\"<p><div class=\"shar", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/24/0513228/courtroom-recording-software-compromised-with-backdoor-installer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Courtroom Recording Software Compromised With Backdoor Installer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T13:12:54.221264+00:00", "description": "An anonymous reader quotes a report from ScienceAlert: A team of scientists has shown that crows can 'count' out loud -- producing a specific and deliberate number of caws in response to visual and auditory cues. While other animals such as honeybees have shown an ability to understand numbers, this specific manifestation of numeric literacy has not yet been observed in any other non-human species. \"Producing a specific number of vocalizations with purpose requires a sophisticated combination of numerical abilities and vocal control,\" writes the team of researchers led by neuroscientist Diana Liao of the University of Tubingen in Germany. \"Whether this capacity exists in animals other than humans is yet unknown. We show that crows can flexibly produce variable numbers of one to four vocalizations in response to arbitrary cues associated with numerical values.\"\n \nThe ability to count aloud is distinct from understanding numbers. It requires not only that understanding, but purposeful v", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/24/004247/crows-can-count-out-loud-study-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Crows Can 'Count' Out Loud, Study Shows", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T11:02:46.002437+00:00", "description": "Using the Euclid space telescope, astronomers have discovered dozens of rogue planets drifting without stars in the Orion nebula. The Guardian reports: The European Space Agency (Esa) launched the $1 billion observatory last summer on a six-year mission to create a 3D map of the cosmos. Armed with its images, scientists hope to understand more about the mysterious 95% of the universe that is unexplained. The first wave of scientific results come from only 24 hours of observations, which revealed 11m objects in visible light and 5m in infrared. Along with the rogue planets, the researchers describe new star clusters, dwarf galaxies and very distant, bright galaxies from the first billion years of the universe.\n \nA flurry of new images from the same observations are the largest ever taken in space and demonstrate the stunning wide-field views that astronomers can expect from Euclid in the coming years. Among those released on Thursday is a breathtaking image of Messier 78, a vibrant sta", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/23/2358230/euclid-telescope-spies-rogue-planets-floating-free-in-milky-way?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Euclid Telescope Spies Rogue Planets Floating Free In Milky Way", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T07:47:41.096610+00:00", "description": "fjo3 quotes a report from Reuters: SpaceX on Wednesday launched an inaugural batch of operational spy satellites it built as part of a new U.S. intelligence network designed to significantly upgrade the country's space-based surveillance powers, the first deployment of several more planned this year. The spy network was revealed in a pair of Reuters reports earlier this year showing SpaceX is building hundreds of satellites for the U.S. National Reconnaissance Office, an intelligence agency, for a vast system in orbit capable of rapidly spotting ground targets almost anywhere in the world.\n \nSpaceX's Falcon 9 rocket lifted off from the Vandenberg Space Force Base in Southern California at 4 a.m. EDT on Wednesday, carrying into space what the NRO said was the \"first launch of the NRO's proliferated systems featuring responsive collection and rapid data delivery.\" \"Approximately half a dozen launches supporting NRO's proliferated architecture are planned for 2024, with additional launch", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/23/2237209/spacex-launches-first-satellites-for-new-us-spy-constellation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "SpaceX Launches First Satellites For New US Spy Constellation", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T05:37:57.583833+00:00", "description": "Spotify is about to render its Car Thing dashboard accessory inoperable on December 9th. Not only is the company refusing to open-source the device, it won't offer owners any subscription credit or automatic refund. \"Rather, it's just canning the project and telling people to (responsibly) dispose of Car Thing,\" reports The Verge. From the report: \"We're discontinuing Car Thing as part of our ongoing efforts to streamline our product offerings,\" Spotify wrote in an FAQ on its website. \"We understand it may be disappointing, but this decision allows us to focus on developing new features and enhancements that will ultimately provide a better experience to all Spotify users.\"\n \nThe company is recommending that customers do a factory reset on the product and find some way of responsibly recycling the hardware. Spotify is also being direct and confirming that there's little reason to ever expect a sequel. \"As of now, there are no plans to release a replacement or new version of Car Thing,", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/23/2037255/spotify-is-going-to-break-every-car-thing-gadget-it-ever-sold?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Spotify Is Going To Break Every 'Car Thing' Gadget It Ever Sold", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T05:37:55.586705+00:00", "description": "Speaking of Samsung, samleecole shares a report about the contract the South Korean firm requires repair shops to sign: In exchange for selling them repair parts, Samsung requires independent repair shops to give Samsung the name, contact information, phone identifier, and customer complaint details of everyone who gets their phone repaired at these shops, according to a contract obtained by 404 Media. Stunningly, it also requires these nominally independent shops to \"immediately disassemble\" any phones that customers have brought them that have been previously repaired with aftermarket or third-party parts and to \"immediately notify\" Samsung that the customer has used third-party parts. \n\n\"Company shall immediately disassemble all products that are created or assembled out of, comprised of, or that contain any Service Parts not purchased from Samsung,\" a section of the agreement reads. \"And shall immediately notify Samsung in writing of the details and circumstances of any unauthoriz", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/23/1849224/leaked-contract-shows-samsung-forces-repair-shop-to-snitch-on-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Leaked Contract Shows Samsung Forces Repair Shop To Snitch On Customers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T05:37:53.128131+00:00", "description": "An anonymous reader quotes a report from Quartz: Mark Zuckerberg has assembled some of his fellow tech chiefs into an advisory council to guide Meta on its artificial intelligence and product developments. The Meta Advisory Group will periodically meet with Meta's management team, Bloomberg reported. Its members include: Stripe CEO and co-founder Patrick Collison, former GitHub CEO Nat Friedman, Shopify CEO Tobi Lutke, and former Microsoft executive and investor Charlie Songhurst.\n \n\"I've come to deeply respect this group of people and their achievements in their respective areas, and I'm grateful that they're willing to share their perspectives with Meta at such an important time as we take on new opportunities with AI and the metaverse,\" Zuckerberg wrote in an internal note to Meta employees, according to Bloomberg. The advisory council differs from Meta's 11-person board of directors because its members are not elected by shareholders, nor do they have fiduciary duty to Meta, a Met", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/23/2143214/mark-zuckerberg-assembles-team-of-tech-execs-for-ai-advisory-council?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mark Zuckerberg Assembles Team of Tech Execs For AI Advisory Council", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T05:37:51.247068+00:00", "description": "The IRS has extended the Free File program through 2029, \"continuing its partnership with a coalition of private tax software companies that allow most Americans to file federal taxes for free,\" reports CNBC. From the report: This season, Free File processed 2.9 million returns through May 11, a 7.3% increase compared to the same period last year, according to the IRS. \"Free File has been an important partner with the IRS for more than two decades and helped tens of millions of taxpayers,\" Ken Corbin, chief of IRS taxpayer services, said in a statement Wednesday. \"This extension will continue that relationship into the future.\"\n \n\"This multi-year agreement will also provide certainty for private-sector partners to help with their future Free File planning,\" Corbin added. IRS Free File remains open through the Oct. 15 federal tax extension deadline. You can use Free File for 2023 returns with an adjusted gross income of $79,000 or less, which is up from $73,000 in 2022. Fillable Forms ", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/23/2151204/irs-extends-free-file-tax-program-through-2029?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "IRS Extends Free File Tax Program Through 2029", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T05:37:49.305634+00:00", "description": "Political consultant Steven Kramer faces a $6 million fine and over two dozen criminal charges for using AI-generated robocalls mimicking President Joe Biden's voice to mislead New Hampshire voters ahead of the presidential primary. The Associated Press reports: The Federal Communications Commission said the fine it proposed Thursday for Steven Kramer is its first involving generative AI technology. The company accused of transmitting the calls, Lingo Telecom, faces a $2 million fine, though in both cases the parties could settle or further negotiate, the FCC said. Kramer has admitted orchestrating a message that was sent to thousands of voters two days before the first-in-the-nation primary on Jan. 23. The message played an AI-generated voice similar to the Democratic president's that used his phrase \"What a bunch of malarkey\" and falsely suggested that voting in the primary would preclude voters from casting ballots in November.\n \nKramer is facing 13 felony charges alleging he viola", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/23/2227251/political-consultant-behind-fake-biden-robocalls-faces-6-million-fine-criminal-charges?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Political Consultant Behind Fake Biden Robocalls Faces $6 Million Fine, Criminal Charges", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-24T05:37:47.339698+00:00", "description": "An anonymous reader quotes a report from Markets Insider: Sunny days in Germany mean gray clouds for solar profitability as the nation's dive into renewables has left it with too much energy. According to a note from SEB Research, in the past 10 days, solar producers have had to take an 87% price cut during production hours. In fact, when production peaks, prices have slid well below zero. On average, the price received was 9.1 euros per megawatt-hour, significantly under the 70.6 euros paid during non-solar-power hours. \"This is what happens to power prices when the volume of unregulated power becomes equally big or bigger than demand: Prices collapse when unregulated power produces the most,\" the Swedish bank wrote on Tuesday.\n \nLast year's record wave of solar installations are what's driving Germany's price \"destruction\" as inventory outpaces consumption. While total solar capacity topped 81.7 gigawatts by 2023's end, demand load only reached 52.2 gigawatts, noted SEB chief commod", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/23/2233226/germany-has-too-many-solar-panels-and-its-pushed-energy-prices-negative?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Germany Has Too Many Solar Panels, and It's Pushed Energy Prices Negative", "user": null, "vote": 0}]