[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-28T19:30:03+00:00", "description": "The Legend of Heroes: Trails series has been going on for a long time, and as well-regarded as the Sky and Crossbell arcs are, a sense of fatigue set in after Cold Steel. Trails into Reverie provided the epilogue that Cold Steel 4 lacked, but fans were beyond wanting to move past Class VII and Erebonia.\n\nEnter The Legend of Heroes: Trails through Daybreak, boasting a new cast of characters, a fresh setting in Calvard, a different narrative approach and revamped combat. Players control Van Arkride, a Spriggan who assists Agnes Claudel in retrieving a mysterious orbment.\n\nWith more morally grey situations and solutions (which govern the new LGC Alignment system), real-time and command-based combat options, and highly improved visuals over previous titles, Trails through Daybreak is what fans of the series need. Some quibbles remain, of course, but it's still a compelling RPG experience.", "id": 786446, "language": null, "link": "https://www.youtube.com/watch?v=XT1_m45_Lq0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/XT1_m45_Lq0/hqdefault.jpg", "title": "The Legend of Heroes: Trails Through Daybreak Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-28T15:45:03+00:00", "description": "There are so many free-to-play titles demanding your time these days that it's hard to keep track. However, miHoYo is usually one to watch out for, having made a name for itself with its titles, namely Honkai: Star Rail and Genshin Impact.\n\nIts next big release, Zenless Zone Zero, is no different. Launching on July 4th for PS5, PC, iOS and Android, it's a fast-paced, super-stylish action RPG where the Agents of New Eridu venture into the Hollows.\n\nWhether you're following the story, venturing into the rogue-like Hollow Zero, tackling Shiyu Defense or farming resources, Zenless Zone Zero has a lot to offer. Even the combat has its fair share of nuance that makes it worthwhile. Here are 15 things you should know about the game before its release on July 4th for PC, PS5, iOS and Android.", "id": 785126, "language": null, "link": "https://www.youtube.com/watch?v=vTpAKdLplak", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/vTpAKdLplak/hqdefault.jpg", "title": "Zenless Zone Zero – EVERYTHING You Need To Know Before You Play", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-28T10:15:03+00:00", "description": "The games industry is at a really great place at the moment, and fans have been treated to many different kinds of experiences ranging from AAA blockbusters to middle-market releases and indie games. \n\n2024 has been a wonderful year for gaming, and the first six months have been a rollercoaster of a ride with fans having so many engaging titles to enjoy. But the year is far from over, and so are the games that will be coming out this year. \n\nWith this video, we will be taking a look at 30 of the biggest games that are still releasing in 2024.", "id": 783041, "language": null, "link": "https://www.youtube.com/watch?v=PKNr3z-pRyw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/PKNr3z-pRyw/hqdefault.jpg", "title": "30 BIG Games STILL Coming Out In 2024", "user": null, "vote": 0}]