[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-05T18:30:32+00:00", "description": "Back in 2018, before Luigi’s Mansion 3 had come out, with the 3DS in the final legs of its lifecycle, the developer took the step to prolong its life a little bit more with a remake of the original Luigi’s Mansion. \n\nNow, in 2024, with the Switch set to be succeeded by a next-gen platform next year and with no word yet on when the next mainline Luigi’s Mansion game will release, the company is set to release a remaster of Luigi’s Mansion: Dark Moon for its current platform. \n\nLuigi’s Mansion 2 HD is not far away from release now, and with its promise of a visually enhanced version of the beloved 2013 3DS title, it’s certainly got a fair few people excited about it. Here, we’re going to talk about a few key details that you should know about it.", "language": null, "link": "https://www.youtube.com/watch?v=YbsY7iSUPoA", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/YbsY7iSUPoA/hqdefault.jpg", "title": "Luigi’s Mansion 2 HD - 10 Things You NEED TO KNOW Before You Purchase", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-05T15:30:16+00:00", "description": "Ace Combat might not have seen the kind of success that other Bandai Namco franchises have over the years – like Tekken or Dark Souls, for instance – but in its own right, it is a highly successful series not only from a critical perspective, but also a commercial one. \n\nHaving amassed a sizeable fanbase over the course of nearly three decades and having sold over 19 million copies across all of its many mainline instalments and spinoffs, Ace Combat is clearly a series with a following, and given Bandai Namco’s plans, it’s clearly going to continue to grow for the foreseeable future. \n\nOf course, we don’t yet know what exactly that future will entail- so here, we’re going to look back at the past. Join us as we take a look at the complete history of the Ace Combat franchise.\n\nThanks to Playscope Timeline YouTube channel for their Ace Combat 4 and Ace Combat 5 trailers.", "language": null, "link": "https://www.youtube.com/watch?v=URiCvFrgeRs", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/URiCvFrgeRs/hqdefault.jpg", "title": "The COMPLETE History of ACE COMBAT", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-05T13:30:10+00:00", "description": "Shadow of the Erdtree is poised to be the largest expansion FromSoftware has ever put out. As the single expansion DLC for Elden Ring, we have high hopes for its setting, gameplay, and massive new zone. Elden Ring had some of the most outlandish enemy designs seen in a game, and what we’ve seen of Shadow of the Erdtree’s trailers, they are looking crazier than ever. \n\nThe weapons and abilities from the first gameplay trailer also looked amazing, with a Bone Fist type martial arts moveset that look like a riot to pull off. Miquella and Marika play a heavy role in the DLC, so it’ll be great to see more backstory for them. The main antagonist might be one of the most challenging boss fights; I mean, Messmer has a serpent, casts flames, and wields a spear as long as a semi-truck. It’s safe to say we’re hyped for Shadow of the Erdtree.", "language": null, "link": "https://www.youtube.com/watch?v=GMtos_N8xlk", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/GMtos_N8xlk/hqdefault.jpg", "title": "Elden Ring: Shadow of the Erdtree  - 15 Things I CAN'T WAIT To Do", "user": null, "vote": 0}]