[{"permanent": false, "thumbnail": "https://i4.ytimg.com/vi/oHRsJmrPAAw/hqdefault.jpg", "description": "Terminator: Dark Fate - Defiance is a unique take on the real-time strategy genre where, instead of making massive armies, you instead have to take care of smaller squads and ensure their survival. This sense of desperation is further amplified by the fact that a big part of the game revolves around keeping track of even the smallest possible resource you can find.\n\nWhile counting bullets and checking truck engines might not sound like a fun time at the outset, actually playing the game and learning how these systems interact with each other ends up revealing just how much fun Terminator: Dark Fate - Defiance can be. It also helps that the desperation of the campaign excellently mimics the dire circumstances of its namesake franchise.", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-03-03T21:00:31+00:00", "language": null, "album": "", "user": null, "page_rating_visits": 0, "bookmarked": false, "source_obj__id": 129, "comments": [], "title": "Terminator: Dark Fate - Defiance Review - Yet ANOTHER SURPRISINGLY Fun Game", "age": null, "link": "https://www.youtube.com/watch?v=oHRsJmrPAAw", "page_rating": 0, "tags": [], "page_rating_votes": 0, "dead": false, "vote": 0, "artist": "GamingBolt"}, {"permanent": false, "thumbnail": "https://i4.ytimg.com/vi/OccK5NK3W3c/hqdefault.jpg", "description": "WWE 2K22 was the beginning of this wrestling franchise’s resurgence, with last year’s iteration WWE 2K23 arguably the best wrestling game in years. Now, WWE 2K24 finds itself in strange territory – the gameplay formula established by this now rebooted series is already solid, so how are the developers going to make enough improvement to make WWE 2K24 an unmissable upgrade? \n\nWell, it seems as though they’ve taken their established formula and added enough innovation to make this a worthy upgrade – new game modes, match types, and upgrades all serve to support the spectacle and drama of real-life wrestling. WWE is in a golden era, and WWE 2K24 might have enough to make it the new champion of wrestling games.", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-03-03T17:00:15+00:00", "language": null, "album": "", "user": null, "page_rating_visits": 0, "bookmarked": false, "source_obj__id": 129, "comments": [], "title": "Why WWE 2K24 Is Going To Be One of The Biggest Games of 2024", "age": null, "link": "https://www.youtube.com/watch?v=OccK5NK3W3c", "page_rating": 0, "tags": [], "page_rating_votes": 0, "dead": false, "vote": 0, "artist": "GamingBolt"}, {"permanent": false, "thumbnail": "https://i1.ytimg.com/vi/hQkmOS04ESE/hqdefault.jpg", "description": "Marvel has made a lot of inroads with gaming in recent years, with Insomniac’s Spider-Man series doing the bulk of the heavy-lifting, and even though there have been a few high-profile failures as well (remember Avengers, anyone?), looking ahead, it’s hard not to be excited about what the future holds. \n\nWith the failed live service experiment in our rearview mirror, the current pipeline of upcoming AAA Marvel titles is promising a number of different iconic characters being brought to life by different studios in narrative-driven, single player experiences, from Motive Studio’s Iron Man to Insomniac’s Wolverine to Skydance New Media’s Captain America and Black Panther game. \n\nHere, we’re going to talk about all upcoming Marvel games that are currently officially confirmed to be in development, and everything we know about each one of them.", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-03-03T09:30:13+00:00", "language": null, "album": "", "user": null, "page_rating_visits": 0, "bookmarked": false, "source_obj__id": 129, "comments": [], "title": "All CONFIRMED UPCOMING MARVEL GAMES And Everything We Know About Them [2024 Edition]", "age": null, "link": "https://www.youtube.com/watch?v=hQkmOS04ESE", "page_rating": 0, "tags": [], "page_rating_votes": 0, "dead": false, "vote": 0, "artist": "GamingBolt"}]