[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T23:51:49.019477+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Quantum dots are already moving in the premium display category, particularly through QD-OLED TVs and monitors. The next step could be QDEL, short for \"quantum dot electroluminescent,\" also known as NanoLED, screens. Not to be confused with the QLED (quantum light emitting diode) tech already available in TVs, QDEL displays don't have a backlight. Instead, the quantum dots are the light source. The expected result is displays with wider color spaces than today's QD-OLEDs (quantum dot OLEDs) that are also brighter, more affordable, and resistant to burn-in. It seems like QDEL is being eyed as one of the most potentially influential developments for consumer displays over the next two years. If you're into high-end display tech, QDEL should be on your radar.\n \nYou may know QDEL as NanoLED because that's what Nanosys, a quantum dot supplier developing the technology, calls it. QDEL has gone by other names, such as QLED -- before Sams", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/04/23/2144258/what-comes-after-oled-meet-qdel?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "What Comes After OLED? Meet QDEL", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T22:47:37.733701+00:00", "description": "According to the Wall Street Journal, a deal for IBM to acquire HashiCorp could materialize in the next few days. Shares of HashiCorp jumped almost 20% on the news. CNBC reports: Developers use HashiCorp's software to set up and manage infrastructure in public clouds that companies such as Amazon\n and Microsoft operate. Organizations also pay HashiCorp for managing security credentials. Founded in 2012, HashiCorp went public on Nasdaq in 2021. The company generated a net loss of nearly $191 million on $583 million in revenue in the fiscal year ending Jan. 31, according to its annual report. In December, Mitchell Hashimoto, co-founder of HashiCorp, whose family name is reflected in the company name, announced that he was leaving.\n \nRevenue jumped almost 23% during that period, compared with 2% for IBM in 2023. IBM executives pointed to a difficult economic climate during a conference call with analysts in January. The hardware, software and consulting provider reports earnings on Wedne", "language": "en-us", "link": "https://slashdot.org/story/24/04/23/2041238/hashicorp-reportedly-being-acquired-by-ibm?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "HashiCorp Reportedly Being Acquired By IBM", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T22:47:36.244444+00:00", "description": "The Ray-Ban Meta Smart Glasses now feature support for multimodal AI -- without the need for a projector or $24 monthly fee. (We're looking at you, Humane AI.) With the new update, the Meta AI assistant will be able to analyze what you're seeing, and it'll give you smart, helpful answers or suggestions. The Verge reports: First off, there are some expectations that need managing here. The Meta glasses don't promise everything under the sun. The primary command is to say \"Hey Meta, look and...\" You can fill out the rest with phrases like \"Tell me what this plant is.\" Or read a sign in a different language. Write Instagram captions. Identify and learn more about a monument or landmark. The glasses take a picture, the AI communes with the cloud, and an answer arrives in your ears. The possibilities are not limitless, and half the fun is figuring out where its limits are. [...]\n \nTo me, it's the mix of a familiar form factor and decent execution that makes the AI workable on these glasses", "language": "en-us", "link": "https://meta.slashdot.org/story/24/04/23/2056254/the-ray-ban-meta-smart-glasses-have-multimodel-ai-now?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Ray-Ban Meta Smart Glasses Have Multimodel AI Now", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T21:42:39.027932+00:00", "description": "An anonymous reader quotes a report from Ars Technica: There's a new Linux distro on the scene today, and it's a bit specialized. Its development was led by the automotive electronics supplier Elektrobit, and it's the first open source OS that complies with the automotive industry's functional safety requirements. [...] With Elektrobit's EB corbos Linux for Safety Applications (that sure is a long name), there's an open source Linux distro that finally fits the bill, having just been given the thumbs up by the German organization TUV Nord. (It also complies with the IEC 61508 standard for safety applications.) \"The beauty of our concept is that you don't even need to safety-qualify Linux itself,\" said Moritz Neukirchner, a senior director at Elektrobit overseeing SDVs. Instead, an external safety monitor runs in a hypervisor, intercepting and validating kernel actions.\n \n\"When you look at how safety is typically being done, look at communication -- you don't safety-certify the communi", "language": "en-us", "link": "https://linux.slashdot.org/story/24/04/23/2023220/linux-can-finally-run-your-cars-safety-systems-and-driver-assistance-features?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Linux Can Finally Run Your Car's Safety Systems and Driver-Assistance Features", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T21:42:37.493974+00:00", "description": "A lawsuit is alleging Amazon was so desperate to keep up with the competition in generative AI it was willing to breach its own copyright rules. From a report: The allegation emerges from a complaint accusing the tech and retail mega-corp of demoting, and then dismissing, a former high-flying AI scientist after it discovered she was pregnant. The lawsuit was filed last week in a Los Angeles state court by Dr Viviane Ghaderi, an AI researcher who says she worked successfully in Amazon's Alexa and LLM teams, and achieved a string of promotions, but claims she was later suddenly demoted and fired following her return to work after giving birth. She is alleging discrimination, retaliation, harassment and wrongful termination, among other claims.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ex-Amazon+Exec+Claims+She+Was+Asked+To+Ignore+Copyright+Law+in+Race+To+AI%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F04%2F23%2F2034256%2F%3Futm_source%3", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/23/2034256/ex-amazon-exec-claims-she-was-asked-to-ignore-copyright-law-in-race-to-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ex-Amazon Exec Claims She Was Asked To Ignore Copyright Law in Race To AI", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T20:37:54.360552+00:00", "description": "Apple's iPhone sales dropped sharply in China in the first quarter of this year as the company saw strong competition from domestic brand Huawei, according to a new report from market research firm Counterpoint Research. CNBC: Apple saw sales of its iPhones fall 19.1% in the first three months of the year, Counterpoint's data showed, as Chinese telecommunications and consumer electronics giant Huawei saw a resurgence in its smartphone business. The Shenzhen, China-based firm saw sales of its smartphones surge a whopping 69.7% in the first quarter, Counterpoint said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=iPhone+Sales+Drop+19%25+in+China%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F24%2F04%2F23%2F1852251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F24%2F04%2F23%", "language": "en-us", "link": "https://mobile.slashdot.org/story/24/04/23/1852251/iphone-sales-drop-19-in-china?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "iPhone Sales Drop 19% in China", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T19:33:00.989768+00:00", "description": "General Motors (GM) has been selling data about the driving behavior of millions of people to insurance companies, leading to higher premiums for some drivers, according to a recent investigation. The affected drivers were not informed about the tracking, which was carried out through GM's OnStar connected services plan and the Smart Driver program. The New York Times reporter who broke the story discovered that her own driving data had been shared with data brokers working with the insurance industry, despite not being enrolled in the program. GM has since discontinued the Smart Driver product and stopped sharing data with LexisNexis and Verisk, following customer feedback and federal lawsuits filed by drivers across the country.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=How+GM+Tricked+Millions+of+Drivers+Into+Being+Spied+On%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F04%2F23%2F1843214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitt", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/23/1843214/how-gm-tricked-millions-of-drivers-into-being-spied-on?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How GM Tricked Millions of Drivers Into Being Spied On", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T19:32:59.479414+00:00", "description": "An anonymous reader shares a report: For years, people who have found Google search frustrating have been adding \"Reddit\" to the end of their search queries. This practice is so common that Google even acknowledged the phenomenon in a post announcing that it will be scraping Reddit posts to train its AI. And so, naturally, there are now services that will poison Reddit threads with AI-generated posts designed to promote products. \n\nA service called ReplyGuy advertises itself as \"the AI that plugs your product on Reddit\" and which automatically \"mentions your product in conversations naturally.\" Examples on the site show two different Redditors being controlled by AI posting plugs for a text-to-voice product called \"AnySpeech\" and a bot writing a long comment about a debt consolidation program called Debt Freedom Now. A video demo shows a dashboard where a user adds the name of their company and URL they want to direct users to. It then auto-suggests keywords that \"help the bot know wh", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/23/1847240/ai-is-poisoning-reddit-to-promote-products-and-game-google-with-parasite-seo?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Is Poisoning Reddit To Promote Products and Game Google With 'Parasite SEO'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T18:27:45.556346+00:00", "description": "The Federal Trade Commission is set to vote Tuesday afternoon on a proposal to ban noncompete agreements, which prevent workers from taking positions at competitors for a period of time after they leave a job. From a report: The ban could be a win for workers -- particularly at the low end of the income scale. Critics of these agreements say they stifle innovation and wage growth by restricting workers' ability to take new jobs that pay higher wages or offer some other opportunity. They also make it tougher for employers to hire strong talent, lessening competition. \n\nSome states have laws limiting noncompetes to higher-income folks or banning them altogether -- but most don't. Experts told Axios that the final rule will likely look similar to the draft proposal, which was a broad prohibition on all noncompetes, even for executives. Any final rule is unlikely to take effect for many years -- if ever, as it will surely get tied up in court. The Chamber of Commerce, which opposes the ba", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/23/1657246/ftc-to-vote-on-noncompete-ban?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FTC To Vote On Noncompete Ban", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T18:27:44.011301+00:00", "description": "An anonymous reader shares a report: Apple has dropped the number of Vision Pro units that it plans to ship in 2024, going from an expected 700 to 800k units to just 400k to 450k units, according to Apple analyst Ming-Chi Kuo. Orders have been scaled back before the Vision Pro has launched in markets outside of the United States, which Kuo says is a sign that demand in the U.S. has \"fallen sharply beyond expectations.\" \n\nAs a result, Apple is expected to take a \"conservative view\" of headset demand when the Vision Pro launches in additional countries. Kuo previously said that Apple will introduce the Vision Pro in new markets before the June Worldwide Developers Conference, which suggests that we could see it available in additional areas in the next month or so.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Cuts+Vision+Pro+Shipments+As+Demand+Falls+'Sharply+Beyond+Expectations'%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F04%2F2", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/23/1722254/apple-cuts-vision-pro-shipments-as-demand-falls-sharply-beyond-expectations?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Cuts Vision Pro Shipments As Demand Falls 'Sharply Beyond Expectations'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T17:22:34.290994+00:00", "description": "The U.S. publishing industry is driven by celebrity authors and repeat bestsellers, according to testimony from a blocked merger between Penguin Random House and Simon &amp; Schuster. Only 50 authors sell over 500,000 copies annually, with 96% of books selling under 1,000 copies. Publishing houses spend most of their advance money on celebrity books, which along with backlist titles like The Bible, account for the bulk of their revenue and fund less commercially successful books.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=No+One+Buys+Books+Any+More%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F04%2F23%2F1632227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F04%2F23%2F1632227%2Fno-one-buys-books-any-more%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/23/1632227/no-one-buys-books-any-more?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "No One Buys Books Any More", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T16:17:23.545918+00:00", "description": "Chinese tech giant Kuaishou is laying off employees in their mid-30s as part of a company-wide restructuring plan dubbed \"Limestone,\" FT reported Tuesday, citing people with direct knowledge of the matter. The move highlights the pervasive ageism in China's tech sector, where younger workers are favored for their perceived willingness to work long hours and keep up with the latest technological developments, the report adds. \n\nWhile China's labor law does not explicitly prohibit age discrimination, some have interpreted it as such. However, tech executives have openly expressed their preference for younger employees, with companies like ByteDance and Pinduoduo boasting some of the youngest workforces in the industry. The economic slowdown and regulatory crackdowns have exacerbated the problem, with tens of thousands of jobs cut across the sector in recent months. Those over 35 face significant challenges in finding new employment, as even the civil service and service sector prioritiz", "language": "en-us", "link": "https://slashdot.org/story/24/04/23/154206/chinas-ageing-tech-workers-hit-by-curse-of-35?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China's Ageing Tech Workers Hit By 'Curse of 35'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T16:17:21.890556+00:00", "description": "prisoninmate writes: Fedora Linux 40 distribution has been officially released -- powered by the latest Linux 6.8 kernel series, and featuring the GNOME 46 and KDE Plasma 6 desktop environments, reports 9to5Linux: \"Powered by the latest and greatest Linux 6.8 kernel series, the Fedora Linux 40 release ships with the GNOME 46 desktop environment for the flagship Fedora Workstation edition and the KDE Plasma 6 desktop environment for the Fedora KDE Spin, which defaults to the Wayland session as the X11 session was completely removed.\" \n\n\"Fedora Linux 40 also includes some interesting package management changes, such as dropping Delta RPMs and disabling support in the default configuration of DNF / DNF5. It also changes the DNF behavior to no longer download filelists by default. However, this release doesn't ship with the long-awaited DNF5 package manager. For AMD GPUs, Fedora Linux 40 ships with AMD ROCm 6.0 as the latest release of AMD's software optimized for AI and HPC workload perf", "language": "en-us", "link": "https://linux.slashdot.org/story/24/04/23/1452255/fedora-linux-40-officially-released?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Fedora Linux 40 Officially Released", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T15:11:29.461519+00:00", "description": "Google has fired another 20 workers for participating in protests against its $1.2 billion cloud computing contract with the Israeli government, according to an activist group representing the workers. From a report: In total, the company has now fired around 50 employees over sit-in protests held in Google offices last week that were part of yearslong discontent among a group of Google and Amazon workers over claims that Israel is using the companies' services to harm Palestinians. Google has denied those claims, saying Project Nimbus, the cloud-computing contract, doesn't involve \"highly sensitive, classified, or military workloads relevant to weapons or intelligence services,\" and that Israeli government ministries that use its commercial cloud must agree to its terms of services and other policies. \n\nNo Tech For Apartheid, the group representing the workers, claimed in a statement that Google is attempting to \"quash dissent, silence its workers, and reassert its power over them.\" ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/23/148207/google-fires-more-employees-over-protest-of-cloud-contract-with-israel?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Fires More Employees Over Protest of Cloud Contract With Israel", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T15:11:27.867673+00:00", "description": "Microsoft has launched Phi-3 Mini, a lightweight AI model with 3.8 billion parameters, as part of its plan to release three small models. Phi-3 Mini, trained on a smaller data set compared to large language models, is available on Azure, Hugging Face, and Ollama. Microsoft claims Phi-3 Mini performs as well as models 10 times its size, offering capabilities similar to GPT-3.5 in a smaller form factor. Smaller AI models are more cost-effective and perform better on personal devices.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Launches+Phi-3+Mini%2C+a+3.8B-Parameter+Model+Rivaling+GPT-3.5+Capabilities%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F04%2F23%2F1433204%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F04%2F23%2F1433204%2Fmicrosoft-launches-phi-3-mini-a-38b", "language": "en-us", "link": "https://slashdot.org/story/24/04/23/1433204/microsoft-launches-phi-3-mini-a-38b-parameter-model-rivaling-gpt-35-capabilities?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Launches Phi-3 Mini, a 3.8B-Parameter Model Rivaling GPT-3.5 Capabilities", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T14:06:34.347198+00:00", "description": "Toyota's Mirai, a hydrogen-powered Fuel Cell EV initially heralded as the future of driving, has faced significant challenges due to inadequate hydrogen fueling infrastructure. As chronicled by InsideEVs, many owners have become disillusioned with the vehicle's high operational costs, unreliable refueling options, and significant depreciation, prompting lawsuits and calls for buybacks. Longtime Slashdot reader whoever57 writes: Toyota Mirai owners are fed up and disillusioned. Hydrogen fuel pumps are hard to find and, rather than new pumps opening, they are closing down. Owners feel misled about the costs and availability of hydrogen fuel stations. Even if a Mirai owner can find a fuel station, it may not be operating. Moreover, refueling is frequently a long and problematic process, with pumps taking over an hour to fill a tank and cars getting stuck to the fuel pump for hours. It would be quicker to charge a battery EV. Naturally, resale values of these cars are plummeting. Even wit", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/22/2353248/toyotas-hydrogen-future-is-crumbling-as-owners-file-lawsuits-call-for-buybacks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Toyota's Hydrogen Future Is Crumbling As Owners File Lawsuits, Call For Buybacks", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T10:50:44.727147+00:00", "description": "NASA last week formally approved a $3.35 billion mission to explore Saturn's largest moon with a quadcopter drone. \"Dragonfly is a spectacular science mission with broad community interest, and we are excited to take the next steps on this mission,\" said Nicky Fox, associate administrator of NASA's science mission directorate. \"Exploring Titan will push the boundaries of what we can do with rotorcraft outside of Earth.\" The mission has a launch date of July 2028. Ars Technica reports: After reaching Titan, the eight-bladed rotorcraft lander will soar from place to place on Saturn's hazy moon, exploring environments rich in organic molecules, the building blocks of life. Dragonfly will be the first mobile robot explorer to land on any other planetary body besides the Moon and Mars, and only the second flying drone to explore another planet. NASA's Ingenuity helicopter on Mars was the first. Dragonfly will be more than 200 times as massive as Ingenuity and will operate six times farther", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/22/2338219/nasa-officially-greenlights-335-billion-mission-to-saturns-moon-titan?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA Officially Greenlights $3.35 Billion Mission To Saturn's Moon Titan", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T07:34:59.643252+00:00", "description": "quonset writes: Just over two weeks ago, NASA figured out why its Voyager 1 spacecraft stopped sending useful data. They suspected corrupted memory in its flight data system (FDS) was the culprit. Today, for the first time since November, Voyager 1 is sending useful data about its health and the status of its onboard systems back to NASA. How did NASA accomplish this feat of long distance repair? They broke up the code into smaller pieces and redistributed them throughout the memory.\n \nFrom NASA: \"... So they devised a plan to divide the affected code into sections and store those sections in different places in the FDS. To make this plan work, they also needed to adjust those code sections to ensure, for example, that they all still function as a whole. Any references to the location of that code in other parts of the FDS memory needed to be updated as well. The team started by singling out the code responsible for packaging the spacecraft's engineering data. They sent it to its new ", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/22/2343257/voyager-1-resumes-sending-updates-to-earth?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Voyager 1 Resumes Sending Updates To Earth", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T04:19:35.783368+00:00", "description": "An anonymous reader quotes a report from the Washington Post: In sunny California, solar panels are everywhere. They sit in dry, desert landscapes in the Central Valley and are scattered over rooftops in Los Angeles's urban center. By last count, the state had nearly 47 gigawatts of solar power installed -- enough to power 13.9 million homes and provide over a quarter of the Golden State's electricity. But now, the state and its grid operator are grappling with a strange reality: There is so much solar on the grid that, on sunny spring days when there's not as much demand, electricity prices go negative. Gigawatts of solar are \"curtailed\" -- essentially, thrown away. In response, California has cut back incentives for rooftop solar and slowed the pace of installing panels. But the diminishing economic returns may slow the development of solar in a state that has tried to move to renewable energy. And as other states build more and more solar plants of their own, they may soon face the", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/22/2313206/california-is-grappling-with-a-growing-problem-too-much-solar?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "California Is Grappling With a Growing Problem: Too Much Solar", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T02:10:56.776857+00:00", "description": "According to French business magazine Challenges, Apple has acquired Datakalab -- a Paris-based startup specializing in artificial intelligence compression and computer vision technology. 9to5Mac reports: Datakalab described itself as \"experts in low power, runtime efficient, and deep learning algorithms\" that work on device. On its LinkedIn page, Datakalab highlights \"industry leading compression and adaptation to deploy embedded computer vision that is fast, cost-effective and precise.\" Prior to the Apple acquisition had between 10 and 20 employees.\n \nFrom Datakalab's now-defunct website: \"Datakalab is a French technology company that develops computer image analysis algorithms to measure flows in public space. The images are instantly transformed into anonymized statistical data processed locally in 100ms. Datakalab does not store any images or personal data and only keeps statistical data. Datakalab products are built according to the principle of 'Privacy by Design.'\"\n \nWhile nei", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/22/2320251/apple-acquires-datakalab-a-french-startup-behind-ai-and-computer-vision-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Acquires Datakalab, a French Startup Behind AI and Computer Vision Tech", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T02:10:54.826182+00:00", "description": "Data scientist Antoine Mayerowitz, PhD, applied Vilfredo Pareto's (the early 20th-century Italian economist) theories to Mario Kart 8 Deluxe to determine the best racer combinations. \"When you break down the build options (including driver stats and various vehicle details) in Mario Kart 8 Deluxe, there are over 700,000 possible combinations,\" notes Engadget. \"But once you eliminate duplicates that differ only in appearance, you can narrow it down to 'only' 25,704 possibilities.\" From the report: Pareto's theories, most notably the Pareto front, help us navigate the complexities of choice. They can pinpoint the solutions with the most balanced strengths and the fewest trade-offs. Pareto's work is about efficiency and effectiveness. [...] Mayerowitz's Pareto front analysis lets you narrow your possibilities down to the 14 most efficient. And it turns out the game's top players were onto something: One of the combinations with the most ideal balance of speed, acceleration and mini-turbo", "language": "en-us", "link": "https://games.slashdot.org/story/24/04/22/2331216/paretos-economic-theories-used-to-find-the-best-mario-kart-8-racer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Pareto's Economic Theories Used To Find the Best Mario Kart 8 Racer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-23T00:41:35.187777+00:00", "description": "An anonymous reader quotes a report from The Register: Huawei plans to expand its native HarmonyOS smartphone platform worldwide, despite coming under US-led sanctions that have deprived it of access to key technologies. \"We will work hard to build up the HarmonyOS app ecosystem in the China market first, then, from country to country, we will start gradually pushing it out to other parts of the world,\" Huawei's rotating chairman Erik Xu told attendees at its 21st Analyst Summit in Shenzhen last week. Part of this process will involve porting apps to HarmonyOS and encouraging other app developers to code for the platform.\n \n\"In the China market, Huawei smartphone users spend 99 percent of their time on about 5,000 apps. So we decided to spend 2024 porting these apps over to HarmonyOS first in our drive to truly unify the OS and the app ecosystem. We are also encouraging other apps to be ported over to HarmonyOS,\" Xu said. According to Huawei's rotating chairman, more than 4,000 of tho", "language": "en-us", "link": "https://mobile.slashdot.org/story/24/04/22/209252/huawei-wants-to-take-homegrown-harmonyos-phone-platform-worldwide?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Huawei Wants To Take Homegrown HarmonyOS Phone Platform Worldwide", "user": null, "vote": 0}]