[{"page_rating": 0, "bookmarked": false, "title": "Vietnam To Collect Biometrics For New ID Cards", "tags": [], "link": "https://yro.slashdot.org/story/24/02/20/2116224/vietnam-to-collect-biometrics-for-new-id-cards?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Starting in July, the Vietnamese government will begin collecting biometric information from its citizens when issuing new identification cards. The Register reports: Prime minister Pham Minh Chinh instructed the nation's Ministry of Public Security to collect the data in the form of iris scans, voice samples and actual DNA, in accordance with amendments to Vietnam's Law on Citizen Identification. The ID cards are issued to anyone over the age of 14 in Vietnam, and are optional for citizens between the ages of 6 and 14, according to a government news report. Amendments to the Law on Citizen Identification that allow collection of biometrics passed on November 27 of last year.\n \nThe law allows recording of blood type among the DNA-related information that will be contained in a national database to be shared across agencies \"to perform their functions and tasks.\" The ministry will work with other parts of the government to integrate the identification system into the national ", "thumbnail": null, "comments": [], "date_published": "2024-02-20T23:40:21.357726+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Valve Makes All Steam Audio SDK Source Code Available Under Apache 2.0 License", "tags": [], "link": "https://news.slashdot.org/story/24/02/20/2122208/valve-makes-all-steam-audio-sdk-source-code-available-under-apache-20-license?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Michael Larabel reports via Phoronix: With Valve's release today of the Steam Audio SDK 4.5.2 they have made the software development kit fully open-source under an Apache 2.0 license. Steam Audio 4.5.2 may not sound exciting in the context of a version number but as described in the release announcement is now \"the first open source release of the Steam Audio SDK source code.\" The rest of this work in this Steam Audio SDK release amounts to bug fixes and other standard changes.\n \nIn a SteamCommunity.com announcement posted today entitled \"Steam Audio Open Source Release,\" it notes: \"The entire Steam Audio codebase, including both the SDK and all plugins, is now released under the Apache 2.0 license. This allows developers to use Steam Audio in commercial products, and to modify or redistribute it under their own licensing terms without having to include source code. We welcome contributions from developers who would like to fix bugs or add features to Steam Audio.\" You can l", "thumbnail": null, "comments": [], "date_published": "2024-02-20T23:40:18.090103+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "EU Opens Formal Investigation Into TikTok Over Possible Online Content Breaches", "tags": [], "link": "https://tech.slashdot.org/story/24/02/20/2111257/eu-opens-formal-investigation-into-tiktok-over-possible-online-content-breaches?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "An anonymous reader quotes a report from Reuters: The European Union will investigate whether ByteDance's TikTok breached online content rules aimed at protecting children and ensuring transparent advertising, an official said on Monday, putting the social media platform at risk of a hefty fine. EU industry chief Thierry Breton said he took the decision after analyzing the short video app's risk assessment report and its replies to requests for information, confirming a Reuters story. \"Today we open an investigation into TikTok over suspected breach of transparency &amp; obligations to protect minors: addictive design &amp; screen time limits, rabbit hole effect, age verification, default privacy settings,\" Breton said on X.\n \nThe European Union's Digital Services Act (DSA), which applies to all online platforms since Feb. 17, requires in particular very large online platforms and search engines to do more to tackle illegal online content and risks to public security. TikTok'", "thumbnail": null, "comments": [], "date_published": "2024-02-20T22:35:14.809303+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Making Alarms More Musical Can Save Lives", "tags": [], "link": "https://science.slashdot.org/story/24/02/20/1818248/making-alarms-more-musical-can-save-lives?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Medical alarms don't have to be louder to be more effective. Scientific American: Beeping alarms in hospitals are a life-or-death matter -- but with so many going off all the time, medical professionals may experience alarm fatigue that impairs care. Researchers now report that changing an alarm's sound to incorporate properties of musical instruments can make it more helpful amid the din. Auditory alarms can sound up to 300 times a day per patient in U.S. hospitals, but only a small fraction require immediate action. \n\nData from the U.S. Food and Drug Administration suggest that alarm fatigue (including when clinicians turned off or forgot to restart alarms) and other alarm-related issues were linked to 566 deaths over five and a half years. After a typical day at the hospital, \"I'd leave with beeping in my ears,\" says Vanderbilt University Medical Center anesthesiologist Joseph Schlesinger. He collaborated with Michael Schutz, a music cognition researcher at McMaster Univer", "thumbnail": null, "comments": [], "date_published": "2024-02-20T21:30:23.245027+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Microsoft Publisher Books Its Retirement Party for 2026", "tags": [], "link": "https://it.slashdot.org/story/24/02/20/1933238/microsoft-publisher-books-its-retirement-party-for-2026?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Microsoft is confirming plans to deprecate its Publisher application in 2026. From a report: This writer has fond memories of Microsoft Publisher, which started life in 1991 as a desktop publisher for Windows 3.0. While alternatives existed in the form of Ventura Publisher, Timeworks, and later QuarkXPress, Microsoft Publisher was a useful tool to write newsletters. Unlike Word, Publisher was focused on layout and page design. Though it lacked many of the features of its competitors, it was responsible for some genuinely horrendous designs, and was popular due to its cheap price. \n\nDespite not finding much favor with professionals, Microsoft Publisher continued to be updated over the years. Microsoft Publisher 97 was the first to turn up in the Microsoft Office suite, and the most recent edition, released in 2021, is available as part of Microsoft 365. However, all good things -- and Publisher -- must come to an end. Microsoft has warned that the end is nigh for its venerable", "thumbnail": null, "comments": [], "date_published": "2024-02-20T21:30:21.416512+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Apple Officially Warns Users To Stop Putting Wet iPhones in Rice", "tags": [], "link": "https://mobile.slashdot.org/story/24/02/20/1911202/apple-officially-warns-users-to-stop-putting-wet-iphones-in-rice?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "An anonymous reader shares a report: In a recent support document, Apple states that putting wet devices in a bag of rice could \"allow small particles of rice to damage your iPhone,\" although it doesn't go into further detail. The company also recommended against using other well-known hacks, such as using an external heat source to dry the phone or sticking a cotton swab into the connector. The company's warning on rice coincides with those of other repair experts, who have found that the rice hack works slower than simply leaving your iPhone on a counter to dry. Time is crucial in these situations, as the most important thing is to prevent the water from damaging the electronics inside the phone.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Officially+Warns+Users+To+Stop+Putting+Wet+iPhones+in+Rice%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F24%2F02%2F20%2F1911202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img sr", "thumbnail": null, "comments": [], "date_published": "2024-02-20T20:20:54.186060+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Microsoft Develops AI Server Gear To Lessen Reliance on Nvidia", "tags": [], "link": "https://tech.slashdot.org/story/24/02/20/1725205/microsoft-develops-ai-server-gear-to-lessen-reliance-on-nvidia?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Microsoft is developing a new network card that could improve the performance of its Maia AI server chip and potentially reduce the company's reliance on chip designer Nvidia, The Information reported on Tuesday. Reuters: Microsoft CEO Satya Nadella has tapped Pradeep Sindhu, who co-founded networking gear developer Juniper Networks, to spearhead the network card effort, the report said citing a person with knowledge of the matter. Microsoft acquired Sindhu's server chip startup, Fungible, last year. The new network card is similar to Nvidia's ConnectX-7 card, which the chip developer sells alongside its graphic processor units (GPUs), the report added. The equipment could take more than a year to develop and, if successful, could lessen the time it takes for OpenAI to train its models on Microsoft servers as well as make the process less expensive, according to the report.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Dev", "thumbnail": null, "comments": [], "date_published": "2024-02-20T20:20:52.437165+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "This Tiny Website Is Google's First Line of Defense in the Patent Wars", "tags": [], "link": "https://tech.slashdot.org/story/24/02/20/182246/this-tiny-website-is-googles-first-line-of-defense-in-the-patent-wars?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "A trio of Google engineers recently came up with a futuristic way to help anyone who stumbles through presentations on video calls. They propose that when algorithms detect a speaker's pulse racing or \"umms\" lengthening, a generative AI bot that mimics their voice could simply take over. That cutting-edge idea wasn't revealed at a big company event or in an academic journal. Instead, it appeared in a 1,500-word post on a little-known, free website called TDCommons.org that Google has quietly owned and funded for nine years. WIRED: Until WIRED received a link to an idea on TDCommons last year and got curious, Google had never spoken with the media about its website. Scrolling through TDCommons, you can read Google's latest ideas for coordinating smart home gadgets for better sleep, preserving privacy in mobile search results, and using AI to summarize a person's activities from their photo archives. And the submissions aren't exclusive to Google; about 150 organizations, inclu", "thumbnail": null, "comments": [], "date_published": "2024-02-20T19:17:18.589164+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Signal Finally Rolls Out Usernames, So You Can Keep Your Phone Number Private", "tags": [], "link": "https://it.slashdot.org/story/24/02/20/1835203/signal-finally-rolls-out-usernames-so-you-can-keep-your-phone-number-private?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Encrypted messaging app Signal has launched new feature allowing users to conceal their phone numbers and instead use usernames, in a move aimed at boosting privacy protections long sought by cybersecurity experts and privacy advocates. From a report: Rather than give your phone number to other Signal contacts as the identifier they use to begin a conversation with you, in other words, you can now choose to be discoverable via a chosen handle -- or even to prevent anyone who does have your phone number from finding you on Signal. \n\nThe use of phone numbers has long been perhaps the most persistent criticism of Signal's design. These new privacy protections finally offer a fix, says Meredith Whittaker, Signal's executive director. \"We want to build a communications app that everyone in the world can easily use to connect with anyone else privately. That 'privately' is really in bold, underlined, in italics,\" Whittaker tells WIRED. \"So we're extremely sympathetic to people who ", "thumbnail": null, "comments": [], "date_published": "2024-02-20T19:17:15.831455+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Neuralink's First Human Patient Able To Control Mouse Through Thinking, Musk Says", "tags": [], "link": "https://science.slashdot.org/story/24/02/20/1615216/neuralinks-first-human-patient-able-to-control-mouse-through-thinking-musk-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "The first human patient implanted with a brain-chip from Neuralink appears to have fully recovered and is able to control a computer mouse using their thoughts, the startup's founder Elon Musk said late on Monday. From a report: \"Progress is good, and the patient seems to have made a full recovery, with no ill effects that we are aware of. Patient is able to move a mouse around the screen by just thinking,\" Musk said in a Spaces event on social media platform X. Musk said Neuralink was now trying to get as many mouse button clicks as possible from the patient. The firm successfully implanted a chip on its first human patient last month, after receiving approval for human trial recruitment in September.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Neuralink's+First+Human+Patient+Able+To+Control+Mouse+Through+Thinking%2C+Musk+Says%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F02%2F20%2F1615216%2F%3Futm_source%3Dtwitter%26utm_m", "thumbnail": null, "comments": [], "date_published": "2024-02-20T17:27:52.836274+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Cox Communications Wins Order Overturning $1 Billion US Copyright Verdict", "tags": [], "link": "https://news.slashdot.org/story/24/02/20/1635234/cox-communications-wins-order-overturning-1-billion-us-copyright-verdict?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Cox, the cable television and internet service provider, convinced a U.S. appeals court to throw out a $1 billion jury verdict in favor of several major record labels that had accused it of failing to curb user piracy, setting the stage for a new trial on the matter. From a report: The 4th U.S. Circuit Court of Appeals in Richmond, Virginia ruled on Tuesday that the amount of damages was not justified and that a federal district court should hold a new trial to determine the appropriate amount. A Virginia jury in 2019 found Cox, the largest unit of privately owned Cox Enterprises, liable for its customers' violations of over 10,000 copyrights belonging to labels including Sony Music Entertainment, Warner Music Group, and Universal Music Group. More than 50 labels teamed up to sue Cox in 2018, in what was seen as a test of the obligations of internet service providers (ISPs) to thwart piracy.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?st", "thumbnail": null, "comments": [], "date_published": "2024-02-20T17:27:51.325551+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "International Nest Aware Subscriptions Jump in Price, as Much As 100%", "tags": [], "link": "https://tech.slashdot.org/story/24/02/20/1534220/international-nest-aware-subscriptions-jump-in-price-as-much-as-100?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Google's \"Nest Aware\" camera subscription is going through another round of price increases. From a report: This time it's for international users. There's no big announcement or anything, just a smattering of email screenshots from various countries on the Nest subreddit. 9to5Google was nice enough to hunt down a pile of the announcements. Nest Aware is a monthly subscription fee for Google's Nest cameras. Nest cameras exclusively store all their video in the cloud, and without the subscription, you aren't allowed to record video 24/7. \n\nThere are two sets of subscriptions to keep track of: the current generation subscription for modern cameras and the \"first generation Nest Aware\" subscription for older cameras. To give you an idea of what we're dealing with, in the US, the current free tier only gets you three hours of \"event\" video -- meaning video triggered by motion detection. Even the basic $8-a-month subscription doesn't get you 24/7 recording -- that's still only 30 ", "thumbnail": null, "comments": [], "date_published": "2024-02-20T16:19:07.741050+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Astronomers Discover Universe's Brightest Object", "tags": [], "link": "https://science.slashdot.org/story/24/02/20/163250/astronomers-discover-universes-brightest-object?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "The brightest known object in the universe, a quasar 500tn times brighter than our sun, was \"hiding in plain sight,\" researchers say. From a report: Australian scientists spotted a quasar powered by the fastest growing black hole ever discovered. Its mass is about 17bn times that of our solar system's sun, and it devours the equivalent of a sun a day. The light from the celestial object travelled for more than 12bn years to reach Earth. Australian National University scientists first spotted it using a 2.3-metre telescope at the university's NSW Siding Spring Observatory in Coonabarabran. They then confirmed the find using the European Southern Observatory's (ESO's) Very Large Telescope, which has a primary mirror of 8 metres. The findings by the ANU researchers, in collaboration with the ESO, the University of Melbourne, and France's Sorbonne Universite have been published in Nature Astronomy.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home", "thumbnail": null, "comments": [], "date_published": "2024-02-20T16:19:06.233231+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Sony's PlayStation Portal Hacked To Run Emulated PSP Games", "tags": [], "link": "https://games.slashdot.org/story/24/02/20/149230/sonys-playstation-portal-hacked-to-run-emulated-psp-games?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "An anonymous reader shares a report: Sony's new PlayStation Portal has been hacked by Google engineers to run emulated games locally. The $199.99 handheld debuted in November but was limited to just streaming games from a PS5 console and not even titles from Sony's cloud gaming service. Now, two Google engineers have managed to get the PPSSPP emulator running natively on the PlayStation Portal, allowing a Grand Theft Auto PSP version to run on the Portal without Wi-Fi streaming required. \"After more than a month of hard work, PPSSPP is running natively on PlayStation Portal. Yes, we hacked it,\" says Andy Nguyen in a post on X. Nguyen also confirms that the exploit is \"all software based,\" so it doesn't require any hardware modifications like additional chips or soldering. Only a photo of Grand Theft Auto: Liberty City Stories running on the PlayStation Portal has been released so far, but Nguyen may release some videos to demonstrate the exploit at the weekend.<p><div class=\"", "thumbnail": null, "comments": [], "date_published": "2024-02-20T15:13:53.832781+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Adobe Acrobat Adds Generative AI To 'Easily Chat With Documents'", "tags": [], "link": "https://tech.slashdot.org/story/24/02/20/1441252/adobe-acrobat-adds-generative-ai-to-easily-chat-with-documents?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Adobe is adding a new generative AI experience to its Acrobat PDF management software, which aims to \"completely transform the digital document experience\" by making information in long documents easier to find and understand. From a report: Announced in Adobe's press release as \"AI Assistant in Acrobat,\" the new tool is described as a \"conversational engine\" that can summarize files, answer questions, and recommend more based on the content, allowing users to \"easily chat with documents\" to get the information they need. It's available in beta starting today for paying Acrobat users. \n\nThe idea is that the chatbot will reduce the time-consuming tasks related to working with massive text documents -- such as helping students quickly find information for research projects or summarizing large reports into snappy highlights for emails, meetings, and presentations. AI Assistant in Acrobat can be used with all document formats supported by the app, including Word and PowerPoint. ", "thumbnail": null, "comments": [], "date_published": "2024-02-20T15:13:51.050357+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Walmart To Buy TV Maker Vizio For $2.3 Billion", "tags": [], "link": "https://entertainment.slashdot.org/story/24/02/20/1218207/walmart-to-buy-tv-maker-vizio-for-23-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Walmart has agreed to buy TV maker Vizio, the companies announced Tuesday, as the largest U.S. retailer grows its high-profit ad business. From a report: Walmart will acquire Vizio for $2.3 billion, or $11.50 per share, in cash. Vizio shares, which spiked after reports of the deal first emerged last week, closed at $9.53 on Friday. Walmart and its Sam's Club warehouse chain have long been major sellers of Vizio devices. But in buying the company, Walmart touted the potential to boost its ad business through Vizio's SmartCast Operating System, which allows users to stream free ad-supported content on their TVs.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Walmart+To+Buy+TV+Maker+Vizio+For+%242.3+Billion%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F02%2F20%2F1218207%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebo", "thumbnail": null, "comments": [], "date_published": "2024-02-20T12:58:49.454856+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Wikileaks Founder in Last-Ditch Bid To Avoid US Extradition", "tags": [], "link": "https://news.slashdot.org/story/24/02/20/1123259/wikileaks-founder-in-last-ditch-bid-to-avoid-us-extradition?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "An anonymous reader shares a report: Lawyers for Julian Assange have launched what could be his final bid to avoid extradition to the US to face trial over leaking military secrets. The two-day hearing at the High Court in London is hearing his team argue he should be allowed a full appeal. Edward Fitzgerald KC told the court his client was being prosecuted \"for engaging in ordinary journalistic practice.\" If an appeal is turned down, Mr Assange could be handed over within weeks. \n\nSupporters of the Wikileaks founder say he exposed wrongdoing, but the US says Mr Assange put lives at risk. The case is being heard by two judges, Dame Victoria Sharp and Mr Justice Johnson. As the hearing got under way, Mr Fitzgerald told them his client was \"being prosecuted for engaging in ordinary journalistic practice of obtaining and publishing classified information, information that is both true and of obvious and important public interest.\" He also confirmed that Mr Assange would not be a", "thumbnail": null, "comments": [], "date_published": "2024-02-20T11:53:48.410525+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "International Law Enforcement Disrupts LockBit Ransomware", "tags": [], "link": "https://it.slashdot.org/story/24/02/20/092259/international-law-enforcement-disrupts-lockbit-ransomware?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "A coalition of global law enforcement agencies including the FBI and UK National Crime Agency have taken control of the LockBit ransomware gang's dark web site, replacing it with a notice saying their services had been disrupted by joint international action. The \"Operation Cronos\" task force includes Europol and enforcement agencies from a dozen countries across Europe, Asia and North America. LockBit is a prolific ransomware group that hacks corporate networks then threatens to leak stolen data unless ransom demands are paid. The notice said the operation against them was \"ongoing and developing.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=International+Law+Enforcement+Disrupts+LockBit+Ransomware%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F02%2F20%2F092259%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.", "thumbnail": null, "comments": [], "date_published": "2024-02-20T09:30:08.168482+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "'Step Away From CNBC'", "tags": [], "link": "https://slashdot.org/story/24/02/20/0325234/step-away-from-cnbc?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Andrew Feinberg, writing for Slate: If you wanted to design a financial channel that would cause investors to underperform the stock market, you'd create CNBC, NBC's financial counterpart that runs on cable news and ostensibly tries to make viewers better investors. You'd make it sober and rational (well, there is Jim Cramer, but we'll get to him later), no need to feature anyone foaming at the mouth about stocks that could triple in six months or worried Cassandras warning that it's time to sell everything and burrow underground. And yet, you'd ensure that viewers stay engaged by keeping them on edge, worried and confused about what might happen next. Anxiety, you'd discover, is your friend, viewer hypervigilance your bread and butter. \n\nIn other words, CNBC makes viewers nervous in a very specific way. Nervous that they're about to lose money in a market downturn. Nervous that they might miss a hot trend or stock. Or uncertain that they're in the right sectors. Then an \"exp", "thumbnail": null, "comments": [], "date_published": "2024-02-20T07:14:02.001914+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "AI Not Hyped Enough, Says Microsoft Exec", "tags": [], "link": "https://slashdot.org/story/24/02/19/1955234/ai-not-hyped-enough-says-microsoft-exec?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "Puneet Chandok, Microsoft India and South Asia head, at an event this week: \"People say AI is overhyped, but I think it's not hyped enough. The next generation who will use this in the next few years will have a much higher bar on what technology can do for them. So how you build it for that generation, how you build it for that future will be really interesting to see. AI is truly a general purpose technology, which can change everything that we do,\" he added.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Not+Hyped+Enough%2C+Says+Microsoft+Exec%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F02%2F19%2F1955234%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F02%2F19%2F1955234%2Fai-not-hyped-enough-says-microsoft-exec%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><", "thumbnail": null, "comments": [], "date_published": "2024-02-20T03:42:04.732949+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Microsoft Fixes Edge Browser Bug That Was Stealing Chrome Tabs and Data", "tags": [], "link": "https://it.slashdot.org/story/24/02/19/1949256/microsoft-fixes-edge-browser-bug-that-was-stealing-chrome-tabs-and-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "language": "en-us", "page_rating_contents": 0, "album": "", "artist": "help@slashdot.org", "page_rating_visits": 0, "user": null, "description": "An anonymous reader shared an news report: Microsoft has fixed an issue where its Edge browser was again misbehaving, this time by automatically importing browsing data and tabs from Chrome without consent. I personally experienced the bug last month, after I rebooted my PC for a regular Windows update and Microsoft Edge automatically opened with the Chrome tabs I was working on before the update. I asked Microsoft repeatedly to explain why this behavior had occurred for myself and many other Windows users, but the company refused to comment. Microsoft has now quietly issued a fix in the latest Microsoft Edge update. \n\nHere's how Microsoft describes the fix: \"Edge has a feature that provides an option to import browser data on each launch from other browsers with user consent. This feature's state might not have been syncing and displaying correctly across multiple devices. This is fixed.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?stat", "thumbnail": null, "comments": [], "date_published": "2024-02-20T01:32:27.928923+00:00", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 607, "vote": 0}]