[{"page_rating": 0, "bookmarked": false, "title": "The Story of Tifa So Far - Before You Begin Final Fantasy 7 Rebirth", "tags": [], "link": "https://www.youtube.com/watch?v=KRGwcXyUvNw", "language": null, "page_rating_contents": 0, "album": "", "artist": "GamingBolt", "page_rating_visits": 0, "user": null, "description": "Final Fantasy 7’s cast of characters is brimming with characters such as Tifa. A key character in the story of Final Fantasy 7 Remake, Tifa has consistently proven to be a highlight of the series time and again, and in 2020, she did so again when Final Fantasy 7 Remake came out. \n\nNow, she’s set to take the stage yet again with the imminent Final Fantasy 7 Rebirth. Ahead of the action RPG’s release, here, we’re going to talk about Tifa, her setting so far in the remake trilogy, and what the future might hold for her.", "thumbnail": "https://i4.ytimg.com/vi/KRGwcXyUvNw/hqdefault.jpg", "comments": [], "date_published": "2024-02-20T22:45:00+00:00", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 208, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "Final Fantasy 7 Rebirth - 8 NEW Details You Need To Know", "tags": [], "link": "https://www.youtube.com/watch?v=bD1YgNXcJsQ", "language": null, "page_rating_contents": 0, "album": "", "artist": "GamingBolt", "page_rating_visits": 0, "user": null, "description": "Ahead of Final Fantasy 7 Rebirth’s looming launch, with Sony looking to drive hype surrounding it through the roof, we recently got another extended look at the action RPG in a lengthy, dedicated State of Play presentation, and though there has certainly been no shortage of information on the game until now, plenty more of it was revealed. \n\nFrom the game’s open world and the plethora of activities that it will house to its demo, and much more, a host of new details have recently emerged on Final Fantasy 7 Rebirth. As such, as we continue to cross the days out on our calendars, here, we are going to dive into those fresh details.", "thumbnail": "https://i3.ytimg.com/vi/bD1YgNXcJsQ/hqdefault.jpg", "comments": [], "date_published": "2024-02-20T18:15:01+00:00", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 208, "vote": 0}, {"page_rating": 0, "bookmarked": false, "title": "What The Hell Happened To SKULL AND BONES?", "tags": [], "link": "https://www.youtube.com/watch?v=2b6HcwFoDuE", "language": null, "page_rating_contents": 0, "album": "", "artist": "GamingBolt", "page_rating_visits": 0, "user": null, "description": "You've probably heard that another potential live service failure has entered the market. Then you realize it's Skull and Bones and question whether it was cancelled.\n\nBut no, Skull and Bones is finally available after reportedly starting development in 2013, being announced in 2017 and facing multiple delays. Reviews are mixed - some appreciate the combat and presentation, but the live service elements, bugs, always-online nature, pointless story and repetitive gameplay are hard to ignore. \n\nSome feel it would have been better if priced lower and launched several years ago. Nevertheless, it's a disappointment despite the lack of expectations. The various ways it went wrong are extensive, but above all else, it showcases how the lack of a coherent vision can be a project's downfall, regardless of the amount of time or money devoted to it.", "thumbnail": "https://i3.ytimg.com/vi/2b6HcwFoDuE/hqdefault.jpg", "comments": [], "date_published": "2024-02-20T11:30:01+00:00", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_votes": 0, "permanent": false, "age": null, "dead": false, "source_obj__id": 208, "vote": 0}]