[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-18T20:30:03+00:00", "description": "After delivering a hardcore, traditional Souslike experience with its debut outing Ashen, indie studio A44’s sophomore release, Flintlock: The Siege of Dawn instead decides to craft a much more approachable experience than what this genre has traditionally been known for, and by and large, the results are impressive. \n\nThough Flintlock can be a little rough around the edges (especially in the technical department), it successfully skirts the line between offering a legitimate Soulslike experience and being accessible for newcomers. \n\nBeyond that, with solid combat, engaging progression mechanics, an excellent setting that boasts a strong visual aesthetic, and a unique and incredibly well implemented risk/reward mechanic in the Reputation system, Flintlock: The Siege of Dawn has plenty for fans of Soulslikes and action RPGs to like.", "id": 890534, "language": null, "link": "https://www.youtube.com/watch?v=cNrNttIKbPs", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/cNrNttIKbPs/hqdefault.jpg", "title": "Flintlock: The Siege of Dawn Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-18T15:30:15+00:00", "description": "Back in the PS3 era, Sucker Punch decided to move on from the stealthy Sly Cooper for pastures anew, and in the process ended up creating the inFamous franchise, a series that brought superhero and supervillain power fantasies to life in spectacular fashion over the course of multiple instalments. \n\nBut though inFamous was well liked, well reviewed, and commercially successful, it did not manage to survive past the early years of the PS4 era, with Sucker Punch instead moving on to Ghost of Tsushima. As excellent as Ghost of Tsushima was, inFamous is still a franchise that many dearly miss, so here, we’re going to talk about why it had to go away, and if it might ever come back.", "id": 888863, "language": null, "link": "https://www.youtube.com/watch?v=UFjH5VQNehA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/UFjH5VQNehA/hqdefault.jpg", "title": "Why Did Sony KILL inFamous?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-18T10:30:30+00:00", "description": "The completionists amongst you might strive to see everything a game has to offer – side quests, collectibles, achievements, plus the main campaign itself. Some of these games might be supremely addictive too, providing that sweet rush with every success. \n\nHowever, therein lies a problem with a lot of games; put simply, there are insurmountable roadblocks hampering that quest to 100%. Perhaps they’re too challenging; maybe there’s a significant number or objectives, many of which might be boring. Or maybe the time demands are too large; we simply don’t have 100s of hours to plough into a game. This feature highlights 15 such games, taking care to avoid entries that can’t be completed because of glitches or legacy achievements.\n\nThumbnail credit: Nexusmod user: 4Y4N", "id": 887372, "language": null, "link": "https://www.youtube.com/watch?v=t6NhJCJDn6E", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/t6NhJCJDn6E/hqdefault.jpg", "title": "15 MOST Addictive Games WE WILL NEVER COMPLETE", "user": null, "vote": 0}]