[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "10 MOST Disappointing Boss Fights of 2023", "description": "It's been a year of iconic encounters in video games, some meeting expectations and others surpassing them in sheer hype. However, not every boss lived up to their potential. Some faltered and fell when it mattered the most.\n\nThere are those who, despite their stature and design, couldn't match up in the actual fight, like DJ Cyber from Bomb Rush Cyberfunk. Then you have bosses like Fang from Sonic Superstars during Trip's Story or Zhang Rhang from Wo Long: Fallen Dynasty, who are just awful and frustrate more than challenge the player.\n\nWe've all been there, so it's time to reflect on the most disappointing boss fights in 2023 and wonder where they went wrong.\n\nThumbnail credit: Youtuber: MK Paul Rudd", "link": "https://www.youtube.com/watch?v=72esGc0JrNU", "date_published": "2023-12-26T15:30:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/72esGc0JrNU/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "The Last of Us Part 2 Remastered - 15 Things You NEED TO KNOW Before You Buy", "description": "Sony has been pretty consistent about bringing its PS4 titles to the PS5 in the early years of its life, and another one of those games is now also lined up for a current-gen launch. \n\nThe Last of Us Part 2 Remastered is set to launch on January 19, and though its visual and technical improvements don’t seem much to write home about (especially for a game that’s already as impressive as The Last of Us Part 2 still is), it’s still looking like a significantly expanded release of the action-adventure title, with new additions ranging from a roguelite mode to early development slices of levels that were cut from the final game and plenty more. \n\nHere, we’re taking a look at a few key details that you should know about the remaster.", "link": "https://www.youtube.com/watch?v=AyIwJjx-oFY", "date_published": "2023-12-26T09:30:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/AyIwJjx-oFY/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]