[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-14T17:30:04+00:00", "description": "Nomada Studio's Neva is its first game in nearly six years after the critical and commercial success of Gris. Unlike the latter, it's more action-focused with tougher platforming but retains the emotional core and narrative while telling a heartfelt new story.\n\nPlayers control Alba, who travels alongside Neva after a mysterious corruption causes tragedy. They journey through the land from Summer to Fall, Winter, and Spring, encountering new challenges and depending on each to survive. Neva grows throughout, gaining new abilities that alter how you approach different scenarios.\n\nCouple that with a stunning presentation that potentially surpasses even Gris and an incredible soundtrack by Berlinist, and you have one of the better platformers of the year. While Neva is on the short side, it's easy to recommend, whether you're a fan of Gris or seeking a heart-warming story about family and nature to get lost in.", "id": 1323186, "language": null, "link": "https://www.youtube.com/watch?v=LlGd3c_oT3A", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/LlGd3c_oT3A/hqdefault.jpg", "title": "Neva Review - A Beautiful Game You NEED TO Experience", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-14T15:30:04+00:00", "description": "In case you weren't aware, Silent Hill 2 remake is a success, both for Bloober Team, who many doubted could deliver on the project, and Konami, whose survival horror franchise has floundered for years. There are many things to like about it, from the incredible visuals and increased immersion to the presentation and sound design.\n\nHowever, one area that's received particular praise is Toluca Prison. It was a location in the original where protagonist James Sunderland had to retrieve three stone tablets and discover three items to create a handle to progress. Not only does the remake streamline this into something more believable, but it expands on it with terrifying results.\n\nIn many ways, it's a masterclass of horror, the sound and visuals adding to the stress and tension. In others, it's incredible environmental story-telling, packed with interesting puzzles and dangerous enemies. Regardless, it's perhaps one of the remake's best sections.", "id": 1322392, "language": null, "link": "https://www.youtube.com/watch?v=FUEh-epSHvU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/FUEh-epSHvU/hqdefault.jpg", "title": "Silent Hill 2 Remake's Toluca Prison Is A MASTERCLASS In Horror", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-14T13:30:35+00:00", "description": "A long-awaited sequel to singular 3D arena battler Budokai Tenkaichi is upon us. Dragon Ball: Sparking! ZERO is a thrilling, fast-paced fighting game, with superb animations lifted straight out of the anime series, and a colossal raft of characters from a broad range of Dragon Ball media. \n\nOf course, anime is popular, and Dragon Ball is amongst the most legendary manga created, but there are other reasons why loads of gamers are enraptured by Sparking! ZERO. \n\nFor starters, the specific brand of fighting Dragon Ball’s Saiyan warriors is tailor made for largescale 3D arenas. This video will discuss this and other reasons as to why millions of gamers love Dragon Ball: Sparking! ZERO.", "id": 1321375, "language": null, "link": "https://www.youtube.com/watch?v=u4k6Maq9oso", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/u4k6Maq9oso/hqdefault.jpg", "title": "Why Do MILLIONS OF GAMERS LOVE Dragon Ball: Sparking! Zero?", "vote": 0}]