[{"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T22:15:21.467028+00:00", "description": "An anonymous reader shared this report from the New York Times:\n\nBetween the time [construction worker Florencio] Rendon applied for the coding boot camp and the time he graduated, what Mr. Rendon imagined as a \"golden ticket\" to a better life had expired. About 135,000 start-up and tech industry workers were laid off from their jobs, according to one count. At the same time, new artificial intelligence tools like ChatGPT, an online chatbot from OpenAI, which could be used as coding assistants, were quickly becoming mainstream, and the outlook for coding jobs was shifting. Mr. Rendon says he didn't land a single interview. \n\nCoding boot camp graduates across the country are facing a similarly tough job market. In Philadelphia, Mal Durham, a lawyer who wanted to change careers, was about halfway through a part-time coding boot camp late last year when its organizers with the nonprofit Launchcode delivered disappointing news. \"They said: 'Here is what the hiring metrics look like. Thin", "id": 1578373, "language": null, "link": "https://news.slashdot.org/story/24/11/24/2159232/coding-boot-gamp-graduates-find-tough-prospects-in-an-ai-powered-world?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Coding Boot Gamp Graduates Find tough Prospects In an AI-Powered World", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T21:11:27.866631+00:00", "description": "Reddit's moderators drew some criticism after \"locking\" a discussion about C++ paper/proposal author Andrew Tomazos. The URL (in the post with the locked discussion) had led to a submission for Slashdot's queue of potential (but unpublished) stories, which nevertheless attracted 178 upvotes on Reddit and another 85 comments. That unpublished Slashdot submission was also submitted to Hacker News, where it drew another 38 upvotes but was also eventually flagged. \n\nBack on Reddit's C++ subreddit (which has 300,000 members), a \"direct appeal\" was submitted to the moderators to unlock Reddit's earlier discussion (drawing over 100 upvotes). But there's one problem with this drama, as Slashdot reader brantondaveperson pointed out. \"There appears to be no independent confirmation of this story anywhere. The only references to it are this Slashdot story, and a Reddit story. Neither cite sources or provide evidence.\" This drew a response from the person submitting the potential story to Slashd", "id": 1578119, "language": null, "link": "https://meta.slashdot.org/story/24/11/24/2055208/unpublished-slashdot-submission-dragged-into-reddit-drama-about-c-papers-title?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Unpublished Slashdot Submission Dragged Into Reddit Drama About C++ Paper's Title", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T18:56:07.519609+00:00", "description": "On November 24th, 1971 &mdash; 53 years ago today &mdash; a mysterious man jumped out of an airplane clutching $200,000 in ransom money. (He'd extorted it from the airline by claiming he had a bomb, and it's still \"the only unsolved case of air piracy in the history of commercial aviation,\" according to Wikipedia.) Will modern technology finally let us solve the case &mdash; or just turn it into a miniseries on Netflix? And have online researchers finally discovered the definitive clue? \n\nThe FBI vetted more than 800 suspects, according to the Wyoming news site Cowboy State Daily, but in 2016 announced they were suspending their active investigation. \n\nSo it's newsworthy that the FBI now appears to be investigating new evidence, according to an amateur D.B. Cooper researcher on YouTube: the discovery of what's believed to be D.B. Cooper's uniquely-modified parachute:\n\n\nRetired pilot, skydiver and YouTuber, Dan Gryder told Cowboy State Daily that he may have found the missing link aft", "id": 1577657, "language": null, "link": "https://yro.slashdot.org/story/24/11/24/1815217/is-there-new-evidence-in-the-db-cooper-case?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Is There New Evidence in the D.B. Cooper Case?", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T17:52:44.459892+00:00", "description": "The GitHub Secure Open Source Fund launched this week with an initial commitment of $1.25 million, reports TechCrunch, using \"capital from contributors including American Express, 1Password, Shopify, Stripe, and GitHub's own parent company Microsoft.\"\n\n\nGitHub briefly teased the new initiative at its annual GitHub Universe developer conference last month, but Tuesday it announced full details and formally opened the program for applicants, which will be reviewed \"on a rolling basis\" through the closing date of January 7, 2025, with programming and funding starting shortly after... \n\nTuesday's news builds on a number of previous GitHub initiatives designed to support project maintainers that work on key components of critical software, including GitHub Sponsors which landed in 2019 (and which is powering the new fund), but more directly the GitHub Accelerator program that launched its first cohort last year &mdash; the GitHub Secure Open Source Fund is essentially an extension of that", "id": 1577375, "language": null, "link": "https://news.slashdot.org/story/24/11/24/0414244/github-announces-new-open-source-fund-with-security-mentoring?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "GitHub Announces New Open Source Fund with Security Mentoring", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T17:52:44.235524+00:00", "description": "Back in the mid-1980s Mark Roth was in 5th grade when the game ChipWits \"helped kindle his interest in coding,\" according to an online biography. (\"By middle school, he wrote his first Commodore 64 assembler and by high school he authored a 3D Graphics library for DOS.\") \n\nAnd 40 years later, Slashdot reader markroth8 writes that the programming puzzle/logic game \"inspired many people to become professional coders\":\n\nChipWits was first released for Mac in 1984, and was later ported to Commodore 64 and Apple II in 1985. To celebrate the game's 40th anniversary, the team behind the new Steam reboot of ChipWits (including its original co-creator Doug Sharp, also of fame for the game King of Chicago) is announcing the recovery and open source release of the original game's source code, written in the FORTH programming language, for both Mac and Commodore 64 platforms. \n\nRecovering data from 40-year old 5.25\" and 3.5\" disks was a challenge in and of itself, and most of the data survived u", "id": 1577374, "language": null, "link": "https://news.slashdot.org/story/24/11/24/019242/macforth-code-for-1984-robot-coding-game-chipwits-from-1984-is-now-open-source?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "MacFORTH Code for 1984 Robot-Coding Game 'ChipWits' from 1984 is Now Open Source", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T16:25:59.113367+00:00", "description": "America's Justice Department \"has ordered all consensual searches by drug enforcement agents conducted at the nation's airports stopped,\" reports Georgia's local TV station Atlanta News First &mdash; after their series of investigations \"uncovered how the agents often search innocent passengers at airport gates, looking for cash.\"\n\n\nOn Thursday, the department made public a November 12, 2024, directive from the deputy attorney general to the U.S. Drug Enforcement Administration (DEA) that it suspend \"all consensual encounters at mass transportation facilities unless they are either connected to an ongoing, predicated investigation involving one or more identified targets or criminal networks or approved by the DEA Administrator based on exigent circumstances.\" The management advisory memorandum was issued by DOJ Inspector General Michael Horowitz. \n\nThe memo specifically mentioned the case of an airline passenger interviewed by Atlanta News First Chief Investigator Brendan Keefe, aut", "id": 1577077, "language": null, "link": "https://yro.slashdot.org/story/24/11/24/0310249/americas-dea-ordered-to-stop-searching-random-travellers-at-airports---and-seizing-their-cash?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "America's DEA Ordered to Stop Searching Random Travellers at Airports - and Seizing Their Cash", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T13:11:15.489568+00:00", "description": "\"Scientists have found what seems to be the oldest direct evidence of hot water flowing on Mars during its ancient past,\" reports Space.com. \n\n\"The discovery could further indicate that the Red Planet, despite its arid and desolate appearance today, may have been capable of supporting life long ago.\"\n\nThe evidence was delivered to Earth and sealed within the well-known Martian meteorite NWA7034, found in the Sahara Desert in 2011. Due to its black, highly polished appearance, the Martian rock is also known as \"Black Beauty.\" At an estimated 2 billion years old, Black Beauty is the second oldest Martian meteorite ever discovered. However, the Curtin University team discovered something even older within it: a 4.45 billion-year-old zircon grain that harbors the fingerprints of fluids rich in water. \n\nTeam member Aaron Cavosie from Curtin's School of Earth and Planetary Sciences thinks this discovery will open up new avenues to understanding hydrothermal systems associated with the acti", "id": 1576273, "language": null, "link": "https://science.slashdot.org/story/24/11/24/0337254/mars-meteorite-reveals-new-evidence-that-hot-water-flowed-on-ancient-mars?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Mars Meteorite Reveals New Evidence That Hot Water Flowed on Ancient Mars", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T08:51:06.768326+00:00", "description": "Slashdot reader Bruce66423 shared this report from the Guardian:\n\n\nStaff have resigned at Starling Bank after its new chief executive demanded thousands of workers attend its offices more frequently, despite lacking enough space to host them. \n\nIn his first major policy change since taking over from the UK digital bank's founder, Anne Boden, in March, Raman Bhatia has ordered all hybrid staff &mdash; many of whom were in the office only one or two days a week, or on an ad-hoc basis &mdash; to travel to work for a minimum of 10 days each month. But the bank, which operates online only, admitted that some of its offices would not be equipped to handle the influx... \"We are considering ways in which we can create more space,\" an email sent by Starling's human resources team and seen by the Guardian said. \n\nStarling has 3,231 staff, the vast majority of whom are in the UK with some also in Dublin. However, the Guardian understands that the bank has only about 900 desks, including 260 at ", "id": 1575422, "language": null, "link": "https://it.slashdot.org/story/24/11/24/0241229/bank-employees-resign-after-executive-demands-return-to-offices-without-space-for-everyone?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Bank Employees Resign After Executive Demands Return to Offices Without Space for Everyone", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T06:40:57.324994+00:00", "description": "NBC News reports that a newly identified chemical byproduct \"may be present in drinking water in about a third of U.S. homes, a study found.\" \n\n\"Scientists do not yet know whether the byproduct is dangerous. But some are worried that it could have toxic properties because of similarities to other chemicals of concern.\"\n\nThe newly identified substance, named \"chloronitramide anion,\" is produced when water is treated with chloramine, a chemical formed by mixing chlorine and ammonia. Chloramine is often used to kill viruses and bacteria in municipal water treatment systems. Researchers said the existence of the byproduct was discovered about 40 years ago, but it was only identified now because analysis techniques have improved, which finally enabled scientists to determine the chemical's structure. \nIt could take years to figure out whether chloronitramide anion is dangerous &mdash; it's never been studied. The researchers reported their findings Thursday in the journal Science, in part", "id": 1575079, "language": null, "link": "https://science.slashdot.org/story/24/11/24/0019202/potentially-toxic-chemical-byproduct-may-be-present-in-13-of-us-drinking-water?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'Potentially Toxic' Chemical Byproduct May Be Present in 1/3 of US Drinking Water", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T03:26:18.269899+00:00", "description": "The Rust community has \"recognized the unsafety of Rust (if used incorrectly),\" according to a blog post by Amazon Web Services. \nSo now AWS and the Rust Foundation are \"crowdsourcing an effort to verify the Rust standard library,\" according to an article at DevClass.com, \"by setting out a series of challenges for devs and offering financial rewards for solutions...\"\n\nRust includes ways to bypass its safety guarantees though, with the use of the \"unsafe\" keyword... The issue AWS highlights is that even if developers use only safe code, most applications still depend on the Rust standard library. AWS states that there are approximately 7.5K unsafe functions in the Rust Standard Library and notes that 57 \"soundness issues\" and 20 CVEs (Common Vulnerabilities and Exposures) have been reported in the last three years. [28% of the soundness issues were discovered in 2024.] \n\nMarking a function as unsafe does not mean it is vulnerable, only that Rust does not guarantee its safety. AWS plan", "id": 1574692, "language": null, "link": "https://developers.slashdot.org/story/24/11/23/2327203/verify-the-rusts-standard-librarys-7500-unsafe-functions---and-win-financial-rewards?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Verify the Rust's Standard Library's 7,500 Unsafe Functions - and Win 'Financial Rewards'", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-24T00:11:33.104936+00:00", "description": "Microsoft-owned GitHub published a blog post asking \"Does GitHub Copilot improve code quality? Here's what the data says.\" \n\nIts first paragraph includes statistics from past studies &mdash; that GitHub Copilot has helped developers code up to 55% faster, leaving 88% of developers feeling more \"in the flow\" and 85% feeling more confident in their code. \nBut does it improve code quality?\n\n[W]e recruited 202 [Python] developers with at least five years of experience. Half were randomly assigned GitHub Copilot access and the other half were instructed not to use any AI tools... We then evaluated the code with unit tests and with an expert review conducted by developers. \nOur findings overall show that code authored with GitHub Copilot has increased functionality and improved readability, is of better quality, and receives higher approval rates... Developers with GitHub Copilot access had a 56% greater likelihood of passing all 10 unit tests in the study, indicating that GitHub Copilot h", "id": 1574251, "language": null, "link": "https://developers.slashdot.org/story/24/11/23/1855203/does-github-copilot-improve-code-quality?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Does GitHub Copilot Improve Code Quality?", "vote": 0}]