[{"age": null, "album": "", "author": "GamingBolt", "bookmarked": false, "comments": [], "date_published": "2024-11-24T15:30:02+00:00", "description": "Console gaming goes a long way back, but PC gaming laid the groundwork. Throughout the years, we've seen more and more innovative titles, whether it's Half-Life injecting narrative into a first-person shooter, StarCraft introducing three different playable races, or Minecraft with its sandbox crafting.\n\nEven in recent years, there have been several excellent games pushing the boundaries of gaming, like the rogue-lite city builder Against the Storm or UFO 50 and its compilation of 50 games with extensive replay value. Of course, you can't forget about console titles, which perform better on PC, like Horizon Forbidden West, and Red Dead Redemption 2, elevating their experiences higher than thought possible.\n\nSelecting the 30 best PC titles of all time is daunting, given the embarrassment of riches. Nevertheless, check out our picks for the absolute creme of the crop as of 2024.", "id": 1577098, "language": null, "link": "https://www.youtube.com/watch?v=8wsHtKp2RF4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/8wsHtKp2RF4/hqdefault.jpg", "title": "30 Best PC Games of All Time You Definitely NEED TO PLAY [2024 Edition]", "vote": 0}, {"age": null, "album": "", "author": "GamingBolt", "bookmarked": false, "comments": [], "date_published": "2024-11-24T10:30:21+00:00", "description": "Audiences love nothing more than being taken by surprise- as long as the surprises are pleasant ones, of course. And thankfully, games and game developers have figured out many different ways to effectively do just that over the years, whether that’s by taking unexpected narrative turns, by delivering gameplay experiences unlike anything else out there, or by simply turning out to be far, far better than almost anyone could have expected. \n\nFrom games that developed entire genres or subgenres to modern classics that set new standards for the entire industry at large to follow, there are certain instances of games doing just that that stand out in memory, and here, we are going to discuss a few of them.", "id": 1575826, "language": null, "link": "https://www.youtube.com/watch?v=p__ExYcCrHo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/p__ExYcCrHo/hqdefault.jpg", "title": "15 Single Player Games That SURPRISED GAMERS", "vote": 0}]