[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 Most UNDERRATED XBOX GAMES You Should Definitely Give A Chance", "description": "Microsoft’s presence in the console market hasn’t been the strongest for quite some time now, but the Xbox brand has managed to survive through generations thanks to strong third-party support and certain first-party IPs like Halo, Gears of War, and Forza. \n\nThe majority of discussions around the best games on Xbox seem to be limited the above mentioned series , and that’s a shame because there are just so many unrecognized and under appreciated games on the platform that never really got the love and attention they deserve. \n\nWith this video, we will be turning the pages of history for the Xbox brand and counting down 15 of the most underrated Xbox games of all time - right from its humble beginnings to the glory days of Xbox 360 to recent times and everything in between.", "link": "https://www.youtube.com/watch?v=z1exufTlIVM", "date_published": "2023-12-25T15:30:12+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/z1exufTlIVM/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "19 Best Single Player Games of 2023 YOU NEED TO PLAY", "description": "Regardless of which genres you generally lean towards, or which platforms you prefer to play your games on, or whether you like smaller and focused experiences or behemoths that you can sink hundreds of hours into, chances are that you had more than enough to keep you hooked and occupied throughout the course of 2023. \n\nIn particular, fans of single player experiences had a steady stream of stellar games to dive into throughout the year, from beginning to end, and though picking out just a few of them as the ones that stand out in memory the most is no easy task, that’s exactly what we’re here to do. \n\nIn this video, we talk about some of our favorite 2023 single player games.", "link": "https://www.youtube.com/watch?v=08wlnFqeDGU", "date_published": "2023-12-25T09:30:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/08wlnFqeDGU/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]