[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-19T15:30:31+00:00",
        "description": "After last year's sheer onslaught of incredible titles across multiple genres, 2024 may look underwhelming in comparison. It also doesn't help that some of the biggest releases were live service titles like Suicide Squad: Kill the Justice League or Skull and Bones, to say nothing of Concord and its two-week lifespan.\n\nFortunately, those seeking compelling single-player titles don't have to look far. 2024 surprisingly delivered with four excellent first-party titles for Xbox Series X/S while delivering some decent PS5 exclusives as well. May publishers continued to astonish with their IPs; Black Myth: Wukong finally launched after years of hype to massive success, and Satisfactory exited early access to universal acclaim.\n\nThat doesn't even account for Elden Ring's Shadow of the Erdtree, which is also very good. There's plenty more where that came from, so without further ado, check out the 20 best single-player titles of 2024 that you must play.",
        "id": 1744029,
        "language": null,
        "link": "https://www.youtube.com/watch?v=zgyOE7RixpI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/zgyOE7RixpI/hqdefault.jpg",
        "title": "20 STUNNING Single Player Games of 2024 That Prove Solo Experiences Are Still King",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-19T06:30:07+00:00",
        "description": "When you enter a new year full of video game releases, there's always some hope that the majority will deliver on the hype and promise. 2024 is a somewhat different case - titles like Suicide Squad: Kill the Justice League and Skull and Bones had the odds stacked against them. Lo and behold, they both failed.\n\nHowever, we would have never guessed at every disappointment from this year. There's XDefiant, which had an average start but is confirmed to shut down in June 2025. MultiVersus re-emerged from its beta into a full game and somehow ended far worse. Concord is Sony's biggest first-party failure in the past several years, reportedly selling only 25,000 copies and even Dragon Age: The Veilguard didn't quite meet expectations.\n\nThese are but a few of the underwhelming releases from the year that was. Check out our picks for the 15 most disappointing games of 2024 here.",
        "id": 1740825,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Glbabl9TiBA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Glbabl9TiBA/hqdefault.jpg",
        "title": "15 Most Disappointing Games of 2024 That BROKE GAMERS' HEARTS",
        "vote": 0
    }
]