[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-19T23:51:11+00:00",
        "description": "<p>Zack Rosenblatt, Dianna Russini, and Michael Silver have written a devastating profile of the most dysfunctional franchise in all of U.S. pro sports, the New York Jets, whose dysfunction has a clear and obvious root cause: meddling idiot owner Woody Johnson (heir to the Johnson &amp; Johnson pharmaceutical fortune). One example:</p>\n\n<blockquote>\n  <p>A few weeks later, Douglas and his Broncos counterpart, George\nPaton, were deep in negotiations for a trade that would have sent\nJeudy to the Jets and given future Hall of Fame quarterback Aaron\nRodgers another potential playmaker. The Broncos felt a deal was\nnear. Then, abruptly, it all fell apart. In Denver’s executive\noffices, they couldn’t believe the reason why.</p>\n\n<p>Douglas told the Broncos that Johnson didn’t want to make the\ntrade because the owner felt Jeudy’s player rating in “Madden\nNFL,” the popular video game, wasn’t high enough, according to\nmultiple league sources. The Broncos ultimately traded the\nreceiver to the C",
        "id": 1747099,
        "language": null,
        "link": "https://www.nytimes.com/athletic/6005172/2024/12/19/woody-johnson-jets-madden-sons",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Woody Johnson’s New York Jets",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-19T03:27:53+00:00",
        "description": "<p>Joe Otterson, reporting for Variety:</p>\n\n<blockquote>\n  <p>“Silo” has been renewed for both Seasons 3 and 4 at Apple TV+,\nwith the fourth season set to be the show’s last.</p>\n\n<p>The renewal news comes as the post-apocalyptic drama is currently\nairing its second season. The sixth episode of Season 2 is due out\non Dec. 20. The season finale is scheduled to debut on Jan. 17.</p>\n</blockquote>\n\n<p>I feel bad complaining about a good show not only getting renewed, but renewed through to a planned conclusion. I fucking hate <a href=\"https://daringfireball.net/linked/2023/08/19/amazon-peripheral-season-2\">when good shows get cancelled after one season</a>.</p>\n\n<p>But. While I really liked season 1 of <em>Silo</em>, season 2 has been a bore. We’re halfway through — five episodes — and everything interesting could have been put in one episode. Maybe one and half. I hope the remaining five episodes of season 2 pick up, but so far, it really feels like this entire season has just padding",
        "id": 1740258,
        "language": null,
        "link": "https://variety.com/2024/tv/news/silo-renewed-season-3-ending-season-4-1236249072",
        "manual_status_code": 0,
        "page_rating": 29,
        "page_rating_contents": 90,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 489,
        "source_url": "https://daringfireball.com/feeds/main",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "‘Silo’ Renewed for Two Additional Seasons",
        "vote": 0
    }
]