[{"page_rating_votes": 0, "tags": [], "vote": 0, "page_rating_contents": 0, "user": null, "artist": "GamingBolt", "description": "2023 saw numerous new and notable entries in the racing game sphere; The Crew Motorsport made worthy efforts to replicate Forza Horizon’s open world blueprint, whilst Forza Motorsport, despite its understandable detractors, was an excellent entry in the sim racing franchise. \n\nRacing games upcoming in 2024 and beyond look to continue the genre’s good run, with esteemed franchises returning alongside a slew of intriguing, more unique motorsport offerings. \n\nAs ever there’s plenty of simulation and casual arcade-style racers on the horizon, but 2024 even brings a battle royale kart racer, a faithful homage to an iconic mainstay of arcades worldwide. This year, arguably more than ever, there’s a racing game for everyone to enjoy.", "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "comments": [], "title": "15 NEW Racing Games of 2024 And Beyond [PS5, Xbox Series X | S, PC]", "link": "https://www.youtube.com/watch?v=OvH42i_xRb8", "page_rating_visits": 0, "album": "", "language": null, "thumbnail": "https://i4.ytimg.com/vi/OvH42i_xRb8/hqdefault.jpg", "age": null, "date_published": "2024-01-27T15:30:10+00:00", "source_obj__id": 208, "bookmarked": false, "page_rating": 0, "dead": false}, {"page_rating_votes": 0, "tags": [], "vote": 0, "page_rating_contents": 0, "user": null, "artist": "GamingBolt", "description": "After last year went down as arguably one of the best in recent memory for video games, 2024 has a lot to live up to. Thankfully, there’s a slew of fantastic looking releases firmly planted on the horizon, from Final Fantasy VII Rebirth and Like a Dragon: Infinite Wealth, to Tekken 8 and Senua’s Saga: Hellblade II. \n\nThing is, there’s still a significant number of titles with release windows we’re not so sure of. The games on this rundown are expected to release this year, barring any unforeseen delays, but none have firm release dates to put in our calendars, which is strange given their magnitude. Here’s hoping we won’t be waiting too long until we find out exactly when we can get our hands on these exceptional looking titles.", "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "comments": [], "title": "15 BIG Games of 2024 That Still Don't Have Firm Release Dates", "link": "https://www.youtube.com/watch?v=r49mrQATVRw", "page_rating_visits": 0, "album": "", "language": null, "thumbnail": "https://i3.ytimg.com/vi/r49mrQATVRw/hqdefault.jpg", "age": null, "date_published": "2024-01-27T10:00:39+00:00", "source_obj__id": 208, "bookmarked": false, "page_rating": 0, "dead": false}]