[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "permanent": false, "page_rating_contents": 0, "user": null, "dead": false, "source_obj__id": 208, "artist": "GamingBolt", "tags": [], "page_rating_visits": 0, "page_rating_votes": 0, "page_rating": 0, "bookmarked": false, "album": "", "title": "Sons of the Forest 1.0 Release - WHAT'S NEW?", "comments": [], "language": null, "date_published": "2024-01-28T14:30:08+00:00", "description": "Endnight Games' Sons of the Forest launched in early access last year to exceptional success, selling over two million copies in the first 24 hours. It had several issues but received multiple updates since then, adding new features, polishing performance and expanding on the story.\n\nWith Version 1.0 arriving on February 22nd, adding actor Shawn Ashmore to play a central character, it's time to reflect on all the changes and new content made over the past year. What new structures are available to build? Were there any enemies or bosses? Did companions like Kelvin receive updates? How much crazier did the game get?\n\nCheck out some of the changes to Sons of the Forest from early access to now as we prepare for Version 1.0's launch.", "link": "https://www.youtube.com/watch?v=Uf_YlNRZl3Y", "thumbnail": "https://i2.ytimg.com/vi/Uf_YlNRZl3Y/hqdefault.jpg", "age": null, "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "permanent": false, "page_rating_contents": 0, "user": null, "dead": false, "source_obj__id": 208, "artist": "GamingBolt", "tags": [], "page_rating_visits": 0, "page_rating_votes": 0, "page_rating": 0, "bookmarked": false, "album": "", "title": "16 BEST VR Games of All Time You Need to Play [2024 Edition]", "comments": [], "language": null, "date_published": "2024-01-28T09:30:08+00:00", "description": "Despite initial skepticism and plenty of naysayers, the VR platform has proven not to be a passing fad but instead continues to thrive at a rapid pace. \n\nOver the last few years, we have had the opportunity to experience some great VR games that make good use of the platform’s immersive capabilities that seat us in the wondrous worlds. These games include but are not limited to Horizon Call of the Mountain and Half-Life: Alyx among others. \n\nWith this feature, we will be taking a look back at the history of VR games and count down 16 of the best VR games of all time - ranging from excellent VR modes in popular AAA games to dedicated VR adventures and much more.", "link": "https://www.youtube.com/watch?v=Wcif0NpSbCo", "thumbnail": "https://i4.ytimg.com/vi/Wcif0NpSbCo/hqdefault.jpg", "age": null, "vote": 0}]