[{"title": "Exclusive cover reveal for Clay Harmon’s Into the Rift", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://www.grimdarkmagazine.com/feed", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T22:36:15+00:00", "language": "en-AU", "artist": null, "comments": [], "source_obj__id": 571, "link": "https://www.grimdarkmagazine.com/exclusive-cover-reveal-for-clay-harmons-into-the-rift", "bookmarked": false, "page_rating_visits": 0, "description": "<p>Last Updated on February 23, 2024 With Into the Rift, book two in Clay Harmon&#8217;s The Rift Walker series, only months away releasing on July 2nd 2024, we are ramping up our excitement for its release. Our reviewer loved Flames of Mira, saying: With a cool magic system, interesting world, and morally grey characters plagued by tough decisions, it is a story that fans of grimdark will devour. You can read our full review here, but for now, keep scrolling because it&#8217;s time to get a little bit into what the book is about, and then get into this gorgeous cover art by Larry Rostat. About Into the Rift A fantasy world like no other. A unique magic system. Into the Rift takes us back to the thrilling story begun in Flames of Mira, and continues the tale of Jakar. After defeating the mercenary army that threatened his home, Jakar sets out with Efadora – the only person left with the power to bind him – across the Rift. He hunts the cultists who enslaved him, intent on end"}, {"title": "REVIEW: Candle Children by M.J. Baker", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://www.grimdarkmagazine.com/feed", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T04:25:47+00:00", "language": "en-AU", "artist": null, "comments": [], "source_obj__id": 571, "link": "https://www.grimdarkmagazine.com/review-candle-children-by-m-j-baker", "bookmarked": false, "page_rating_visits": 0, "description": "<p>Gangs of orphaned children provide flickers of light amidst the dark world of Candle Children, M.J. Baker’s bleak paranormal fantasy. The largest of these gangs, the Candle Children, is led by Beth Lansdown, a blind girl with a special connection to the spiritual world. Candle Children has a distinct Dickensian air with its cast of destitute orphans and plenty of ghosts and spirits. What’s the difference? “A ghost is the soul of someone from this world originally. A spirit comes from another world. Apart from that, the difference is a little blurred.” The children know ancient songs that can help placate the spirits, keeping them at bay. However, the Emperor seeks to leverage the children’s influence over the paranormal to weaponize the spirits toward his own ends. “Never trust a man who feels the need to convince the world that he’s brave.” The Emperor is also bigoted against the children since a high fraction of them are tainted as Orcbloods. Although only about five per"}]