[{"title": "Bluesky Now Open To Federation", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T23:40:39.237124+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://tech.slashdot.org/story/24/02/22/2133228/bluesky-now-open-to-federation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "Longtime Slashdot reader Rei writes: In a blog post today, Bluesky, the social media network founded by Jay Graber, announced that they have finally opened to federation. Users can now operate their own PDS (backend) servers. How to do so is discussed on the developers' blog and a new Discord channel for PDS administrators.\n \nAs the blog notes, there are key differences between the AT Protocol/Bluesky federation and ActivityPub/Mastodon federation, including: global conversation (rather than local-server based with remote content only brought in from follows); a decentralized user account not bound to a specific host; user-composable moderation lists not inherently tied to a specific server, offsetting the need for defederation; user-composable feeds/algorithms, not tied to servers; and full account portability, without the need to be initiated by your server, protecting users from rogue admins or servers that disappear.\n \nDespite the difference, a number of projects, such as"}, {"title": "The Justice Department Gets a Chief AI Officer", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T23:40:37.750276+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://slashdot.org/story/24/02/22/2138227/the-justice-department-gets-a-chief-ai-officer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "Princeton professor and technology law researcher Jonathan Mayer has been appointed as the Justice Department's first chief AI officer. The Verge reports: Attorney General Merrick Garland said in a statement that appointing an AI officer was important for the department to \"keep pace with rapidly evolving scientific and technological developments.\" One of Mayer's responsibilities will be to build a team of technical and policy experts around cybersecurity and AI. Mayer will also serve as the department's chief science and technology advisor and help recruit tech talent.\n \nMayer held technology roles in government before his new Justice Department gig, according to his bio in Princeton's Center for Information Technology Policy. He served as an adviser on technology law and policy to Vice President Kamala Harris when she was still in the Senate. Mayer was also the chief technologist in the enforcement office of the Federal Communications Commission.<p><div class=\"share_submiss"}, {"title": "Reddit in AI Content Licensing Deal With Google", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T22:35:21.999305+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://tech.slashdot.org/story/24/02/22/1757233/reddit-in-ai-content-licensing-deal-with-google?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "Social media platform Reddit has struck a deal with Google to make its content available for training the search engine giant's AI models. Reuters: The contract with Alphabet-owned Google is worth about $60 million per year, according to one of the sources. The deal underscores how Reddit, which is preparing for a high-profile stock market launch, is seeking to generate new revenue amid fierce competition for advertising dollars from the likes of TikTok and Meta Platform's Facebook.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Reddit+in+AI+Content+Licensing+Deal+With+Google%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F02%2F22%2F1757233%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F02%2F22%2F1757233%2Freddit-in-ai-content-licensing-deal-with-google%3Futm"}, {"title": "FTC To Ban Avast From Selling Browsing Data For Advertising Purposes", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T22:35:20.466165+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://news.slashdot.org/story/24/02/22/183247/ftc-to-ban-avast-from-selling-browsing-data-for-advertising-purposes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "The U.S. FTC will order Avast to pay $16.5 million and ban the company from selling the users' web browsing data or licensing it for advertising purposes. From a report: The complaint says Avast violated millions of consumers' rights by collecting, storing, and selling their browsing data without their knowledge and consent while misleading them that the products used to harvest their data would block online tracking. \"While the FTC's privacy lawsuits routinely take on firms that misrepresent their data practices, Avast's decision to expressly market its products as safeguarding people's browsing records and protecting data from tracking only to then sell those records is especially galling,\" said FTC Chair Lina M. Khan. \n\n\"Moreover, the volume of data Avast released is staggering: the complaint alleges that by 2020 Jumpshot had amassed \"more than eight petabytes of browsing information dating back to 2014.\" More specifically, the FTC says UK-based company Avast Limited harve"}, {"title": "GPay App and P2P Payments Will Stop Working in the US This June", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T22:35:18.535223+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://news.slashdot.org/story/24/02/22/188224/gpay-app-and-p2p-payments-will-stop-working-in-the-us-this-june?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "An anonymous reader shares a report: When Google Wallet launched in 2022, Google kept the \"GPay\" app around in a handful of countries. The company announced today that the old Google Pay app is soon going away in the US. That app, which appears as \"GPay\" on your Android homescreen, was Google's previous vision for mobile payments and finance. \n\nIt was \"designed around your relationships with people and businesses\" with conversation-like threads serving as a purchase history, while keeping track of your spending was another big aspect. GPay will stop working in the US from June 4, 2024. It will remain available for users in India and Singapore as Google continues to \"build for the unique needs in those countries.\" As part of the app going away, Google is shutting down peer-to-peer payments that let you send, request, or receive money from others in the US. Google's P2P offering never really took off.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com"}, {"title": "Supreme Court Seems Skeptical of EPA's 'Good Neighbor' Rule on Power Plant Pollution", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T22:35:16.894155+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://news.slashdot.org/story/24/02/22/1832218/supreme-court-seems-skeptical-of-epas-good-neighbor-rule-on-power-plant-pollution?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "The Supreme Court's conservative majority seemed skeptical Wednesday as the Environmental Protection Agency sought to continue enforcing an anti-air-pollution rule in 11 states while separate legal challenges proceed around the country. From a report: The EPA's \"good neighbor\" rule is intended to restrict smokestack emissions from power plants and other industrial sources that burden downwind areas with smog-causing pollution. Three energy-producing states -- Ohio, Indiana and West Virginia -- challenged the rule, along with the steel industry and other groups, calling it costly and ineffective. The rule is on hold in a dozen states because of the court challenges. \n\nThe Supreme Court, with a 6-3 conservative majority, has increasingly reined in the powers of federal agencies, including the EPA, in recent years. The justices have restricted EPA's authority to fight air and water pollution -- including a landmark 2022 ruling that limited EPA's authority to regulate carbon diox"}, {"title": "Can Any English Word Be Turned Into a Synonym For 'Drunk'? Not All, But Many Can.", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T22:35:15.330150+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://slashdot.org/story/24/02/22/1851240/can-any-english-word-be-turned-into-a-synonym-for-drunk-not-all-but-many-can?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "An anonymous reader shares a report: British comedian Michael McIntyre has a standard bit in his standup routines concerning the many (many!) slang terms posh British people use to describe being drunk. These include \"wellied,\" \"trousered,\" and \"ratarsed,\" to name a few. McIntyre's bit rests on his assertion that pretty much any English word can be modified into a so-called \"drunkonym,\" bolstered by a few handy examples: \"I was utterly gazeboed,\" or \"I am going to get totally and utterly carparked.\" \n\nIt's a clever riff that sparked the interest of two German linguists. Christina Sanchez-Stockhammer of Chemnitz University of Technology and Peter Uhrig of FAU Erlangen-Nuremberg decided to draw on their expertise to test McIntyre's claim that any word in the English language could be modified to mean \"being in a state of high inebriation.\" Given their prevalence, \"It is highly surprising that drunkonyms are still under-researched from a linguistic perspective,\" the authors wrot"}, {"title": "AT&amp;T Restores Service After Massive, Nationwide Outage", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T22:35:13.638078+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://mobile.slashdot.org/story/24/02/22/2127240/att-restores-service-after-massive-nationwide-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "An anonymous reader quotes a report from CNN Business: AT&amp;T's network went down for many of its customers across the United States Thursday morning, leaving customers unable to place calls, text or access the internet. By a little after 3 pm ET, roughly 11 hours after reports of the outage first emerged, the company said that it had restored service to all impacted customers. \"We have restored wireless service to all our affected customers. We sincerely apologize to them,\" AT&amp;T said in a statement. The company added that it is \"taking steps to ensure our customers do not experience this again in the future.\"\n \nThe Federal Communications Commission confirmed Thursday afternoon that it is investigating the outage. The White House says federal agencies are in touch with AT&amp;T about network outages but that it doesn't have all the answers yet on what exactly led to the interruptions. Although Verizon and T-Mobile customers reported some network outages, too, they appea"}, {"title": "Instacart's AI Recipes Look Literally Impossible", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T18:58:25.980292+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://tech.slashdot.org/story/24/02/22/1410215/instacarts-ai-recipes-look-literally-impossible?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "An anonymous reader shares a report: I hate cookbooks without pictures. We eat with our eyes first, as chefs love to say, but what's more important to me is that if I'm making a dish for the first time, I want to see what the final product should look like to know I did it right. It's not so much about presentation as it is about knowing that I browned the chicken skin enough. An image of a recipe will not be this useful, I think, if it was AI-generated, and especially so if the fact that the image was AI-generated wasn't disclosed by the recipe. That, to my surprise, is exactly the case with thousands of recipes the grocery delivery service Instacart is suggesting to its users. Some of the recipes include unheard of measurements and ingredients that don't appear to exist. \n\n[...] As I was browsing, I noticed that Instacart was offering me recipes that appeared to complement the ingredients I was looking at. The concept doesn't make a ton of sense to me -- I'm going to Instac"}, {"title": "Windows 11 Users Herded Toward 23H2 Via Automatic Upgrade", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T17:50:30.505317+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://tech.slashdot.org/story/24/02/22/1445220/windows-11-users-herded-toward-23h2-via-automatic-upgrade?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "Windows 11 users still clinging to the past are to be dragged into a bright, 23H2-shaped future by Microsoft, whether they want to or not. From a report: Microsoft has added a notification to its Release Health dashboard warning Windows 11 users that it is time for the beatings automatic upgrades to begin. \"We are starting to update eligible Windows 11 devices automatically to version 23H2.\" \n\nAs for what eligible means, according to Microsoft, this is \"Windows 11 devices that have reached or are approaching end of servicing.\" Support for Windows 11 21H2 came to an end last year on October 10, 2023, and version 22H2 is due to end on October 8, 2024. Win 11 23H2 itself will endure until November 11, 2025, or just after the plug gets pulled on Windows 10. The update comes shortly after Microsoft quashed the last of its compatibility holds in Windows 11 23H2, which affected customers attempting to use the Co-pilot preview with multiple monitors. Icons tended to move unexpectedly"}, {"title": "Varda Space, Rocket Lab Nail First-of-Its-Kind Spacecraft Landing in Utah", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T16:44:42.860165+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://science.slashdot.org/story/24/02/22/1545243/varda-space-rocket-lab-nail-first-of-its-kind-spacecraft-landing-in-utah?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "A spacecraft containing pharmaceutical drugs that were grown on orbit has finally returned to Earth today after more than eight months in space. From a report: Varda Space Industries' in-space manufacturing capsule, called Winnebago-1, landed in the Utah desert at around 4:40 p.m. EST. Inside the capsule are crystals of the drug ritonavir, which is used to treat HIV/AIDS. It marks a successful conclusion of Varda's first experimental mission to grow pharmaceuticals on orbit, as well as the first time a commercial company has landed a spacecraft on U.S. soil, ever. The capsule will now be sent back to Varda's facilities in Los Angeles for analysis, and the vials of ritonavir will be shipped to a research company called Improved Pharma for post-flight characterization, Varda said in a statement. The company will also be sharing all the data collected through the mission with the Air Force and NASA, per existing agreements with those agencies. \n\nThe first-of-its-kind reentry and"}, {"title": "Amazon Says 'No Changes' Coming To Freevee Despite Reports of the Streamer Shuttering", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T16:44:41.251768+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://entertainment.slashdot.org/story/24/02/22/1440244/amazon-says-no-changes-coming-to-freevee-despite-reports-of-the-streamer-shuttering?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "Amazon is pushing back against reports that its Freevee service is shuttering. The Wrap: AdWeek reported the news, which it said is part of an effort by the tech giant to shift its focus to Prime Video. Sources familiar with the matter told the outlet that sunsetting Freevee could happen sometime within the second quarter. However, a spokesperson for Amazon said there are \"no changes\" coming to Freevee. \n\n\"Amazon Freevee remains an important streaming offering providing both Prime and non-Prime customers thousands of hit movies, shows and originals, all for free,\" they added. Freevee, which was formerly known as IMDb TV until a rebrand in 2022, offers thousands of premium movies and TV shows, including originals such as \"Bosch: Legacy,\" \"Judy Justice\" and \"Jury Duty\" and over 150 free ad-supported streaming TV (FAST) channels.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Says+'No+Changes'+Coming+To+Freevee+Despite+Reports+of"}, {"title": "Four-day Week Made Permanent For Most UK Firms In World's Biggest Trial", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T15:33:12.908356+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://news.slashdot.org/story/24/02/22/1336219/four-day-week-made-permanent-for-most-uk-firms-in-worlds-biggest-trial?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "AmiMoJo writes: Most of the UK companies that took part in the world's biggest ever four-day working week trial have made the policy permanent, research shows. Of the 61 organisations that took part in a six-month UK pilot in 2022, 54 (89%) are still operating the policy a year later, and 31 (51%) have made the change permanent. More than half (55%) of project managers and CEOs said a four-day week -- in which staff worked 100% of their output in 80% of their time -- had a positive impact on their organisation, the report found. \n\nFor 82% this included positive effects on staff wellbeing, 50% found it reduced staff turnover, while 32% said it improved job recruitment. Nearly half (46%) said working and productivity improved. The report's author, Juliet Schor, professor of sociology at Boston College, said the results showed \"real and long lasting\" effects. \"Physical and mental health, and work-life balance are significantly better than at six months. Burnout and life satisfac"}, {"title": "US Health Tech Giant Change Healthcare Hit by Cyberattack", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T15:33:09.661982+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://tech.slashdot.org/story/24/02/22/144230/us-health-tech-giant-change-healthcare-hit-by-cyberattack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "U.S. healthcare technology giant Change Healthcare has confirmed a cyberattack on its systems. In a brief statement, the company said it was \"experiencing a network interruption related to a cyber security issue.\" From a report: \"Once we became aware of the outside threat, in the interest of protecting our partners and patients, we took immediate action to disconnect our systems to prevent further impact,\" Change Healthcare wrote on its status page. \"The disruption is expected to last at least through the day.\" \n\nThe incident began early on Tuesday morning on the U.S. East Coast, according to the incident tracker. The specific nature of the cybersecurity incident was not disclosed. Most of the login pages for Change Healthcare were inaccessible or offline when TechCrunch checked at the time of writing. Michigan local newspaper the Huron Daily Tribune is reporting that local pharmacies are experiencing outages due to the Change Healthcare cyberattack.<p><div class=\"share_submi"}, {"title": "Study Finds Anti-Piracy Messages Backfire, Especially For Men", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T13:22:13.837101+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://yro.slashdot.org/story/24/02/22/0225210/study-finds-anti-piracy-messages-backfire-especially-for-men?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "jbmartin6 shares a report from Phys.Org: Threatening messages aimed to prevent digital piracy have the opposite effect if you're a man, a new study from the University of Portsmouth has found. According to the research, women tend to respond positively to this kind of messaging, but men typically increase their piracy behaviors by 18%. [...] This paper studies how effective anti-piracy messages are as a deterrent, examining the change in TV and film piracy intentions among 962 adults compared with their past behavior. The three messages examined in the study were verbatim copies of three real-world anti-piracy campaigns. Two of the campaigns used threatening messages to try to combat piracy and the third was educational in tone.\n \nOne of the threatening messages was from crime reduction charity, Crimestoppers, which focused on the individual's risk of computer viruses, identity fraud, money and data theft and hacking. The other message was based on a campaign by the French go"}, {"title": "Google Pauses AI Image-generation of People After Diversity Backlash", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T12:17:54.069810+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://tech.slashdot.org/story/24/02/22/1150243/google-pauses-ai-image-generation-of-people-after-diversity-backlash?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "Google has temporarily stopped its latest AI model, Gemini, from generating images of people, as a backlash erupted over the model's depiction of people from diverse backgrounds. From a report: Gemini creates realistic images based on users' descriptions in a similar manner to OpenAI's ChatGPT. Like other models, it is trained not to respond to dangerous or hateful prompts, and to introduce diversity into its outputs. However, some users have complained that it has overcorrected towards generating images of women and people of colour, such that they are featured in historically inaccurate contexts, for instance in depictions of Viking kings. \n\nGoogle said in a statement: \"We're working to improve these kinds of depictions immediately. Gemini's image generation does generate a wide range of people. And that's generally a good thing because people around the world use it. But it's missing the mark here.\" It added that it would \"pause the image-generation of people and will re-r"}, {"title": "Popular Meditation App Must Pay 30% App Store Fee On 'Tips' Sent To Teachers", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T10:06:49.209168+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://news.slashdot.org/story/24/02/22/027258/popular-meditation-app-must-pay-30-app-store-fee-on-tips-sent-to-teachers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "Sarah Perez reports via TechCrunch: The CEO of meditation app Insight Timer, Christopher Plowman, is frustrated. He doesn't think the teachers who leverage his app's marketplace to reach their students should have to share 30% of their income with Apple -- its commission on in-app purchases -- and for the past 12 months, Apple had also agreed. After Apple loosened its rules around in-app donations in 2022, Insight Timer took advantage of the option to adjust a digital donations feature that allowed Insight Timers' teachers to collect \"tips\" from their user profiles and during live events. Apple reviewed the app and approved its release on the App Store. Now the tech giant has changed its mind -- it wants to collect a commission from this content, and Insight Timer had no choice but to comply or have its iOS business shut down, Plowman says. [...]\n \nIn section 3.2.1 of Apple's App Review guidelines, the company explains that apps can route around Apple's in-app purchase if the"}, {"title": "FDA Warns Against Using Smartwatches and Smart Rings To Measure Blood Sugar", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T07:57:39.345086+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://science.slashdot.org/story/24/02/22/0218229/fda-warns-against-using-smartwatches-and-smart-rings-to-measure-blood-sugar?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "In a warning issued Wednesday, the FDA said it has not authorized or approved any smartwatch or smart ring to measure blood glucose levels. The use of these devices can lead to inaccurate measurements and errors in managing diabetes that can be life-threatening, the agency said. From a report: These unauthorized devices are different from smartwatch apps that display data from FDA-approved continuous glucose monitoring devices that pierce the skin. The FDA did not name specific brands but said the sellers of these unauthorized smartwatches and smart rings advertise using &#226;oenon-invasive techniques&#226; to measure blood glucose without requiring people to prick their fingers or pierce their skin. However, these devices do not directly test blood glucose levels, the agency said, urging consumers to avoid buying them for that purpose.\n \nThe agency also advised health care providers to discuss the risk of using unauthorized blood glucose measuring devices with their patient"}, {"title": "Engineers Use AI To Wrangle Fusion Power For the Grid", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T03:36:59.764729+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://hardware.slashdot.org/story/24/02/22/004235/engineers-use-ai-to-wrangle-fusion-power-for-the-grid?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "An anonymous reader quotes a report from Princeton Engineering: In the blink of an eye, the unruly, superheated plasma that drives a fusion reaction can lose its stability and escape the strong magnetic fields confining it within the donut-shaped fusion reactor. These getaways frequently spell the end of the reaction, posing a core challenge to developing fusion as a non-polluting, virtually limitless energy source. But a Princeton-led team composed of engineers, physicists, and data scientists from the University and the Princeton Plasma Physics Laboratory (PPPL) have harnessed the power of artificial intelligence to predict -- and then avoid -- the formation of a specific plasma problem in real time.\n \nIn experiments at the DIII-D National Fusion Facility in San Diego, the researchers demonstrated their model, trained only on past experimental data, could forecast potential plasma instabilities known as tearing mode instabilities up to 300 milliseconds in advance. While tha"}, {"title": "Leaked Hacking Files Show Chinese Spying On Citizens and Foreigners Alike", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T02:34:21.896783+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://yro.slashdot.org/story/24/02/21/223214/leaked-hacking-files-show-chinese-spying-on-citizens-and-foreigners-alike?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "An anonymous reader quotes a report from PBS: Chinese police are investigating an unauthorized and highly unusual online dump of documents from a private security contractor linked to the nation's top policing agency and other parts of its government -- a trove that catalogs apparent hacking activity and tools to spy on both Chinese and foreigners. Among the apparent targets of tools provided by the impacted company, I-Soon: ethnicities and dissidents in parts of China that have seen significant anti-government protests, such as Hong Kong or the heavily Muslim region of Xinjiang in China's far west. The dump of scores of documents late last week and subsequent investigation were confirmed by two employees of I-Soon, known as Anxun in Mandarin, which has ties to the powerful Ministry of Public Security. The dump, which analysts consider highly significant even if it does not reveal any especially novel or potent tools, includes hundreds of pages of contracts, marketing present"}, {"title": "Nvidia Posts Record Revenue Up 265% On Booming AI Business", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T02:34:20.386617+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://slashdot.org/story/24/02/21/2324238/nvidia-posts-record-revenue-up-265-on-booming-ai-business?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "In its fourth quarter earnings report today, Nvidia beat Wall Street's forecast for earnings and sales, causing shares to rise about 10% in extended trading. CNBC reports: Here's what the company reported compared with what Wall Street was expecting for the quarter ending in January, based on a survey of analysts by LSEG, formerly known as Refinitiv:\n \nEarnings per share: $5.16 adjusted vs. $4.64 expected\nRevenue: $22.10 billion vs. $20.62 billion expected \nNvidia said it expected $24.0 billion in sales in the current quarter. Analysts polled by LSEG were looking for $5.00 per share on $22.17 billion in sales. Nvidia CEO Jensen Huang addressed investor fears that the company may not be able to keep up this growth or level of sales for the whole year on a call with analysts. \"Fundamentally, the conditions are excellent for continued growth\" in 2025 and beyond, Huang told analysts. He says demand for the company's GPUs will remain high due to generative AI and an industry-wide "}, {"title": "Google Admits Gemini Is 'Missing the Mark' With Image Generation of Historical People", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T02:34:18.863382+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://tech.slashdot.org/story/24/02/21/2335258/google-admits-gemini-is-missing-the-mark-with-image-generation-of-historical-people?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "Google's Gemini AI chatbot is under fire for generating historically inaccurate images, particularly when depicting people from different eras and nationalities. Google acknowledges the issue and is actively working to refine Gemini's accuracy, emphasizing that while diversity in image generation is valued, adjustments are necessary to meet historical accuracy standards. 9to5Google reports: The Twitter/X post in particular that brought this issue to light showed prompts to Gemini asking for the AI to generate images of Australian, American, British, and German women. All four prompts resulted in images of women with darker skin tones, which, as Google's Jack Krawcyczk pointed out, is not incorrect, but may not be what is expected.\n \nBut a bigger issue that was noticed in the wake of that post was that Gemini also struggles to accurately depict human beings in a historical context, with those being depicted often having darker skin tones or being of particular nationalities th"}, {"title": "University of Alabama Pauses IVF Services After Court Embryo Ruling", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "album": "", "thumbnail": null, "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T02:34:16.951377+00:00", "language": "en-us", "artist": "help@slashdot.org", "comments": [], "source_obj__id": 607, "link": "https://science.slashdot.org/story/24/02/21/2345226/university-of-alabama-pauses-ivf-services-after-court-embryo-ruling?utm_source=rss1.0mainlinkanon&utm_medium=feed", "bookmarked": false, "page_rating_visits": 0, "description": "Following a recent ruling from the state supreme court, the University of Alabama at Birmingham health system said it is pausing all in vitro fertilization (IVF) treatments for fear of criminal prosecution or punitive damages. On Friday, the Alabama Supreme Court ruled that frozen embryos are \"children,\" entitled to full personhood rights, and anyone who destroys them could be liable in a wrongful death case. The Hill reports: \"We are saddened that this will impact our patients' attempt to have a baby through IVF, but we must evaluate the potential that our patients and our physicians could be prosecuted criminally or face punitive damages for following the standard of care for IVF treatments,\" the health system said. [...] It is standard practice in IVF to fertilize several eggs and then transfer one into a woman's uterus. Any remaining normally developing embryos can be, at the patient's request and consent, frozen for later use. But legal experts say it's unclear if the st"}]