[{"title": "Final Fantasy 7 Rebirth PS5 Graphics Analysis: Fidelity vs Performance, And Improvements Over Remake", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "thumbnail": "https://i1.ytimg.com/vi/DVmY4p91Gxg/hqdefault.jpg", "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T17:00:08+00:00", "language": null, "artist": "GamingBolt", "comments": [], "source_obj__id": 208, "link": "https://www.youtube.com/watch?v=DVmY4p91Gxg", "bookmarked": false, "page_rating_visits": 0, "description": "The developer has been doing a really great job with its Final Fantasy 7 Remake Initiative, and after an excellent Part 1 and Intergrade episode, we finally have Rebirth, the second episode in this trilogy. \n\nIt's a continuation of what came before, not only from a gameplay perspective but also from a technical standpoint. It makes great use of Unreal Engine 4’s features and delivers a game that's bigger and better in more ways than one, though some problems do persist in Rebirth as well. \n\nWith this video, we take a look at the technical aspects of the game and break down individual elements from lighting to reflections and much more."}, {"title": "Final Fantasy 7 Rebirth Review - An Unabashed Masterpiece", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "thumbnail": "https://i3.ytimg.com/vi/vlhh_RDpuQ8/hqdefault.jpg", "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T14:00:47+00:00", "language": null, "artist": "GamingBolt", "comments": [], "source_obj__id": 208, "link": "https://www.youtube.com/watch?v=vlhh_RDpuQ8", "bookmarked": false, "page_rating_visits": 0, "description": "Final Fantasy 7 Rebirth is the best RPG in decades. Rebirth delivers an epic, riveting campaign from start to finish. Meanwhile, it also builds on the excellent foundations of its 2020 predecessor in several meaningful ways, most prominent among them being a meticulously designed, massive open world that is brimming with incredible visual and mechanical variety. \n\nThanks to the excellent quality of the game’s abundant optional content, the desire to go off the beaten path and explore never really diminishes, and all of this is tied together by in-depth, multilayered progression mechanics and one of the best combat systems you’ll ever see in a game. All said, Final Fantasy 7 Rebirth is an unabashed masterpiece."}, {"title": "Elden Ring Shadow of the Erdtree DLC - 10 NEW Details You Should Know", "user": null, "vote": 0, "permanent": false, "page_rating": 0, "age": null, "page_rating_votes": 0, "tags": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "thumbnail": "https://i1.ytimg.com/vi/tbvpL87g4GE/hqdefault.jpg", "page_rating_contents": 0, "dead": false, "date_published": "2024-02-22T14:00:45+00:00", "language": null, "artist": "GamingBolt", "comments": [], "source_obj__id": 208, "link": "https://www.youtube.com/watch?v=tbvpL87g4GE", "bookmarked": false, "page_rating_visits": 0, "description": "It's official: Elden Ring's first paid expansion, Shadow of the Erdtree, is out on June 21st for Xbox Series X/S, Xbox One, PS4, PS5 and PC for $39.99. Venturing to the Land of Shadow, it's FromSoftware's biggest expansion yet, with multiple new enemies and bosses to fight, and the gameplay looks stunning.\n\nAlongside a map larger than Limgrave, full of new types of areas, dungeons and Legacy Dungeons, it also offers content. Here are ten new details about Elden Ring: Shadow of the Erdtree that you should know before you pre-order."}]