[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T23:38:44.285506+00:00", "description": "An anonymous reader quotes a report from NPR: A New Jersey appeals court says a couple cannot sue Uber over a life-altering car accident because of the app's terms and conditions, even though they say it was their daughter who agreed to those terms while placing an Uber Eats order. John and Georgia McGinty -- a Mercer County couple both in their 50s -- filed a lawsuit against the ride-hailing company in February 2023, nearly a year after suffering \"serious physical, psychological, and financial damages\" when the Uber they were riding in crashed into another car, according to court filings. \"There are physical scars, mental scars, and I don't think that they will ever really be able to go back to their full capacity that they were at before,\" says their attorney, Mike Shapiro.\n \nUber responded by filing a motion to dismiss the complaint and compel arbitration, which would require the parties to resolve their differences outside court instead -- ostensibly benefiting the company by lowe", "id": 1257332, "language": null, "link": "https://yro.slashdot.org/story/24/10/02/2135232/court-blocks-uber-crash-lawsuit-after-couples-daughter-agreed-to-uber-eats-tos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Court Blocks Uber Crash Lawsuit After Couple's Daughter Agreed To Uber Eats TOS", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T22:33:31.730458+00:00", "description": "schwit1 shares a report from The Independent: Thousands of Bank of America customers reported trouble accessing their bank accounts Wednesday afternoon as the financial institution faced a widespread outage. On social media, customers said they could not view their account balances. Those who could view their accounts said they were met with an alarming $0 balance. For many, a \"Connection Error\" message popped up while trying to log into the banking app. The message said it was \"unable to complete your request\" and asked the user to \"try again later.\"\n \nBy 1:15 p.m. Eastern Time, nearly 20,000 customers said they were having trouble, according to Downdetector, which reports web outages. That number dropped before rising again around 2:45 p.m. ET. It is unclear what caused the outage<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bank+of+America+Is+Down%3A+Users+Report+Their+Accounts+Showing+Empty+Balance%3A+https%3A", "id": 1257056, "language": null, "link": "https://news.slashdot.org/story/24/10/02/2116227/bank-of-america-is-down-users-report-their-accounts-showing-empty-balance?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Bank of America Is Down: Users Report Their Accounts Showing Empty Balance", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T22:33:31.645616+00:00", "description": "The Verge's Gaby Del Valle reports: New York City Mayor Eric Adams, who was indicted last week on charges including fraud, bribery, and soliciting donations from foreign nationals, told federal investigators he forgot his phone password before handing it over, according to charging documents. That was almost a year ago, and investigators still can't get into the phone, prosecutors said Wednesday.\n \nDuring a federal court hearing, prosecutor Hagan Scotten said the FBI's inability to get into Adams' phone is a \"significant wild card,\" according to a report from the New York Post. The FBI issued a search warrant for Adams' devices in November 2023. Adams initially handed over two phones but didn't have his personal device on him. The indictment does not mention what type of device Adams uses. When Adams turned in his personal cellphone the following day, charging documents say, he said he had changed the password a day prior -- after learning about the investigation -- and couldn't remem", "id": 1257055, "language": null, "link": "https://apple.slashdot.org/story/24/10/02/2124209/the-feds-still-cant-get-into-eric-adams-phone?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Feds Still Can't Get Into Eric Adams' Phone", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T21:29:50.803146+00:00", "description": "The small town of Spruce Pine, North Carolina, which supplies high-purity quartz essential for semiconductor production, is reeling from the damage caused by Tropical Storm Helene. An anonymous reader quotes a report from Axios: Spruce Pine is one of the only places in the world to mine high-purity quartz. The mineral is an essential ingredient of chips in countless products, including medical devices, solar panels, cellphones and the chips powering the latest tech craze: artificial intelligence. It's difficult to underscore the significance of Spruce Pine -- a town of about 2,000 people, known for its charming downtown and blossoming arts scene -- to the global economy. Economics editor Ed Conway put it best in his 2023 book \"Material World,\" writing: \"It is rare, unheard of almost, for a single site to control the global supply of a crucial material. Yet if you want to get high-purity quartz -- the kind you need to make those crucibles without which you can't make silicon wafers -- ", "id": 1256709, "language": null, "link": "https://news.slashdot.org/story/24/10/02/215204/hurricane-helene-took-out-nc-town-the-entire-tech-world-relies-on?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Hurricane Helene Took Out NC Town the Entire Tech World Relies On", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T20:24:36.781012+00:00", "description": "The Federal Communications Commission is making up to $200 million available to help schools and libraries make their computer systems more secure. From a report: The Schools and Libraries Cybersecurity Pilot Program will be used to evaluate whether to fund this kind of program on a more permanent basis. The funding will come through a pool of money called the Universal Service Fund (USF), which is made up of contributions from telecommunications companies. Schools and libraries participating in the program will be able to reimburse things like advanced firewalls, identity protection and authentication services, malware protection, and VPNs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FCC+is+Offering+%24200+Million+To+Protect+Schools+and+Libraries+From+Hackers%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F10%2F02%2F1933202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitt", "id": 1256355, "language": null, "link": "https://news.slashdot.org/story/24/10/02/1933202/fcc-is-offering-200-million-to-protect-schools-and-libraries-from-hackers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "FCC is Offering $200 Million To Protect Schools and Libraries From Hackers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T19:19:18.226310+00:00", "description": "Financial Times has more details on the new fundraise closed by OpenAI. From the report: OpenAI has asked investors to avoid backing rival start-ups such as Anthropic and Elon Musk's xAI, as it secures $6.6bn in new funding and seeks to shut out challengers to its early lead in generative artificial intelligence. [...] During the negotiations, the company made clear that it expected an exclusive funding arrangement, according to three people with knowledge of the discussions. Seeking exclusive relationships with investors restricts rivals' access to capital and strategic partnerships. The move by the maker of ChatGPT risks inflaming existing tensions with competitors, especially Musk, who is suing OpenAI. Venture firms are party to sensitive information about the companies they invest in, and close relationships with one company can make it difficult or contentious to also back a rival. But exclusivity is rarely insisted on, according to VCs, and many leading firms have spread their b", "id": 1256041, "language": null, "link": "https://news.slashdot.org/story/24/10/02/1810206/openai-asks-investors-not-to-back-rival-startups-such-as-elon-musks-xai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Asks Investors Not To Back Rival Startups Such as Elon Musk's xAI", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T19:19:17.991711+00:00", "description": "Amazon is set to roll out a greater number of ads [non-paywalled link] across its blockbuster television shows and movies on Prime Video next year as the US tech giant steps up its push into ad-funded streaming services. Financial Times: The company said it had not seen a sharp drop in subscribers since it introduced advertising to its Prime Video platform eight months ago, allaying fears among top executives of a customer backlash, as it attempts to win over more brands to its streaming service. \n\nKelly Day, vice-president of Prime Video International, who oversees the streaming video business in global markets, told the Financial Times there would be an increasing number of ad slots for brands to target in 2025. Talking ahead of its first London \"up front\" on Wednesday evening -- when television companies present their plans to advertisers to attract money over the next year -- Day said its advertising \"load\" would \"ramp up a little bit more into 2025.\"<p><div class=\"share_submissio", "id": 1256040, "language": null, "link": "https://entertainment.slashdot.org/story/24/10/02/1849247/amazon-to-increase-number-of-ads-on-prime-video?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon To Increase Number of Ads on Prime Video", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T18:13:56.306246+00:00", "description": "Apple's iOS 18 update has introduced changes to contact sharing that could significantly impact social app developers. The new feature allows users to selectively share contacts with apps, rather than granting access to their entire address book. While Apple touts this as a privacy enhancement, developers warn it may hinder the growth of new social platforms. Nikita Bier, a start-up founder, called it \"the end of the world\" for friend-based social apps. Critics argue the change doesn't apply to Apple's own services, potentially giving the tech giant an unfair advantage.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Did+Apple+Just+Kill+Social+Apps%3F%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F10%2F02%2F1744216%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdo", "id": 1255560, "language": null, "link": "https://apple.slashdot.org/story/24/10/02/1744216/did-apple-just-kill-social-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Did Apple Just Kill Social Apps?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T17:09:46.531792+00:00", "description": "Juno, an app designed for watching YouTube on the Vision Pro, has been removed from the App Store, developer Christian Selig said today. From a report: Back in April, YouTube emailed Selig and said that Juno was violating the YouTube Terms of Service and the YouTube API by modifying the native YouTube.com web user interface, and used YouTube trademarks and iconography that could be confusing to customers. \n\nIn response, Selig switched from using the embed player to the website player, made it clear that Juno was an unofficial YouTube viewer, and explained to YouTube that as a web viewer, Juno is not using YouTube APIs. At the same time, though, YouTube filed a complaint with the App Store, and Selig went on to warn customers that he would not fight Google on any decision regarding Juno. Juno has now been removed from the App Store by Apple in response to YouTube's complaint. Selig says that he does not agree with the decision because Juno is a simple web view and that that modifies CS", "id": 1255121, "language": null, "link": "https://tech.slashdot.org/story/24/10/02/168227/popular-third-party-youtube-app-for-vision-pro-pulled-from-app-store?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Popular Third-Party YouTube App for Vision Pro Pulled From App Store", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T17:09:46.434847+00:00", "description": "OpenAI has completed a deal to raise over $6.5 billion in new funding, giving the artificial intelligence company a more than $150 billion valuation, and bolstering its efforts to build the world's leading generative AI technology. From a report: The deal is one of the largest-ever private investments, and makes OpenAI one of the three largest venture-backed startups, alongside Elon Musk's SpaceX and TikTok owner ByteDance, according to people familiar with the matter who asked not to be identified discussing private information. The size of the investment underscores the tech industry's belief in the power of AI, and its appetite for the extremely costly research powering its advancement. The funding round was led by Thrive Capital, the venture capital firm headed up by Josh Kushner, Bloomberg previously reported, along with other global investors.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Has+Closed+Ne", "id": 1255120, "language": null, "link": "https://slashdot.org/story/24/10/02/171209/openai-has-closed-new-funding-round-raising-over-65-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Has Closed New Funding Round Raising Over $6.5 Billion", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T16:04:12.737655+00:00", "description": "Two Harvard students have developed smart glasses with facial recognition capabilities, sparking debate over privacy and surveillance. The project, dubbed I-XRAY, uses Meta's Ray-Ban smart glasses coupled with facial recognition software to identify strangers and retrieve personal information about them. AnhPhu Nguyen and Caine Ardayfio, the creators, tested the technology on unsuspecting individuals in public spaces. The glasses scan faces, match them against online databases, and display personal details on a smartphone within seconds. The students claim their project aims to raise awareness about potential privacy risks.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta's+Smart+Glasses+Repurposed+For+Covert+Facial+Recognition%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F10%2F02%2F1441238%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=", "id": 1254695, "language": null, "link": "https://tech.slashdot.org/story/24/10/02/1441238/metas-smart-glasses-repurposed-for-covert-facial-recognition?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta's Smart Glasses Repurposed For Covert Facial Recognition", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T14:58:15.330296+00:00", "description": "Microsoft is releasing a new version of Office this week, designed for people that don't want to subscribe to Microsoft 365. From a report: The standalone Microsoft Office 2024 release is now available for both consumers and small businesses, and includes locked-in-time versions of Word, Excel, PowerPoint, OneNote, and Outlook across both Mac and PC. Office 2024 includes a lot of the updates that Microsoft has been delivering to Microsoft 365 subscribers over the past few years. \n\nMicrosoft last released a standalone version of Office in 2021, and this new Office 2024 release includes improvements to the core apps, as well as accessibility and UI changes. Office 2024 has a new default theme, with Microsoft's latest Fluent Design principles that match the visual changes to Windows 11. Microsoft has also added accessibility-focused improvements to help Office users find potential accessibility issues in documents, slideshows, workbooks, and emails.<p><div class=\"share_submission\" style=", "id": 1254067, "language": null, "link": "https://slashdot.org/story/24/10/02/146210/microsoft-office-2024-is-now-available-for-macs-and-pcs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Office 2024 is Now Available For Macs and PCs", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T14:58:15.010052+00:00", "description": "Anduril founder Palmer Luckey advocated for a \"warrior class\" and autonomous weapons during a talk at Pepperdine University. The defense tech entrepreneur, known for his Hawaiian shirts and mullet, argued that societies need people \"excited about enacting violence on others in pursuit of good aims.\" \n\nLuckey revealed that Anduril supplied weapons to Ukraine two weeks into the Russian invasion, lamenting that earlier involvement could have made \"a really big difference.\" He criticized Western hesitancy on AI development, claiming adversaries are waging a \"shadow campaign\" against it in the United Nations. Contradicting his co-founder's stance, Luckey endorsed fully autonomous weapons, comparing them favorably to indiscriminate landmines.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Anduril+Founder+Luckey%3A+Every+Country+Needs+a+'Warrior+Class'+Excited+To+Enact+'Violence+on+Others+in+Pursuit+of+Good+Aims'%3A+https%", "id": 1254066, "language": null, "link": "https://news.slashdot.org/story/24/10/02/1423221/anduril-founder-luckey-every-country-needs-a-warrior-class-excited-to-enact-violence-on-others-in-pursuit-of-good-aims?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Anduril Founder Luckey: Every Country Needs a 'Warrior Class' Excited To Enact 'Violence on Others in Pursuit of Good Aims'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T13:52:39.584995+00:00", "description": "An anonymous reader quotes a report from 404 Media: Somewhere over the streets of San Francisco's Mission, a microphone sits surveilling ... for banger songs. Bop Spotter is a project by technologist Riley Walz in which he has hidden an Android phone in a box on a pole, rigged it to be solar powered, and has set it to record audio and periodically sends it to Shazam's API to determine which songs people are playing in public. Walz describes it as ShotSpotter, but for music. \"This is culture surveillance. No one notices, no one consents. But it's not about catching criminals,\" Walz's website reads. \"It's about catching vibes. A constant feed of what's popping off in real-time.\"\n \nShotSpotter, of course, is the microphone-based, \"gunshot detection\" surveillance company that cities around the country have spent millions of dollars on. ShotSpotter is often inaccurate, and sometimes detects things like fireworks or a car backfiring as gunshots. Chicago, one of ShotSpotter's biggest clients", "id": 1253591, "language": null, "link": "https://entertainment.slashdot.org/story/24/10/02/0310226/hidden-bopspotter-microphone-is-constantly-surveilling-san-francisco-for-good?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Hidden 'BopSpotter' Microphone Is Constantly Surveilling San Francisco For Good", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T10:42:34.042880+00:00", "description": "Google Flights is offering train routes as an alternative to airlines, thanks to a new partnership with Amtrak. 9to5Google reports: In the US, this option surfaces routes and pricing directly provided by Amtrak, as the rail service announced recently: \"Amtrak and Google have joined forces to help travelers choose more sustainable transportation options when searching for intercity travel. Thanks to a newly launched, direct data integration, travelers using Google can now view the most up-to-date Amtrak departure times, trip durations and fares directly on the Google Search results page. Amtrak's new integration with Google also means that once customers select a train, they can click through to Amtrak.com to complete the booking for their chosen itinerary without needing to re-enter their trip details.\"\n \nAmtrak says that choosing a train route over a flight can cut a customer's carbon footprint by up to 72%. Of course, train routes in the US often take considerably longer than flight", "id": 1252285, "language": null, "link": "https://tech.slashdot.org/story/24/10/02/033251/google-flights-now-uses-amtrak-data-to-show-trains-to-consider-alongside-flights?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Flights Now Uses Amtrak Data To Show 'Trains To Consider' Alongside Flights", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T07:58:11.507653+00:00", "description": "California Governor Gavin Newsom signed a law giving the California Energy Commission the authority to require bidirectional charging in electric vehicles (EVs) in the future -- although no timeline is set. Bidirectional charging allows EVs to not only charge from the grid but also supply electricity back to the grid, potentially enhancing grid resiliency, supporting renewable energy, and reducing peak electricity demand. Electrek reports: The idea started in 2023 when state Senator Nancy Skinner introduced a bill which would require EVs to have bidirectional charging by 2027. As this bill made its way through the legislative process, it got watered down from that ambitious timeline. So the current form of the bill, which is now called SB 59, took away that timeline and instead gave the California Energy Commission (CEC) the go-ahead to issue a requirement whenever they see it fit. The bill directs the CEC, the California Air Resources Board, and the California Public Utilities Commis", "id": 1251776, "language": null, "link": "https://tech.slashdot.org/story/24/10/02/0156225/bidirectional-charging-may-be-required-on-evs-soon-due-to-new-california-law?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Bidirectional Charging May Be Required On EVs Soon Due To New California Law", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T04:24:46.163250+00:00", "description": "An anonymous reader quotes a report from VentureBeat: Epic Games CEO Tim Sweeney opened the Unreal Fest Seattle event today with an update on news that included a blistering criticism of monopolistic platform owners. Sweeney is a big proponent of open platforms and the open metaverse. In fact, he will talk about that subject in a virtual talk at our GamesBeat Next 2024 event on October 28-29 in San Francisco. (You can use this code for a 25% discount: gbn24dean). And so Sweeney continues to pressure the major platforms to give more favorable terms to game developers. He started out on that front by giving a price cut for users of Unreal Engine 5, Epic's tools for making games. For those who release games first or simultaneously on the Epic Games Store, Epic is cutting its royalty rate from 5% to 3.5% for Unreal developers. He noted that Epic is in better financial shape than it was a year ago, when Epic had to lay off a lot of staff. Sweeney said the company spent the last year rebuil", "id": 1251248, "language": null, "link": "https://tech.slashdot.org/story/24/10/02/0145246/epic-games-ceo-tim-sweeney-renews-blast-at-gatekeeper-platform-owners?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Epic Games CEO Tim Sweeney Renews Blast At 'Gatekeeper' Platform Owners", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T02:14:37.949422+00:00", "description": "Nintendo has convinced Ryujinx's lead developer to shut down the project. According to The Verge, the Switch emulator's download page is empty and its GitHub is gone. The Verge reports: \"Yesterday, gdkchan was contacted by Nintendo and offered an agreement to stop working on the project, remove the organization and all related assets he's in control of,\" writes developer and moderator ripinperiperi on Discord. \"While awaiting confirmation on whether he would take this agreement, the organization has been removed, so I think it's safe to say what the outcome is.\" The rest of ripinperiperi's message is a eulogy for the project, including a pair of videos showing the Ryujinx team's progress on iOS and Android ports of the Nintendo Switch emulator, among other core changes -- ones that will now presumably never ship.\n \nNintendo would not confirm or deny to The Verge that it made a deal with the developer. Instead, Nintendo spokesperson Eddie Garcia mysteriously pointed me to the Entertain", "id": 1250799, "language": null, "link": "https://games.slashdot.org/story/24/10/02/0058247/nintendo-shuts-down-ryujinx-switch-emulator?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Nintendo Shuts Down Ryujinx Switch Emulator", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T01:10:01.378826+00:00", "description": "The Firefox extension for the uBlock Origin Lite content blocker is no longer available. According to Neowin, \"Raymond Hill, the maker of the extension, pulled support and moved uBlock Origin Lite to self-hosting after multiple encounters with a 'nonsensical and hostile' review process from the store review team.\" From the report: It all started in early September when Mozilla flagged every version of the uBlock Origin Lite extension as violating its policies. Reviewers then claimed the extension apparently collected user data and contained \"minified, concatenated or otherwise machine-generated code.\" The developer seemingly debunked those allegations, saying that \"it takes only a few seconds for anyone who has even basic understanding of JavaScript to see the raised issues make no sense.\" Raymond Hill decided to drop the extension from the store and move it to a self-hosted version. This means that those who want to continue using uBlock Origin Lite on Firefox should download the lat", "id": 1250650, "language": null, "link": "https://news.slashdot.org/story/24/10/01/2210202/ublock-origin-lite-maker-ends-firefox-store-support-slams-mozilla-for-hostile-reviews?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "uBlock Origin Lite Maker Ends Firefox Store Support, Slams Mozilla For Hostile Reviews", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T01:10:01.294870+00:00", "description": "At its DevDay event today, OpenAI announced that it is giving third-party developers access to its speech-to-speech engine that powers ChatGPT's advanced voice mode. \"The move paves the way for a wave of AI apps that offer conversational voice interfaces,\" reports Axios. From the report: Early testers of the feature include nutrition and fitness app Healthify and Speak, a language learning app. Other new features being made available to developers include the ability to fine tune models based on pictures. In a demo for reporters, OpenAI executives showed an example of the new audio capabilities combined with Twilio's API to allow an AI assistant to call a fictional candy shop and place an order for 400 chocolate covered strawberries.\n \nDevelopers will only be able to use the voices provided by OpenAI -- the same ones that are options within ChatGPT. While the voice won't be watermarked in any way and developers won't have to make the AI system identify itself, OpenAI says it's against", "id": 1250649, "language": null, "link": "https://developers.slashdot.org/story/24/10/01/2215220/openai-opens-its-speech-ai-engine-to-developers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Opens Its Speech AI Engine To Developers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T00:06:28.016258+00:00", "description": "The Register's Simon Sharwood reports: AT&amp;T has claimed that Broadcom made it an offer to increase prices by 1,050 percent, and may be influencing other vendors to make a migration harder. The claim of the colossal price hike came in an email [PDF] filed in evidence by AT&amp;T in its case alleging Broadcom hasn't honored a contract that would allow the carrier to acquire an additional two years of support services for its VMware estate. The email was penned by AT&amp;T executive vice president and general manager Susan A Johnson and appears to be addressed to Broadcom CEO Hock Tan.\n \n\"After a 10 plus year strategic relationship with Broadcom ... I am sad to report that we appear to be at an impasse on our VMware deal,\" Johnson wrote on August 19. \"The latest offer that we have received would put us at an average of $REDACTED per year for a 5 year deal, where we currently pay $REDACTED per year to support previously purchased perpetual licenses with a right to renew support throug", "id": 1250404, "language": null, "link": "https://slashdot.org/story/24/10/01/216232/att-claims-vmware-by-broadcom-offered-it-a-1050-price-increase?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AT&amp;T Claims VMware By Broadcom Offered It a 1,050% Price Increase", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T00:06:27.340610+00:00", "description": "An anonymous reader quotes a report from Reuters: A federal judge dismissed a U.S. Department of Justice lawsuit accusing eBay of violating environmental laws by allowing the sale of hundreds of thousands of harmful products on its platform, including pesticides and devices to evade motor vehicle pollution controls. U.S. District Judge Orelia Merchant in Brooklyn ruled on Monday that Section 230 of the federal Communications Decency Act, which protects online platforms from liability over user content, shielded eBay from liability in the civil lawsuit.\n \nThe judge said eBay's administrative and technical support to sellers \"does not materially contribute to the products' alleged unlawfulness\" and does not make the San Jose, California, company a \"publisher or speaker\" on sellers' behalf. Merchant also said eBay was not a \"seller\" of some of the challenged products, because it did not physically possess them or hold title. She rejected the government's argument that eBay was a seller b", "id": 1250403, "language": null, "link": "https://yro.slashdot.org/story/24/10/01/2116225/ebay-wins-dismissal-of-us-lawsuit-over-alleged-sale-of-harmful-products?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "eBay Wins Dismissal of US Lawsuit Over Alleged Sale of Harmful Products", "vote": 0}]