[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T17:30:06+00:00", "description": "In our restless dreams, we’ve been seeing the return of Silent Hill for as long as we can cast our memories back, and after what has felt like an eternity of waiting, the legendary survival horror franchise is finally coming back- and what’s more, it’s coming back with what’s looking like an increasingly promising remake of the series’ best instalment to date, Silent Hill 2. \n\nFor many, this will obviously be their first time experiencing the game and its story, in which case, our advice is obviously for you to turn back and enjoy your first playthrough knowing as little as you can going in. \n\nAt the same time, however, many returning and veteran fans will also be coming back to re-experience Silent Hill 2 in enhanced and expanded form. For that group, a big part of the experience is going to be analyzing the remake’s story and storytelling and judging how well Bloober Team’s attempts hold up when compared to the seminal original. \n\nTo that end, with the horror title set to launch not", "id": 1255402, "language": null, "link": "https://www.youtube.com/watch?v=r3-bj9Rz7as", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/r3-bj9Rz7as/hqdefault.jpg", "title": "The INSANE Story of Silent Hill 2 - Before You Play Silent Hill 2 Remake", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T15:30:18+00:00", "description": "As much flak as For Honor's developer has earned in today's industry (and rightfully so), there was a time when the developer would experiment and try new things. It also delivered a multiplayer fighter: For Honor.\n\nFor Honor features several factions - Knights, Vikings, and Samurai (with Outlanders and Wu Lin joining later) - fighting to the death. It's a fighting game at heart, with the perspective shifting during Duels to allow players to focus on positioning their attacks and blocking. While there are aspects of an arena fighter, it also offers much more nuance.\n\nWhile it launched with multiple problems, For Honor has become one of the longest-supported titles out there. It continues to receive updates, including new maps and heroes. How has it evolved over the seven-plus years since its launch? Find out everything here.", "id": 1254625, "language": null, "link": "https://www.youtube.com/watch?v=rhA7dTHHLK4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/rhA7dTHHLK4/hqdefault.jpg", "title": "Seven Years Later, Is For Honor FIXED? - The Complete Journey So Far", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-02T13:30:10+00:00", "description": "With Dragon Ball: Sparking! ZERO’s launch approaching, there’s naturally a lot of excitement surrounding Dragon Ball games in general, and looking at the franchise’s history in the gaming medium, it’s hard not to be impressed at the many highs that it has delivered across a variety of genres. \n\nOver the decades, we have seen no shortage of legitimately great Dragon Ball titles, from fighting games to RPGs and so much more, and though some have obviously been better than others, there has been a sizeable number of games that have genuinely impressed with what they set out to do. \n\nSo, with Sparking! ZERO coming imminently, here, we are going to look back, take stock, and rank what we feel are the fifteen best Dragon Ball games of all time.", "id": 1253409, "language": null, "link": "https://www.youtube.com/watch?v=IqKE-KvG_rQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/IqKE-KvG_rQ/hqdefault.jpg", "title": "Top 15 Best Dragon Ball Games You NEED TO PLAY", "vote": 0}]