[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T23:35:46.863660+00:00", "description": "YouTube has released an AI-powered eraser tool to help creators easily remove copyrighted music from their videos without affecting other audio such as dialog or sound effects. TechCrunch's Ivan Mehta reports: On its support page, YouTube still warns that, at times, the algorithm might fail to remove just the song. \"This edit might not work if the song is hard to remove. If this tool doesn't successfully remove the claim on a video, you can try other editing options, such as muting all sound in the claimed segments or trimming out the claimed segments,\" the company said.\n \nAlternatively, creators can choose to select \"Mute all sound in the claimed segments\" to silence bits of video that possibly has copyrighted material. Once the creator successfully edits the video, YouTube removes the content ID claim -- the company's system for identifying the use of copyrighted content in different clips. YouTube shared a video describing the feature on its Creator Insider channel.<p><div class=\"s", "id": 816499, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/05/2230200/youtubes-updated-eraser-tool-removes-copyrighted-music-without-impacting-other-audio?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "YouTube's Updated Eraser Tool Removes Copyrighted Music Without Impacting Other Audio", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T23:35:45.272253+00:00", "description": "Nvidia is expected to earn $12 billion from GPU sales to China in 2024, despite U.S. trade restrictions. Research firm SemiAnalysis says the GPU maker will ship over 1 million units of its new H20 model to the Chinese market, \"with each one said to cost between $12,000 and $13,000 apiece,\" reports The Register. From the report: This figure is said by SemiAnalysis to be nearly double what Huawei is likely to sell of its rival accelerator, the Ascend 910B, as reported by The Financial Times. If accurate, this would seem to contradict earlier reports that Nvidia had moved to cut the price of its products for the China market. This was because buyers were said to be opting instead for domestically made kit for accelerating AI workloads. The H20 GPU is understood to be the top performing model out of three Nvidia GPUs specially designed for the Chinese market to comply with rules introduced by the Biden administration last year that curb performance.\n \nIn contrast, Huawei's Ascend 910B is ", "id": 816498, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/05/2241226/nvidia-forecasted-to-make-12-billion-selling-gpus-in-china?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Nvidia Forecasted To Make $12 Billion Selling GPUs In China", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T22:30:49.037878+00:00", "description": "An anonymous reader quotes a report from TorrentFreak: With dozens of millions of monthly visits, Animeflix positioned itself as one of the most popular anime piracy portals. The site also has an active Discord community of around 35k members, who actively participate in discussions, art competitions, even a chess tournament. While rightsholders take no offense at these side-projects, the site's core business was streaming pirated videos. That hasn't gone unnoticed; last December Animeflix was listed as one of the shutdown targets of anti-piracy coalition ACE.\n \nWhether these early enforcement efforts were responsible for the site's closure is unclear. In May, rightsholders increased the pressure through the High Court of India, obtaining a broad injunction that effectively suspended Animeflix's main domain name; Animeflix.live. This follow-up action didn't seem to hurt the site too much. It simply moved to new domains, Animeflix.gg and Animeflix.li, informing its users that the old d", "id": 816311, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/07/05/1944226/popular-pirate-site-animeflix-shuts-down-voluntarily?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Popular Pirate Site Animeflix Shuts Down 'Voluntarily'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T21:25:49.471821+00:00", "description": "An anonymous reader writes: The All England Lawn Tennis Club is using AI for the first time to protect players at Wimbledon from online abuse. An AI-driven service monitors players' public-facing social media profiles and automatically flags death threats, racism and sexist comments in 35 different languages. High-profile players who have been targeted online such as the former US Open champion Emma Raducanu and the four-time grand slam winner Naomi Osaka have previously spoken out about having to delete Instagram and Twitter, now called X, from their phones. Harriet Dart, the British No 2, has said she only uses social media from time to time because of online \"hate.\" \n\nSpeaking on Thursday after her triumph against Katie Boulter, the British No 1, Dart said: \"I just think there's a lot of positives for it [social media] but also a lot of negatives. I'm sure today, if I open one of my apps, regardless if I won, I'd have a lot of hate as well.\" Jamie Baker, the tournament's director, ", "id": 815986, "language": "en-us", "link": "https://slashdot.org/story/24/07/05/1929223/wimbledon-employs-ai-to-protect-players-from-online-abuse?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Wimbledon Employs AI To Protect Players From Online Abuse", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T21:25:47.548027+00:00", "description": "An anonymous reader shares a report: It resembles an enormous, malevolent robot from 1980s sci-fi but West Japan Railway's new humanoid employee was designed with nothing more sinister than a spot of painting and gardening in mind. Starting this month, the large machine with enormous arms, a crude, disproportionately small Wall-E-like head and coke-bottle eyes mounted on a truck -- which can drive on rails -- will be put to use for maintenance work on the company's network. Its operator sits in a cockpit on the truck, \"seeing\" through the robot's eyes via cameras and operating its powerful limbs and hands remotely. With a vertical reach of 12 metres (40ft), the machine can use various attachments for its arms to carry objects as heavy as 40kg (88lb), hold a brush to paint or use a chainsaw. For now, the robot's primary task will focus on trimming tree branches along rails and painting metal frames that hold cables above trains, the company said. The technology will help fill worker sh", "id": 815985, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/07/05/1945254/japan-introduces-enormous-humanoid-robot-to-maintain-train-lines?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Japan Introduces Enormous Humanoid Robot To Maintain Train Lines", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T20:23:32.203713+00:00", "description": "An anonymous reader quotes a report from Ars Technica: More than 384,000 websites are linking to a site that was caught last week performing a supply-chain attack that redirected visitors to malicious sites, researchers said. For years, the JavaScript code, hosted at polyfill[.]com, was a legitimate open source project that allowed older browsers to handle advanced functions that weren't natively supported. By linking to cdn.polyfill[.]io, websites could ensure that devices using legacy browsers could render content in newer formats. The free service was popular among websites because all they had to do was embed the link in their sites. The code hosted on the polyfill site did the rest. In February, China-based company Funnull acquired the domain and the GitHub account that hosted the JavaScript code. On June 25, researchers from security firm Sansec reported that code hosted on the polyfill domain had been changed to redirect users to adult- and gambling-themed websites. The code wa", "id": 815692, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/05/1919211/384000-sites-pull-code-from-sketchy-code-library-recently-bought-by-chinese-firm?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "384,000 Sites Pull Code From Sketchy Code Library Recently Bought By Chinese Firm", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T20:23:30.628500+00:00", "description": "Samsung said it expects a 1,452% profit increase for the second quarter, causing shares to climb 2.24% to a high of 86,500 Korean won ($62.73). CNBC reports: Samsung issued guidance on Friday, saying operating profit for the April to June quarter is projected to be about 10.4 trillion won ($7.54 billion) -- that's a jump of about 1,452% from 670 billion won a year ago. The expected operating profit beat a LSEG estimate of 8.51 trillion won. The firm also said it expects revenue for the second quarter to be between 73 trillion to 75 trillion won, from 60.01 trillion won a year ago. This is in line with the 73.7 trillion won estimated by LSEG analysts.\n \nBusiness for the world's largest memory chip maker rebounded as memory chip prices recovered on AI optimism last year. The South Korean electronics giant saw record losses in 2023 as the industry reeled from a post-Covid slump in demand for memory chips and electronics. Its memory chips are commonly found in a wide range of consumer dev", "id": 815691, "language": "en-us", "link": "https://slashdot.org/story/24/07/05/1927202/samsung-stock-hits-three-year-high-with-boost-from-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Samsung Stock Hits Three-Year High With Boost From AI", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T19:18:04.003990+00:00", "description": "Amazon has introduced new advertising strategies for its Fire TV platform, displaying full-screen ads before screensavers activate on idle devices, CordCutters reports. Users have observed ads from various brands during these pre-screensaver intervals, the report added.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Injects+Ads+Into+Fire+TV+Downtime%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F07%2F05%2F1832251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F07%2F05%2F1832251%2Famazon-injects-ads-into-fire-tv-downtime%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://entertainment.slashdot.org/story/24/07/05/1832251/amazon-injects-ads-into-fire-tv", "id": 815374, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/07/05/1832251/amazon-injects-ads-into-fire-tv-downtime?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Injects Ads Into Fire TV Downtime", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T18:13:05.193715+00:00", "description": "Mojang Studios, the creator of the globally popular video game Minecraft, is diversifying its revenue streams amid slowing growth in the gaming industry. Chief Executive Asa Bredin revealed in an interview that the company is exploring new partnerships in merchandising, education, and content streaming. The company is also venturing into film and television, with a Warner Bros. movie adaptation set to premiere in April and a Netflix series in development. From a report: Mojang's push follows repeated forays by Nintendo and Sony Group to broaden the appeal of their gaming properties at a time that spending in the industry has hit a lull. Nintendo is developing a live-action film based on the Legend of Zelda franchise, following the blockbuster success of The Super Mario Bros. Movie, while Sony has turned The Last of Us into an HBO series and created games based on the Spider-Man movies.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Minecraft+", "id": 814998, "language": "en-us", "link": "https://games.slashdot.org/story/24/07/05/175224/minecraft-seeks-new-revenue-as-gaming-growth-slows?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Minecraft Seeks New Revenue as Gaming Growth Slows", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T18:13:03.235555+00:00", "description": "An anonymous reader shares a report: Eton College, one of the world's most prestigious boarding schools, is planning to ban smartphones for its incoming first-year students and replace these with old-school Nokia phones instead, a spokesperson for the school confirmed to Business Insider. The new policy comes as the UK-based school grapples with managing student's educations alongside technological developments. \n\n\"Eton routinely reviews our mobile phone and devices policy to balance the benefits and challenges that technology brings to schools,\" a spokesperson told BI. \"From September those joining in Year 9 will receive a 'brick' phone for use outside the school day, as well as a School-issued iPad to support academic study. Age-appropriate controls remain in place for other year groups,\" they added.\nEton College is an exclusive boarding school located outside London, near Windsor. Prince William, Prince Harry, Tom Hiddleston, and Eddie Redmayne are among its best-known alumni.<p><d", "id": 814997, "language": "en-us", "link": "https://mobile.slashdot.org/story/24/07/05/1730254/eton-replaces-first-year-student-smartphones-with-nokia-brick-phones?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Eton Replaces First-Year Student Smartphones With Nokia 'Brick' Phones", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T17:09:13.586038+00:00", "description": "Google is intensifying efforts to decrease its dependency on Apple's Safari browser, as a U.S. antitrust lawsuit threatens its default search engine status on iPhones. The tech giant has been trying to shift more iPhone searches to its own apps, with the percentage rising from 25% five years ago to the low 30s recently, The Information reported Friday. \n\nProgress has stalled in recent months, however. To attract users, Google has run advertising campaigns showcasing unique features like Lens image search. The company recently hired former Instagram executive Robby Stein to lead this initiative, potentially leveraging AI to enhance its apps' appeal. Google paid Apple over $20 billion last year for default status on Safari. Reducing this dependency could protect Google's mobile search advertising revenue if the antitrust ruling goes against it. The report adds: Google executives considered having its new AI Overviews feature, which shows AI-generated responses to search queries, appear ", "id": 814606, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/05/1519208/google-struggles-to-lessen-reliance-on-apple-safari?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Struggles to Lessen Reliance on Apple Safari", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T17:09:11.492152+00:00", "description": "Airlines in Europe will be forced to raise prices to fund the cost of cutting carbon emissions, the boss of British Airways owner IAG said. From a report: Luis Gallego told the Financial Times that switching to cleaner, more expensive sustainable fuel would \"have a big impact\" on the industry [the link may be paywalled] and put some people off flying. \"Flying is going to be more expensive. That is an issue, we are trying to improve efficiency to mitigate that, but it will have an impact on demand,\" he said. He added that European airlines could become less competitive because of the bloc's tough net zero targets, which include a requirement for 6 per cent of jet fuel to be from sustainable sources by 2030. \n\n\"We agree with decarbonisation ... but I think we need to do it in a consistent way worldwide not to jeopardise European aviation,\" Gallego said. Sustainable aviation fuel (SAF) is made from a range of non-fossil fuel sources, from waste cooking oil to crops, and can emit 70 per c", "id": 814605, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/05/1542208/british-airways-owner-warns-airfares-must-rise-to-fund-carbon-cuts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "British Airways Owner Warns Airfares Must Rise To Fund Carbon Cuts", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T16:02:39.422948+00:00", "description": "An anonymous reader shares a report: Generative AI could \"distort collective understanding of socio-political reality or scientific consensus,\" and in many cases is already doing that, according to a new research paper from Google, one of the biggest companies in the world building, deploying, and promoting generative AI. The paper, \"Generative AI Misuse: A Taxonomy of Tactics and Insights from Real-World Data,\" [PDF] was co-authored by researchers at Google's artificial intelligence research laboratory DeepMind, its security think tank Jigsaw, and its charitable arm Google.org, and aims to classify the different ways generative AI tools are being misused by analyzing about 200 incidents of misuse as reported in the media and research papers between January 2023 and March 2024. \n\nUnlike self-serving warnings from Open AI CEO Sam Altman or Elon Musk about the \"existential risk\" artificial general intelligence poses to humanity, Google's research focuses on real harm that generative AI ", "id": 813982, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/05/150218/google-paper-ai-potentially-breaking-reality-is-a-feature-not-a-bug?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Paper: AI Potentially Breaking Reality Is a Feature Not a Bug", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T15:00:14.908635+00:00", "description": "No leap second will be added to universal time in 2024, the International Earth Rotation and Reference Systems Service (IERS) has announced. From a report: An additional second has previously been added to the universal time as displayed by atomic clocks (UTC) when this measurement has become out of sync with the rotation of the Earth (UT1). \n\nBut in a statement released on Thursday, the IERS, which enacts changes to UTC on behalf of the International Telecommunications Union (ITU), said the difference between UTC and UT1 is not great enough to warrant a change. Changes in the relationship between UTC and UT1 sometimes occur because the Earth does not always spin at the same speed, with natural events such as earthquakes often causing small changes.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=No+Leap+Second+To+Be+Added+To+Universal+Time+in+2024%2C+IERS+Says%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F07%2F05%2F143223%2F%3Futm_sour", "id": 813152, "language": "en-us", "link": "https://science.slashdot.org/story/24/07/05/143223/no-leap-second-to-be-added-to-universal-time-in-2024-iers-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "No Leap Second To Be Added To Universal Time in 2024, IERS Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T15:00:12.844943+00:00", "description": "China has requested significantly more generative AI patents than any other country, the U.N. intellectual property agency (the World Intellectual Property Organization) is reporting. According to WIPO's first-ever report on GenAI patents, China submitted over 38,200 inventions in the past decade, dwarfing the United States' 6,300 filings. South Korea, Japan, and India rounded out the top five. The study tracked approximately 54,000 GenAI-related patent applications from 2014 to 2023, with over a quarter emerging in the last year alone.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Dominates+Generative+AI+Patent+Filings%2C+UN+Says%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F07%2F05%2F1421237%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F07%2F05%2F1421237%2Fc", "id": 813151, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/05/1421237/china-dominates-generative-ai-patent-filings-un-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China Dominates Generative AI Patent Filings, UN Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:40:12.957744+00:00", "description": "A hacker infiltrated OpenAI's internal messaging systems in early 2023, stealing confidential information about the ChatGPT maker's AI technologies, New York Times reported Thursday. The breach, disclosed to employees in April that year but kept from the public, has sparked internal debate over the company's security protocols and potential national security implications, the report adds. The hacker accessed an employee forum containing sensitive discussions but did not breach core AI systems. OpenAI executives, believing the hacker had no government ties, opted against notifying law enforcement, the Times reported. From the report: After the breach, Leopold Aschenbrenner, an OpenAI technical program manager focused on ensuring that future A.I. technologies do not cause serious harm, sent a memo to OpenAI's board of directors, arguing that the company was not doing enough to prevent the Chinese government and other foreign adversaries from stealing its secrets. \n\nMr. Aschenbrenner sai", "id": 811607, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/04/1325203/a-hacker-stole-openai-secrets?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "A Hacker Stole OpenAI Secrets", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:40:10.896663+00:00", "description": "ZipNada writes: A federal court in Texas has partially blocked the government's ban on noncompete agreements that was set to take effect September 4. An estimated 30 million people, or one in five American workers, are bound by noncompetes. The employment agreements typically prevent workers -- everyone from minimum wage earners to CEOs -- from joining competing businesses or launching ones of their own. \n\nIn its complaint, Ryan LLC accused the FTC of overstepping its statutory authority in declaring all noncompetes unfair and anticompetitive. Judge Brown agreed, writing, \"The FTC lacks substantive rulemaking authority with respect to unfair methods of competition.\" Through a statement Wednesday evening, the FTC said its authority is supported by both statute and precedent. \"We will keep fighting to free hardworking Americans from unlawful noncompetes, which reduce innovation, inhibit economic growth, trap workers, and undermine Americans' economic liberty,\" wrote FTC spokesman Dougla", "id": 811606, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/04/1333206/federal-judge-partially-blocks-us-ban-on-noncompetes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Federal Judge Partially Blocks US Ban On Noncompetes", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:40:08.823842+00:00", "description": "An anonymous reader shares a report: Apple has removed several apps offering virtual private network services from the Russian App Store, following a request from Roskomnadzor, Russia's media regulator, independent news outlet Mediazona reported on Thursday. \n\nThe VPN services removed by Apple include leading services such as ProtonVPN, Red Shield VPN, NordVPN and Le VPN. Those living in Russia will no longer be able to download the services, while users who already have them on their phones can continue using them, but will be unable to update them. Red Shield VPN posted a notice from Apple on X, which said that their app would be removed following a request from Roskomnadzor, \"because it includes content that is illegal in Russia.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Bows+To+Kremlin+Pressure+To+Remove+Leading+VPNs+From+Russian+App+Store%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F07%2F04%2F1342248%2F%3Futm_source%3Dt", "id": 811605, "language": "en-us", "link": "https://apple.slashdot.org/story/24/07/04/1342248/apple-bows-to-kremlin-pressure-to-remove-leading-vpns-from-russian-app-store?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Bows To Kremlin Pressure To Remove Leading VPNs From Russian App Store", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:40:06.645767+00:00", "description": "New research aimed at identifying foods that contain higher levels of PFAS found people who eat more white rice, coffee, eggs and seafood typically showed more of the toxic chemicals in their plasma and breast milk. The Guardian adds: The study checked samples from 3,000 pregnant mothers, and is among the first research to suggest coffee and white rice may be contaminated at higher rates than other foods. It also identified an association between red meat consumption and levels of PFOS, one of the most common and dangerous PFAS compounds. The authors said the findings highlight the chemicals' ubiquity and the many ways they can end up in the food supply.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Coffee%2C+Eggs+and+White+Rice+Linked+To+Higher+Levels+of+PFAS+in+Human+Body%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F07%2F04%2F1348202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_larg", "id": 811604, "language": "en-us", "link": "https://science.slashdot.org/story/24/07/04/1348202/coffee-eggs-and-white-rice-linked-to-higher-levels-of-pfas-in-human-body?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Coffee, Eggs and White Rice Linked To Higher Levels of PFAS in Human Body", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:40:04.672037+00:00", "description": "An anonymous reader shares a report: A new test version of Windows 11 is available for Windows Insiders on the Dev Channel with Build 26120.961, which rolls out a significant change: a new Windows Start menu. You'll immediately notice that Microsoft has redesigned the Microsoft user account display, moving it to the center of the Start menu as soon as you click on the username or profile picture. \n\nThis new \"account manager\" feature gives you quicker access to your various Microsoft accounts, such as Microsoft 365, Xbox Game Pass, and OneDrive cloud storage. To no surprise, Microsoft is using this prominent display to remind you of their own products and services. The difference to the current Windows 11 Start menu is obvious, as the following screenshot shows:<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+Windows+11+Start+Menu+Annoyingly+Hides+Oft-Used+Actions%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F04%2F1350241%2F%3Futm_", "id": 811603, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/04/1350241/new-windows-11-start-menu-annoyingly-hides-oft-used-actions?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New Windows 11 Start Menu Annoyingly Hides Oft-Used Actions", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:40:02.212607+00:00", "description": "Amazon's Kindle e-reader system is experiencing a widespread outage, affecting new book downloads and access to undownloaded titles in users' libraries. The issue, confirmed by Amazon support, is expected to last at least 48 hours.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Kindle+Outage+Blocks+Book+Downloads%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F07%2F04%2F1837250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F07%2F04%2F1837250%2Famazon-kindle-outage-blocks-book-downloads%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/story/24/07/04/1837250/amazon-kindle-outage-blocks-book-downloads?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more", "id": 811602, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/04/1837250/amazon-kindle-outage-blocks-book-downloads?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Kindle Outage Blocks Book Downloads", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:40:00.170019+00:00", "description": "An Italian video game, 22 years in the making, has finally hit the market, setting a record for the longest development time in gaming history. \"Kien,\" an action platformer for Nintendo's Game Boy Advance, began development in 2002 by a group of five inexperienced enthusiasts, The Guardian reports. Only one, Fabio Belsanti, saw the project through to completion. The game, inspired by 15th-century Tuscan manuscripts and early Japanese graphics, offers a challenging, nonlinear fantasy experience. It's now available on a translucent gray cartridge, complete with a printed manual -- a rarity in modern gaming. Belsanti's company, AgeOfGames, survived the delay by creating educational games. The recent boom in retro gaming finally made Kien's release feasible, he said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Kien%2C+the+Most-Delayed+Video+Game+in+History%2C+Released+After+22+Years%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F07%2F04%2F", "id": 811601, "language": "en-us", "link": "https://games.slashdot.org/story/24/07/04/144200/kien-the-most-delayed-video-game-in-history-released-after-22-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Kien, the Most-Delayed Video Game in History, Released After 22 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:39:58.071835+00:00", "description": "Roku's recent update has sparked controversy among TV owners, particularly those with TCL and Hisense models. The update, version 13.0.0 released on June 6, introduced a feature called \"Roku Smart Picture\" that has led to numerous complaints about unwanted motion smoothing effects. The Verge adds: While Roku doesn't explicitly mention motion smoothing, or what Roku calls \"action smoothing,\" the update has made it so that I and many others with Roku TVs see motion smoothing, regardless of whether the picture setting is Roku Smart Picture or not. My TV didn't even support motion smoothing before this. Now, I can't make it go away.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Roku+Faces+Criticism+Over+Controversial+TV+Update%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F07%2F05%2F0123208%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebo", "id": 811600, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/05/0123208/roku-faces-criticism-over-controversial-tv-update?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Roku Faces Criticism Over Controversial TV Update", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:39:56.139438+00:00", "description": "Half of the Netherlands' petrol stations are set to close in the next five to 10 years as electric cars start to take over the market, according to ING Research. From a report: The bank's economists say there will be insufficient earnings in future, with only some 2,000 of today's 4,131 gas stations remaining. \"It is mainly the small, unmanned petrol stations that will disappear,\" says ING Research, as reported in De Telegraaf. [...] \n\nOwners are trying to maintain turnover by increasing their sales of food and beverages, maintenance services and even car washing, ING says. But the long-term business model of independent stations will be difficult to maintain. \"A quick calculation shows how long petrol station owners can still sell petrol,\" Dirk Mulder, Trade &amp; Retail sector banker at ING Research, said. \"A new car remains in the Dutch fleet for an average of 19 years. The last petrol and diesel cars will come onto the market in 2034 and will stay on the road until approximately 2", "id": 811599, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/05/0224237/half-of-petrol-stations-expected-to-close-in-next-decade?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Half of Petrol Stations Expected To Close in Next Decade", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:39:54.087478+00:00", "description": "MattSparkes writes: Secret international discussions have resulted in governments across the world imposing identical export controls on quantum computers, while refusing to disclose the scientific rationale behind the regulations. Although quantum computers theoretically have the potential to threaten national security by breaking encryption techniques, even the most advanced quantum computers currently in public existence are too small and too error-prone to achieve this, rendering the bans seemingly pointless. \n\nThe UK is one of the countries that has prohibited the export of quantum computers with 34 or more quantum bits, or qubits, and error rates below a certain threshold. The intention seems to be to restrict machines of a certain capability, but the UK government hasn't explicitly said this. A New Scientist freedom of information request for a rationale behind these numbers was turned down on the grounds of national security. France has also introduced export controls with the", "id": 811598, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/05/0254216/multiple-nations-enact-mysterious-export-controls-on-quantum-computers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Multiple Nations Enact Mysterious Export Controls On Quantum Computers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:39:51.981845+00:00", "description": "Britain's Labour Party was projected on Thursday evening to win a landslide election victory, sweeping the Conservative Party out of power after 14 years, in a thundering anti-incumbent revolt that heralded a new era in British politics. \n\nBritish Prime Minister Rishi Sunak accepted defeat Friday, and said he had called Keir Starmer, the Labour leader, to congratulate him. \n\nThe New York Times: Partial results, and an exit poll conducted for the BBC and two other broadcasters, indicated that Labour was on course to win around 405 of the 650 seats in the British House of Commons, versus 154 for the Conservatives. If the projections are confirmed, it would be the worst defeat for the Conservatives in the nearly 200-year history of the party, one that would raise questions about its future -- and even its very viability. Reform U.K., an insurgent, anti-immigration party, was projected to win 4 seats but a significant share of the vote, a robust performance that came at the expense of the", "id": 811597, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/05/0413233/labour-party-set-for-landslide-win-in-uk-election?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Labour Party Set for Landslide Win in UK Election", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:39:49.571552+00:00", "description": "Nintendo has announced the end of repair services for its Wii U console, following the earlier decision to shut down all Wii U servers. Nintendo cited the expiration of the parts retention period as the reason for discontinuing repairs. The move marks the final chapter for the Wii U, which launched in 2012 but struggled to gain traction, selling only 13.56 million units compared to its successor, the Switch, which has sold over 140 million units.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nintendo+Ends+Wii+U+Repairs%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F07%2F05%2F0338222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F07%2F05%2F0338222%2Fnintendo-ends-wii-u-repairs%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook", "id": 811596, "language": "en-us", "link": "https://games.slashdot.org/story/24/07/05/0338222/nintendo-ends-wii-u-repairs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Nintendo Ends Wii U Repairs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:39:47.656808+00:00", "description": "Renowned futurist Ray Kurzweil, 76, has doubled down on his prediction of the Singularity's imminent arrival in an interview with The New York Times. Gesturing to a graph showing exponential growth in computing power, Kurzweil asserted humanity would merge with AI by 2045, augmenting biological brains with vast computational abilities. \n\n\"If you create something that is thousands of times -- or millions of times -- more powerful than the brain, we can't anticipate what it is going to do,\" Kurzweil said. His claims, once dismissed, have gained traction amid recent AI breakthroughs. As Kurzweil ages, his predictions carry personal urgency. \"Even a healthy 20-year-old could die tomorrow,\" he told The Times, hinting at his own mortality race against the Singularity's timeline.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ray+Kurzweil+Still+Says+He+Will+Merge+With+AI%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F07%2F05%2F0813245%2F%3Futm_source%", "id": 811595, "language": "en-us", "link": "https://slashdot.org/story/24/07/05/0813245/ray-kurzweil-still-says-he-will-merge-with-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ray Kurzweil Still Says He Will Merge With AI", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:39:45.662276+00:00", "description": "Top Eurocops are appealing for help from lawmakers to undermine a privacy-enhancing technology (PET) they say is hampering criminal investigations -- and it's not end-to-end encryption this time. Not exactly. From a report: Europol published a position paper today highlighting its concerns around SMS home routing -- the technology that allows telcos to continue offering their services when customers visit another country. Most modern mobile phone users are tied to a network with roaming arrangements in other countries. EE customers in the UK will connect to either Telefonica or Xfera when they land in Spain, or T-Mobile in Croatia, for example. \n\nWhile this usually provides a fairly smooth service for most roamers, Europol is now saying something needs to be done about the PETs that are often enabled in these home routing setups. According to the cops, they pointed out that when roaming, a suspect in a criminal case who's using a SIM from another country will have all of their mobile ", "id": 811594, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/05/1023247/europol-says-mobile-roaming-tech-making-its-job-too-hard?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Europol Says Mobile Roaming Tech Making Its Job Too Hard", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T13:39:43.454667+00:00", "description": "\"Fortnite\" maker Epic Games said on Friday Apple was impeding its attempts to set up a games store on iPhones and iPads in Europe, the latest escalation in a bitter feud over the technology giant's control of the iOS app ecosystem. From a report: Apple has twice rejected documents it submitted to launch the Epic Games Store because the design of certain buttons and labels was similar to those used by its App Store, the video-game publisher said. \"We are using the same 'Install' and 'In-app purchases' naming conventions that are used across popular app stores on multiple platforms, and are following standard conventions for buttons in iOS apps,\" Epic said in a series of posts on X. \"Apple's rejection is arbitrary, obstructive, and in violation of the DMA, and we've shared our concerns with the European Commission,\" it said. Under pressure from European regulators, Apple had in March cleared the way for Epic to put its own game store on iOS devices in Europe.<p><div class=\"share_submiss", "id": 811593, "language": "en-us", "link": "https://apple.slashdot.org/story/24/07/05/131241/epic-games-says-apple-stalling-launch-of-its-game-store-in-europe?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Epic Games Says Apple Stalling Launch of Its Game Store in Europe", "user": null, "vote": 0}]