[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T15:30:06+00:00", "description": "Innovating in the looter shooter space can be challenging, especially when there are only so many kinds of progression, monetization and gameplay systems proven to work. Nexon's The First Descendant seemingly forgoes much of that by copying many of its systems from other shooters, with a dash of patrol spaces from Destiny.\n\nWhile its snappy gunplay and impressive visuals will impress from time to time, it stumbles in some more fundamental ways. The storytelling is uninteresting. The characters feel like cardboard cutouts who only serve to dispense dialogue and little else. The missions and activities range from repetitive and tired to insipid and uninspired.\n\nThe end game has some potential with its Colossus but ultimately falters due to the lack of matchmaking on Hard difficulty and abysmal drop rates. The First Descendant isn't the worst option when considering looter shooters, but it only highlights how much better its inspirations can be.", "id": 813422, "language": null, "link": "https://www.youtube.com/watch?v=9tf20xgc3dM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/9tf20xgc3dM/hqdefault.jpg", "title": "The First Descendant Review - Worth The Hype?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-05T10:00:28+00:00", "description": "Heading into 2024, we were probably all aware that the year was in no way going to come close to replicating the insanity of 2023, and while we’ve all been proven right on paper, this year has also not been nearly as dry as many of us had thought it would be. \n\nWe are now halfway through the year, and looking back at this point, we can’t help but marvel at how many excellent games we have already played this year so far, and the sheer variety of experiences that we have enjoyed. Looking ahead, there’s even more to look forward to, but here, we’re going to pause and reminisce, as we go over and rank what we feel have been the year’s best single-player games up to this point", "id": 809829, "language": null, "link": "https://www.youtube.com/watch?v=IrrIlwtPoAE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/IrrIlwtPoAE/hqdefault.jpg", "title": "Top 15 Single Player Games of 2024 YOU NEED TO PLAY [First Half]", "user": null, "vote": 0}]