[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 More Best Semi-Open World Games YOU SHOULD PLAY", "description": "Open world design and linear design both offer radically different kinds of experiences, and there’s no shortage of reasons to love either of them- but you know what we really appreciate? \n\nA game that properly manages to capture the strengths of both those styles. Semi-open world games – the good ones, at the very least – get to have their cake and it eat it too, because not only do they let players experience tightly designed and linear gameplay sequences, but they also have plenty of room for the kind of exploration that purely linear games tend to lack. \n\nPreviously, we’ve spoken about some of our favorite semi-open world games, but there are plenty more that we haven’t highlighted yet. To that end, in this feature, that’s exactly what we’re going to do. \n\nCheck out part 1 here: https://www.youtube.com/watch?v=6NE-PjhjZjU&", "link": "https://www.youtube.com/watch?v=ERzNtKFjPGo", "date_published": "2023-12-21T15:30:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/ERzNtKFjPGo/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "10 NEW Games of January 2024 To Look Forward To", "description": "As eventful as 2023 has been, 2024 is upon us and offers all kinds of new titles to get excited about. Tekken 8 is one of the heavier hitters, with Bandai Namco's latest flagship fighter featuring a new Story Mode, characters, features and even rollback netcode.\n\nThere's also Like a Dragon: Infinite Wealth, the newest mainline title in the series and its longest yet. Whether you're in it for the turn-based combat, the story, side stories or creating an island community, there is lots to do. \n\nAll these and more await next month. Let's go into the ten biggest games launching in January 2024 and what you can expect.", "link": "https://www.youtube.com/watch?v=P0v1TMCl4kc", "date_published": "2023-12-21T09:30:05+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/P0v1TMCl4kc/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]