[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Like A Dragon: Infinite Wealth - 15 Things YOU NEED TO KNOW Before You Buy", "description": "The Like a Dragon franchise – formerly known as Yakuza – has been steadily gaining momentum for a number of years now, and after having delivered a couple of spinoff entries in the form of Like a Dragon: Ishin! and Like a Dragon Gaiden, its ready to return with its next mainline instalment. \n\nLike a Dragon: Infinite Wealth will once again turn focus to new series protagonist Ichiban Kasuga, who is joined by his friends – including longtime Yakuza star Kazuma Kiryu – on a new adventure that, for the first time in franchise history, will take us outside Japan, to the sunny islands of Hawaii.\n\nWith the RPG now not far away from launch, here, we’re going to go over a few key details that you should know about it.", "link": "https://www.youtube.com/watch?v=yF0S91gbLNs", "date_published": "2023-12-18T15:30:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/yF0S91gbLNs/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "God of War Ragnarok: Valhalla DLC Review - The Final Verdict", "description": "Valhalla might not be the Ragnarok DLC most of us had expected, but it’s still an incredible addendum to the developer's acclaimed action-adventure game. Taking the form of a roguelite mode, it helps embellish the underlying strengths of Ragnarok’s combat better than even the base game itself was able to do, thanks to excellent implemented roguelite design and systems. \n\nAdd to the fact that this is a completely free DLC, and there’s every reason to play it.", "link": "https://www.youtube.com/watch?v=J0MupfmgjOk", "date_published": "2023-12-18T07:00:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/J0MupfmgjOk/hqdefault.jpg", "age": null, "page_rating_contents": 52, "page_rating_votes": 0, "page_rating_visits": 6, "page_rating": 52, "tags": [], "comments": [], "vote": 0}]