[{"source": "https://www.arabnews.com/rss.xml", "title": "Climate-change research critical for intervention in Kingdom, say experts", "description": "JEDDAH: There should be a greater focus on climate-change education and research to ensure effective strategies for future interventions in the Kingdom, it was proposed at a conference here.\n\n\tThe two-day event organized by the National Meteorological Center, which ended on Sunday, saw the participation of various experts who discussed “enhancing education, training, skills development and expertise of the future generation of climate scientists,” the Saudi Press Agency reported.", "link": "https://www.arabnews.com/node/2427641/saudi-arabia", "date_published": "2023-12-18T05:12:40+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Iraq holds first provincial elections in a decade", "description": "BAGHDAD: Voting began in Iraq on Monday in the first elections for provincial councils in a decade, with the ruling Shiite Muslim alliance likely to extend its grip on power amid a boycott by populist cleric Moqtada Al-Sadr, its main political rival.\n\tThe election sets the stage for parliamentary elections scheduled for 2025, which will determine the balance of power in a nation where groups with ties to Iran have made political gains in recent years.", "link": "https://www.arabnews.com/node/2427631/middle-east", "date_published": "2023-12-18T05:12:09+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Facing pressure, UN Security Council to vote on new Gaza ceasefire call", "description": "NEW YORK CITY: The United Nations Security Council will vote Monday on a new resolution calling for an “urgent and sustainable cessation of hostilities” in Gaza, as Washington exhibits growing impatience with key ally Israel.\n\n\tThe vote comes days after the United States blocked a previous Security Council resolution that would have called for a “humanitarian ceasefire” in the battered Palestinian territory, where Israel continues its deadly strikes in retaliation for Hamas’s unprecedented attack on October 7.", "link": "https://www.arabnews.com/node/2427611/world", "date_published": "2023-12-18T03:12:29+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "North Korea fires what appears to be long-range ballistic missile", "description": "SEOUL/TOKYO: North Korea fired what appeared to be a long-range ballistic missile on Monday, South Korea and Japan said, its second missile launch in less than 12 hours as Pyongyang condemned a US-led show of force against the nuclear armed state.\n\tThe missile was fired from an area near the capital Pyongyang toward the sea off the North’s east coast and flew about 1,000 km (621 miles), South Korea’s Joint Chiefs of Staff said.\n\tJapan’s coast guard said the suspected missile fell into the sea west of Hokkaido about an hour after launch.", "link": "https://www.arabnews.com/node/2427596/world", "date_published": "2023-12-18T02:12:56+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Temple promised by BJP transforms Indian city but Muslims, some locals feel neglected", "description": "AYODHYA, India: In this northern Indian city once marred by communal tensions, laborers are finalizing a $6 billion infrastructure facelift ahead of the opening of a grand Hindu temple that is igniting an economic boom — which some of Ayodhya’s poor and its Muslim community say is passing them by. City officials expect about 4.5 million tourists a month — more than Ayodhya’s entire population of 3 million — once the first stage of Ram Mandir, as the temple is known, opens on Jan. 22 inside a sprawling complex of carved pink sandstone and white marble.", "link": "https://www.arabnews.com/node/2427601/world", "date_published": "2023-12-18T02:12:21+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Pope Francis deplores the death of two women in Gaza parish", "description": "VATICAN CITY: Pope Francis on Sunday deplored the death of two women in a Catholic parish in Gaza, where he said “unarmed civilians” were being targeted by shootings and bombings.\n\tHe was speaking a day after the Latin Patriarchate of Jerusalem said a Christian mother and daughter had been shot dead by an Israeli soldier on the grounds of the Gaza Strip’s only Catholic church.", "link": "https://www.arabnews.com/node/2427556/world", "date_published": "2023-12-18T01:45:50.241598+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Killed Israeli hostage’s brother says army ‘murdered’ him", "description": "SHEFAYIM, Israel: An Israeli hostage mistakenly killed by soldiers in the Gaza Strip was buried on Sunday, with his brother accusing the army of having “abandoned” and “murdered” him.\n\tAlon Shamriz, 26, was one of the three Israeli hostages shot dead Friday by soldiers during combat in the Gaza City district of Shejaiya, even as they carried a white flag and cried for help in Hebrew.\n\tShamriz, Yotam Haim and Samer El-Talalqa were killed when troops mistook them for a threat and opened fire, the army said.", "link": "https://www.arabnews.com/node/2427561/middle-east", "date_published": "2023-12-18T01:45:50.241055+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Zelensky describes immediate goals for work on EU accession", "description": "KYIV: Ukraine and the European Commission will soon assess Kyiv’s progress on aligning its legislation with that of the European Union and a framework for EU accession talks is expected in the spring, President Volodymyr Zelensky said on Sunday.\n\tIn his nightly video address, he reminded the country that EU leaders decided at a summit on Thursday to launch formal membership talks with Ukraine. The country faces uncertainty over the future of vital wartime foreign assistance, notably from the United States.", "link": "https://www.arabnews.com/node/2427566/world", "date_published": "2023-12-18T01:45:50.240538+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Car plows into parked vehicle in Biden’s motorcade outside Delaware campaign headquarters", "description": "WILMINGTON, Delaware: A car plowed into a parked SUV that was guarding President Joe Biden ‘s motorcade Sunday night while the president was leaving a visit to his campaign headquarters. The president and first lady Jill Biden were unharmed.", "link": "https://www.arabnews.com/node/2427591/world", "date_published": "2023-12-18T01:12:11+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Russia and Ukraine launch swarm of drones at each other’s territory", "description": "KYIV: Ukraine and Russia launched a swarm of drones at each other’s territories on Sunday as both sides step up attacks, with the Russian assault reportedly killing one person in Odesa and the Ukrainian strike targeting a Russian military airfield.\n\tUkraine’s air force said on Sunday morning that it had destroyed 20 drones and a cruise missile that Russia launched overnight. Nine of the drones were downed over the southern Odesa region, with falling debris starting a fire in a residential house and killing one person.", "link": "https://www.arabnews.com/node/2427586/world", "date_published": "2023-12-18T00:12:10+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]