[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Teardown PS5 Review - The Final Verdict", "description": "After a successful run on PC a year ago, Tuxedo Labs has finally released Teardown on current gen consoles PS5 and Xbox Series X. The transition isn't without a few minor flaws, but the game largely retains the core gameplay that makes it so fun in the first place along with its simple yet gorgeous visuals and rock solid performance. \n\nThe story might not be the most detailed, but it manages to add an element of fun to with occasionally hilarious scenarios. Between this and the surprisingly detailed destruction mechanics on offer, Teardown can be a really fun time. But because each mission involves a ton of planning before you get down to the execution, Teardown also might not be everyone's cup of tea.", "link": "https://www.youtube.com/watch?v=3IHE0ZTNZL8", "date_published": "2023-11-14T15:30:02+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/3IHE0ZTNZL8/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "THE RISE AND FALL OF PAYDAY", "description": "Wind the clock back to 2011, a time where digital media was still in its infancy, where the live service fad was barely even an idea, and it’s easy to see how unique of an experience the original Payday was. \n\nWhen its sequel launched a couple of years later, it represented another major step forward for the franchise, and in spite of its own struggles, over the coming years, with consistent support, the co-op shooter managed to turn itself into something of a juggernaut. \n\nIn spite of the success the series has enjoyed, however, with Payday 3, it has very much taken several steps back, with significant issues holding back its design in a number of ways. Here, we take a look back at the history of Payday so far, how it has let itself down with its latest release, and whether it can still make a recovery in the months and years to come.", "link": "https://www.youtube.com/watch?v=eOnyMV835Ro", "date_published": "2023-11-14T13:30:14+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/eOnyMV835Ro/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Top 15 PC Games With MIND-BLOWING Graphics [2023 Edition]", "description": "PC has been one of the most prominent gaming platforms for quite a while, but it has seen a rapid increase in popularity over the last couple of years. And that essentially boils down to a couple of things including but not limited to first-party games making their way to the platform. \n\nOf course, there’s a certain flexibility that you get when you play on a PC - and you can crank the visual fidelity of games up to eleven provided that you have a capable hardware. With this feature, we will be looking at 15 of the best games that are great options if you wish to push your PC to the absolute limit and witness gaming graphics in all their glory.", "link": "https://www.youtube.com/watch?v=HowPBtqpdyU", "date_published": "2023-11-14T09:45:02+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/HowPBtqpdyU/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]