[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T17:30:00+00:00", "description": "Starfield is a divisive game, to say the very least, but when I reviewed it last year, I was definitely among the people who absolutely fell in love with its vast interstellar offerings. A year later, developer Bethesda Game Studios has come out with what is supposed to be the first of Starfield’s annual post launch expansions, and the results are… a bit more mixed, personally speaking. \n\nAt its core, this is still more Starfield, which means there’s plenty of fun to be had here for anyone who enjoyed the base experience, with a hefty chunk of new content, the same underlying mechanics, and an entirely new and completely handcrafted map. \n\nShattered Space is not, however, an improvement as much as it is a sideways step, so if you didn’t like Starfield, the expansion isn’t going to suddenly turn you into a fan.", "id": 1267902, "language": null, "link": "https://www.youtube.com/watch?v=2Ymsb0rp2Ao", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/2Ymsb0rp2Ao/hqdefault.jpg", "title": "Starfield: Shattered Space Is DISAPPOINTING - What The Hell Happened? [REVIEW]", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T15:30:10+00:00", "description": "The Quiet Place franchise has seen meteoric growth with its multiple successful films in recent years, and it’s now looking to expand its presence into gaming as well. Developed by Stormind Games, A Quiet Place: The Road Ahead is launching imminently as the IP’s first foray into gaming, and in all that we have seen so far, it has looked quite promising. \n\nTelling an original story and promising an intense horror experience, the game touts what’s looking like a smartly designed stealth system that is built all around sound and sound design. \n\nFrom its atmosphere and its setting to its stealth horror gameplay and more, there’s plenty about A Quiet Place: The Road Ahead that has caught our attention in the lead up to its release, and here, that’s exactly what we’ll be discussing.", "id": 1267243, "language": null, "link": "https://www.youtube.com/watch?v=cGZvn2kzvyU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/cGZvn2kzvyU/hqdefault.jpg", "title": "A Quiet Place: The Road Ahead - 11 Things You Need To Know Before You Buy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T13:30:11+00:00", "description": "Across all of fiction, for as long as stories have been told, the end of the world and what comes after has been one of the most popular settings and genres for that storytelling. That has obviously bled over into video games as well, where post-apocalyptic settings for video games remain among the most popular and common ones across its entire decades long history. No matter the genre of video game, at some point or the other, someone attempted making a post apocalyptic take on it (you might think this is exaggeration, but you’d be surprised).\n\nWith so many different post-apocalyptic titles, and across so many styles, picking the very best ones across the entire history of the medium may feel like it is a losing battle. However, that’s exactly the task we set for ourselves. The end result? Here are 30 games that we believe comprise the very best post-apocalyptic ones on offer.", "id": 1267244, "language": null, "link": "https://www.youtube.com/watch?v=CZ-FCaZ7NbI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/CZ-FCaZ7NbI/hqdefault.jpg", "title": "Top 30 INSANE Post-Apocalyptic Games of All Time You Need To Play", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T07:15:01+00:00", "description": "The original Silent Hill 2 remains a classic in the survival horror genre. Featuring an excellent cast of characters, an engaging story and one of the best soundtracks in video games history, making a remake was not an easy task. But Bloober Team and Konami have done an excellent job in delivering a scary yet highly enjoyable experience with Silent Hill 2.\n\nBuilt on Unreal Engine 5, Silent Hill 2 Remake features excellent attention to detail, brilliant voice acting performances and an enhanced soundtrack. Featuring a behind the shoulder camera view, the remake, just like the original, places emphasis on challenging exploration and puzzle solving. Melee combat is a ton of fun but the guns feel a tad underwhelming.\n\nSilent Hill 2 is a dream come true for many fans who have been waiting for a great game in the franchise for a long time. It easily ranks amongst one of the best horror games out there.", "id": 1264798, "language": null, "link": "https://www.youtube.com/watch?v=U5E0gcVR0wI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/U5E0gcVR0wI/hqdefault.jpg", "title": "Silent Hill 2 Remake Review - Up There With Resident Evil 2 And Dead Space Remakes", "vote": 0}]