[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T16:00:14+00:00", "description": "<p>In Vessel of Hatred, the first major expansion for Diablo 4, Nayrelle is on the run and in danger, and you need to find her. In Kyovashad, the glorious few survivors of the incursion into hell have returned, and they are no longer aligned on how to govern their people. There are soldiers in the streets, a new map section to dive in to, a whole new character class to play with, mercenaries, runes, and you, the wanderer, need to find Lorath and Nayrelle before they do. This is everything I&#8217;d hoped for from Vessel of Hatred. Out of everything the Blizzard team is bringing to the table, the new Spiritborn character is likely the part Diablo 4 fans are most looking forward to. A bit like the old Desert Mercenaries in Diablo 2 crossed with a ninja crossed with a culture heavily invested in spirit animals, the Spiritborn class has clear differentiators from the first release classes, making this a fun new experience. There are plenty of skills and spells to invest in, making the pla", "id": 1267603, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/new-characters-new-map-sections-new-stories-in-vessel-of-hatred-the-first-diablo-4-expansion", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 137, "source_url": "https://www.grimdarkmagazine.com/feed", "status_code": 0, "tags": [], "thumbnail": null, "title": "New characters, new map sections, new stories in Vessel of Hatred, the first Diablo 4 expansion", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T04:25:43+00:00", "description": "<p>Absolution is the surprise fourth volume of Jeff VanderMeer’s Southern Reach series, which began with Annihilation and continued with Authority and Acceptance. The original trilogy was published in rapid succession ten years ago, all three volumes appearing in 2014, the same year that Adrian Collins founded Grimdark Magazine. It is thus a special treat to review this fourth volume of VanderMeer’s erstwhile trilogy in our tenth anniversary issue of Grimdark Magazine. For the uninitiated, the Southern Reach series is a sci-fi horror centered on a mysterious coastal region known as Area X, where biological evolution has been accelerated in unexpected and terrifying ways, presumably due to extraterrestrial interference. Annihilation introduces us to an all-female team of scientists investigating Area X known only by their occupation: a biologist, an anthropologist, a psychologist, and a surveyor. These four women comprise the twelfth expedition into Area X after the successive failures", "id": 1264671, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-absolution-by-jeff-vandermeer", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 137, "source_url": "https://www.grimdarkmagazine.com/feed", "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: Absolution by Jeff VanderMeer", "vote": 0}]