[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:26:29+00:00", "description": "Combining the Best of Two Worlds: From TF-IDF to Llama LLM - William Arias, GitLab\n\nLearn how combining traditional NLP techniques with LLMs can solve 'hallucination' issues and create robust applications. This session offers practical insights into leveraging foundational NLP principles alongside advanced LLM technology. It's based on a business problem where the need is to craft technical content that directly tackles the key challenges customers encounter. Rather than wading through hundreds of public forum posts or customer complaints manually, why not harness the combined power of traditional, explainable Natural Language Processing (NLP) techniques integrated with the advanced language generation capabilities of Large Language Models (LLMs). This session will provide architecture and lessons learned in the journey to uncover insights from our users' feedback. Centered around a topic modeling use case, this session offers actionable insights that go beyond mere buzzwords. At the ", "id": 1268690, "language": null, "link": "https://www.youtube.com/watch?v=9-N00cv0kFc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/9-N00cv0kFc/hqdefault.jpg", "title": "Combining the Best of Two Worlds: From TF-IDF to Llama LLM - William Arias, GitLab", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:26:22+00:00", "description": "Lightning Talk: RISC-V and AI: How an Open-Standards ISA Underpins Portability for AI/ML Applications - Philipp Tomsich, VRULL GmbH\n\nRISC-V, an open-standards Instruction Set Architecture (ISA), provides the freedom to add instructions for domain-specific acceleration. This session highlights the significance of ongoing standardization efforts at RISC-V aimed at enhancing AI/ML capabilities through specific architectural enhancements: optimized instructions for matrix operations, efforts to merge GPGPU-style processing into a coherent, multi-paradigm compute resource, and support for emerging paradigms like spiking neural networks. This positions RISC-V to become a \"lingua franca\" for portable AI/ML libraries and kernels that can transparently be moved between compatible hardware from multiple vendors.", "id": 1268691, "language": null, "link": "https://www.youtube.com/watch?v=SSV43dITOtM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/SSV43dITOtM/hqdefault.jpg", "title": "Lightning Talk: RISC-V and AI: How an Open-Standards ISA Underpins Portability f...- Philipp Tomsich", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:26:16+00:00", "description": "Panel: Why Open Source AI Matters for Europe - Justin Colannino, Sachiko Muto, Stefano Maffulli, Cailean Osborne\n\nOpen source brings the promise of an AI market that is decentralised, competitive, user-centric, and where Europe leads. With this explosion, open source communities and policymakers are asking questions about open source AI’s innovation benefits, safety risks, impact on sovereignty, and competitive economics against closed-source models. In this fireside chat, OSI board member and Microsoft open source lawyer Justin Colannino will interview OFE's Sachiko Muto, OSI's Stefano Maffulli, and LF’s Cailean Osborne about why a clear and consistent definition of open source AI matters for open source communities in the face of growing EU policy tending towards greater open source regulation. We will focus on how truly “open source” in AI manifests in practice and how can it be can bolster European competitiveness while keeping true to all of our open source values.", "id": 1268692, "language": null, "link": "https://www.youtube.com/watch?v=YNtPThGcV9Q", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/YNtPThGcV9Q/hqdefault.jpg", "title": "Panel: Why Open Source AI Matters for Europe - Justin Colannino, Sachiko Muto, Stefano Maffulli...", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:26:10+00:00", "description": "Lightning Talk: Building the AIverse: Standardizing Autonomous AI Agents for a Decentralized Fediverse - Chris Xie, Futurewei\n\nThe decentralized fediverse is poised to revolutionize how we interact online, but it still lacks a crucial component: standardized, interoperable AI agents. Current AI agent frameworks are numerous, but fragmented, leading to inefficiencies and duplication of effort. This talk proposes a future vision where decentralized fediverse is empowered by standardized, autonomous AI agents with human-in-the-loop, enhancing our daily lives both online and offline. We'll discuss the need for a standard architecture for AI agent frameworks, incorporating AI safety rules and sustainable development principles, to ensure the new \"AIverse\" is built responsibly and sustainably. Join us in exploring how this vision can become a reality.", "id": 1268693, "language": null, "link": "https://www.youtube.com/watch?v=dgD37WxMBfc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/dgD37WxMBfc/hqdefault.jpg", "title": "Lightning Talk: Building the AIverse: Standardizing Autonomous AI Agents for a Decent... - Chris Xie", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:26:04+00:00", "description": "Global School Connectivity DataOps Platform - Shilpa Arora, UNICEF\n\nDiscover how an open-source, end-to-end DataOps stack is being developed to manage connectivity and infrastructure data for over 2 million schools. This session will cover key components including data ingestion mechanisms, pipelines, data quality, metadata and master data management, data cataloging, data APIs, analytics & visualisation, data lake storage, and ML notebook management—all integrated with error and change notification systems.", "id": 1268694, "language": null, "link": "https://www.youtube.com/watch?v=rP_v1ENx1h0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/rP_v1ENx1h0/hqdefault.jpg", "title": "Global School Connectivity DataOps Platform - Shilpa Arora, UNICEF", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:25:56+00:00", "description": "Reducing Bias in AI with Open Source - Abubakar Siddiq Ango, GitLab\n\nBias in AI has become a hot topic and increasingly, we are seeing how dangerous it is. Dangerous because AI is gain more influence in decisions that impact lives, decisions about who gets employment, healthcare or economic development and who gets profiled for crime, extra search at the airport, and so on. Even tools designed to identify AI-generated content have shown bias against non-native speakers based on their choice of verbiage. To reduce bias, experts often refer to having diverse training data and cognitive diversity, but where else is this achievable than in Open-source communities? This session is designed to open up discussions around reducing bias in AI with Open source. Abubakar will start by sharing examples of biases, sharing strategies to leverage open-source communities, and opening the floor for attendees to share their opinions and views, with the goal of creating a resource that will be valuable ", "id": 1268695, "language": null, "link": "https://www.youtube.com/watch?v=2B4Aq4Alca8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/2B4Aq4Alca8/hqdefault.jpg", "title": "Reducing Bias in AI with Open Source - Abubakar Siddiq Ango, GitLab", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:18:58+00:00", "description": "Learning by Example: Highlights from Google Season of Docs - Erin McKean, Google\n\nThe Google Season of Docs program gives direct grants to open source projects to hire technical writers. The technical writing projects supported by these grants are intended to solve real problems for open source project communities, and the case studies created by the projects are intended to help other open source projects learn how to conceptualize and create their own problem-solving open source documentation. In this talk, we'll walk through how projects participating in Google's Season of Docs program have framed their problems, hypothesized solutions, created documentation to solve those problems, and measured the success of their documentation.", "id": 1268696, "language": null, "link": "https://www.youtube.com/watch?v=xPB_9Gh4zZY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/xPB_9Gh4zZY/hqdefault.jpg", "title": "Learning by Example: Highlights from Google Season of Docs - Erin McKean, Google", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:13:17+00:00", "description": "ELinux Wiki BOF - Tim Bird, Sony Electronics\n\nIn this session, the status of the elinux wiki will be discussed, along with ideas for expanding and updating the content for the site. The elinux wiki has served as a resource for embedded Linux developers for almost 18 years. The wiki contains a lot of great material, including slides and videos for almost every embedded Linux Conference. In this session, Tim will discuss the wiki, and we'll brainstorm ideas for rejuvenating the site, and utilizing it as an effective community resource. Rewards will be available if you make an edit to the wiki during the BOF!! Let's work together to improve this valuable resource!", "id": 1268698, "language": null, "link": "https://www.youtube.com/watch?v=AIEaNv68Z0Y", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/AIEaNv68Z0Y/hqdefault.jpg", "title": "ELinux Wiki BOF - Tim Bird, Sony Electronics", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:13:17+00:00", "description": "Embedded Linux in EOD Robots - Lessons Learned - Marcin Bis, Łukasiewicz Research Network – Industrial Research Institute for Automation and Measurements PIAP\n\nLessons learned, benefits and some drawbacks learned from utilizing Embedded Linux, Yocto Project and other parts of Opensource software stack in development, production and maintenance of Mobile Robots for special operations. A history of the Polish mobile robots has begun in 1999 with a prototype INSPECTOR robot designed and build by Łukasiewicz Research Network – Industrial Research Institute for Automation and Measurements PIAP. Since about 2010 the robots became digital and started to use Linux and build systems. The talk covers some practical aspects of design and implementation of ARM and x86 Explosive Ordnance Disposal (EOD) mobile robots, the industry transformation and response to Embedded Linux and Yocto Project software stack from a perspective of small engineering team chasing a constantly shifting targets. An insi", "id": 1268701, "language": null, "link": "https://www.youtube.com/watch?v=TreGIWZm-T4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/TreGIWZm-T4/hqdefault.jpg", "title": "Embedded Linux in EOD Robots - Lessons Learned - Marcin Bis, Łukasiewicz Research Network – Indus...", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:13:17+00:00", "description": "How to Build Your Own High-Performance Charger with EVerest - Andreas Heinrich & Kai-Uwe Hermann, Pionix GmbH\n\nIn this talk we will give you a comprehensive overview of the complex task of building a high-performance DC vehicle charging station. We will show you how the EVerest project addresses a diverse set of challenges across all areas of the required software stack. EVerest abstracts away the complexities of reliably communicating with vehicles of all makes and models to enable successful charging sessions with robust implementations of the relevant communication protocols, such as ISO 15118-2/20 and DIN 70121 including Plug & Charge. Communication with backend systems of different providers can be achieved through the OCPP 2.0.1 and 1.6 standards. We will also explain how error handling and reporting are managed in a system running a diverse set of EVerest modules. Additionally we will discuss our strategy for generating comprehensive documentation for a project that spans multi", "id": 1268697, "language": null, "link": "https://www.youtube.com/watch?v=7sLQ7IPHuyQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/7sLQ7IPHuyQ/hqdefault.jpg", "title": "How to Build Your Own High-Performance Charger with EVerest - Andreas Heinrich & Kai-Uwe Hermann", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:13:17+00:00", "description": "How to Enable Android (AOSP) on Your Developer Board - Mattijs Korpershoek, BayLibre\n\nMost embedded development boards can run Linux from traditional distros like Debian to custom Yocto systems. But have you ever wondered what it would take to run Android Open Source Project (AOSP) on these developer boards? Well, wonder no more. This talk will walk you through it. Using a ARM based Texas Instruments evaluation board as example, we will start from TI's Yocto SDK then download AOSP and study all the changes needed in order to boot to the Android home screen. We will cover: - Bootloader (U-Boot) modifications required for Android boot flow - Linux kernel versus Android Common Kernel (ACK) - User space changes - Android's build system - Additional changes to add more advanced features.", "id": 1268699, "language": null, "link": "https://www.youtube.com/watch?v=H8YVB1JptXE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/H8YVB1JptXE/hqdefault.jpg", "title": "How to Enable Android (AOSP) on Your Developer Board - Mattijs Korpershoek, BayLibre", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:13:17+00:00", "description": "Keynote: How openEuler is Powering Tomorrow's AI/Smart Infrastructure - Xinwei Hu, Chairman of openEuler Technical Committee, openEuler of OpenAtom Foundation\n\nThe OpenAtom openEuler community is dedicated to driving continuous innovation in AI during the intelligent era. In response to the diversity of hardware and software, openEuler is creating a cloud-native AI infrastructure and openEuler NEXT, an OS for heterogeneous native computing. Our goal is to deliver AI systems that are user-friendly, efficient, reliable, and secure.\n \nopenEuler Intelligence: This AI infrastructure offers out-of-the-box readiness, hardware affinity, inference acceleration, and full lifecycle management. It is designed to adapt to the rapid changes in AI applications and algorithms in order to optimize the AI workflow and enhance user experience across development, deployment, operations, and maintenance.\n \nopenEuler NEXT: To address the complexity of hardware management, openEuler NEXT supports unified re", "id": 1268700, "language": null, "link": "https://www.youtube.com/watch?v=MjxZlqBIG74", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/MjxZlqBIG74/hqdefault.jpg", "title": "Keynote: How openEuler is Powering Tomorrow's AI/Smart Infrastructure - Xinwei Hu, Chairman of op...", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:13:17+00:00", "description": "Keynote: The Community of Intelligence - Bryan Che, Chief Strategy Officer, Huawei\n\nAI promises to unleash a new wave of productivity, change, and uncertainty. Indeed, many are concerned about the unknown and unpredictable effects of AI. However, the collective open source community provides many inspirations and examples for how to come together to navigate these challenges. At Huawei we believe this “community of intelligence” is ever more crucial as our technologies advance.", "id": 1268704, "language": null, "link": "https://www.youtube.com/watch?v=nAf5My8yyXY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/nAf5My8yyXY/hqdefault.jpg", "title": "Keynote: The Community of Intelligence - Bryan Che, Chief Strategy Officer, Huawei", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:13:17+00:00", "description": "Keynote: The Security Symphony - Emily Fox, Security Lead for Emerging Technologies & Security Community Architect, Red Hat OCTO\n\nA symphony is an elaborate musical composition created from movements that when ordered and structured can inspire, inform, and create a unified experience for the audience. What can we observe and reflect upon in technology that enabled the rising tide of security? As we continue to see experimentation and innovation within the open source ecosystem, new projects are emerging that go beyond singular notes and present security constructs arranged in measures together as useful capabilities. This keynote will explore how each of these elements come together and provide us with the notes to develop the next movement in this symphony.", "id": 1268703, "language": null, "link": "https://www.youtube.com/watch?v=md5Lfxwjtsw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/md5Lfxwjtsw/hqdefault.jpg", "title": "Keynote: The Security Symphony - Emily Fox, Security Lead for Emerging Technologies & Security Co...", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T19:13:17+00:00", "description": "Keynote: Welcome Back - Gabriele Columbro, Executive Director, Fintech Open Source Foundation (FINOS) & General Manager, Linux Foundation Europe\n\nSpeakers: Gabriele Columbro", "id": 1268702, "language": null, "link": "https://www.youtube.com/watch?v=f9j_armU9RI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/f9j_armU9RI/hqdefault.jpg", "title": "Keynote: Welcome Back - Gabriele Columbro, Executive Director, Fintech Open Source Foundation (FI...", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-04T13:00:36+00:00", "description": "Don’t miss out on experiencing the amazing community waiting for you at the #KubeCon + #CloudNativeCon 2024. Be part of the excitement in Salt Lake City this November 12-15! \n\nSecure your spot: https://events.linuxfoundation.org/kubecon-cloudnativecon-north-america/\n#kubecon #cloudnativecon", "id": 1266658, "language": null, "link": "https://www.youtube.com/watch?v=SdK3vkPHbyg", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/SdK3vkPHbyg/hqdefault.jpg", "title": "#KubeCon: Can't miss Event of the Year!", "vote": 0}]