[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-01T20:30:06+00:00", "description": "Test Drive Unlimited 2 came out all the way back in 2011, but after 13 long years of endless waiting, the series’ hiatus is finally about to come to an end. Nacon and KT Racing will soon be releasing Test Drive Unlimited Solar Crown, and based on what we have seen so far, the open world racer is taking promising shape. \n\nFrom its ambitious promises of a large-scale shared world racing experience to the sheer breadth and depth of content that it is touting, there’s a lot about the game that has caught our eye. With its launch drawing ever closer, here, we’re going to go over some of the most crucial details about Test Drive Unlimited Solar Crown that you should know about before you dive into its open world offerings.", "id": 1065068, "language": null, "link": "https://www.youtube.com/watch?v=mdyUDbLZeu4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/mdyUDbLZeu4/hqdefault.jpg", "title": "Test Drive Unlimited Solar Crown - 15 Things You NEED TO KNOW Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-01T16:00:09+00:00", "description": "Few franchises spark debate and conversation to the degree that Metal Gear does, but even within the series, no game has done that quite the way that Metal Gear Solid 5 did. \n\nA lot of that was obviously by design, what with its open world structure and its new approach to storytelling that took so many longtime series fans by surprise, but a lot of Metal Gear Solid 5’s controversy came not from the game, but from the circumstances surrounding it. \n\nHideo Kojima left Konami under acrimonious circumstances shortly after development wrapped up, which capped off what had already been a long and eventful development cycle. Here, we’re going to talk about all of that and more, as we discuss the reveal, development, launch, and more for Ground Zeroes and The Phantom Pain.\n\nCredit for PlayStation Awards 2014:  https://www.youtube.com/watch?v=8LwGJftuDcc\n\nIntro: 0:00\nThe Ruse Cruise Begins 2:00\nFace of the Franchise 6:40\nRuns for the Hills 10:58\nA Flawed Masterpiece 15:22\nThe Phantom Pain 19:", "id": 1064026, "language": null, "link": "https://www.youtube.com/watch?v=Ch2BVmEQLRo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/Ch2BVmEQLRo/hqdefault.jpg", "title": "Metal Gear Solid 5: \"I'm Afraid It's Been NINE YEARS\"", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-01T09:30:10+00:00", "description": "Some of the most popular titles in the world are part of the first-person shooter genre. Whether it's competitive multiplayer titles played in front of thousands online, live service titles that earn millions in revenue, or even story-driven campaigns, they're widespread and extraordinarily successful.\n\nIt's thus challenging to pin down some of the best first-person shooters of all time, especially considering how far the genre has come. Thanks to remasters and \"enhanced\" editions, we can also experience the classics of yesteryear with new quality-of-life features and improved visuals. Of course, you also have more contemporary titles that endure and remain engaging despite their age.\n\nOpinions vary on everyone's favorite shooter, but the world is spoiled for choice considering the sheer range of high-quality titles. Check out our picks for the top 30 best first-person shooters of all time as of 2024.\n\nIntro 0:00\nNumber 30 0:31\nNumber 29 1:14\nNumber 28 1:37\nNumber 27 2:00\nNumber 26 2:", "id": 1061068, "language": null, "link": "https://www.youtube.com/watch?v=GuuqeaArSo4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/GuuqeaArSo4/hqdefault.jpg", "title": "Top 30 Greatest First Person Shooter Games of All Time You Are Not Playing [2024 Edition]", "user": null, "vote": 0}]