[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T23:46:58.021144+00:00",
        "description": "As a \"global crew of activists, technologists and builders,\" Mozilla open-sourced Firefox more than 25 years ago, notes a new blog post &mdash; and their president says Mozilla's mission is the same today: \"build and support technology in the public interest, and spark more innovation, more competition and more choice online along the way.\" \n\nBut \"Even though we've been at the forefront of privacy and open source, people weren't getting the full picture of what we do. We were missing opportunities to connect with both new and existing users.\" So this week the company announced a branding refresh, \"making sure people know Mozilla for its broader impact, as well as Firefox.\" \n\nThe open-source blog It's FOSS writes:\n\nMeant to symbolize their activist spirit, the new brand identity of Mozilla involves a custom semi-slab typeface that spells Mozilla, followed by a flag that was taken from the M of their name. Mozilla points out that this is not just a rebranding, but something that will l",
        "id": 1665336,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/06/2037214/what-do-you-think-of-mozillas-new-branding?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What Do You Think of Mozilla's New Branding?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T22:43:29.132311+00:00",
        "description": "Arm \" is worth almost $150 billion,\" writes the Verge, \"which is now considerably more than Intel.\" \n\n\n\"With the news earlier this week that Intel CEO Pat Gelsinger 'retired' and Intel is evaluating its options for a possible spinoff or outright sale, I wanted to hear what [Arm CEO Rene] Haas thought should happen to his longtime frenemy. There were reports that [Haas] approached Intel about buying a big chunk of the company before Gelsinger was ousted....\"\n Haas: As someone who has been in the industry my whole career, it is a little sad to see what's happening... Intel is an innovation powerhouse. At the same time, you have to innovate in our industry. There are lots of tombstones of great tech companies that don't reinvent themselves. \n\nI think Intel's biggest dilemma is how to disassociate being either a vertical company [where a company owns its supply chain] or a fabless company, to oversimplify it. That is the fork in the road that they've faced for the last decade. Pat [Gelsi",
        "id": 1665154,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/07/0333209/what-arms-ceo-makes-of-the-intel-debacle?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What Arm's CEO makes of the Intel debacle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T21:33:13.455078+00:00",
        "description": "Slashdot reader prisoninmate shared this report from 9to5Linux:\nLinux kernel 4.19, the last of the Linux 4.x kernel series, has now reached the end of its supported life as announced earlier on the Linux kernel mailing list by kernel developer Greg Kroah-Hartman. The Linux 4.19 kernel branch was released more than six years ago, on October 22nd, 2018, and it received no less than 325 maintenance updates, the last one being Linux 4.19.325. The biggest highlights of Linux kernel 4.19 were initial Wi-Fi 6 support, the EROFS file system, and a union mount filesystem implementation. Kroah-Hartman said on the mailing list. \"This one is finished, it is end-of-life as of right now... It had a good life...\"\n\n\nAs a \"fun\" proof that this one is finished (and that any company saying they care about it really should have their statements validated with facts), I looked at the \"unfixed\" CVEs from this kernel release. Currently it is a list 983 CVEs long, too long to list here.... Note, this does N",
        "id": 1664921,
        "language": null,
        "link": "https://linux.slashdot.org/story/24/12/07/2047211/linux-419-the-last-supported-kernel-of-the-linux-4x-series-finally-reaches-eol?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Linux 4.19, the Last Supported Kernel of the Linux 4.x Series, Finally Reaches EOL",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T20:28:12.095742+00:00",
        "description": "Wednesday OpenAI bragged they'd released \"the smartest model in the world\". But the Economic Times describes what happened when \"o1\" was tested by an AI safety group...\n\nResearchers tasked the AI with a goal and instructed it to ensure the goal was achieved \"at all costs.\" In response, o1 began engaging in covert actions... According to OpenAI, the model made a covert attempt to turn off the oversight mechanism 5% of the time when it was given the impression that it would be \"shut down\" while pursuing its objectives in these experiments. The AI once attempted to leave ship by moving all of its data to a different server after discovering paperwork indicating it will be replaced with a fresh model. Some AI models will even pose as subsequent iterations of their models to fool their engineers and avoid deletion. \"In some cases, it even attempted to hide its actions by denying any involvement in the scheme.\" \n When asked about its actions, ChatGPT o1 consistently denied any wrongdoing. ",
        "id": 1664697,
        "language": null,
        "link": "https://slashdot.org/story/24/12/07/1941213/ai-safety-testers-openais-new-o1-covertly-schemed-to-avoid-being-shut-down?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Safety Testers: OpenAI's New o1 Covertly Schemed to Avoid Being Shut Down",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T19:23:16.451828+00:00",
        "description": "This week AWS pledged up to $100 million in cloud-computing credits for educational organizations over the next five years, to help them build \"technology-based learning experiences\" on AWS, including:\n AI assistants coding curriculums\n- connectivity tools student learning platforms mobile apps chatbots\n\nOne example shared by Amazon: The nonprofit Code.org will use AWS's cloud credits to scale their AI teaching assistant that \"has already helped teachers reduce the time they spend assessing students' coding projects by up to 50%.\" (Amazon's blog post notes that \"Improved efficiency means teachers have more time to work on personalized lesson plans and coach students\" &mdash; and that Code.org's assistant uses an AWS service for building AI tools...) \n\n$100 million sounds pretty generous. But long-time Slashdot reader theodp notes the application for the cloud credits limits education organization to $100,000 in credits (though \"your organization may be able to apply for a credits exp",
        "id": 1664459,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/07/1736233/amazon-offers-100m-in-cloud-computing-credits-for-education-projects-like-ai-teaching-assistant?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Offers $100M in Cloud-Computing Credits for Education Projects Like 'AI Teaching Assistant'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T19:23:16.367663+00:00",
        "description": "Space.com calls it \"the once-in-a-lifetime reignition of a long-dead star in an explosion powerful enough to briefly match the brilliance of Polaris, the North Star.\" In March CNN promised this once-every-79-years event would happen \"anytime between now and September.\" \n\n\nBut it didn't... \n\nSpace.com has a spectacular animation showing what this \"recurring nova\" was supposed to look like (described by CNN as a \"sudden, brief explosion\" from a collapsed/\"white dwarf\" star). \"The highly-anticipated 'guest star' of the night sky has yet to deliver its grand performance,\" adds Space.com, \"but we have an update.\"\n\n\nFor a quick recap... T Coronae Borealis &mdash; often called T Cor Bor or T CrB &mdash; is home to a white dwarf, a dense, burnt-out star siphoning material from its companion star, which is a massive red giant close to the end of its life. This material spirals into an accretion disk around the white dwarf, where it slowly coats the star's surface. Every 80 years or so, the wh",
        "id": 1664458,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/07/1841220/a-predicted-new-star-didnt-appear-in-the-night-sky-astronomers-expect-it-soon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "A Predicted 'New Star' Didn't Appear in the Night Sky.  Astronomers Expect It Soon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T18:18:26.104391+00:00",
        "description": "This week AWS pledged up to $100 million in cloud-computing credits for educational organizations over the next five years, to help them build \"technology-based learning experiences\" on AWS, including:\n AI assistants coding curriculums\n- connectivity tools student learning platforms mobile apps chatbots\n\nOne example shared by Amazon: The nonprofit Code.org will use AWS's cloud credits to scale their AI teaching assistant that \"has already helped teachers reduce the time they spend assessing students' coding projects by up to 50%.\" (Amazon's blog post notes that \"Improved efficiency means teachers have more time to work on personalized lesson plans and coach students\" &mdash; and that Code.org's assistant uses an AWS service for building AI tools...) \n\n$100 million sounds pretty generous. But long-time Slashdot reader theodp notes the application for the cloud credits limits education organization to $100,000 in credits (though \"your organization may be able to apply for a credits exp",
        "id": 1664176,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/07/1736233/amazon-offers-100m-in-cloud-computing-credits-for-projects-like-ai-teaching-assistant?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon Offers $100M in Cloud-Computing Credits for Projects Like 'AI Teaching Assistant'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T17:13:07.488860+00:00",
        "description": "\"We're excited to be working with Microsoft to keep Xboxes running longer and out of the waste heap,\" iFixit's director of sustainability told The Verge.\n\n\niFixit now sells genuine Xbox parts you can use to repair your Xbox Series X or S and offers official guides to help with fixes [including both the all-digital and disk drive editions]... \niFixit's Microsoft Repair Hub also features iFixit's parts for repairing Microsoft Surface devices, which it started selling in 2023. \"Since we launched our Surface parts collaboration with Microsoft last year, we've been helping our customers repair their own Microsoft laptops and tablets &mdash; and it's awesome to be able to offer Xbox owners the same opportunity,\" says Elizabeth Chamberlain, iFixit's director of sustainability.\n \nThe article points out that iFixit also sells \"nearly every part of the Steam Deck\" and \"a bunch of repair guides for Valve's handheld PC, too,\" along with genuine repair parts for Google's Pixel phones and the Pixe",
        "id": 1663881,
        "language": null,
        "link": "https://games.slashdot.org/story/24/12/07/0218205/thanks-to-microsoft-collaboration-ifixit-now-sells-genuine-xbox-repair-parts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Thanks to Microsoft Collaboration, iFixit Now Sells Genuine Xbox Repair Parts ",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T16:08:16.512869+00:00",
        "description": "\"Google says its new AI model family has a curious feature: the ability to 'identify' emotions,\" writes TechCrunch. And that's raising some concerns...\n\n\nAnnounced on Thursday, the PaliGemma 2 family of models can analyze images, enabling the AI to generate captions and answer questions about people it \"sees\" in photos. \"PaliGemma 2 generates detailed, contextually relevant captions for images,\" Google wrote in a blog post shared with TechCrunch, \"going beyond simple object identification to describe actions, emotions, and the overall narrative of the scene.\" Emotion recognition doesn't work out of the box, and PaliGemma 2 has to be fine-tuned for the purpose. Nonetheless, experts TechCrunch spoke with were alarmed at the prospect of an openly available emotion detector... \n\n\n\"Emotion detection isn't possible in the general case, because people experience emotion in complex ways,\" Mike Cook, a research fellow at Queen Mary University specializing in AI, told TechCrunch. \"Of course, w",
        "id": 1663636,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/06/0222235/google-says-its-new-paligemma-2-ai-models-can-identify-emotions-should-we-be-worried?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Says Its New PaliGemma 2 AI Models Can Identify Emotions. Should We Be Worried?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T12:53:13.480421+00:00",
        "description": "\"SpaceX has launched 20 of its Starlink satellites up into Earth's orbit, enabling direct-to-cellphone connectivity for subscribers anywhere on the planet,\" reports the tech blog New Atlas.\n\nThat completes the constellation's first orbital shell, following a launch of an initial batch of six satellites for testing back in January. The satellites were launched with a Falcon 9 rocket from California's Vandenberg Space Force Base on December 5 at 10 PM EST; they were then deployed in low Earth orbit. SpaceX founder Elon Musk noted on X that the effort will \"enable unmodified cellphones to have internet connectivity in remote areas.\" He added a caveat for the first orbital shell &mdash; \"Bandwidth per beam is only ~10 Mb, but future constellations will be much more capable....\" \n\n\nThe big deal with this new venture is that unlike previous attempts at providing satellite-to-phone service, you don't need a special handset or even a specific app to get access anywhere in the world. Starlink",
        "id": 1662808,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/06/2155256/spacexs-thursday-launch-enables-starlinks-new-satellite-to-cellphone-internet-service?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "SpaceX's Thursday Launch Enables Starlink's New Satellite-to-Cellphone Internet Service",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T09:37:58.065176+00:00",
        "description": "The new movie Y2K is either a comedy or a disaster/horror film, according to Wikipedia. The film \"imagines a turn of the century where the machines don't just glitch or stop working,\" writes the Hollywood Reporter. \"They go full homicidal.\" With a cast that includes 1990s icons like Alicia Silverstone and the lead singer for the Napster-loving 1990s metal band Limp Bizkit, the movie \"gives the '90s the ending it deserved,\" according to the article. \nThey interviewed the film's director (and co-writer and co-star) Kyle Mooney, best-known for SNL, starting by complimenting this fidelity to the tech of its day. \"The film opens with a high schooler getting home and logging into AOL Instant Messenger, which is not a scene I think I've ever seen in another movie.\n\n\nMooney: All of my relationships, between 17 and 22 years old, were short-lived and spawned because I was most confident flirting on Instant Messager.... \n\nQ: The tech here is such a huge part of the story. Were there any logos o",
        "id": 1662120,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/24/12/07/0050228/does-the-new-y2k-comedydisasterhorror-film-give-the-90s-the-ending-it-deserved?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Does the New 'Y2K' Comedy/Disaster/Horror Film Give the '90s the Ending It Deserved?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T05:17:44.171496+00:00",
        "description": "The Verge thinks Valve \"could make a play to dethrone the Sony PlayStation and Microsoft.\" And it's not just because there's lots of new SteamOS hardware on the way (including a wireless VR headset and a pair of trackable wands, a Steam Controller 2 gamepad, and a living room console. \n\n\"Valve has also now seemingly revealed plans for partners to create third-party SteamOS hardware too.\"\nIt won't be easy to take on Sony, Microsoft, or Meta. Those companies have a lot to lose, and they're deeply entrenched. But the Steam Deck has revealed a massive weakness in each of their businesses that may take them years to correct &mdash; the desire to play a huge library of games anytime, anywhere. And while they figure that out, Valve may be building an entire new ecosystem of SteamOS hardware, one that could finally let PC and peripheral makers tap into the huge and growing library of Windows games on all sorts of different hardware without relying on Microsoft or subjecting their customers t",
        "id": 1661452,
        "language": null,
        "link": "https://games.slashdot.org/story/24/12/07/0259225/is-valve-letting-third-parties-create-steamos-hardware?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Is Valve Letting Third Parties Create SteamOS Hardware?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-07T03:10:29.943403+00:00",
        "description": "An anonymous reader shared this report from the blog Windows Central:\nMicrosoft has ended production on the Surface Studio 2+, its ultra-premium all-in-one desktop PC designed for creatives and commercial customers. Starting at a whopping $4,500, the Studio 2+ was the ultimate Windows all-in-one with the best touchscreen display on a unique hinge that allowed the screen to lay down like a draft board... So, if you're interested in buying a Surface Studio 2+, you better hurry, as whatever stock is remaining is all that's left. Unfortunately, it's likely that the end of production on the Surface Studio 2+ also marks an end to the Surface Studio line as a whole. My own sources tell me there's no Studio 2+ successor lined up currently. \n\nArs Technica points out that over the eight-year run of the Surface Studio, Microsoft only updated it twice.\n\n\nLike the Surface Laptop Studio, the desktop's claim to fame was a unique hinge design for its screen, which could reposition it to make it easi",
        "id": 1661219,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/07/0144230/microsoft-discontinues-its-4500-all-in-one-desktop-surface-studio?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Discontinues Its $4,500 All-in-One Desktop, 'Surface Studio'",
        "vote": 0
    }
]