[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-11T19:30:00+00:00", "description": "With its promise of the ultimate Star Wars scoundrel fantasy set in the first ever open world game the IP has ever seen, Star Wars Outlaws certainly has plenty to live up to, and though there are still some questions over whether or not it’s going to be able to live up to those expectations, what we’ve seen of the game has certainly looked promising. \n\nRecently, in fact, we got another extensive look at Star Wars Outlaws thanks to a new gameplay deep dive at an event, which revealed new details on its combat, stealth, open world, and more. W\n\nith the game’s release in August drawing closer by the day and excitement continuing to build, here, we are going to go over all of those new details.", "language": null, "link": "https://www.youtube.com/watch?v=3oSCU_jnthc", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/3oSCU_jnthc/hqdefault.jpg", "title": "Star Wars Outlaws - 10 BRAND NEW THINGS You May Not Know", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-11T15:30:11+00:00", "description": "The Destiny franchise has had its ups and downs, but the past year has been particularly rough. The failure of Lightfall, the middling seasonal approach - the looter shooter began to feel stale and ultimately inconsequential despite hurtling towards a ten-year story conclusion.\n\nTo say The Final Shape had to deliver is an understatement. Whether that will apply to sales remains to be seen, but in terms of narrative, characterization and story-telling, it's some of the best in the franchise. The sprint to defeat The Witness and prevent the reshaping of humanity is epic but makes enough time for emotional catharsis.\n\nOf course, between well-designed campaign missions, a new region bustling with activities, post-story quests and the raid, there is a lot of quality content to tide over fans of the gameplay. Whether The Final Shape saves the franchise or not, it's peak Destiny content that fans shouldn't miss.", "language": null, "link": "https://www.youtube.com/watch?v=N-uDwgt7zKQ", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/N-uDwgt7zKQ/hqdefault.jpg", "title": "Destiny 2: The Final Shape Review - Peak Destiny Content That Fans Shouldn't Miss", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-11T09:45:04+00:00", "description": "The wait for an Assassin’s Creed game set in feudal Japan has been a long one, but at long last, it has almost come to an end. Assassin’s Creed Shadows is coming this November, and following its announcement in May, at the recent Forward showcase, we got our first proper look at the game thanks to an extensive gameplay walkthrough, as well as a deep dive with developer commentary that followed afterward. \n\nFrom stealth and combat to various different kinds of tools and weapons, seasons and how they will dynamically impact the world, and much more, there were plenty of new details that were revealed on the upcoming open world action RPG thanks to the recent blowout. Here, we are going to go over all of those key details.", "language": null, "link": "https://www.youtube.com/watch?v=hxLOgpRCrf0", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/hxLOgpRCrf0/hqdefault.jpg", "title": "Assassin's Creed Shadows: 10 NEW GAMEPLAY DETAILS You Likely Missed", "user": null, "vote": 0}]