[{"page_rating_contents": 0, "vote": 0, "description": "Among the PlayStation-exclusive titles launching this quarter, Rise of the Ronin from Team Ninja is one to look out for. Set in the Bakumatsu, it's an open-world title, a first for the Nioh developer and one that allows you to make choices (with differing consequences).\n\nIt's not the first hack and slash open world title with a samurai protagonist to be released exclusively for PlayStation. Ghost of Tsushima launched in 2020 and still stands out as an incredible title in its story-telling and combat. There's hope then that Rise of the Ronin can fill that void until a sequel launches.\n\nHowever, there's one area it could end up surpassing Ghost of Tsushima with how it encourages players to engage with the world and become attached to its characters. Find out what that could be here.", "page_rating": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_votes": 0, "user": null, "tags": [], "source_obj__id": 208, "page_rating_visits": 0, "comments": [], "link": "https://www.youtube.com/watch?v=PiWPRmXijko", "permanent": false, "album": "", "thumbnail": "https://i1.ytimg.com/vi/PiWPRmXijko/hqdefault.jpg", "artist": "GamingBolt", "bookmarked": false, "language": null, "dead": false, "title": "PS5 Exclusive Rise of the Ronin Could Surpass Ghost of Tsushima - HERE'S HOW", "age": null, "date_published": "2024-02-04T19:30:02+00:00"}, {"page_rating_contents": 0, "vote": 0, "description": "This new Steampunk inspired fantasy adventure places Victorian-era humans within a universe of vast interconnected realms, a place where magic exists alongside the overarching threat of dangerous, mystical beasts. \n\nAmongst the most anticipated games of 2024, Nightingale is coming to early access on February 22nd, and is the first outing from new studio Inflexion Games. It’s an experience which melds crafting and survival mechanics with engaging combat and portal traversal, but there’s a unique aesthetic at play here too, something of a departure from a team comprising devs who’ve worked on Mass Effect. \n\nThis video aims to outline 13 must-know aspects before delving into the magical world of Nightingale.", "page_rating": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_votes": 0, "user": null, "tags": [], "source_obj__id": 208, "page_rating_visits": 0, "comments": [], "link": "https://www.youtube.com/watch?v=NUILQS1pnCE", "permanent": false, "album": "", "thumbnail": "https://i3.ytimg.com/vi/NUILQS1pnCE/hqdefault.jpg", "artist": "GamingBolt", "bookmarked": false, "language": null, "dead": false, "title": "Ex-Bioware's Nightingale - 13 Things You Need To Know Before You Buy", "age": null, "date_published": "2024-02-04T15:30:08+00:00"}, {"page_rating_contents": 0, "vote": 0, "description": "After years and years of speculation and hype, Rocksteady Games has finally rounded up work on Suicide Squad: Kill the Justice League, a game that could have been a natural next step for the Arkham games. \n\nWhile the game might not hit its stride in the gameplay department, it definitely makes good use of Unreal Engine 4’s visual features to craft a good-looking open world with quality character models and great draw distance. \n\nWith this video, we will be diving into the various technical aspects of the game. Furthermore, we will also be comparing the game’s PC version to its PS5 counterpart along with performance parameters across both platforms and loading times comparison.", "page_rating": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_votes": 0, "user": null, "tags": [], "source_obj__id": 208, "page_rating_visits": 0, "comments": [], "link": "https://www.youtube.com/watch?v=LsrTE9qqikk", "permanent": false, "album": "", "thumbnail": "https://i1.ytimg.com/vi/LsrTE9qqikk/hqdefault.jpg", "artist": "GamingBolt", "bookmarked": false, "language": null, "dead": false, "title": "Suicide Squad: Kill The Justice League PS5 vs PC Graphics Comparison - A Great Looking Shooter", "age": null, "date_published": "2024-02-04T09:30:06+00:00"}]