[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T08:08:14+00:00", "description": "<p>Last Updated on March 29, 2024 We readers are always advised not to buy books because of their covers. But thinking about how we at Grimdark Magazine decide to pick up stories, it becomes clear that covers are key to setting expectations. Just like every retelling of Robin Hood has a bow and arrow somewhere on the cover, grimdark tends to come in shades of black, red and grey. (Of course, there are exceptions.) Covers indicate market positioning and intended audience, as does cover copy. I’m sure all of us have fallen prey to a pretty cover promising something it doesn’t deliver on. However, we’ve reviewed a range of books that fit our definition of grimdark (TL:DR a morally grey protagonist in a world stacked against them) while looking like fun and fluffy reads – the proverbial wolf in a sheep’s pelt. This list will shine a spotlight on books with pretty, colourful covers that you should give a try. Her Majesty&#8217;s Royal Coven by Juno Dawson Her Majesty’s Royal Coven by Juno ", "language": "en-AU", "link": "https://www.grimdarkmagazine.com/top-five-grimdark-stories-hiding-behind-pink-and-pastels", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "Top five grimdark stories hiding behind pink and pastels", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T04:25:44+00:00", "description": "<p>This is a big improvement. I&#8217;m not the kind of guy who gets caught up in trivialities. There&#8217;s plenty of people who would only want a Halo TV show if the Master Chief never removed his helmet, and it only depicted a straight ten-episode adaptation of the first video game with most of it being using Needlers on Grunts. I mean, I&#8217;d watch the hell out of that, but it doesn&#8217;t get into the deeper lore of the Halo universe. Halo does have a pretty deep lore too despite being the Expanded Universe for a bunch of third person shooters. I&#8217;ve read dozens of books in the setting, and they mostly hold up. Unfortunately, Season One wasn&#8217;t good despite the fact it got into things like the recruitment of child soldiers, unethical medical experimentation, the Insurrectionists, and the fact ONI is full of a bunch of incompetent man children. The Halo games were made at the height of the War on Terror and were influenced by the geopolitical situation of the time. ", "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-halo-season-two", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: Halo Season Two", "user": null, "vote": 0}]