[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T23:20:43.215656+00:00", "description": "Victoria Song reports via The Verge: When Gmail launched with a goofy press release 20 years ago next week, many assumed it was a hoax. The service promised a gargantuan 1 gigabyte of storage, an excessive quantity in an era of 15-megabyte inboxes. It claimed to be completely free at a time when many inboxes were paid. And then there was the date: the service was announced on April Fools' Day, portending some kind of prank. But soon, invites to Gmail's very real beta started going out -- and they became a must-have for a certain kind of in-the-know tech fan. At my nerdy high school, having one was your fastest ticket to the cool kids' table. I remember trying to track one down for myself. I didn't know whether I actually needed Gmail, just that all my classmates said Gmail would change my life forever.\n \nTeenagers are notoriously dramatic, but Gmail did revolutionize email. It reimagined what our inboxes were capable of and became a central part of our online identities. The service n", "language": "en-us", "link": "https://tech.slashdot.org/story/24/03/29/2046236/20-years-of-gmail?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "20 Years of Gmail", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T23:20:41.690249+00:00", "description": "LinkedIn is testing support for short-form videos to help it compete with TikTok, YouTube Shorts, Instagram Reels, and other social media platforms. \"[W]e are testing new ways to help members more easily discover timely, relevant videos to watch on LinkedIn,\" Suzi Owens, a company spokesperson, tells Axios in an email. From the report: A new \"Video\" option will appear next to the \"Home\" button at the bottom of the app's navigation bar, per a demo of the feature shared online by Austin Null, strategy director at creative agency McKinney. After tapping it, viewers are led to a feed of short-form videos similar to Instagram Reels and TikTok.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=LinkedIn+Moves+In+On+TikTok's+Turf+With+Short-Form+Videos%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F03%2F29%2F2057202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" hre", "language": "en-us", "link": "https://tech.slashdot.org/story/24/03/29/2057202/linkedin-moves-in-on-tiktoks-turf-with-short-form-videos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "LinkedIn Moves In On TikTok's Turf With Short-Form Videos", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T22:15:34.730476+00:00", "description": "An anonymous reader quotes a report from Ars Technica: NYC's \"MyCity\" ChatBot was rolled out as a \"pilot\" program last October. The announcement touted the ChatBot as a way for business owners to \"save ... time and money by instantly providing them with actionable and trusted information from more than 2,000 NYC Business web pages and articles on topics such as compliance with codes and regulations, available business incentives, and best practices to avoid violations and fines.\" But a new report from The Markup and local nonprofit news site The City found the MyCity chatbot giving dangerously wrong information about some pretty basic city policies. To cite just one example, the bot said that NYC buildings \"are not required to accept Section 8 vouchers,\" when an NYC government info page says clearly that Section 8 housing subsidies are one of many lawful sources of income that landlords are required to accept without discrimination. The Markup also received incorrect information in re", "language": "en-us", "link": "https://yro.slashdot.org/story/24/03/29/2039238/nycs-government-chatbot-is-lying-about-city-laws-and-regulations?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NYC's Government Chatbot Is Lying About City Laws and Regulations", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T21:10:36.767573+00:00", "description": "U.S. users have just a few more days to make the transition from Google Podcasts as the company moves forward with the process of discontinuing the service globally. From a report: Google is currently sending in-app notifications to users in the U.S. that starting April 2nd they will no longer be able to use Google Podcasts and is recommending to export subscriptions to YouTube Music. The Google Podcasts streaming service launched six years ago. It's app has more than 500 million downloads on Google Play and apart from offering a large selection of podcasts it also allows subscribing to favorite channels, downloading and playing on various devices. The service integrates with Google's ecosystem, providing users with personalized recommendations based on interests, listening history, and preferences.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Podcasts+Service+Shuts+Down+in+the+US+Next+Week%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%", "language": "en-us", "link": "https://tech.slashdot.org/story/24/03/29/1910235/google-podcasts-service-shuts-down-in-the-us-next-week?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Podcasts Service Shuts Down in the US Next Week", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T21:10:34.869893+00:00", "description": "According to The Information (paywalled), Microsoft and OpenAI are planning a $100 billion datacenter project that will include an artificial intelligence supercomputer called \"Stargate.\" Reuters reports: The Information reported that Microsoft would likely be responsible for financing the project, which would be 100 times more costly than some of the biggest current data centers, citing people involved in private conversations about the proposal. OpenAI's next major AI upgrade is expected to land by early next year, the report said, adding that Microsoft executives are looking to launch Stargate as soon as 2028. The proposed U.S.-based supercomputer would be the biggest in a series of installations the companies are looking to build over the next six years, the report added.\n \nThe Information attributed the tentative cost of $100 billion to a person who spoke to OpenAI CEO Sam Altman about it and a person who has viewed some of Microsoft's initial cost estimates. It did not identify ", "language": "en-us", "link": "https://slashdot.org/story/24/03/29/1915222/microsoft-openai-plan-100-billlion-stargate-ai-supercomputer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft, OpenAI Plan $100 Billlion 'Stargate' AI Supercomputer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T20:05:32.271067+00:00", "description": "An anonymous reader quotes a report from Axios: OpenAI said on Friday it's allowed a small number of businesses to test a new tool that can recreate a person's voice from just a 15-second recording. The company said it is taking \"a cautious and informed approach\" to releasing the program, called Voice Engine, more broadly given the high risk of abuse presented by synthetic voice generators.\n \nBased on the 15-second recording, the program can create a \"emotive and realistic\" natural-sounding voice that closely resembles the original speaker. This synthetic voice can then be used to read text inputs, even if the text isn't in the original speaker's native language. In one example offered by the company, an English speaker's voice was translated into Spanish, Mandarin, German, French and Japanese while preserving the speaker's native accent.\n \nOpenAI said Voice Engine has so far been used to provide reading assistance to non-readers, translate content and to help people who are non-verba", "language": "en-us", "link": "https://slashdot.org/story/24/03/29/193257/openai-reveals-ai-tool-to-recreate-human-voices?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Reveals AI Tool To Recreate Human Voices", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T20:05:30.770084+00:00", "description": "Anton Shilov reports via Tom's Hardware: About half of the processors packaged in Russia are defective. This has prompted Baikal Electronics, a Russian processor developer, to expand the number of packaging partners in the country, according to a report in Vedomosti, a Russian-language business daily newspaper published in Moscow (hat tip to Cnews). In addition to GS Group based in Kaliningrad, the company will now use Milandr and Mikron, which are based in Zelenograd, a town near Moscow. What remains unclear is which foundry initially produces the chips for Baikal. [...]\n \nThere are no contract chipmakers in Russia that can process wafers on 28nm-class fabrication technologies, so Baikal is likely using a Chinese foundry to make its processors. Since 2021, the company has been experimenting with localizing chip packaging at GS Group in Kaliningrad. But transitioning to local packaging has not been smooth. The process is intricate and costly, leading to a high rate of defects. Accordi", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/03/29/198209/half-of-russian-made-chips-are-defective?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Half of Russian-Made Chips Are Defective", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T19:00:29.904609+00:00", "description": "Abstract of a paper on Nature: Online media is important for society in informing and shaping opinions, hence raising the question of what drives online news consumption. Here we analyse the causal effect of negative and emotional words on news consumption using a large online dataset of viral news stories. Specifically, we conducted our analyses using a series of randomized controlled trials (N=22,743). Our dataset comprises ~105,000 different variations of news stories from Upworthy.com that generated 5.7 million clicks across more than 370 million overall impressions. Although positive words were slightly more prevalent than negative words, we found that negative words in news headlines increased consumption rates (and positive words decreased consumption rates). For a headline of average length, each additional negative word increased the click-through rate by 2.3%. Our results contribute to a better understanding of why users engage with online media.<p><div class=\"share_submissi", "language": "en-us", "link": "https://news.slashdot.org/story/24/03/29/1551248/negativity-drives-online-news-consumption?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Negativity Drives Online News Consumption", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T17:55:48.200793+00:00", "description": "When a long-term memory forms, some brain cells experience a rush of electrical activity so strong that it snaps their DNA. Then, an inflammatory response kicks in, repairing this damage and helping to cement the memory, a study in mice shows. Nature: The findings, published on 27 March in Nature, are \"extremely exciting,\" says Li-Huei Tsai, a neurobiologist at the Massachusetts Institute of Technology in Cambridge who was not involved in the work. They contribute to the picture that forming memories is a \"risky business,\" she says. Normally, breaks in both strands of the double helix DNA molecule are associated with diseases including cancer. But in this case, the DNA damage-and-repair cycle offers one explanation for how memories might form and last. \n\nIt also suggests a tantalizing possibility: this cycle might be faulty in people with neurodegenerative diseases such as Alzheimer's, causing a build-up of errors in a neuron's DNA, says study co-author Jelena Radulovic, a neuroscient", "language": "en-us", "link": "https://science.slashdot.org/story/24/03/29/1535208/memories-are-made-by-breaking-dna---and-fixing-it?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Memories Are Made By Breaking DNA - and Fixing It", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T16:50:54.065676+00:00", "description": "Hillary Clinton and U.S. election officials said they are concerned disinformation generated and spread by AI could threaten the 2024 presidential election [non-paywalled link]. WSJ: Clinton, a former secretary of state and 2016 presidential candidate, said she thinks foreign actors like Russian President Vladimir Putin could use AI to interfere in elections in the U.S. and elsewhere. Dozens of countries are running elections this year. \"Anybody who's not worried is not paying attention,\" Clinton said Thursday at Columbia University, where election officials and tech executives discussed how AI could impact global elections. \n\nShe added: \"It could only be a very small handful of people in St. Petersburg or Moldova or wherever they are right now who are lighting the fire, but because of the algorithms everyone gets burned.\" Clinton said Putin tried to undermine her before the 2016 election by spreading disinformation on Facebook, Twitter and Snapchat about \"all these terrible things\" s", "language": "en-us", "link": "https://politics.slashdot.org/story/24/03/29/1334258/hillary-clinton-election-officials-warn-ai-could-threaten-elections?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Hillary Clinton, Election Officials Warn AI Could Threaten Elections", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T16:50:52.222281+00:00", "description": "Algorithms might help hotels illegally collude on prices, even if no humans from those businesses actually talk to each other about them, according to US antitrust enforcers. From a report: The Department of Justice and Federal Trade Commission jointly submitted a statement of interest in Cornish-Adebiyi v. Caesars Entertainment, a case brought before the US District Court of New Jersey. The class action case was brought by New Jersey residents who rented rooms in Atlantic City hotels and alleged that several of those hotels engaged in an illegal price-fixing conspiracy through the use of a common pricing algorithm. \n\nThe plaintiffs are trying to show that the hotels violated Section 1 of the Sherman Act, which prohibits \"conspiracy in restraint of trade\" and is used to prosecute illegal price-fixing. They say that the hotels allegedly used a pricing algorithm platform called Rainmaker, knowing that their competitors were also using the platform and choosing it for that reason. The ag", "language": "en-us", "link": "https://news.slashdot.org/story/24/03/29/1519218/algorithms-can-aid-price-collusion-even-if-no-humans-actually-talk-to-each-other-us-enforcers-say?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Algorithms Can Aid Price Collusion, Even If No Humans Actually Talk To Each Other, US Enforcers Say", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T15:45:03.095844+00:00", "description": "Former U.S. Treasury Secretary Larry Summers, now on the board of ChatGPT developer OpenAI, believes that while AI has the potential to revolutionize the economy, its impact will take time to materialize. However, Summers maintains that AI could be the biggest economic development since the Industrial Revolution, eventually replacing most forms of human labor, particularly cognitive tasks. He said: \"If one takes a view over the next generation, this could be the biggest thing that has happened in economic history since the Industrial Revolution,\"he added. \"This offers the prospect of not replacing some forms of human labor, but almost all forms of human labor.\" \n\nFrom building homes to making medical diagnoses, Summers predicted that AI will eventually be able to do nearly every human job, particularly white collar workers' \"cognitive labor.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Larry+Summers%2C+Now+an+OpenAI+Board+Member%2C+Thinks+", "language": "en-us", "link": "https://tech.slashdot.org/story/24/03/29/1246248/larry-summers-now-an-openai-board-member-thinks-ai-could-replace-almost-all-forms-of-labor?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Larry Summers, Now an OpenAI Board Member, Thinks AI Could Replace 'Almost All' Forms of Labor", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T15:45:01.591823+00:00", "description": "The US has seen a significant increase in student absenteeism since the pandemic closed schools four years ago, with an estimated 26% of public school students considered chronically absent in the last school year, up from 15% before the pandemic, according to data from 40 states and Washington, D.C. A report adds: The increases have occurred in districts big and small, and across income and race. For districts in wealthier areas, chronic absenteeism rates have about doubled, to 19 percent in the 2022-23 school year from 10 percent before the pandemic, a New York Times analysis of the data found. Poor communities, which started with elevated rates of student absenteeism, are facing an even bigger crisis: Around 32 percent of students in the poorest districts were chronically absent in the 2022-23 school year, up from 19 percent before the pandemic. Even districts that reopened quickly during the pandemic, in fall 2020, have seen vast increases.<p><div class=\"share_submission\">\n<a clas", "language": "en-us", "link": "https://news.slashdot.org/story/24/03/29/1322242/chronic-student-absenteeism-soars-across-us?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Chronic Student Absenteeism Soars Across US", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T14:40:54.780855+00:00", "description": "An anonymous reader shares a report: Mutterings of alarm are emerging from the cloisters of Red Hat after the world's largest management consultancy was hired to help the IBM subsidiary focus engineers on their highest-value work. Red Hat confirmed the partnership with McKinsey &amp; Company to The Reg, sharing this extract from an email from CTO Chris Wright to the Global Engineering Team: \n\n\"Hey everyone -- as I mentioned during the recent Q1 All Hands, my goal is to have Global Engineering recognized as the world's greatest open-source software engineering organization. This team is already doing amazing work, and we have several initiatives in progress to help us achieve the goal I've set. One of those is a partnership with McKinsey. The objective of this project is to help us understand and incorporate learnings on working models, development practices, and tooling from across the software industry. \n\n\"We've heard your feedback in person, during All Hands, and through RHAS [the a", "language": "en-us", "link": "https://linux.slashdot.org/story/24/03/29/1235217/red-hat-tries-on-a-mckinsey-cap-in-quest-to-streamline-techies-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Red Hat Tries on a McKinsey Cap in Quest To Streamline Techies' Jobs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T13:36:06.077463+00:00", "description": "An anonymous reader quotes a report from GamingOnLinux: After repeatedly suffering issues with scam apps making it onto the Snap Store, Canonical maker of Ubuntu Linux have now decided to manually look over submissions. I've covered the issues with the Snap Store a few times now like on March 19th when ten scam crypto apps appeared, got taken down and then reappeared under a different publisher. Also earlier back in February there was an issue where a user actually lost their wallet as a result of a fake app. Multiple fake apps were also put up back in October last year as well, so it was a repeating issue that really needed dealing with properly.\n \nSo to try and do something about it, Canonical's Holly Hall has posted on their Discourse forum about how \"The Store team and other engineering teams within Canonical have been continuously monitoring new snaps that are being registered, to detect potentially malicious actors\" and that they will now do manual reviews whenever people try to", "language": "en-us", "link": "https://news.slashdot.org/story/24/03/29/0022218/canonical-now-doing-manual-reviews-for-new-packages-due-to-scam-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Canonical Now Doing Manual Reviews For New Packages Due To Scam Apps", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T10:20:22.333434+00:00", "description": "Lyle Smith reports via StorageReview.com: Proxmox has introduced a new import wizard for Proxmox Virtual Environment (VE), aiming to simplify the migration process for importing VMware ESXi VMs. This new feature comes at an important time in the industry, as it aims to ease the transition for these organizations looking to move away from VMware's vSphere due to high renewal costs.\n \nThe new import wizard is integrated into Proxmox VE's existing storage plugin system, allowing for direct integration into the platform's API and web-based user interface. It offers users the ability to import VMware ESXi VMs in their entirety, translating most of the original VM's configuration settings to Proxmox VE's configuration model (all while minimizing downtime). Currently, the import wizard is in a technical preview state, having been added during the Proxmox VE 8.2 development cycle. Although it is still under active development, early reports suggest the wizard is stable and holds considerable ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/03/29/009228/proxmox-import-wizard-makes-for-easy-vmware-vm-migrations?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Proxmox Import Wizard Makes for Easy VMware VM Migrations", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T08:10:29.652563+00:00", "description": "Apple has sued its former employee Andrew Aude for leaking information about more than a half-dozen Apple products and policies, including its then-unannounced Journal app and Vision Pro headset, product development policies, strategies for regulatory compliance, employee headcounts, and more. MacRumors reports: Aude joined Apple as an iOS software engineer in 2016, shortly after graduating college. He worked on optimizing battery performance, making him \"privy to information regarding dozens of Apple's most sensitive projects,\" according to the complaint. In April 2023, for example, Apple alleges that Aude leaked a list of finalized features for the iPhone's Journal app to a journalist at The Wall Street Journal on a phone call. That same month, The Wall Street Journal's Aaron Tilley published a report titled \"Apple Plans iPhone Journaling App in Expansion of Health Initiatives.\"\n \nUsing the encrypted messaging app Signal, Aude is said to have sent \"over 1,400\" messages to the same j", "language": "en-us", "link": "https://yro.slashdot.org/story/24/03/29/0017219/apple-sues-former-employee-for-leaking-journal-app-vision-pro-details?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Sues Former Employee For Leaking Journal App, Vision Pro Details", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T03:49:32.690092+00:00", "description": "An anonymous reader quotes a report from the New York Times: They're vast expanses that can be as big as towns: open landfills where household waste ends up, whether it's vegetable scraps or old appliances. These landfills also belch methane, a powerful, planet-warming gas, on average at almost three times the rate reported to federal regulators, according to a study published Thursday in the journal Science.\n \nFor the new study, scientists gathered data from airplane flyovers using a technology called imaging spectrometers designed to measure concentrations of methane in the air. Between 2018 and 2022, they flew planes over 250 sites across 18 states, about 20 percent of the nation's open landfills. At more than half the landfills they surveyed, researchers detected emissions hot spots, or sizable methane plumes that sometimes lasted months or years. That suggested something had gone awry at the site, like a big leak of trapped methane from layers of long-buried, decomposing trash, t", "language": "en-us", "link": "https://news.slashdot.org/story/24/03/28/2342238/methane-from-landfills-is-a-big-driver-of-climate-change-study-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Methane From Landfills Is a Big Driver of Climate Change, Study Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T01:40:25.001155+00:00", "description": "The Palisades Nuclear Plant in Michigan has won a $1.5 billion conditional federal loan to reopen after being closed for decommissioning in 2022. Canary Media reports: If the loan is granted (subject to Holtec meeting closing conditions) and the 800-megawatt reactor located on Lake Michigan is repowered, it would be the first nuclear plant in the U.S. to reopen after being closed for decommissioning. Surprisingly, it would be just the second or third reactor to restart in the history of global civil nuclear power, according to Mycle Schneider, lead author of the World Nuclear Industry Status Report 2023, in an interview with Bulletin of the Atomic Scientists.\n \nHoltec purchased Palisades a month after it shut down with plans to mothball the site, but plans changed. Now the firm, which specializes in nuclear waste management and decommissioning (as opposed to rebuilding and operating nuclear plants), intends to revive the plant instead. Holtec plans to get the power plant restarted by ", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/03/28/2334245/michigan-nuclear-plant-aims-to-be-first-ever-to-reopen-in-us?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Michigan Nuclear Plant Aims To Be First Ever To Reopen In US", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T00:36:11.393334+00:00", "description": "Starting next month, Meta's Ray-Ban smart glasses will support multimodal AI features to perform translation, along with object, animal, and monument identification. The Verge reports: Users can activate the glasses' smart assistant by saying \"Hey Meta,\" and then saying a prompt or asking a question. It will then respond through the speakers built into the frames. The NYT offers a glimpse at how well Meta's AI works when taking the glasses for a spin in a grocery store, while driving, at museums, and even at the zoo.\n \nAlthough Meta's AI was able to correctly identify pets and artwork, it didn't get things right 100 percent of the time. The NYT found that the glasses struggled to identify zoo animals that were far away and behind cages. It also didn't properly identify an exotic fruit, called a cherimoya, after multiple tries. As for AI translations, the NYT found that the glasses support English, Spanish, Italian, French, and German.<p><div class=\"share_submission\">\n<a class=\"slashpo", "language": "en-us", "link": "https://meta.slashdot.org/story/24/03/28/2135223/meta-is-adding-ai-to-its-ray-ban-smart-glasses?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Is Adding AI To Its Ray-Ban Smart Glasses", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-29T00:36:09.273805+00:00", "description": "Tobias Mann reports via The Register: Cloud server provider Vultr has rapidly revised its terms-of-service after netizens raised the alarm over broad clauses that demanded the \"perpetual, irrevocable, royalty-free\" rights to customer \"content.\" The red tape was updated in January, as captured by the Internet Archive, and this month users were asked to agree to the changes by a pop-up that appeared when using their web-based Vultr control panel. That prompted folks to look through the terms, and there they found clauses granting the US outfit a \"worldwide license ... to use, reproduce, process, adapt ... modify, prepare derivative works, publish, transmit, and distribute\" user content.\n \nIt turned out these demands have been in place since before the January update; customers have only just noticed them now. Given Vultr hosts servers and storage in the cloud for its subscribers, some feared the biz was giving itself way too much ownership over their stuff, all in this age of AI trainin", "language": "en-us", "link": "https://yro.slashdot.org/story/24/03/28/2319230/cloud-server-host-vultr-rips-user-data-ownership-clause-from-tos-after-web-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cloud Server Host Vultr Rips User Data Ownership Clause From ToS After Web Outage", "user": null, "vote": 0}]