[{"album": "", "permanent": false, "artist": "GamingBolt", "page_rating_votes": 0, "title": "MLB The Show 24 - 15 Things YOU NEED TO KNOW Before You Buy", "language": null, "bookmarked": false, "page_rating_contents": 0, "source_obj__id": 129, "user": null, "dead": false, "page_rating": 0, "date_published": "2024-03-10T21:00:24+00:00", "page_rating_visits": 0, "vote": 0, "thumbnail": "https://i2.ytimg.com/vi/yLv4Iji5xDI/hqdefault.jpg", "link": "https://www.youtube.com/watch?v=yLv4Iji5xDI", "age": null, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "tags": [], "description": "San Diego Studio’s baseball simulation MLB The Show has created a reputation for itself as one of the most consistent and reliable sports simulation video games available. This year’s iteration – MLB The Show 24 – looks like it’ll be another homerun for the studio. \n\nLongstanding features such as Diamond Dynasty and Franchise Mode will of course return, but the Negro Leagues Storyline mode first introduced last year returns for its second season, and with its immersive retelling of important eras in the history of baseball its positioning itself as one of the most seminal features of the series. \n\nThis feature aims to unpack all there is to know before committing to a pre-order, including release dates, new feature highlights, and platform availability."}, {"album": "", "permanent": false, "artist": "GamingBolt", "page_rating_votes": 0, "title": "Why I Am SUPER EXCITED For Death Stranding 2...", "language": null, "bookmarked": false, "page_rating_contents": 0, "source_obj__id": 129, "user": null, "dead": false, "page_rating": 0, "date_published": "2024-03-10T17:00:14+00:00", "page_rating_visits": 0, "vote": 0, "thumbnail": "https://i4.ytimg.com/vi/OrZgf0MUe9o/hqdefault.jpg", "link": "https://www.youtube.com/watch?v=OrZgf0MUe9o", "age": null, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "tags": [], "description": "Kojima Productions delivered an amazing game in the form of Death Stranding, an experience that could be termed as something that was way ahead of its time. \n\nWith its innovative strand type gameplay and fleshed-out world, Death Standing was able to capture the hearts of many fans and the developer is hard at work on a sequel in the form of Death Stranding 2: On the Beach. \n\nScheduled to come out next year, there are plenty of ways in which the sequel could build upon the original in new and interesting ways, in turn making for a game that could truly showcase the potential of a Strand-type experience."}, {"album": "", "permanent": false, "artist": "GamingBolt", "page_rating_votes": 0, "title": "What The HELL Is Lightyear Frontier?", "language": null, "bookmarked": false, "page_rating_contents": 0, "source_obj__id": 129, "user": null, "dead": false, "page_rating": 0, "date_published": "2024-03-10T09:30:18+00:00", "page_rating_visits": 0, "vote": 0, "thumbnail": "https://i3.ytimg.com/vi/bBp3HP039IY/hqdefault.jpg", "link": "https://www.youtube.com/watch?v=bBp3HP039IY", "age": null, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "tags": [], "description": "The survival genre has exploded in popularity as of late, with dozens of games from developers all across the board providing their take on the survival formula. This has led to somewhat of a homogenization across the genre, so games that dare to do something differently instantly catch the attention of everyone. \n\nThis includes but is not limited to Amplifier Studios’ upcoming Lightyear Frontier, which combines the relaxing elements of games like Stardew Valley within the framework of a survival game. \n\nWith this video, we talk about its various aspects ranging from the gameplay to story elements and art design, and try to break down why you need to look forward to it. We also talk about how the developer’s vision for the future of the game inspires confidence in its ability to deliver a compelling experience in the long run."}]