[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T20:30:08+00:00", "description": "Lorelei and the Laser Eyes is an experience that’s more than the sum of its parts. It’s not a game that will appeal to everyone, given its singular vision and how much it adheres to it, and as I mentioned, the game has some shortcomings that could grate on the player. But it is extremely unique, extremely immersive, and very, very, very distinct to video games as a medium. \n\nLike this developer’s previous games, this is a title that you may come away from untouched or may find making a surprisingly large impression on you. It depends on just how much you find yourself in the footsteps of Lorelei as she tries to uncover the truth. But for me, the experience was incredibly unique, and well worth it. If you’re at all a fan of mystery stories, adventure games, or just really unique experiences, your takeaway will hew far closer to mine — and you’ll come away really enjoying what this game has to offer.", "language": null, "link": "https://www.youtube.com/watch?v=tBtTCE6abgw", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/tBtTCE6abgw/hqdefault.jpg", "title": "This Amazing Game Will Likely Be Missed By Many Players...", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T15:30:21+00:00", "description": "It's safe to say that Xbox is finding itself in a rock and a hard place, with the constant stream of bad decisions with the most recent incident being the closure of Tango Gameworks and Arkane Austin. It's disheartening to see a brand that was once a pioneer of innovation getting devolved to a point where it's existence in the foreseeable future is looking questionable to say the least. \n\nIt's clear that Xbox has a very visible gap in what it wishes to be and what it's becoming by virtue of its poor decisions. What's more baffling is that the company already has a great infrastructure and resources to turn its wheels around, but it just refuses to put in the required effort to make things right after all this time.", "language": null, "link": "https://www.youtube.com/watch?v=rHDi3cf6ZIM", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/rHDi3cf6ZIM/hqdefault.jpg", "title": "As An Xbox Fan, Their Current State Makes Me SAD", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T13:30:05+00:00", "description": "Several underrated titles have been released throughout the years, some deserving more appreciation than others after numerous updates and fixes. However, there's also the curious case of Experiment 101's Biomutant.\n\nHyped as offering an open world with action RPG combat, from third-person shooting to Wung-Fu melee, it also features a system that influenced the story, a loot system, vehicles and much more. The sheer scale was impressive, but upon release, Biomutant felt like it lagged in almost every single metric. Between the bland open world, boring story, uninteresting gameplay and ridiculous characters, it just didn't click.\n \nNot that this stopped Biomutant from achieving success, however. With the Switch version and numerous updates over the years, has it improved? Are there reasons to revisit it? Check out our thoughts to learn more.", "language": null, "link": "https://www.youtube.com/watch?v=CccakpzqN8k", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/CccakpzqN8k/hqdefault.jpg", "title": "3 Years Later, IS BIOMUTANT FINALLY FIXED?", "user": null, "vote": 0}]