[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T03:23:00+00:00", "description": "FRONTLINE and the Venezuelan news outlet Armando.info investigate Alex Saab, a shadowy figure at the heart of a corruption scandal spanning from Venezuela to the U.S., and explore what has happened to the journalists who helped uncover the scandal.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate/\n\nIn 2016, as Venezuela was in economic freefall, President Nicolás Maduro’s government responded with the CLAP program: a domestic aid initiative that was billed as providing high-quality, essential food items to Venezuelans impacted by the economic crisis. But as the FRONTLINE and Armando.info documentary shows, complaints about powdered milk in the CLAP boxes soon caught the attention of a team of journalists. Armando.info requested a chemical analysis of a few of the milk products, and a researcher they consulted noted some were so deficient in calcium and high in sodium they couldn’t be classified as milk at all.\n \nArm", "language": null, "link": "https://www.youtube.com/watch?v=BgzTAG_Vhn4", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "source_obj__id": 109, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/BgzTAG_Vhn4/hqdefault.jpg", "title": "A Dangerous Assignment: Uncovering Corruption in Maduro’s Venezuela (full documentary) | FRONTLINE", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T01:57:46+00:00", "description": "Watch the opening sequence of \"A Dangerous Assignment: Uncovering Corruption in Maduro's Venezuela,\" a 90-minute documentary from FRONTLINE and Armando.info.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate​\n\nIn \"A Dangerous Assignment,\" premiering Tues., May 14, 2024, FRONTLINE and the Venezuelan news outlet Armando.info investigate the shadowy figure at the heart of a corruption scandal spanning from Venezuela to the U.S. This 90-minute documentary tells the inside story of Alex Saab, his capture and then release by the U.S. in a controversial prisoner swap, and what has happened to the journalists who helped uncover the corruption scandal.\n\nLearn more & explore additional reporting connected to “A Dangerous Assignment” on our website: https://to.pbs.org/44FR7BE\n\n“A Dangerous Assignment: Uncovering Corruption in Maduro’s Venezuela” is an Assignment Film production for GBH/FRONTLINE in association with Armando.info", "language": null, "link": "https://www.youtube.com/watch?v=KAkIehy5M9c", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "source_obj__id": 109, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/KAkIehy5M9c/hqdefault.jpg", "title": "Watch the Opening Sequence of 'A Dangerous Assignment' | FRONTLINE + Armando.info", "user": null, "vote": 0}]