[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T22:58:29.574456+00:00", "description": "Google is opening up API access to its Google Home smart home platform, allowing app developers to access over 600 million connected devices and tap into the Google Home automation engine. In addition, Google announced that it'll be turning Google TVs into Google Home hubs and Matter controllers. The Verge reports: The Home APIs can access any Matter device or Works with Google Home device, and allows developers to build their own experiences using Google Home devices and automations into their apps on both iOS and Android. This is a significant move for Google in opening up its smart home platform, following shutting down its Works with Nest program back in 2019. [...] The Home APIs are already available to Google's early access partners, and Google is opening up a waitlist for any developer to sign up today. \"We are opening up access on a rolling basis so they can begin building and testing within their apps,\" Anish Kattukaran, head of product at Google Home and Nest, told The Verge", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/15/2024256/google-opens-up-its-smart-home-to-everyone?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Opens Up Its Smart Home To Everyone", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T22:58:27.660569+00:00", "description": "An anonymous reader quotes a report from New Scientist: Efforts to build a global quantum internet have received a boost from two developments in quantum information storage that could one day make it possible to communicate securely across hundreds or thousands of kilometers. The internet as it exists today involves sending strings of digital bits, or 0s and 1s, in the form of electrical or optical signals, to transmit information. A quantum internet, which could be used to send unhackable communications or link up quantum computers, would use quantum bits instead. These rely on a quantum property called entanglement, a phenomenon in which particles can be linked and measuring one particle instantly influences the state of another, no matter how far apart they are. Sending these entangled quantum bits, or qubits, over very long distances, requires a quantum repeater, a piece of hardware that can store the entangled state in memory and reproduce it to transmit it further down the line", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/15/2032244/quantum-internet-draws-near-thanks-to-entangled-memory-breakthroughs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Quantum Internet Draws Near Thanks To Entangled Memory Breakthroughs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T21:53:14.991162+00:00", "description": "This week, in celebration of Global Accessibility Awareness Day, Apple is introducing several new accessibility features. Noteworthy additions include eye-tracking support for recent iPhone and iPad models, customizable vocal shortcuts, music haptics, and vehicle motion cues. Engadget reports: The most intriguing feature of the set is the ability to use the front-facing camera on iPhones or iPads (at least those with the A12 chip or later) to navigate the software without additional hardware or accessories. With this enabled, people can look at their screen to move through elements like apps and menus, then linger on an item to select it. That pause to select is something Apple calls Dwell Control, which has already been available elsewhere in the company's ecosystem like in Mac's accessibility settings. The setup and calibration process should only take a few seconds, and on-device AI is at work to understand your gaze. It'll also work with third-party apps from launch, since it's a ", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/15/2012232/apple-brings-eye-tracking-to-recent-iphones-and-ipads?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Brings Eye-Tracking To Recent iPhones and iPads", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T20:48:35.117520+00:00", "description": "An anonymous reader shares a report: There are concerning reports on Reddit that Apple's latest iOS 17.5 update has introduced a bug that causes old photos that were deleted -- in some cases years ago -- to reappear in users' photo libraries. After updating their iPhone, one user said they were shocked to find old NSFW photos that they deleted in 2021 suddenly showing up in photos marked as recently uploaded to iCloud. Other users have also chimed in with similar stories. \"Same here,\" said one Redditor. \"I have four pics from 2010 that keep reappearing as the latest pics uploaded to iCloud. I have deleted them repeatedly.\" \"Same thing happened to me,\" replied another user. \"Six photos from different times, all I have deleted. Some I had deleted in 2023.\" More reports have been trickling in overnight. One said: \"I had a random photo from a concert taken on my Canon camera reappear in my phone library, and it showed up as if it was added today.\"<p><div class=\"share_submission\">\n<a class", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/15/1920242/troubling-ios-175-bug-reportedly-resurfacing-old-deleted-photos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Troubling iOS 17.5 Bug Reportedly Resurfacing Old Deleted Photos", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T20:48:33.595781+00:00", "description": "With Amazon on its heels, the nation's biggest company by revenue is hunting for ways to continue growing. From a report: For a decade, Walmart has reigned as the nation's biggest company by revenue. Its sales last year added up to $648 billion -- more than $1.2 million a minute. That status comes with benefits. It gives Walmart power in negotiations with product manufacturers and in dealing with government officials over policy issues. It's also a point of pride: Job postings often tout working at the \"Fortune 1\" company as a perk. Its reign is looking shaky lately [non-paywalled link]. If current sales trends persist, Amazon is likely to overtake Walmart soon. Amazon reported $575 billion in total revenue last year, up 12% from the previous year, compared with Walmart's revenue growth of 6%. \n\nWalmart's behemoth size means that to meet its own sales target of around 4% growth each year, the company has to find an additional $26 billion in sales this year. That's no easy task. About ", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/15/1927245/walmarts-reign-as-americas-biggest-retailer-is-under-threat?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Walmart's Reign as America's Biggest Retailer Is Under Threat", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T20:48:32.110853+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Google's I/O conference is still happening, and while the big keynote was yesterday, major Android beta releases have apparently been downgraded to Day 2 of the show. Google really seems to want to be primarily an AI company now. Android already had some AI news yesterday, but now that the code-red requirements have been met, we have actual OS news. One of the big features in this release is \"Private Space,\" which Google says is a place where users can \"keep sensitive apps away from prying eyes, under an additional layer of authentication.\"\n \nFirst, there's a new hidden-by-default portion of the app drawer that can hold these sensitive apps, and revealing that part of the app drawer requires a second round of lock-screen authentication, which can be different from the main phone lock screen. Just like \"Work\" apps, the apps in this section run on a separate profile. To the system, they are run by a separate \"user\" with separate dat", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/15/204240/android-15-gets-private-space-theft-detection-and-av1-support?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Android 15 Gets 'Private Space,' Theft Detection, and AV1 Support", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T17:57:23.279836+00:00", "description": "A bipartisan group of four senators led by Majority Leader Chuck Schumer is recommending that Congress spend at least $32 billion over the next three years to develop AI and place safeguards around it, writing in a report released Wednesday that the U.S. needs to \"harness the opportunities and address the risks\" of the quickly developing technology. AP: The group of two Democrats and two Republicans said in an interview Tuesday that while they sometimes disagreed on the best paths forward, it was imperative to find consensus with the technology taking off and other countries like China investing heavily in its development. They settled on a raft of broad policy recommendations that were included in their 33-page report. While any legislation related to AI will be difficult to pass, especially in an election year and in a divided Congress, the senators said that regulation and incentives for innovation are urgently needed.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/15/1729251/senators-urge-32-billion-in-emergency-spending-on-ai-after-finishing-yearlong-review?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Senators Urge $32 Billion in Emergency Spending on AI After Finishing Yearlong Review", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T16:53:23.439583+00:00", "description": "The FBI has seized the notorious BreachForums hacking forum that leaked and sold stolen corporate data to other cybercriminals. From a report: The seizure occurred on Wednesday morning, soon after the site was used last week to leak data stolen from a Europol law enforcement portal. The website is now displaying a message stating that the FBI has taken control over it and the backend data, indicating that law enforcement seized both the site's servers and domains. [...] The seizure message also shows the two forum profile pictures of the site's administrators, Baphomet and ShinyHunters, overlaid with prison bars.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FBI+Seizes+BreachForums+Hacking+Forum+Used+To+Leak+Stolen+Data%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F05%2F15%2F1547215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/15/1547215/fbi-seizes-breachforums-hacking-forum-used-to-leak-stolen-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FBI Seizes BreachForums Hacking Forum Used To Leak Stolen Data", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T16:53:21.345280+00:00", "description": "Intel unveiled Thunderbolt Share on Wednesday with which it promises to streamline screen and file sharing between two PCs. Tom's Hardware: Thunderbolt Share will allow PC owners to connect their two computers with a wired connection that leverages Thunderbolt's speed (40Gbps or higher), low latency, and built-in security. It allows PC-to-PC access that shares the screen, keyboard, mouse, and storage. The software also enables folder synchronization or easy drag-and-drop file transfer between the computers. [...] \n\nThunderbolt Share also provides uncompressed screen sharing between two PCs in the original resolution of the source computer. It also claims low latency for a smooth, responsive experience that includes the screen, keyboard, and mouse with full HD screen mirroring at up to 60 frames per second (fps). Higher resolutions could result in fewer frames per second, but Ziller said it would still be a \"great experience.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"", "language": "en-us", "link": "https://slashdot.org/story/24/05/15/160243/intels-new-thunderbolt-share-provides-file-and-screen-sharing-without-hurting-network-performance?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel's New Thunderbolt Share Provides File and Screen Sharing Without Hurting Network Performance", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T15:48:01.072961+00:00", "description": "schwit1 shares a report: Fake studies have flooded the publishers of top scientific journals, leading to thousands of retractions and millions of dollars in lost revenue. The biggest hit has come to Wiley, a 217-year-old publisher based in Hoboken, N.J., which Tuesday announced that it was closing 19 journals, some of which were infected by large-scale research fraud. In the past two years, Wiley has retracted more than 11,300 papers that appeared compromised, according to a spokesperson, and closed four journals. It isn't alone: At least two other publishers have retracted hundreds of suspect papers each. Several others have pulled smaller clusters of bad papers. \n\nAlthough this large-scale fraud represents a small percentage of submissions to journals, it threatens the legitimacy of the nearly $30 billion academic publishing industry and the credibility of science as a whole. The discovery of nearly 900 fraudulent papers in 2022 at IOP Publishing, a physical sciences publisher, was ", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/15/1449205/flood-of-fake-science-forces-multiple-journal-closures?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Flood of Fake Science Forces Multiple Journal Closures", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T15:47:59.146560+00:00", "description": "Tech columnist and venture investor MG Siegler, commenting on the new iPad Pro: I love the iPad for the things it's good at. And I love the MacBook for the things it's good at. What I want is less a completely combined device and more a single device that can run both macOS and iPadOS. And this new iPad Pro, again equipped with a chip faster than any MacBook, can do that if Apple allowed it to. \n\nAt first, maybe it's dual boot. That is, just let the iPad Pro load up macOS if it's attached to the Magic Keyboard and use the screen as a regular (but beautiful) monitor -- no touch. Over time, maybe macOS is just a \"mode\" inside of iPadOS -- complete with some elements updated to be touch-friendly, but not touch-first. Steven Sinofsky, the former head of Microsoft's Windows division, chiming in: It is not unusual for customers to want the best of all worlds. It is why Detroit invented convertibles and el caminos. \n\nBut the idea of a \"dual boot\" device is just nuts. It is guaranteed the onl", "language": "en-us", "link": "https://slashdot.org/story/24/05/15/1515251/former-windows-chief-explains-why-macos-on-ipad-is-futile-quest?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Former Windows Chief Explains Why macOS on iPad is Futile Quest", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T14:42:07.691779+00:00", "description": "The Department of Justice says it is considering whether to prosecute Boeing over two deadly crashes involving its 737 Max aircraft. From a report: The aviation giant breached the terms of an agreement made in 2021 that shielded the firm from criminal charges linked to the incidents, the DOJ said. Boeing has denied that it violated the agreement. The crashes - one in Indonesia in 2018, and another in Ethiopia in 2019 - killed a total of 346 people. \n\nThe plane maker failed to \"design, implement, and enforce a compliance and ethics program to prevent and detect violations of the US fraud laws throughout its operations,\" the DOJ said. Boeing said it was looking forward to the opportunity to respond to the Justice Department and \"believes it honoured the terms of that agreement.\" Under the deal, Boeing paid a $2.5bn settlement, while prosecutors agreed to ask the court to drop a criminal charge after a period of three years. The DOJ said Boeing has until 13 June to respond to the allegat", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/15/149255/boeing-may-face-criminal-prosecution-over-737-max-crashes-us-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Boeing May Face Criminal Prosecution Over 737 Max Crashes, US Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T13:37:43.453726+00:00", "description": "In an op-ed for The Wall Street Journal, Representatives Cathy McMorris Rodgers (R-Wash.) and Frank Pallone Jr (D-N.J.) made their case for why Section 230 of the 1996 Communications Decency Act has \"outlived its usefulness.\" Section 230 of the Communications Decency Act protects online platforms from liability for user-generated content, allowing them to moderate content without being treated as publishers.\n \n\"Unfortunately, Section 230 is now poisoning the healthy online ecosystem it once fostered. Big Tech companies are exploiting the law to shield them from any responsibility or accountability as their platforms inflict immense harm on Americans, especially children. Congress's failure to revisit this law is irresponsible and untenable,\" the lawmakers wrote. The Hill reports: Rodgers and Pallone argued that rolling back the protections on Big Tech companies would hold them accountable for the material posted on their platforms. \"These blanket protections have resulted in tech firm", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/15/0034249/has-section-230-outlived-its-usefulness?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Has Section 230 'Outlived Its Usefulness'?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T10:23:34.188540+00:00", "description": "At Google I/O on Tuesday, Google previewed a feature that will alert users to potential scams during a phone call. TechCrunch reports: The feature, which will be built into a future version of Android, uses Gemini Nano, the smallest version of Google's generative AI offering, which can be run entirely on-device. The system effectively listens for \"conversation patterns commonly associated with scams\" in real time. Google gives the example of someone pretending to be a \"bank representative.\" Common scammer tactics like password requests and gift cards will also trigger the system. These are all pretty well understood to be ways of extracting your money from you, but plenty of people in the world are still vulnerable to these sorts of scams. Once set off, it will pop up a notification that the user may be falling prey to unsavory characters.\n \nNo specific release date has been set for the feature. Like many of these things, Google is previewing how much Gemini Nano will be able to do do", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/15/0051206/google-will-use-gemini-to-detect-scams-during-calls?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Will Use Gemini To Detect Scams During Calls", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T07:09:20.718076+00:00", "description": "Philip Ball reports via Scientific American: Thomas Gingeras did not intend to upend basic ideas about how the human body works. In 2012 the geneticist, now at Cold Spring Harbor Laboratory in New York State, was one of a few hundred colleagues who were simply trying to put together a compendium of human DNA functions. Their &#194;project was called ENCODE, for the Encyclopedia of DNA Elements. About a decade earlier almost all of the three billion DNA building blocks that make up the human genome had been identified. Gingeras and the other ENCODE scientists were trying to figure out what all that DNA did. The assumption made by most biologists at that time was that most of it didn't do much. The early genome mappers estimated that perhaps 1 to 2 percent of our DNA consisted of genes as classically defined: stretches of the genome that coded for proteins, the workhorses of the human body that carry oxygen to different organs, build heart muscles and brain cells, and do just about ever", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/15/0045229/revolutionary-genetics-research-shows-rna-may-rule-our-genome?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Revolutionary Genetics Research Shows RNA May Rule Our Genome", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T03:53:47.321267+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Starting in June of last year, global temperatures went from very hot to extreme. Every single month since June, the globe has experienced the hottest temperatures for that month on record -- that's 11 months in a row now, enough to ensure that 2023 was the hottest year on record, and 2024 will likely be similarly extreme. There's been nothing like this in the temperature record, and it acts as an unmistakable indication of human-driven warming. But how unusual is that warming compared to what nature has thrown at us in the past? While it's not possible to provide a comprehensive answer to that question, three European researchers (Jan Esper, Max Torbenson, and Ulf Buntgen) have provided a partial answer: the Northern Hemisphere hasn't seen anything like this in over 2,000 years. [...]\n \nThe first thing the three researchers did was try to align the temperature record with the proxy record. If you simply compare temperatures withi", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/15/0021238/2023-temperatures-were-warmest-weve-seen-for-at-least-2000-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "2023 Temperatures Were Warmest We've Seen For At Least 2,000 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T02:48:32.486864+00:00", "description": "Later this month, Comcast will launch a three-way bundle with Peacock, Netflix and Apple TV+. It will \"come at a vastly reduced price to anything in the market today,\" said. Comcast chief Brian Roberts. Variety reports: The goal is to \"add value to consumers\" and at the same time \"take some of the dollars out of\" other companies' streaming businesses, he added, while reinforcing Comcast's broadband service offerings. Comcast's impending launch of the StreamSaver bundle come as other media companies have been assembling similar offerings. [...] Like the other streaming bundling strategies, Comcast's forthcoming Peacock, Netflix and Apple TV+ package is an effort to reduce cancelation rates (aka \"churn\") and provide a more efficient means of subscriber acquisition -- coming as the traditional cable TV business continues to deteriorate. Last week, Disney and Warner Bros. Discovery announced a three-way bundle comprising of Max, Disney+ and Hulu.<p><div class=\"share_submission\">\n<a class=", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/05/14/208253/comcast-to-launch-peacock-netflix-and-apple-tv-bundle?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Comcast To Launch Peacock, Netflix and Apple TV+ Bundle", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T01:43:24.161267+00:00", "description": "At its I/O developer conference today, Google announced Veo, its latest generative AI video model, that \"can generate 'high-quality' 1080p resolution videos over a minute in length in a wide variety of visual and cinematic styles,\" reports The Verge. From the report: Veo has \"an advanced understanding of natural language,\" according to Google's press release, enabling the model to understand cinematic terms like \"timelapse\" or \"aerial shots of a landscape.\" Users can direct their desired output using text, image, or video-based prompts, and Google says the resulting videos are \"more consistent and coherent,\" depicting more realistic movement for people, animals, and objects throughout shots. Google DeepMind CEO Demis Hassabis said in a press preview on Monday that video results can be refined using additional prompts and that Google is exploring additional features to enable Veo to produce storyboards and longer scenes.\n \nAs is the case with many of these AI model previews, most folks", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/05/15/008241/google-targets-filmmakers-with-veo-its-new-generative-ai-video-model?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Targets Filmmakers With Veo, Its New Generative AI Video Model", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T01:43:22.658066+00:00", "description": "At Google I/O today, Google introduced a \"next-generation AI assistant\" called Project Astra that can \"make sense of what your phone's camera sees,\" reports Wired. It follows yesterday's launch of GPT-4o, a new AI model from OpenAI that can quickly respond to prompts via voice and talk about what it 'sees' through a smartphone camera or on a computer screen. It \"also uses a more humanlike voice and emotionally expressive tone, simulating emotions like surprise and even flirtatiousness,\" notes Wired. From the report: In response to spoken commands, Astra was able to make sense of objects and scenes as viewed through the devices' cameras, and converse about them in natural language. It identified a computer speaker and answered questions about its components, recognized a London neighborhood from the view out of an office window, read and analyzed code from a computer screen, composed a limerick about some pencils, and recalled where a person had left a pair of glasses. [...] Google say", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/2343256/project-astra-is-googles-multimodal-answer-to-the-new-chatgpt?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Project Astra Is Google's 'Multimodal' Answer to the New ChatGPT", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T00:38:17.482173+00:00", "description": "OpenAI's co-founder and Chief Scientist, Ilya Sutskever, is leaving the company to work on \"something personally meaningful,\" wrote CEO Sam Altman in a post on X. \"This is very sad to me; Ilya is easily one of the greatest minds of our generation, a guiding light of our field, and a dear friend. [...] I am forever grateful for what he did here and committed to finishing the mission we started together.\" He will be replaced by OpenAI researcher Jakub Pachocki. Here's Altman's full X post announcing the departure: Ilya and OpenAI are going to part ways. This is very sad to me; Ilya is easily one of the greatest minds of our generation, a guiding light of our field, and a dear friend. His brilliance and vision are well known; his warmth and compassion are less well known but no less important.\n \nOpenAI would not be what it is without him. Although he has something personally meaningful he is going to go work on, I am forever grateful for what he did here and committed to finishing the mi", "language": "en-us", "link": "https://slashdot.org/story/24/05/14/2323250/openais-chief-scientist-and-co-founder-is-leaving-the-company?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI's Chief Scientist and Co-Founder Is Leaving the Company", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-15T00:38:15.988593+00:00", "description": "An anonymous reader quotes a report from UploadVR: 1 in 4 U.S. teens told Pew Research Center they play games on a VR headset. The survey was conducted on 1453 U.S. teens aged 13 to 17. Pew claims the participants were \"recruited primarily through national, random sampling of residential addresses\" and \"weighted to be representative of U.S. teens ages 13 to 17 who live with their parents by age, gender, race and ethnicity, household income, and other categories.\" Broken out by gender, 32% of boys and 15% of girls said they play games on a VR headset. The survey doesn't ask whether they actually own the headset, so this will include those who play on a sibling or parent's headset.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=1+In+4+US+Teens+Say+They+Play+Games+On+a+VR+Headset%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F05%2F14%2F2012215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_larg", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/14/2012215/1-in-4-us-teens-say-they-play-games-on-a-vr-headset?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "1 In 4 US Teens Say They Play Games On a VR Headset", "user": null, "vote": 0}]