[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T23:39:22.992424+00:00", "description": "The House Energy and Commerce Committee has approved the AM for Every Vehicle Act, which mandates that automakers include AM radio in new vehicles without additional charges. The Verge reports: The bill passed the committee on a roll-call vote of 45-2 and now heads to the full House for final approval. The bill, titled the AM for Every Vehicle Act, would direct the National Highway Traffic Safety Administration (NHTSA) to issue a rule that \"requires automakers to maintain AM broadcast radio in their vehicles without a separate or additional payment, fee, or surcharge.\" Supporters say they are pushing the bill out of a concern that the slow demise of AM radio could make it more difficult to broadcast emergency information during a natural disaster or other related events. Conservatives are also worried about losing a lucrative platform for right-wing news and media. [...]\n \nAutomakers generally see AM radio as an obsolete technology, arguing that there are other, better technologies, s", "id": 1171598, "language": null, "link": "https://tech.slashdot.org/story/24/09/18/205250/house-committee-approves-bill-requiring-new-cars-to-have-am-radio?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "House Committee Approves Bill Requiring New Cars To Have AM Radio", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T23:39:22.769762+00:00", "description": "The Register's Jessica Lyons reports: Chinese state-sponsored spies have been spotted inside a global engineering firm's network, having gained initial entry using an admin portal's default credentials on an IBM AIX server. In an exclusive interview with The Register, Binary Defense's Director of Security Research John Dwyer said the cyber snoops first compromised one of the victim's three unmanaged AIX servers in March, and remained inside the US-headquartered manufacturer's IT environment for four months while poking around for more boxes to commandeer. It's a tale that should be a warning to those with long- or almost-forgotten machines connected to their networks; those with shadow IT deployments; and those with unmanaged equipment. While the rest of your environment is protected by whatever threat detection you have in place, these legacy services are perfect starting points for miscreants.\n \nThis particular company, which Dwyer declined to name, makes components for public and p", "id": 1171597, "language": null, "link": "https://yro.slashdot.org/story/24/09/18/2014240/chinese-spies-spent-months-inside-aerospace-engineering-firms-network-via-legacy-it?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Chinese Spies Spent Months Inside Aerospace Engineering Firm's Network Via Legacy IT", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T22:34:31.896529+00:00", "description": "An anonymous reader quotes a report from TechCrunch: At its Made On YouTube event on Wednesday, the company announced a new dedicated space for creators to interact with their fans and viewers. The space, called \"Communities,\" is kind of like a Discord server built into a creator's channel. With Communities, YouTube is hoping creators won't need to use other platforms like Discord or Reddit in order to interact with viewers. Communities are a space for viewers to post and interact with other fans directly within a creator's channel. In the past, viewers have been limited to leaving comments on a creator's video. Now, they can share their own content in a creator's Community to interact with other fans over shared interests. For instance, a fitness creator's Community could include posts from fans who are sharing videos and photos from their most recent hike.\n \nTo start, the feature is only available to subscribers. The company sees Communities as a dedicated space for conversation and", "id": 1171378, "language": null, "link": "https://news.slashdot.org/story/24/09/18/1956210/youtube-launches-communities-a-discord-like-space-for-creators-and-fans?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "YouTube Launches Communities, a Discord-Like Space For Creators and Fans", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T21:30:06.019532+00:00", "description": "All seven independent directors of DNA-testing company 23andMe resigned Tuesday, following a protracted negotiation with founder and Chief Executive Anne Wojcicki over her plan to take the company private. WSJ: It is the latest challenge for 23andMe, which has struggled to find a profitable business model. The stock price fell to $0.30 per share after hours on Tuesday. At that price the company is worth less than the cash on its balance sheet. In a letter addressed to Wojcicki, the directors wrote that \"after months of work, we have yet to receive from you a fully financed, fully diligenced, actionable proposal that is in the best interests of the non-affiliated shareholders.\" \n\nIt is very rare for a publicly traded company to see so many directors resign simultaneously. The board members wrote that they differ with Wojcicki on the \"strategic direction for the company\" and because of her voting power, it was best that they resign. Wojcicki controls 49% of 23andMe votes, giving her a l", "id": 1171012, "language": null, "link": "https://slashdot.org/story/24/09/18/1931220/23andme-board-resigns-in-new-blow-to-dna-testing-company?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "23andMe Board Resigns in New Blow To DNA-Testing Company", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T21:30:05.418224+00:00", "description": "OpenAI truly does not want you to know what its latest AI model is \"thinking.\" From a report: Since the company launched its \"Strawberry\" AI model family last week, touting so-called reasoning abilities with o1-preview and o1-mini, OpenAI has been sending out warning emails and threats of bans to any user who tries to probe how the model works. \n\nUnlike previous AI models from OpenAI, such as GPT-4o, the company trained o1 specifically to work through a step-by-step problem-solving process before generating an answer. When users ask an \"o1\" model a question in ChatGPT, users have the option of seeing this chain-of-thought process written out in the ChatGPT interface. However, by design, OpenAI hides the raw chain of thought from users, instead presenting a filtered interpretation created by a second AI model. Nothing is more enticing to enthusiasts than information obscured, so the race has been on among hackers and red-teamers to try to uncover o1's raw chain of thought using jailbre", "id": 1171011, "language": null, "link": "https://slashdot.org/story/24/09/18/1858224/openai-threatens-to-ban-users-who-probe-its-strawberry-ai-models?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Threatens To Ban Users Who Probe Its 'Strawberry' AI Models", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T20:23:28.693788+00:00", "description": "International police forces have taken down an encrypted communication platform and arrested 51 people, marking a success for co-ordinated efforts to crack down on anonymous messaging services used by criminal groups. FT: Europol and law enforcement agencies from nine countries dismantled Ghost [non-paywalled source], an online platform which used three different encryption standards and allowed users to destroy all messages by sending a specific code, Europol announced on Wednesday. The crackdown is the latest operation by international agencies to decode encrypted messaging services used by criminals to manage their international operations, following the takedown of platforms such as EncroChat and Sky ECC in recent years. \n\n[...] McLean said Ghost was administered by a 32-year-old man from Australia, one of the operation's principal targets. As a result of the decryption operation, where officers broke the app's code so they could read users' messages, the death or injury of as man", "id": 1170558, "language": null, "link": "https://it.slashdot.org/story/24/09/18/1838228/global-police-dismantle-encrypted-messaging-app-used-by-criminals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Global Police Dismantle Encrypted Messaging App Used By Criminals", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T20:23:28.599963+00:00", "description": "Apple's VP of camera software engineering Jon McCormack has affirmed the company's commitment to traditional photography in an interview, contrasting with Google's \"memories\" approach for Pixel cameras. (A Google executive said last month of the AI usage in the pictures Pixel smartphone owners take: \"What some of these edits do is help you create the moment that is the way you remember it, that's authentic to your memory and to the greater context, but maybe isn't authentic to a particular millisecond.\") The Verge: I asked Apple's VP of camera software engineering Jon McCormack about Google's view that the Pixel camera now captures \"memories\" instead of photos, and he told me that Apple has a strong point of view about what a photograph is -- that it's something that actually happened. It was a long and thoughtful answer, so I'm just going to print the whole thing: \n\n\"Here's our view of what a photograph is. The way we like to think of it is that it's a personal celebration of somethi", "id": 1170557, "language": null, "link": "https://apple.slashdot.org/story/24/09/18/1851258/apple-and-google-diverge-on-photography-philosophy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple and Google Diverge on Photography Philosophy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T20:23:28.509980+00:00", "description": "IBM has been laying off a substantial number of employees this week and is trying to keep it quiet, The Register reported Wednesday, citing its sources. From the report: One IBM employee told The Register that IBM Cloud experienced \"a massive layoff\" in the past few days that affected thousands of people. \"Unlike traditional layoffs, this one was done in secret,\" the insider said. \"My manager told me that they were required to sign an NDA not to talk about the specifics.\" \n\nMultiple posts on layoff-focused message boards and corroborating accounts with other sources familiar with the IT giant's operations suggest the cuts are large. Asked to confirm the layoffs, an IBM spokesperson told The Register, \"Early this year, IBM disclosed a workforce rebalancing charge that would represent a very low single digit percentage of IBM's global workforce, and we still expect to exit 2024 at roughly the same level of employment as we entered with.\"<p><div class=\"share_submission\" style=\"position:r", "id": 1170556, "language": null, "link": "https://slashdot.org/story/24/09/18/1934222/ibm-is-quietly-axing-thousands-of-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": " IBM is Quietly Axing Thousands of Jobs", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T18:11:54.355033+00:00", "description": "An anonymous reader shares a report: Last week, the FBI took control of a botnet made up of hundreds of thousands of internet-connected devices, such as cameras, video recorders, storage devices, and routers, which was run by a Chinese government hacking group, FBI director Christopher Wray and U.S. government agencies revealed Wednesday. The hacking group, dubbed Flax Typhoon, was \"targeting critical infrastructure across the U.S. and overseas, everyone from corporations and media organizations to universities and government agencies,\" Wray said at the Aspen Cyber Summit cybersecurity conference on Wednesday. \n\n\"But working in collaboration with our partners, we executed court-authorized operations to take control of the botnet's infrastructure,\" Wray said, explaining that once the authorities did that, the FBI also removed the malware from the compromised devices. \"Now, when the bad guys realized what was happening, they tried to migrate their bots to new servers and even conducted ", "id": 1169725, "language": null, "link": "https://news.slashdot.org/story/24/09/18/1728234/us-government-took-control-of-a-botnet-run-by-chinese-government-hackers-says-fbi-director?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Government 'Took Control' of a Botnet Run by Chinese Government Hackers, Says FBI Director", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T18:11:53.288510+00:00", "description": "The Federal Reserve cut its benchmark interest rate by half a percentage point on Wednesday and signalled more reductions would follow, launching its first easing cycle since the onset of the pandemic. Financial Times: The US central bank's first cut in more than four years leaves the federal funds rate at a range of 4.75 per cent. Michelle Bowman, a governor on the Federal Open Market Committee, voted against the decision, favouring a quarter-point reduction. The half-point cut is larger than the Fed's more customary quarter-point pace and suggests the US central bank is concerned about the prospects of a weakening economy after more than a year of holding rates at a 23-year high.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Federal+Reserve+Cuts+Rates+By+Half+a+Point+and+Signals+Era+of+Easing+Has+Begun%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F09%2F18%2F185206%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwit", "id": 1169724, "language": null, "link": "https://news.slashdot.org/story/24/09/18/185206/federal-reserve-cuts-rates-by-half-a-point-and-signals-era-of-easing-has-begun?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Federal Reserve Cuts Rates By Half a Point and Signals Era of Easing Has Begun", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T17:06:51.231506+00:00", "description": "An anonymous reader shares a report: Israel blew up thousands of two-way personal radios used by Hezbollah members in Lebanon in a second wave of an intelligence operation that started on Tuesday with the explosions of pager devices, two sources with knowledge of the operation told Axios. The second wave of clandestine attacks is another serious security breach in Hezbollah's ranks and increases the pressure on the militant Lebanese group. \n\nLebanon's official news agency reported that at least three people were killed and dozens wounded in the explosions across the country. The walkie-talkies were booby-trapped in advance by Israeli intelligence services and then delivered to Hezbollah as part of the militia's emergency communications system, which was supposed to be used during a war with Israel, the sources said. Associated Press reports: Lebanon's official news agency reports that solar energy systems exploded in homes in several areas of Beirut and in southern Lebanon, wounding a", "id": 1169080, "language": null, "link": "https://news.slashdot.org/story/24/09/18/1522246/walkie-talkies-solar-energy-systems-explode-across-lebanon-in-second-wave-after-pager-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Walkie-Talkies, Solar Energy Systems Explode Across Lebanon in Second Wave After Pager Attack", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T17:06:51.110708+00:00", "description": "Fossil fuel companies pumped at least $5.6bn of sponsorship money into motorsports, football, golf and even snow sports in an effort to \"buy social licence to operate,\" according to a new report. From a report: Almost no major spectator sport remains untouched by oil and gas money, according to research carried out by the New Weather Institute (NWI), a climate thinktank, which traced more than 200 sponsorship deals between sports teams and the industry. In addition, sports stars such as Cristiano Ronaldo, Lionel Messi, Tyson Fury and Anthony Joshua have all been successfully recruited to spend time in the Middle East as part of sponsorship deals, the report says. \n\nIt comes as concern grows about the fossil fuel industry's increasing efforts to launder its global standing through \"sportswashing\" -- a practice, long used by nation states, of building associations with sporting events to improve tarnished reputations. In 2023, Mohammed bin Salman, the crown prince of Saudi Arabia, said:", "id": 1169079, "language": null, "link": "https://news.slashdot.org/story/24/09/18/1612222/fossil-fuel-companies-sponsor-56-billion-in-global-sportswashing-deals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Fossil Fuel Companies Sponsor $5.6 Billion in Global 'Sportswashing' Deals", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T17:06:50.990094+00:00", "description": "An anonymous reader shares a report: LinkedIn is using its users' data for improving the social network's generative AI products, but has not yet updated its terms of service to reflect this data processing, according to posts from various LinkedIn users and a statement from the company to 404 Media. Instead, the company says it will update its terms \"shortly.\" The move is unusual in that LinkedIn appears to have gone ahead with training AI on its users' data, even creating a new option in its settings, without updating its terms of service, which is traditionally one of the main documents that can explain how users' data is collected or used.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=LinkedIn+Is+Training+AI+on+User+Data+Before+Updating+Its+Terms+of+Service%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F09%2F18%2F1643230%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitte", "id": 1169078, "language": null, "link": "https://tech.slashdot.org/story/24/09/18/1643230/linkedin-is-training-ai-on-user-data-before-updating-its-terms-of-service?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "LinkedIn Is Training AI on User Data Before Updating Its Terms of Service", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T15:10:09.618853+00:00", "description": "The entertainment company behind \"The Hunger Games\" and \"Twilight\" plans to start using generative AI in the creation of its new movies and TV shows, a sign of the emerging technology's advance in Hollywood. From a report: Lions Gate Entertainment has agreed to give Runway, one of several fast-evolving AI startups, access to its content library in exchange for a new, custom AI model that the studio can use in the editing and production process. \n\nThe deal -- the first of its kind for Runway and one that could become a blueprint in the entertainment industry -- comes as creatives, actors and studio executives debate whether to use the new technology and how to protect their copyright material. Advocates say generative AI can enhance creators' work and help a cash-strapped industry save time and money. Michael Burns, vice chairman of Lionsgate Studio, expects the company to be able to save \"millions and millions of dollars\" from using the new model. The studio behind the \"John Wick\" fra", "id": 1168355, "language": null, "link": "https://tech.slashdot.org/story/24/09/18/148213/lionsgate-embraces-ai-in-movie-production-to-cut-costs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Lionsgate Embraces AI in Movie Production To Cut Costs", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T15:10:09.521904+00:00", "description": "YouTube has announced a series of AI-related features on the platform, including a couple that might change how creators make videos -- and the videos they make. From a report: The first feature is the new Inspiration tab in the YouTube Studio app, which YouTube has been testing in a limited way over the last few months. The tab's job is, essentially, to tell you what to make: the AI-powered tool will suggest a concept for a video, provide a title and a thumbnail, and even write an outline and the first few lines of the video for you. YouTube frames it as a helpful brainstorming tool but also acknowledges that you can use it to build out entire projects. And I'm just guessing here, but I'd bet those AI-created ideas are going to be pretty darn good at gaming the YouTube algorithm. \n\nOnce you have some AI inspiration, you can make some AI videos with Veo, the superpowerful DeepMind video model that is now being integrated into YouTube Shorts. Veo is mostly going to be part of the \"Drea", "id": 1168354, "language": null, "link": "https://news.slashdot.org/story/24/09/18/1451227/youtube-will-use-ai-to-generate-ideas-titles-and-even-full-videos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "YouTube Will Use AI To Generate Ideas, Titles, and Even Full Videos", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T14:04:40.774109+00:00", "description": "An anonymous reader quotes a report from CBC News: Inside a bustling unit at St. Michael's Hospital in downtown Toronto, one of Shirley Bell's patients was suffering from a cat bite and a fever, but otherwise appeared fine -- until an alert from an AI-based early warning system showed he was sicker than he seemed. While the nursing team usually checked blood work around noon, the technology flagged incoming results several hours beforehand. That warning showed the patient's white blood cell count was \"really, really high,\" recalled Bell, the clinical nurse educator for the hospital's general medicine program. The cause turned out to be cellulitis, a bacterial skin infection. Without prompt treatment, it can lead to extensive tissue damage, amputations and even death. Bell said the patient was given antibiotics quickly to avoid those worst-case scenarios, in large part thanks to the team's in-house AI technology, dubbed Chartwatch. \"There's lots and lots of other scenarios where patien", "id": 1167843, "language": null, "link": "https://science.slashdot.org/story/24/09/18/0232214/ai-tool-cuts-unexpected-deaths-in-hospital-by-26-canadian-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Tool Cuts Unexpected Deaths In Hospital By 26%, Canadian Study Finds", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T11:28:57.114047+00:00", "description": "Longtime Slashdot reader theodp writes: Python in Excel is now generally available for Windows users of Microsoft 365 Business and Enterprise,\" Microsoft announced in a Monday blog post. \"Last August, in partnership with Anaconda, we introduced an exciting new addition to Excel by integrating Python, making it possible to seamlessly combine Python and Excel analytics within the same workbook, no setup required. Since then, we've brought the power of popular Python analytics libraries such as pandas, Matplotlib, and NLTK to countless Excel users.\" Microsoft also announced the public preview of Copilot in Excel with Python, which will take users' natural language requests for analysis and automatically generate, explain, and insert Python code into Excel spreadsheets.\n \nWhile drawing criticism for limiting Python execution to locked-down Azure cloud containers, Python in Excel has also earned accolades from the likes of Python creator Guido van Rossum, now a Microsoft Distinguished Engi", "id": 1166787, "language": null, "link": "https://developers.slashdot.org/story/24/09/18/0210233/microsoft-releases-and-patents-python-in-excel?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Releases and Patents 'Python In Excel'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T08:36:21.236869+00:00", "description": "Neuralink said on Tuesday it has received the FDA's \"breakthrough device\" designation for its experimental implant aimed at restoring vision. Called Blindsight, the device \"will enable even those who have lost both eyes and their optic nerve to see,\" said Neuralink founder Elon Musk. Reuters reports: The FDA's breakthrough tag is given to certain medical devices that provide treatment or diagnosis of life-threatening conditions. It is aimed at speeding up development and review of devices currently under development. Neuralink did not immediately respond to a request seeking details about when it expects the Blindsight device to move into human trials.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FDA+Grants+Neuralink+With+Breakthrough+Device+Tag+For+'Blindsight'+Implant%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F09%2F18%2F0218218%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.", "id": 1165793, "language": null, "link": "https://science.slashdot.org/story/24/09/18/0218218/fda-grants-neuralink-with-breakthrough-device-tag-for-blindsight-implant?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FDA Grants Neuralink With Breakthrough Device Tag For 'Blindsight' Implant", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T06:13:37.185415+00:00", "description": "An anonymous reader shares a report: Per a recent update to Microsoft's Deprecated Windows features page, Legacy DRM services utilized by Windows Media Player and Silverlight clients for Windows 7 and Windows 8 are now deprecated. This will prevent the streaming or playback of DRM-protected content in those applications on those operating systems. It also includes playing content from personal CD rips and streaming from a Silverlight or Windows 8 client to an Xbox 360 if you were still doing that. \n\nFor those unfamiliar, \"DRM\" refers to Digital Rights Management. Basically, DRM tech ensures that you aren't stealing or playing back pirated content. Of course, piracy still exists, but these days, most officially distributed movies, TV shows, games, etc., all involve some form of DRM unless explicitly advertised as DRM-free. DRM does seem like harmless piracy prevention on paper. Still, it hasn't been all that effective at eliminating piracy -- and where it is implemented, it mainly puni", "id": 1165269, "language": null, "link": "https://tech.slashdot.org/story/24/09/18/064220/windows-media-player-and-silverlight-are-losing-legacy-drm-services-on-windows-7-and-8?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Windows Media Player and Silverlight Are Losing Legacy DRM Services on Windows 7 and 8", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T04:34:58.136644+00:00", "description": "An anonymous reader quotes a report from NBC News: Scientists in Brazil found microplastics in the brain tissue of cadavers, according to a new study published Monday in the journal JAMA Network Open. Mounting research over the last few years has found microplastics in nearly every organ in the body, as well as in the bloodstream and in plaque that clogs arteries. Whether these ubiquitous pollutants can reach the human brain has been a primary concern for scientists. The latest research looked at a part of the brain called the olfactory bulb, which processes information about smell. Humans have two olfactory bulbs, one above each nasal cavity. Connecting the olfactory bulb and the nasal cavity is the olfactory nerve.\n \nSome researchers worry the olfactory pathway may also be an entry point for microplastics getting into the brain, beyond the olfactory bulb. \"Previous studies in humans and animals have shown that air pollution reaches the brain, and that particles have been found in th", "id": 1165052, "language": null, "link": "https://science.slashdot.org/story/24/09/17/2320251/new-research-finds-microplastics-in-the-brains-olfactory-bulb?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New Research Finds Microplastics In the Brain's Olfactory Bulb", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T01:19:11.500070+00:00", "description": "The Verge's Alex Heath reports: Snap's fifth-generation Spectacles have a richer, more immersive display. Using them feels snappier. They weigh less than their predecessor and last longer on a charge. Those are exactly the kinds of upgrades you'd expect from a product line that's technically eight years old. But the market for Spectacles -- and AR glasses in general -- still feels as nascent as ever. Snap has an idea for what could change that: developers. These new Spectacles, announced Tuesday at Snap's annual Partner Summit in Los Angeles, aren't being sold. Instead, Snap is repeating its playbook for the last version of Spectacles in 2021 and distributing them to the people who make AR lenses for Snapchat. This time around, though, there's an extra hurdle: you have to apply for access through Lens Studio, the company's desktop tool for creating AR software, and pay $1,188 to lease a pair for at least one year. (After a year, the subscription becomes $99 a month.)\n \nYes, Snap is as", "id": 1164610, "language": null, "link": "https://tech.slashdot.org/story/24/09/17/232227/snaps-new-spectacles-inch-closer-to-compelling-ar?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Snap's New Spectacles Inch Closer To Compelling AR", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-18T01:19:11.408151+00:00", "description": "Google said in a blog post today it will begin labeling AI-generated and AI-edited image search results later this year. Digital Trends reports: The company will flag such content through the \"About this image\" window and it will be applied to Search, Google Lens, and Android's Circle to Search features. Google is also applying the technology to its ad services and is considering adding a similar flag to YouTube videos, but will \"have more updates on that later in the year,\" per the announcement post.\n \nGoogle will rely on Coalition for Content Provenance and Authenticity (C2PA) metadata to identify AI-generated images. That's an industry group Google joined as a steering committee member earlier in the year. This \"C2PA metadata\" will be used to track the image's provenance, identifying when and where an image was created, as well as the equipment and software used in its generation.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.c", "id": 1164609, "language": null, "link": "https://search.slashdot.org/story/24/09/17/237254/google-will-begin-labeling-ai-generated-images-in-search?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Will Begin Labeling AI-Generated Images In Search", "vote": 0}]