[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T15:30:05+00:00", "description": "The year is no stranger to controversies, no matter how well-regarded a game is, but the fighting game genre has faced exceptional backlash over the past many months. Whether it's Street Fighter 6's exorbitant outfit prices or Mortal Kombat 1's irritating monetization, fans are more fed up than ever.\n\nSo, when Bandai Namco announced a cash shop for Tekken 8, which saw exceptional acclaim after launching in January 2024, there was concern among the community. The development team promised it wouldn't be predatory like \"modern stores\" until it also announced a Battle Pass. As the shop went live, players finally saw the full extent of the microtransactions.\n\nHere's what's going on with Tekken 8's monetization and why players aren't happy, especially with all the other problems the recent patch has introduced.", "language": null, "link": "https://www.youtube.com/watch?v=C6BvMObwSw8", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/C6BvMObwSw8/hqdefault.jpg", "title": "Why Are GAMERS ANGRY With Tekken 8?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T09:30:09+00:00", "description": "On April 18th, Final Fantasy 16 will receive a new DLC - The Rising Tide - for PS5. It sees Clive venturing to a new region to search for the lost Eikon - Leviathan.\n\nHow this journey plays out and ultimately ties up the action RPG (especially since The Rising Tide is the final planned DLC) is unknown. However, Clive does gain some sick new Eikonic abilities and battles new and returning foes, like the iconic Tonberries. There are also new side quests to tackle, people to meet and equipment to unlock.\n\nThat's not all, of course, as a new end-game activity, Kairos Gate, will also be added, providing 20 stages of escalating difficulty for players to carve through. Here's everything you need to know about Final Fantasy 16: The Rising Tide before its launch.", "language": null, "link": "https://www.youtube.com/watch?v=LqbHUQFTF2g", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/LqbHUQFTF2g/hqdefault.jpg", "title": "Final Fantasy 16: The Rising Tide DLC - 15 Things You Need To Know Before You Buy", "user": null, "vote": 0}]