[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T23:26:09.827342+00:00", "description": "As reported by Bloomberg (paywalled), Apple is exploring the development of personal home robots following the shut down of its electric vehicle project. CNBC reports: Engineers at Apple have been looking into a robot that can follow users around their homes and a tabletop device that uses robotics to adjust a display screen, Bloomberg reported, citing people familiar with the research team. [...] Apple's hardware engineering division and its artificial intelligence and machine learning group are overseeing the work on personal robotics, Bloomberg reported. The home robot project is still in the early research and development phase, according to the report.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Reportedly+Exploring+Personal+Home+Robots%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F04%2F03%2F2156203%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/03/2156203/apple-reportedly-exploring-personal-home-robots?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Reportedly Exploring Personal Home Robots", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T23:26:07.333343+00:00", "description": "An anonymous reader writes: The massive GPU clusters needed to train Stability AI's popular text-to-image generation model Stable Diffusion are apparently also at least partially responsible for former CEO Emad Mostaque's downfall -- because he couldn't find a way to pay for them. According to an extensive expose citing company documents and dozens of persons familiar with the matter, it's indicated that the British model builder's extreme infrastructure costs drained its coffers, leaving the biz with just $4 million in reserve by last October. Stability rented its infrastructure from Amazon Web Services, Google Cloud Platform, and GPU-centric cloud operator CoreWeave, at a reported cost of around $99 million a year. That's on top of the $54 million in wages and operating expenses required to keep the AI upstart afloat.\n \nWhat's more, it appears that a sizable portion of the cloudy resources Stability AI paid for were being given away to anyone outside the startup interested in experi", "language": "en-us", "link": "https://slashdot.org/story/24/04/03/228209/stability-ai-reportedly-ran-out-of-cash-to-pay-its-bills-for-rented-cloudy-gpus?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Stability AI Reportedly Ran Out of Cash To Pay Its Bills For Rented Cloudy GPUs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T22:21:16.588013+00:00", "description": "An anonymous reader quotes a report from Ars Technica: The George Carlin estate has settled its lawsuit with Dudesy, the podcast that purportedly used a \"comedy AI\" to produce an hour-long stand-up special in the style and voice of the late comedian. Dudesy's \"George Carlin: Dead and Loving It\" special, which was first uploaded in early January, gained hundreds of thousands of views and plenty of media attention for its presentation as a creation of an AI that had \"listened to all of George Carlin's material... to imitate his voice, cadence and attitude as well as the subject matter I think would have interested him today.\" But even before the Carlin estate lawsuit was filed, there were numerous signs that the special was not actually written by an AI, as Ars laid out in detail in a feature report.\n \nShortly after the Carlin estate filed its lawsuit against Dudesy in late January, a representative for Dudesy host Will Sasso told The New York Times that the special had actually been \"c", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/03/211223/george-carlin-estate-forces-ai-carlin-off-the-internet-for-good?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "George Carlin Estate Forces 'AI Carlin' Off the Internet For Good", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T22:21:13.950694+00:00", "description": "A new ChromeOS update (M123) is rolling out that brings keyboard shortcuts and mouse buttons and enables hotspot connections on cellular Chromebooks. The Verge reports: The keyboard shortcut feature will work like it does in other operating systems, in which you can assign specific actions to specific key combinations. Google uses the examples of tweaking shortcuts to be easier to carry out one-handed or making them resemble those you're used to in, say, macOS. The same goes for mouse button customizing -- if your mouse has extra buttons besides just left and right clicks, and you want to turn that weird side button into a mute button, you can do that in ChromeOS with this update.\n \nThe company also added per-app language preferences for Android apps that you're running in ChromeOS, and it says it has made its offline text-to-speech voices more natural-sounding. As is Google's way, these updates will be rolling out over the next few days.<p><div class=\"share_submission\">\n<a class=\"sla", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/03/215257/google-brings-keyboard-shortcuts-custom-mouse-buttons-to-chromeos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Brings Keyboard Shortcuts, Custom Mouse Buttons To ChromeOS", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T21:16:04.227277+00:00", "description": "How do you get an AI to answer a question it's not supposed to? There are many such \"jailbreak\" techniques, and Anthropic researchers just found a new one, in which a large language model (LLM) can be convinced to tell you how to build a bomb if you prime it with a few dozen less-harmful questions first. From a report: They call the approach \"many-shot jailbreaking\" and have both written a paper about it [PDF] and also informed their peers in the AI community about it so it can be mitigated. The vulnerability is a new one, resulting from the increased \"context window\" of the latest generation of LLMs. This is the amount of data they can hold in what you might call short-term memory, once only a few sentences but now thousands of words and even entire books. \n\nWhat Anthropic's researchers found was that these models with large context windows tend to perform better on many tasks if there are lots of examples of that task within the prompt. So if there are lots of trivia questions in th", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/03/1624214/anthropic-researchers-wear-down-ai-ethics-with-repeated-questions?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Anthropic Researchers Wear Down AI Ethics With Repeated Questions", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T20:13:56.112266+00:00", "description": "quonset shares a report: In a scathing indictment of Microsoft corporate security and transparency, a Biden administration-appointed review board issued a report Tuesday saying \"a cascade of errors\" by the tech giant let state-backed Chinese cyber operators break into email accounts of senior U.S. officials including Commerce Secretary Gina Raimondo. \n\nThe Cyber Safety Review Board, created in 2021 by executive order, describes shoddy cybersecurity practices, a lax corporate culture and a lack of sincerity about the company's knowledge of the targeted breach, which affected multiple U.S. agencies that deal with China. It concluded that \"Microsoft's security culture was inadequate and requires an overhaul\" given the company's ubiquity and critical role in the global technology ecosystem. Microsoft products \"underpin essential services that support national security, the foundations of our economy, and public health and safety.\" \n\nThe panel said the intrusion, discovered in June by the ", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/03/1116233/scathing-federal-report-rips-microsoft-for-shoddy-security?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Scathing Federal Report Rips Microsoft For Shoddy Security", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T20:13:54.252692+00:00", "description": "vik writes: According to this BBC article Tennessee just passed a bill banning the dispersion of chemicals in the air that affect weather and temperature. Sponsored by the chemtrail and anti-geoengineering crowds, if signed into law it seems it would ban atmospheric CO2 emissions:The bill forbids \"intentional injection, release, or dispersion\" of chemicals into the air.\n\nIt doesn't explicitly mention chemtrails, which conspiracy theorists believe are poisons spread by planes.\n\nInstead it broadly prohibits \"affecting temperature, weather, or the intensity of the sunlight\".\n\nThe Republican-sponsored bill passed along party lines on Monday. If it is signed by Tennessee's governor, Republican Bill Lee, it will go into effect on 1 July.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Tennessee+Passes+'Chemtrail'+Bill+Banning+Airborne+Chemicals%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F04%2F03%2F0638252%2F%3Futm_source%3Dtwitter%26utm_medium", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/03/0638252/tennessee-passes-chemtrail-bill-banning-airborne-chemicals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Tennessee Passes 'Chemtrail' Bill Banning Airborne Chemicals", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T20:13:52.475190+00:00", "description": "Microsoft and Quantinuum today announced a major breakthrough in quantum error correction. Using Quantinuum's ion-trap hardware and Microsoft's new qubit-virtualization system, the team was able to run more than 14,000 experiments without a single error. From a report: This new system also allowed the team to check the logical qubits and correct any errors it encountered without destroying the logical qubits. This, the two companies say, has now moved the state-of-the-art of quantum computing out of what has typically been dubbed the era of Noisy Intermediate Scale Quantum (NISQ) computers. \n\n\"Noisy\" because even the smallest changes in the environment can lead a quantum system to essentially become random (or \"decohere\"), and \"intermediate scale\" because the current generation of quantum computers is still limited to just over a thousand qubits at best. A qubit is the fundamental unit of computing in quantum systems, analogous to a bit in a classic computer, but each qubit can be in ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/03/1338223/microsoft-and-quantinuum-say-theyve-ushered-in-the-next-era-of-quantum-computing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft and Quantinuum Say They've Ushered in the Next Era of Quantum Computing", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T20:13:50.496881+00:00", "description": "An anonymous reader shares a report: Google offers a VPN via its \"Google One\" monthly subscription plan, and while it debuted on phones, a desktop app has been available for Windows and Mac OS for over a year now. Since a lot of people pay for Google One for the cloud storage increase for their Google accounts, you might be tempted to try the VPN on a desktop, but Windows users testing out the app haven't seemed too happy lately. An open bug report on Google's GitHub for the project says the Windows app \"breaks\" the Windows DNS, and this has been ongoing since at least November. \n\nA VPN would naturally route all your traffic through a secure tunnel, but you've still got to do DNS lookups somewhere. A lot of VPN services also come with a DNS service, and Google is no different. The problem is that Google's VPN app changes the Windows DNS settings of all network adapters to always use Google's DNS, whether the VPN is on or off. Even if you change them, Google's program will change them ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/03/0414256/users-say-googles-vpn-app-breaks-the-windows-dns-settings?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Users Say Google's VPN App Breaks the Windows DNS Settings", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T20:13:48.656948+00:00", "description": "smooth wombat writes: Chase bank announced a new program that will allow brands to target Chase customers based on the customer's purchases. According to the press release, the new program is called Chase Media Solutions and \"serves as a key conduit for brands, connecting them with consumers' personal passions and interests. In turn, Chase customers benefit from personalized offers and the ability to earn cash back with brands they love or are discovering for the first time.\" \n\nThe bank is hoping to combine insights from its large customer base and 6 million small business customers as part of its efforts to build out its own two-sided commerce platform and bring in benefits to both business clients and banking customers. Chase Media Solutions follows from the integration of card-linked marketing platform Figg, which JPMorgan Chase &amp; Co. acquired in 2022, the bank said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=JPMorgan+Chase+is+Abou", "language": "en-us", "link": "https://slashdot.org/story/24/04/03/158249/jpmorgan-chase-is-about-to-let-advertisers-target-customers-based-on-their-spending?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "JPMorgan Chase is About To Let Advertisers Target Customers Based on Their Spending", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T20:13:46.567620+00:00", "description": "Top business schools are integrating AI into their curricula to prepare students for the changing job market. Schools like the Wharton School, American University's Kogod School of Business, Columbia Business School, and Duke University's Fuqua School of Business are emphasizing AI skills across various courses, WSJ reported Wednesday. Professors are encouraging students to use AI as a tool for generating ideas, preparing for negotiations, and pressure-testing business concepts. However, they stress that human judgment remains crucial in directing AI and making sound decisions. An excerpt from the story: Before, engineers had an edge against business graduates because of their technical expertise, but now M.B.A.s can use AI to compete in that zone, said Robert Bray, who teaches operations management at Northwestern's Kellogg School of Management. He encourages his students to offload as much work as possible to AI, treating it like \"a really proficient intern.\" Ben Morton, one of Bray", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/03/1454232/business-schools-are-going-all-in-on-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Business Schools Are Going All In on AI", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T20:13:44.826911+00:00", "description": "Microsoft announced an extended support program for Windows 10 last year that would allow users to pay for continued security updates beyond the October 2025 end of support date. Today, the company has unveiled the pricing structure for that program, which starts at $61 per device, and doubles every year for three years. Windows Central: Security updates on Windows are important, as they keep you protected from any vulnerabilities that are discovered in the OS. Microsoft releases a security update for Windows 10 once a month, but that will stop when October 2025 rolls around. Users still on Windows 10 after that date will officially be out of support, unless you pay. \n\nThe extended support program for Windows 10 will let users pay for three years of additional security updates. This is handy for businesses and enterprise customers who aren't yet ready to upgrade their fleet of employee laptops and computers to Windows 11. For the first time, Microsoft is also allowing individual users", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/03/1757230/microsoft-reveals-subscription-pricing-for-using-windows-10-beyond-2025?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Reveals Subscription Pricing for Using Windows 10 Beyond 2025", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T20:13:43.147361+00:00", "description": "Deadline: Drew Goddard, the Oscar-nominated screenwriter of The Martian who also directed The Cabin in the Woods, has been set to write and direct a new Matrix movie at Warner Bros. The franchise's original co-scribe and co-director Lana Wachowski is executive producing. It's still early days in regards to whether core cast members Keanu Reeves, Carrie Anne-Moss, Laurence Fishburne, Hugo Weaving and Jada Pinkett Smith are coming back. \n\nGoddard will produce with partner Sarah Esberg (Moonlight, If Beale Street Could Talk) via their Goddard Textiles banner. \"Drew came to Warner Bros with a new idea that we all believe would be an incredible way to continue the Matrix world, by both honoring what Lana and Lilly began over 25 years ago and offering a unique perspective based on his own love of the series and characters,\" said Jesse Ehrman, Warner Bros Motion Pictures President of Production. \"The entire team at Warner Bros Discovery is thrilled for Drew to be making this new Matrix film,", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/04/03/1810245/new-matrix-movie-in-works?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New 'Matrix' Movie in Works", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T20:13:41.242960+00:00", "description": "The European Union and the US plan to enlist AI in the search for replacements to so-called forever chemicals that are prevalent in semiconductor manufacturing, Bloomberg News reported Wednesday, citing a draft statement. From the report: The pledge forms part of the conclusions to this week's joint US-EU Trade and Technology Council taking place in Leuven, Belgium. \"We plan to continue working to identify research cooperation opportunities on alternatives to the use of per- and polyfluorinated substances (PFAS) in chips,\" the statement says. \"For example, we plan to explore the use of AI capacities and digital twins to accelerate the discovery of suitable materials to replace PFAS in semiconductor manufacturing,\" it says. \n\nPFAS, sometimes known as forever chemicals, have been at the center of concerns over pollution in both the US and Europe. They have a wide range of industrial applications but also show up in our bodies, in food and water supplies, and -- as their moniker suggests", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/03/1611227/us-eu-to-use-ai-to-seek-alternate-chemicals-for-making-chips?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US, EU To Use AI To Seek Alternate Chemicals for Making Chips", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T20:13:39.412714+00:00", "description": "An anonymous reader shares a report: The Federal Communications Commission has scheduled an April 25 vote to restore net neutrality rules similar to the ones introduced during the Obama era and repealed under former President Trump. The text of the pending net neutrality order wasn't released today. The FCC press release said it will prohibit broadband providers \"from blocking, slowing down, or creating pay-to-play Internet fast lanes\" and \"bring back a national standard for broadband reliability, security, and consumer protection.\" \n\n[...] Numerous consumer advocacy groups praised the FCC for its plan today. Lobby groups representing Internet providers expressed their displeasure. While there hasn't been a national standard since then-Chairman Ajit Pai led a repeal in 2017, Internet service providers still have to follow net neutrality rules because California and other states impose their own similar regulations. The broadband industry's attempts to overturn the state net neutrality", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/03/184255/cable-lobby-vows-years-of-litigation-to-avoid-bans-on-blocking-and-throttling?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cable Lobby Vows 'Years of Litigation' To Avoid Bans on Blocking and Throttling", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T13:23:16.955895+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Jackson County, Missouri, has declared a state of emergency and closed key offices indefinitely as it responds to what officials believe is a ransomware attack that has made some of its IT systems inoperable. \"Jackson County has identified significant disruptions within its IT systems, potentially attributable to a ransomware attack,\" officials wrote Tuesday. \"Early indications suggest operational inconsistencies across its digital infrastructure and certain systems have been rendered inoperative while others continue to function as normal.\"\n \nThe systems confirmed inoperable include tax and online property payments, issuance of marriage licenses, and inmate searches. In response, the Assessment, Collection and Recorder of Deeds offices at all county locations are closed until further notice. The closure occurred the same day that the county was holding a special election to vote on a proposed sales tax to fund a stadium for MLB's", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/03/012229/missouri-county-declares-state-of-emergency-amid-suspected-ransomware-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Missouri County Declares State of Emergency Amid Suspected Ransomware Attack", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T10:52:41.988181+00:00", "description": "The UK and US have signed a landmark deal to work together on testing advanced artificial intelligence (AI) and develop \"robust\" safety methods for AI tools and their underlying systems. \"It is the first bilateral agreement of its kind,\" reports the BBC. From the report: UK tech minister Michelle Donelan said it is \"the defining technology challenge of our generation.\" \"We have always been clear that ensuring the safe development of AI is a shared global issue,\" she said. \"Only by working together can we address the technology's risks head on and harness its enormous potential to help us all live easier and healthier lives.\"\n \nThe secretary of state for science, innovation and technology added that the agreement builds upon commitments made at the AI Safety Summit held in Bletchley Park in November 2023. The event, attended by AI bosses including OpenAI's Sam Altman, Google DeepMind's Demis Hassabis and tech billionaire Elon Musk, saw both the UK and US create AI Safety Institutes whi", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/03/0056246/uk-and-us-sign-landmark-agreement-on-ai-safety?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "UK and US Sign Landmark Agreement On AI Safety", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T08:41:37.131311+00:00", "description": "Taiwan's biggest earthquake in 25 years has disrupted production at the island's semiconductor companies, raising the possibility of fallout for the technology industry and perhaps the global economy. From a report: The potential repercussions are significant because of the critical role Taiwan plays in the manufacture of advanced chips, the foundation of technologies from artificial intelligence and smartphones to electric vehicles. \n\nThe 7.4-magnitude earthquake led to the collapse of at least 26 buildings, four deaths and the injury of 57 people across Taiwan, with much of the fallout still unknown. Taiwan Semiconductor Manufacturing Co., the world's largest maker of advanced chips for customers like Apple and Nvidia, halted some chipmaking machinery and evacuated staff. Local rival United Microelectronics also stopped machinery at some plants and evacuated certain facilities at its hubs of Hsinchu and Tainan. \n\nTaiwan is the leading producer of the most advanced semiconductors in ", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/03/0830217/taiwan-quake-puts-worlds-most-advanced-chips-at-risk?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Taiwan Quake Puts World's Most Advanced Chips at Risk", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T07:36:58.835130+00:00", "description": "artmancc writes: The White House has directed NASA and other federal agencies to get to work on a plan to implement precision timekeeping and dissemination on the moon and elsewhere in space. Reuters cited a memo from the head of the White House Office of Science and Technology Policy (OSTP) that \"instructed the space agency to work with other parts of the U.S. government to devise a plan by the end of 2026 for setting what it called a Coordinated Lunar Time (LTC). The name of the proposed time standard is similar to the terrestrial time standard known as Coordinated Universal Time (UTC).\n \n\"OSTP chief Arati Prabhakar's memo said that for a person on the moon, an Earth-based clock would appear to lose on average 58.7 microseconds per Earth-day and come with other periodic variations that would further drift moon time from Earth time,\" Reuters reported. An unidentified OSTP official said the lunar time standard is needed for secure and synchronized communication between astronauts, sat", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/03/0050232/nasa-to-create-time-standard-for-the-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA To Create Time Standard For the Moon", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T04:21:08.725508+00:00", "description": "An anonymous reader quotes an opinion piece from the Washington Post, published by the Editorial Board: A just-published investigation by Russian, American and German journalists has unearthed startling new information about the so-called Havana syndrome, or \"Anomalous Health Incidents,\" as the government calls the unexplained bouts of painful disorientation that U.S. diplomats and intelligence officers have suffered in recent years. The new information suggests but does not prove that Russia's military intelligence agency is responsible. Earlier, agencies in the U.S. intelligence community had concluded that \"it is very unlikely a foreign adversary is responsible.\" They need to look again. [...]\n \n[T]he new investigation by the Insider, a Russian investigative news outlet, in collaboration with CBS's \"60 Minutes\" and Germany's Der Spiegel, paints a different picture. It identifies the possible culprit as Unit 29155, a \"notorious assassination and sabotage squad\" of the GRU, Moscow's ", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/02/230223/russia-might-have-caused-havana-syndrome?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Russia Might Have Caused Havana Syndrome'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T02:10:53.727526+00:00", "description": "Intel on Tuesday disclosed $7 billion in operating losses for its foundry business in 2023, \"a steeper loss than the $5.2 billion in operating losses the year before,\" reports Reuters. \"The unit had revenue of $18.9 billion for 2023, down 31% from $63.05 billion the year before.\" From the report: Intel shares were down 4.3% after the documents were filed with the U.S. Securities and Exchange Commission (SEC). During a presentation for investors, Chief Executive Pat Gelsinger said that 2024 would be the year of worst operating losses for the company's chipmaking business and that it expects to break even on an operating basis by about 2027. Gelsinger said the foundry business was weighed down by bad decisions, including one years ago against using extreme ultraviolet (EUV) machines from Dutch firm ASML. While those machines can cost more than $150 million, they are more cost-effective than earlier chip making tools.\n \nPartially as a result of the missteps, Intel has outsourced about 30", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/02/2250236/intel-discloses-7-billion-operating-loss-for-chip-making-unit?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Discloses $7 Billion Operating Loss For Chip-Making Unit", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T01:05:37.578691+00:00", "description": "Bitcoin fell more than 4.76% on Tuesday to $66,134 amid rising Treasury yields and strength in the U.S. dollar. CNBC reports: On Monday morning, it was trading at about $70,000 before data came out showing growth in the manufacturing sector for the first time since September 2022 and investor bets on June rate cuts began to cool. Bitcoin is now off its all-time high, reached on March 14, by about 11%. Ether went down with it, losing 5.6% to trade at $3,240.27. Meanwhile, the 10-year U.S. Treasury yield hit its highest level of the year and the dollar, which has an inverse relationship with bitcoin, hit a five-month high.\n \nBitcoin's move may have been exacerbated by a large bitcoin holder, or \"whale,\" who transferred more than 4,000 bitcoin to the Bitfinex exchange late Monday night. Data from CryptoQuant shows a spike in that exchange's reserves -- which typically signals a boost in selling activity -- that coincides with the sudden drop in bitcoin price late Monday night. Stocks tie", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/02/2240215/bitcoin-tumbles-5000-in-24-hours-as-interest-rates-jump?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Bitcoin Tumbles $5,000 In 24 Hours As Interest Rates Jump", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T01:05:35.210226+00:00", "description": "Sara Fischer reports via Axios: Jon Stewart on Monday told Federal Trade Commission (FTC) Chair Lina Khan that Apple wouldn't let him interview her for a podcast. \"I wanted to have you on a podcast and Apple asked us not to do it,\" \"The Daily Show\" host said to Khan, in reference to his former podcast that was an extension of his Apple TV+ comedy show \"The Problem With Jon Stewart.\" \"They literally said 'please don't talk to her,' having nothing to do with what you do for a living. I think they just... I didn't think they cared for you is what happened,\" he added during his conversation with Khan. \"They wouldn't let us do even that dumb thing we just did in the first act on AI. Like, what is that sensitivity? Why are they so afraid to even have these conversations out in the public sphere?\"\n \nStewart returned to \"The Daily Show\" in February after leaving in 2015 as its executive producer and host on Monday evenings through the 2024 election cycle. Stewart's Apple TV+ show ended late l", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/02/2246221/jon-stewart-claims-apple-wouldnt-let-him-interview-ftc-chair-on-his-podcast?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Jon Stewart Claims Apple Wouldn't Let Him Interview FTC Chair On His Podcast", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-03T00:00:26.661227+00:00", "description": "President Joe Biden has become the first sitting U.S. president to post on a decentralized networking protocol. As reported by The Verge, President Biden's Threads account \"has begun using Meta's ActivityPub integration,\" which allows for content, data, and followers to be ported between networks -- the basis that makes up the \"fediverse.\" From the report: The account turning on fediverse posting comes only a couple of weeks after Threads rolled out its beta ActivityPub integration for users in the US, Canada, and Japan. Biden may not be able to see replies and follows as they pour in from the fediverse -- and with some servers blocking connections to Meta, not everyone there will be able to see his posts -- as those features weren't part of Threads' integration when it opened up beta testing last month. But his posts are available, and he'll see likes coming in from there. Or whoever is running the Presidential Threads account will, anyway.<p><div class=\"share_submission\">\n<a class=\"", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/02/2228255/president-biden-is-now-posting-into-the-fediverse?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "President Biden Is Now Posting Into the Fediverse", "user": null, "vote": 0}]