[{"link": "https://www.youtube.com/watch?v=Apd_CtZk6LM", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "page_rating_contents": 0, "source_obj__id": 208, "comments": [], "thumbnail": "https://i2.ytimg.com/vi/Apd_CtZk6LM/hqdefault.jpg", "tags": [], "page_rating": 0, "vote": 0, "description": "Aerith is hugely crucial to the story of Final Fantasy 7 Remake and Rebirth, which means she’s at the center of a sizeable portion of the many debates that Final Fantasy 7’s remake trilogy has sparked. \n\nWith Final Fantasy 7 Rebirth on the horizon, those debates are in full flow once again, so here, we’re going to look at Aerith’s story in Remake, and her potential role in its upcoming second instalment.", "permanent": false, "artist": "GamingBolt", "bookmarked": false, "title": "The Story of Aerith So Far - Before You Begin Final Fantasy 7 Rebirth", "page_rating_votes": 0, "age": null, "date_published": "2024-02-18T18:30:14+00:00", "language": null, "dead": false, "user": null, "page_rating_visits": 0}, {"link": "https://www.youtube.com/watch?v=pe_TDKduRVs", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "page_rating_contents": 0, "source_obj__id": 208, "comments": [], "thumbnail": "https://i1.ytimg.com/vi/pe_TDKduRVs/hqdefault.jpg", "tags": [], "page_rating": 0, "vote": 0, "description": "The medium of games has come a long way from its humble beginnings, and modern games are capable of rendering worlds and characters that are not too different from the ones we see getting portrayed in movies. \n\nThe best games use plenty of design secrets and cinematography tricks to deliver scenes that rival the best of what cinema has to offer. With this video, we will be taking a look at 10 of the best moments in video games, right from Ghost of Tsushima to Yakuza Zero and much more. We will be discussing what makes those scenes so amazing, such as masterful camera work, story context or even an appropriately hard-hitting soundtrack.", "permanent": false, "artist": "GamingBolt", "bookmarked": false, "title": "10 Video Game Moments You Will Never FORGET TILL YOUR DEATH", "page_rating_votes": 0, "age": null, "date_published": "2024-02-18T13:30:30+00:00", "language": null, "dead": false, "user": null, "page_rating_visits": 0}, {"link": "https://www.youtube.com/watch?v=pn3rINBawEY", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "page_rating_contents": 0, "source_obj__id": 208, "comments": [], "thumbnail": "https://i1.ytimg.com/vi/pn3rINBawEY/hqdefault.jpg", "tags": [], "page_rating": 0, "vote": 0, "description": "The stealth genre has spawned some iconic series’ – Metal Gear Solid, Splinter Cell, to name just three – but what’s evident with games that incorporate stealth mechanics into their gameplay is just how varied these experiences can be. \n\nThere’s a subtle art in evading enemies, sneaking past, or eliminating from the cloak of darkness – perhaps explaining stealth as an enduring mechanic in video games since the early days of the medium. \n\nThis video highlights 17 such games that focus primarily on stealth in its gameplay, or at least feature it in some capacity alongside its combat mechanics. Expect tales of espionage, tense cat-and-mouse standoffs, cutting edge gadgets, shuffling horror, and heaps of shadows. Plus, there seems to be an onslaught of dinosaur related stealth games on the horizon too.", "permanent": false, "artist": "GamingBolt", "bookmarked": false, "title": "17 New Stealth Games of 2024 And Beyond That Will Push YOUR SKILLS TO THE LIMIT", "page_rating_votes": 0, "age": null, "date_published": "2024-02-18T06:30:14+00:00", "language": null, "dead": false, "user": null, "page_rating_visits": 0}]