[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T17:30:03+00:00", "description": "The original Epic Mickey was always a fascinating prospect, but even when it first launched back in 2010, it never quite managed to be an equally good game, not only because of some of its ideas not being properly fleshed out, but also because of the flawed manner in which it executed others that had been. \n\nNow, close to a decade and a half later, the platformer is back with an expanded remaster, and though Epic Mickey: Rebrushed is still a flawed game, it’s also a much better version of the original. From a fascinating premise to compelling core mechanics, there’s plenty to like here, even if it is still a pretty uneven experience.", "id": 1204110, "language": null, "link": "https://www.youtube.com/watch?v=WZfwiXnzYE8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/WZfwiXnzYE8/hqdefault.jpg", "title": "Epic Mickey: Rebrushed Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T15:30:08+00:00", "description": "September has passed us by almost as quickly as it started, with hits like Astro Bot and Warhammer 40,000: Space Marine 2. However, October is nearly here and could offer an even bigger roster of titles to jump into.\n\nIt all kicks off Until Dawn, Ballistic Moon's remake of Supermassive's acclaimed narrative horror, and Bloober Team's Silent Hill 2 remake, based on Konami's classic survival horror with revamped visuals. After that, there's Diablo 4's first paid expansion, Vessel of Hatred, which features a new region, class, and end-game activity.\n\nThe rest of the month looks just as packed if not more, with Life is Strange: Double Exposure, A Quiet Place: The Road Ahead, MechWarrior 5: Clans, Unknown 9: Awakening, and more to look forward to. Of course, it ends with Dragon Age: The Veilguard, BioWare's first new game in over five years. Check out our picks for October's biggest games.", "id": 1203357, "language": null, "link": "https://www.youtube.com/watch?v=PU4LfTwyeLk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/PU4LfTwyeLk/hqdefault.jpg", "title": "15 NEW Games of October 2024 You Need To Look Forward To [PS5, XBOX SERIES X | S, PC, SWITCH]", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T13:30:01+00:00", "description": "Konami and Bloober Team's Silent Hill 2 remake is launching soon, and though it's been made abundantly clear on several occasions by now that it's going to be a very faithful recreation of the 2001 classic, there are, of course, going to be several key things the upcoming remake is going to do differently from the original. \n\nHere, we're going to go over some of those biggest differences.", "id": 1202560, "language": null, "link": "https://www.youtube.com/watch?v=ae1bZFJ7Bvk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/ae1bZFJ7Bvk/hqdefault.jpg", "title": "Silent Hill 2 Remake vs Original – 15 BIGGEST DIFFERENCES", "vote": 0}]