[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T23:16:29.140108+00:00", "description": "Caroline Ellison, the former CEO of Alameda Research, must serve 24 months in prison and forfeit $11 billion. \"I've seen a lot of cooperators in 30 years. I've never seen one quite like Ms. Ellison,\" said Judge Lewis Kaplan during the sentencing hearing today. The Verge reports: Ellison pleaded guilty to two counts of wire fraud and five conspiracy counts in December 2022 as part of a cooperation agreement with the government. Prosecutors had recommended a lenient sentence because of Ellison's \"extraordinary\" and \"very timely\" cooperation. Her own lawyers asked for no jail time, as did the federal Probation Department.\n \nEllison was the key witness at the trial of FTX cofounder Sam Bankman-Fried, where she testified for three days. A statement submitted by the prosecution before Ellison's sentencing said the speed at which she came clean made it possible to indict her ex-boyfriend Bankman-Fried quickly, \"ensuring that he did not flee the Bahamas or further obstruct the government's in", "id": 1206151, "language": null, "link": "https://slashdot.org/story/24/09/24/2041203/caroline-ellison-sentenced-to-two-years-in-jail-for-role-in-ftx-fraud-must-forfeit-11-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Caroline Ellison Sentenced To Two Years In Jail For Role In FTX Fraud, Must Forfeit $11 Billion", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T22:13:54.438331+00:00", "description": "OpenAI is rolling out its advanced voice interface for ChatGPT to all Plus and Team subscribers in the U.S., the company said Tuesday. The feature, unveiled four months ago, lets users speak to the AI chatbot instead of typing. Five new voices join the lineup, expanding user options. OpenAI claims improved accent recognition and smoother conversations since initial testing. VentureBeat adds: OpenAI's foray into adding voices into ChatGPT has been controversial at the onset. In its May event announcing GPT-4o and the voice mode, people noticed similarities of one of the voices, Sky, to that of the actress Scarlett Johanssen. It didn't help that OpenAI CEO Sam Altman posted the word \"her\" on social media, a reference to the movie where Johansson voiced an AI assistant. The controversy sparked concerns around AI developers mimicking voices of well-known individuals.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI", "id": 1205814, "language": null, "link": "https://slashdot.org/story/24/09/24/1924211/openai-finally-brings-humanlike-chatgpt-advanced-voice-mode-to-us-plus-team-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Finally Brings Humanlike ChatGPT Advanced Voice Mode To US Plus, Team Users", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T22:13:54.351633+00:00", "description": "An anonymous reader quotes a report from Ars Technica: California Gov. Gavin Newsom vetoed a bill that would have required makers of web browsers and mobile operating systems to let consumers send opt-out preference signals that could limit businesses' use of personal information. The bill approved by the State Legislature last month would have required an opt-out signal \"that communicates the consumer's choice to opt out of the sale and sharing of the consumer's personal information or to limit the use of the consumer's sensitive personal information.\" It would have made it illegal for a business to offer a web browser or mobile operating system without a setting that lets consumers \"send an opt-out preference signal to businesses with which the consumer interacts.\"\n \nIn a veto message (PDF) sent to the Legislature Friday, Newsom said he would not sign the bill. Newsom wrote that he shares the \"desire to enhance consumer privacy,\" noting that he previously signed a bill \"requir[ing] ", "id": 1205813, "language": null, "link": "https://yro.slashdot.org/story/24/09/24/2034226/california-governor-vetoes-bill-requiring-opt-out-signals-for-sale-of-user-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "California Governor Vetoes Bill Requiring Opt-Out Signals For Sale of User Data", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T21:08:07.719758+00:00", "description": "Steep online discounts aren't as sweet as they used to be. From a report: The average discount offered by online retailers in the US is down to 36% so far this year, data from Centric Market Intelligence shows. That's down two percentage points from last year, and down from an average of 42% in 2019 -- a 14% drop in real terms. Finding a bargain is getting tougher for a variety of reasons, according to retail experts who spoke with Sherwood. Sellers are having to pay more for raw materials, and they're shelling out more in customer-acquisition costs to get you to order from them. Fulfilling online orders is also generally more expensive than selling items in person. All these add up to increased costs that make it harder to offer discounts.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Online+Discounts+Are+Getting+Stingier%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F09%2F24%2F191203%2F%3Futm_source%3Dtwitter%", "id": 1205396, "language": null, "link": "https://news.slashdot.org/story/24/09/24/191203/online-discounts-are-getting-stingier?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Online Discounts Are Getting Stingier", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T21:08:07.479073+00:00", "description": "wiredmikey writes: CrowdStrike says it has revamped several testing, validation, and update rollout processes to prevent a repeat of the embarrassing July outage that caused widespread disruption on Windows systems around the world. \n\nIn testimony before the House Subcommittee on Cybersecurity, CrowdStrike vice president Adam Meyers outlined a new set of protocols that include carefully controlled rollouts of software updates, better validation of code inputs, and new testing procedures to cover a broader array of problematic scenarios.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=CrowdStrike+Overhauls+Testing+and+Rollout+Procedures+To+Avoid+System+Crashes%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F09%2F24%2F195217%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashd", "id": 1205395, "language": null, "link": "https://it.slashdot.org/story/24/09/24/195217/crowdstrike-overhauls-testing-and-rollout-procedures-to-avoid-system-crashes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "CrowdStrike Overhauls Testing and Rollout Procedures To Avoid System Crashes", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T20:03:10.159352+00:00", "description": "GPS spoofing attacks are increasingly disrupting commercial flights worldwide, with over 1,100 daily incidents reported in August, up from dozens in February. The false signals, primarily originating from Russia, Ukraine, and Israel, confuse cockpit navigation systems, triggering false alarms and misdirecting flight paths, WSJ reports. \n\nPilots report clocks resetting, erroneous warnings, and navigation errors lasting minutes to entire flights. While no major safety incidents have occurred, aviation officials warn that managing these disruptions could overburden crews during emergencies. Airlines, manufacturers, and regulators are scrambling for solutions, but new equipment standards to combat spoofing won't be ready until next year at the earliest. In the meantime, pilots receive briefings on identifying and responding to potential attacks, sometimes instructed to ignore safety system warnings.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http", "id": 1205050, "language": null, "link": "https://tech.slashdot.org/story/24/09/24/1857224/electronic-warfare-spooks-airlines-pilots-and-air-safety-officials?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Electronic Warfare Spooks Airlines, Pilots and Air-Safety Officials", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T18:58:09.968637+00:00", "description": "Fourteen of the world's biggest banks and financial institutions are pledging to increase their support for nuclear energy [non-paywalled link], a move that governments and the industry hope will unlock finance for a new wave of nuclear power plants. FT: At an event on Monday in New York with White House climate policy adviser John Podesta, institutions including Bank of America, Barclays, BNP Paribas, Citi, Morgan Stanley and Goldman Sachs will say they support a goal first set out at the COP28 climate negotiations last year to triple the world's nuclear energy capacity by 2050. \n\nThey will not spell out exactly what they would do, but nuclear experts said the public show of support was a long-awaited recognition that the sector had a critical role to play in the transition to low-carbon energy. The difficulty and high cost of financing nuclear projects has been an obstacle to new plants and contributed to a significant slowdown in western countries since a wave of reactors was built", "id": 1204674, "language": null, "link": "https://hardware.slashdot.org/story/24/09/24/188243/worlds-biggest-banks-pledge-support-for-nuclear-power?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "World's Biggest Banks Pledge Support For Nuclear Power", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T18:58:09.884791+00:00", "description": "The Department of Justice has filed an antitrust lawsuit against Visa, alleging that the financial services firm has an illegal monopoly over debit network markets and has attempted to unlawfully crush competitors, including fintech companies like PayPal and Square. From a report: The lawsuit follows a multiyear investigation of Visa which the company disclosed in 2021. \"We allege that Visa has unlawfully amassed the power to extract fees that far exceed what it could charge in a competitive market,\" Attorney General Merrick Garland said in a statement. \"Merchants and banks pass along those costs to consumers, either by raising prices or reducing quality or service. As a result, Visa's unlawful conduct affects not just the price of one thing -- but the price of nearly everything.\" \n\nVisa makes more than $7 billion a year in payment processing fees alone, and more than 60 percent of debit transactions in the United States run on Visa's network, the complaint claims. The government alle", "id": 1204673, "language": null, "link": "https://news.slashdot.org/story/24/09/24/1848223/doj-sues-visa-for-locking-out-rival-payment-platforms?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "DOJ Sues Visa For Locking Out Rival Payment Platforms", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T17:53:02.188843+00:00", "description": "An anonymous reader shares a report: The Pacific country of Kiribati might be surrounded by water, but on land its population is running dry. The ocean around them is steadily encroaching, contaminating underground wells and leeching salt into the soil. \"Our waters have been infected,\" climate activist and law student Christine Tekanene says. \"Those who are affected, they now can't survive with the water that changed after sea level rise.\" The freshwater crisis is just one of the many threats driven by rising seas in Kiribati. Its people live on a series of atolls, peaking barely a couple of metres above a sprawling tract of the Pacific Ocean. As global temperatures rise and ice sheets melt, Kiribati -- and other low-lying nations like it -- are experiencing extreme and regular flooding, frequent coastal erosion and persistent food and water insecurity. \n\nThis week the United Nations general assembly will hold a high-level meeting to address the existential threats posed by sea level ", "id": 1204246, "language": null, "link": "https://news.slashdot.org/story/24/09/24/1618221/low-lying-pacific-islands-pin-hopes-on-un-meeting-as-sea-rise-threatens-survival?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Low-Lying Pacific Islands Pin Hopes on UN Meeting as Sea Rise Threatens Survival", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T17:53:01.962941+00:00", "description": "silverjacket writes: A feature for The New Yorker describes a plan to use robots to mine lunar materials and build a radio telescope on the far side of the moon that will help answer questions about the early universe. An excerpt from the story: he dream of a lunar telescope dates to the nineteen-sixties. The moon has the advantage of being hundreds of thousands of miles away from earthly electronics; on the far side of the moon, in particular, there's virtually no noise from human technology or the Earth's magnetosphere. After the Apollo landings, however, interest in the moon waned. Jack Burns, an astrophysicist who is now at the University of Colorado Boulder, has been advocating for a moon-based telescope since 1984. \"I never, never would have guessed that it would take this long,\" he told me. \"I just won't accept no for an answer.\" Today, Burns is the chief scientist of FarView, as well as the primary investigator of a sort of mini-FarView: FARSIDE, which would have one or two hu", "id": 1204245, "language": null, "link": "https://science.slashdot.org/story/24/09/24/1737223/the-quest-to-build-a-telescope-on-the-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Quest To Build a Telescope On the Moon", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T16:48:51.900820+00:00", "description": "WordPress hosting service WP Engine on Monday sent a cease-and-desist letter to Automattic after the latter's CEO Matt Mullenweg called WP Engine a \"cancer to WordPress\" last week. From a report: The notice asks Automattic and Mullenweg to retract their comments and stop making statements against the company. WP Engine, which (like Automattic itself) commercializes the open-source WordPress project, also accused Mullenweg of threatening WP Engine before the WordCamp summit held last week. \"Automattic's CEO Matthew Mullenweg threatened that if WP Engine did not agree to pay Automattic -- his for-profit entity -- a very large sum of money before his September 20th keynote address at the WordCamp US Convention, he was going to embark on a self-described 'scorched earth nuclear approach' toward WP Engine within the WordPress community and beyond, the letter read. \"When his outrageous financial demands were not met, Mr. Mullenweg carried out his threats by making repeated false claims disp", "id": 1203777, "language": null, "link": "https://yro.slashdot.org/story/24/09/24/1547236/wp-engine-sends-cease-and-desist-letter-to-automattic-over-mullenwegs-comments?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "WP Engine Sends Cease-and-Desist Letter To Automattic Over Mullenweg's Comments", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T16:48:51.663175+00:00", "description": "An anonymous reader shares a report: The alleged Iranian hack of Donald Trump's orbit continued at least until mid-September and may be ongoing, a document the hackers shared with a progressive publication reveals. Iranian authorities have denied any involvement in the efforts to leak internal documents from Trump's campaign, which have reportedly been sent to major US publications including Politico and The New York Times, and to the Biden campaign. But the campaign and outside analysts have blamed the hack on the Iranians, who have ample reasons for hostility to the former president and also allegedly plotted his assassination. \n\nThe publisher of the newsletter Popular Information, Judd Legum, writes this morning that a source under the name \"Robert\" shared a set of documents with him. Those included a research dossier on JD Vance matching other publications' descriptions of the hacked material. But the leak also included a legal letter to The New York Times complaining about an art", "id": 1203776, "language": null, "link": "https://news.slashdot.org/story/24/09/24/1610215/trump-hack-continued-into-last-week?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Trump Hack Continued Into Last Week", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T14:38:07.066211+00:00", "description": "Speaking of California, its governor Gavin Newsom has signed into law a a bill that requires schools to limit or ban the use of smartphones, amid a growing consensus that excess usage can increase the risk of mental illness and impair learning. From a report: Thirteen other states this year have banned or restricted cellphones in school or recommended local educators do so, after Florida led the way by banning phones in class in 2023, according to Education Week. California, with nearly 5.9 million public school students, has followed the lead of its own Los Angeles County, whose school board banned smartphones for its 429,000 students in June. \n\nThat same month U.S. Surgeon General Vivek Murthy called for a warning label on social media platforms, akin to those on cigarette packages, likening the problem to a mental health emergency. Murthy cited a study in the medical journal JAMA showing adolescents who spend more than three hours a day on social media may be at heightened risk of ", "id": 1202816, "language": null, "link": "https://news.slashdot.org/story/24/09/24/0958209/california-passes-law-to-ban-or-restrict-smartphones-in-school?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "California Passes Law To Ban or Restrict Smartphones in School", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T14:38:06.969862+00:00", "description": "Google is getting ready to show off updated Street View imagery in nearly 80 countries. The Verge: In a now-removed blog post seen by The Verge, Google announced that the new images are coming to countries like Australia, Brazil, Denmark, Japan, the Philippines, Rwanda, Serbia, South Africa, and more. Google is also bringing Street View to a handful of countries where it's never been available, including Bosnia, Namibia, Lichtenstein, and Paraguay. The company said its more portable Street View camera, which launched in 2022, will help offer images of \"even more places in the future.\" \n\nGoogle Maps and Google Earth are getting sharper satellite imagery as well, thanks to the company's cloud-removal AI tool that takes out clouds, shadows, haze, and mist. This should result in \"brighter, more vibrant\" images, according to Google.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+To+Update+Street+View+Images+Across", "id": 1202815, "language": null, "link": "https://tech.slashdot.org/story/24/09/24/1415224/google-to-update-street-view-images-across-dozens-of-countries-deleted-blog-post-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google To Update Street View Images Across Dozens of Countries, Deleted Blog Post Says", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T13:32:54.075714+00:00", "description": "An anonymous reader quotes a report from the New York Times: Paper or paper? In California, shoppers will have only one bag option at the checkout line starting in 2026. A decade ago, California became the first U.S. state to ban single-use plastic bags, the flimsy sacks that regularly blew into waterways, littered streets and collected in landfills. The prohibition, in the nation's most populous state, was considered a turning point in the effort to reduce plastic waste. But the move backfired in a way that few supporters expected. Californians in 2021 actually tossed nearly 50 percent more plastic bags, by weight, than when the law first passed in 2014, according to data from CalRecycle, California's recycling agency. A loophole in the initial ban allowed retailers to provide thick-walled plastic bags and charge 10 cents a piece for them. Though technically reusable and recyclable, the heavier-duty sacks still ended up in many trash cans after a shopping trip.\n \nGov. Gavin Newsom si", "id": 1202271, "language": null, "link": "https://yro.slashdot.org/story/24/09/24/0422213/california-bans-all-plastic-bags?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "California Bans All Plastic Bags", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T10:17:54.154934+00:00", "description": "schwit1 shares a report SpaceNews with the caption: \"Failures aren't failures if you learn from them.\" From the report: Chinese commercial rocket firm Deep Blue Aerospace conducted a first-stage rocket hop test Sunday, experiencing a partial failure during the final moments of landing. Deep Blue Aerospace carried out the test at 1:40 a.m. Eastern (0540 UTC) Sept. 22 at the firm's Ejin Banner Spaceport in Inner Mongolia using a Nebula-1 rocket first stage. Footage of the vertical liftoff, vertical landing test shows the rocket ascending to a predetermined altitude before shutting off two of the three engines used for the 179-second flight. Landing legs deployed as planned, and the stage hovered above its planned landing spot. However an anomaly during the final engine shutdown phase led to a higher-than-expected landing altitude, leading to partial damage. You can watch the landing attempt and explosion here.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpo", "id": 1201105, "language": null, "link": "https://science.slashdot.org/story/24/09/24/0410259/deep-blue-aerospace-hop-test-suffers-anomaly-moments-before-landing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Deep Blue Aerospace Hop Test Suffers Anomaly Moments Before Landing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T08:07:42.081961+00:00", "description": "A startup called Amogy has successfully converted a 67-year-old diesel tugboat to run on clean ammonia, marking a significant milestone in the transition to zero-emissions propulsion in the maritime industry. The Associated Press reports: Amogy's system uses ammonia to make hydrogen for a fuel cell, making the tug an electric-powered ship. The International Maritime Organization set a target for international shipping to reach net-zero greenhouse gas emissions by, or close to, 2050. Shipping needs to cut emissions rapidly and there are no solutions widely available today to fully decarbonize deep-sea shipping, according to the Global Maritime Forum, a nonprofit that works closely with the industry. There is a lot of interest in ammonia as an alternative fuel because the molecule doesn't contain carbon, said Jesse Fahnestock, who leads the forum's decarbonization work. Ammonia is widely used for fertilizer, so there is already infrastructure in place for handling and transporting it. T", "id": 1200546, "language": null, "link": "https://news.slashdot.org/story/24/09/24/0359225/tugboat-powered-by-ammonia-sails-for-the-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Tugboat Powered By Ammonia Sails For the First Time", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T03:47:02.354757+00:00", "description": "An anonymous reader quotes a report from CNN: California Attorney General Rob Bonta filed a lawsuit against ExxonMobil on Monday alleging the company carried out a \"decades-long campaign of deception\" in which the oil and gas giant misled the public on the merits of plastic recycling. The complaint accuses the company of using slick marketing and misleading public statements for half a century to claim recycling was an effective way to deal with plastic pollution, according to a press release from Bonta's office published Monday. It alleges the company continues to perpetuate the \"myth\" of recycling today. The case, filed in the San Francisco County Superior Court, seeks to compel ExxonMobil \"to end its deceptive practices that threaten the environment and the public,\" the statement said.\n \nBonta is also asking the court to rule ExxonMobil must pay civil penalties, among other payments, for the harm inflicted by plastic pollution in California. \"Plastics are everywhere, from the deepe", "id": 1199764, "language": null, "link": "https://yro.slashdot.org/story/24/09/23/2336240/california-sues-exxonmobil-for-alleged-decades-of-deception-around-plastic-recycling?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "California Sues ExxonMobil For Alleged Decades of Deception Around Plastic Recycling", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T02:42:06.015332+00:00", "description": "rPlus Energies has broken ground on a $1 billion solar + battery storage project in east-central Utah. Electrek reports: The Green River Energy Center in Emery County, Utah, is a 400-megawatt (MW) solar and 400 MW/1,600-megawatt-hour battery storage project that will supply power to western electric utility PacifiCorp under a power purchase agreement. EliTe Solar is supplying solar panels, and Tesla is providing battery storage. Sundt Construction is the engineering, procurement, and construction contractor for the project. Securing over $1 billion in construction debt financing in July, the Green River project is expected to create around 500 jobs. Salt Lake City-based rPlus Energies gives the target completion date as 2026.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=%241+Billion+Solar+and+Battery+Storage+Project+Breaks+Ground+In+Utah%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F09%2F23%2F2327225%2F%3F", "id": 1199623, "language": null, "link": "https://hardware.slashdot.org/story/24/09/23/2327225/1-billion-solar-and-battery-storage-project-breaks-ground-in-utah?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "$1 Billion Solar and Battery Storage Project Breaks Ground In Utah", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T01:37:14.218551+00:00", "description": "Steam has broken its record for the most PC players online, with 38,366,479 concurrent gamers. As IGN notes, that figure is a million more than the previous record, set last month. From the report: So, what helped propel Steam to new heights over the weekend? All the usual suspects were in the top 10 most-played games on Valve's platform, including Counter-Strike 2, Dota 2, Banana (yes, Banana has yet to split), and PUBG, with this year's Black Myth: Wukong, Satisfactory 1.0, Space Marine 2, and Valve's own Deadlock putting in work. Last week saw PlayStation exclusives God of War Ragnarok and Final Fantasy 16 both launch on Steam for the first time, which will have provided a modest boost, too.\n \nThe popularity of Steam is gradually increasing as Valve's vice-like grip on the PC market tightens ever further. Competitors such as the Epic Games Store and CD Projekt's GOG occupy a relatively small piece of the PC gaming pie, with Steam continuing to enjoy record-breaking success even ami", "id": 1199476, "language": null, "link": "https://games.slashdot.org/story/24/09/23/2143208/steam-breaks-its-record-for-pc-players-online-once-again?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Steam Breaks Its Record For PC Players Online Once Again", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T01:37:13.887245+00:00", "description": "In a rare blog post today, OpenAI CEO Sam Altman laid out his vision of the AI-powered future, which he refers to as \"The Intelligence Age.\" Among the most notable claims, Altman said superintelligence might be achieved in \"a few thousand days.\" VentureBeat reports: Specifically, Altman argues that \"deep learning works,\" and can generalize across a range of domains and difficult problem sets based on its training data, allowing people to \"solve hard problems,\" including \"fixing the climate, establishing a space colony, and the discovery of all physics.\" As he puts it: \"That's really it; humanity discovered an algorithm that could really, truly learn any distribution of data (or really, the underlying \"rules\" that produce any distribution of data). To a shocking degree of precision, the more compute and data available, the better it gets at helping people solve hard problems. I find that no matter how much time I spend thinking about this, I can never really internalize how consequenti", "id": 1199475, "language": null, "link": "https://slashdot.org/story/24/09/23/2321221/openai-ceo-sam-altman-anticipates-superintelligence-in-a-few-thousand-days?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI CEO Sam Altman Anticipates Superintelligence In 'a Few Thousand Days'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T00:32:11.967196+00:00", "description": "Ars Technica's Dan Goodin reports: Five years ago, researchers made a grim discovery -- a legitimate Android app in the Google Play market that was surreptitiously made malicious by a library the developers used to earn advertising revenue. With that, the app was infected with code that caused 100 million infected devices to connect to attacker-controlled servers and download secret payloads. Now, history is repeating itself. Researchers from the same Moscow, Russia-based security firm reported Monday that they found two new apps, downloaded from Play 11 million times, that were infected with the same malware family. The researchers, from Kaspersky, believe a malicious software developer kit for integrating advertising capabilities is once again responsible. [...]\n \nThe researchers found Necro in two Google Play apps. One was Wuta Camera, an app with 10 million downloads to date. Wuta Camera versions 6.3.2.148 through 6.3.6.148 contained the malicious SDK that infects apps. The app ha", "id": 1199277, "language": null, "link": "https://it.slashdot.org/story/24/09/23/213203/11-million-devices-infected-with-botnet-malware-hosted-in-google-play?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "11 Million Devices Infected With Botnet Malware Hosted In Google Play", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-24T00:32:11.880652+00:00", "description": "An anonymous reader quotes a report from TechCrunch: With the perennial tensions between proprietary and open source software (OSS) unlikely to end anytime soon, a $3 billion startup is throwing its weight behind a new licensing paradigm -- one that's designed to bridge the open and proprietary worlds, replete with new definition, terminology, and governance model. Developer software company Sentry recently introduced a new license category dubbed \"fair source.\" Sentry is an initial adopter, as are some half dozen others, including GitButler, a developer tooling company from one of GitHub's founders. The fair source concept is designed to help companies align themselves with the \"open\" software development sphere, without encroaching into existing licensing landscapes, be that open source, open core, or source-available, and while avoiding any negative associations that exist with \"proprietary.\" However, fair source is also a response to the growing sense that open source isn't workin", "id": 1199276, "language": null, "link": "https://news.slashdot.org/story/24/09/23/2126218/startups-are-going-fair-source-to-avoid-pitfalls-of-open-source-licensing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Startups Are Going 'Fair Source' To Avoid Pitfalls of Open Source Licensing", "vote": 0}]