[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T23:18:19.081715+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Crashing into parked cars, drifting over into oncoming traffic, intruding into construction zones -- all this \"unexpected behavior\" from Waymo's self-driving vehicles may be violating traffic laws, the US National Highway Traffic Safety Administration (NHTSA) said (PDF) Monday. To better understand Waymo's potential safety risks, NHTSA's Office of Defects Investigation (ODI) is now looking into 22 incident reports involving cars equipped with Waymo's fifth-generation automated driving system. Seventeen incidents involved collisions, but none involved injuries.\n \nSome of the reports came directly from Waymo, while others \"were identified based on publicly available reports,\" NHTSA said. The reports document single-party crashes into \"stationary and semi-stationary objects such as gates and chains\" as well as instances in which Waymo cars \"appeared to disobey traffic safety control devices.\" The ODI plans to compare notes between in", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/1957209/feds-probe-waymo-driverless-cars-hitting-parked-cars-drifting-into-traffic?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Feds Probe Waymo Driverless Cars Hitting Parked Cars, Drifting Into Traffic", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T23:18:17.580657+00:00", "description": "Dan Robinson reports via The Register: VMware has made another small but notable post-merger concession to users: the Workstation Pro and Fusion Pro desktop hypervisor products will now be free for personal use. The cloud and virtualization biz, now a Broadcom subsidiary, has announced that its Pro apps will be available under two license models: a \"Free Personal Use\" or a \"Paid Commercial Use\" subscription for organizations. Workstation Pro is available for PC users running Windows or Linux, while Fusion Pro is available for Mac systems with either Intel CPUs or Apple's own processors. The two products allow users to create a virtual machine on their local computer for the purpose of running a different operating system or creating a sandbox in which to run certain software. [...]\n \nAccording to VMware, users will get to decide for themselves if their use case calls for a commercial subscription. There are no functional differences between the two versions, the company states, and th", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/203234/vmware-giving-away-workstation-pro-fusion-pro-free-for-personal-use?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "VMware Giving Away Workstation Pro, Fusion Pro Free For Personal Use", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T22:13:44.391646+00:00", "description": "A portal linking New York City to Dublin via a livestream has been temporarily shut down after inappropriate behavior ensued, according to the Dublin City Council. From a report: Less than a week after the 24/7 visual art installation was put in place, officials have opted to close it down temporarily after people began to flash each other, grind on the portal, and one person even shared pictures of the twin tower attack to people in New York City. Alternatively, the portal had also been the site of reunions with old friends and even a proposal, with many documenting their experience with the installation online. \n\nThe Dublin City Council said that although those engaged in the inappropriate behavior were few and far between, videos of said behavior went viral online. \"While we cannot control all of these actions, we are implementing some technical solutions to address this and these will go live in the next 24 hours,\" the council said in a Monday statement. \"We will continue to monit", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/1914233/dublin-to-new-york-city-portal-temporarily-shut-down-due-to-inappropriate-behavior?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Dublin To New York City Portal Temporarily Shut Down Due To Inappropriate Behavior", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T21:08:34.254096+00:00", "description": "Marc Whitten, Unity Create's chief product and technology officer, is stepping down on June 1, 2024, following the company's contentious Runtime Fee policy. Whitten will assist with the transition until December 31, 2024. The now-discarded Runtime Fee, announced in September 2023, faced severe backlash from developers who viewed it as a punitive per-install tariff. Unity reworked the fee and acknowledged its lack of communication with developers. CEO John Riccitiello also departed in October 2023, succeeded by Matthew Bromberg. Upon resignation, Whitten will receive a total of $814,801 in various payouts and benefits.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Unity's+Marc+Whitten+Resigns+Amid+Runtime+Fee+Controversy%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F05%2F14%2F1852236%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.faceboo", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/1852236/unitys-marc-whitten-resigns-amid-runtime-fee-controversy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Unity's Marc Whitten Resigns Amid Runtime Fee Controversy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T21:08:32.746286+00:00", "description": "An anonymous reader shares a report: Google's Gemini AI often just feels like a chatbot built into a text-input field, but you can really start to do special things when you give it access to a ton of data. Gemini in Gmail will soon be able to search through your entire backlog of emails and show a summary in a sidebar. That's simple to describe but solves a huge problem with email: even searching brings up a list of email subjects, and you have to click-through to each one just to read it. \n\nHaving an AI sift through a bunch of emails and provide a summary sounds like a huge time saver and something you can't do with any other interface. Google's one-minute demo of this feature showed a big blue Gemini button at the top right of the Gmail web app. Tapping it opens the normal chatbot sidebar you can type in. Asking for a summary of emails from a certain contact will get you a bullet-point list of what has been happening, with a list of \"sources\" at the bottom that will jump you right ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/1858253/ai-in-gmail-will-sift-through-emails-provide-search-summaries-send-emails?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI in Gmail Will Sift Through Emails, Provide Search Summaries, Send Emails", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T20:03:26.201350+00:00", "description": "Among Google's swath of new AI models and tools announced today, the company is also expanding its AI content watermarking and detection technology to work across two new mediums. The Verge: Google's DeepMind CEO, Demis Hassabis, took the stage for the first time at the Google I/O developer conference on Tuesday to talk not only about the team's new AI tools, like the Veo video generator, but also about the new upgraded SynthID watermark imprinting system. It can now mark video that was digitally generated, as well as AI-generated text. \n\n[...] Google had also enabled SynthID to inject inaudible watermarks into AI-generated music that was made using DeepMind's Lyria model. SynthID is just one of several AI safeguards in development to combat misuse by the tech, safeguards that the Biden administration is directing federal agencies to build guidelines around.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google's+Invisible+AI+Watermark+Will+H", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/1822200/googles-invisible-ai-watermark-will-help-identify-generative-text-and-video?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's Invisible AI Watermark Will Help Identify Generative Text and Video", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T18:59:29.181985+00:00", "description": "Google is shaking up Search. On Tuesday, the company announced big new AI-powered changes to the world's dominant search engine at I/O, Google's annual conference for developers. From a report: With the new features, Google is positioning Search as more than a way to simply find websites. Instead, the company wants people to use its search engine to directly get answers and help them with planning events and brainstorming ideas. \"[With] generative AI, Search can do more than you ever imagined,\" wrote Liz Reid, vice president and head of Google Search, in a blog post. \"So you can ask whatever's on your mind or whatever you need to get done -- from researching to planning to brainstorming -- and Google will take care of the legwork.\" \n\nGoogle's changes to Search, the primary way that the company makes money, are a response to the explosion of generative AI ever since OpenAI's ChatGPT released at the end of 2022. [...] Starting today, Google will show complete AI-generated answers in res", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/1810256/google-search-will-now-show-ai-generated-answers-to-millions-by-default?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Search Will Now Show AI-Generated Answers To Millions By Default", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T18:59:27.289090+00:00", "description": "samleecole writes: For the last decade, farmers have been warning that John Deere, a company celebrated by farmers, country musicians, and politicians, has been doing something else very American: Concentrating power, stripping away the ownership rights of people who buy their products, and adding a bevy of artificial, software-based repair restrictions that have effectively created a regime in which farmers can no longer fix their own tractors, combines, harvesters, and other agricultural equipment. Farmers have resorted to pirating John Deere's software and firmware on underground forums and torrent sites, and have used software cracked by Ukrainian pirates in order to simply fix the things they own. Farmers often have to wait days or weeks for an \"authorized\" John Deere dealership to come to their farms to repair their equipment, meanwhile their crops die on the vine.\n\n For years, very little happened to slow down John Deere's march toward total control of the repair market. But in", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/14/1813256/the-walls-are-closing-in-on-john-deeres-tractor-repair-monopoly?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Walls Are Closing In On John Deere's Tractor Repair Monopoly", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T17:56:18.808562+00:00", "description": "The person who claimed to have stolen the physical addresses of 49 million Dell customers appears to have taken more data from a different Dell portal, TechCrunch reported Tuesday. From the report: The newly compromised data includes names, phone numbers and email addresses of Dell customers. This personal data is contained in customer \"service reports,\" which also include information on replacement hardware and parts, comments from on-site engineers, dispatch numbers, and in some cases diagnostic logs uploaded from the customer's computer. \n\nSeveral reports seen by TechCrunch contain pictures apparently taken by customers and uploaded to Dell for seeking technical support. Some of these pictures contain metadata revealing the precise GPS coordinates of the location where the customer took the photos, according to a sample of the scraped data obtained by TechCrunch.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Threat+Actor+Scraped+Dell+Supp", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/14/1654237/threat-actor-scraped-dell-support-tickets-including-customer-phone-numbers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Threat Actor Scraped Dell Support Tickets, Including Customer Phone Numbers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T17:56:17.130262+00:00", "description": "An anonymous reader shares a report: At a privately held event, Google recently demonstrated a special build of Chromium OS -- code-named \"ferrochrome\" -- running in a virtual machine on a Pixel 8. However, Chromium OS wasn't shown running on the phone's screen itself. Rather, it was projected to an external display, which is possible because Google recently enabled display output on its Pixel 8 series. Time will tell if Google is thinking of positioning Chrome OS as a platform for its desktop mode ambitions and Samsung DeX rival.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+is+Experimenting+With+Running+Chrome+OS+on+Android%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F05%2F14%2F1723223%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F05%2F14%2F1723223%2Fgoo", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/1723223/google-is-experimenting-with-running-chrome-os-on-android?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google is Experimenting With Running Chrome OS on Android", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T16:44:35.549348+00:00", "description": "Meta is shutting down Workplace, the tool it sold to businesses that combined social and productivity features, according to messages to customers obtained by Axios and confirmed by Meta. From the report:Meta has been cutting jobs and winnowing its product line for the last few years while investing billions first in the metaverse and now in AI. Micah Collins, Meta's senior director of product management, sent a message to customers alerting them of the shutdown. \n\nCollins said customers can use Workplace through September 2025, when it will become available only to download or read existing data. The service will shut down completely in 2026. Workplace was formerly Facebook at Work, and launched in its current form in 2016. In 2021 the company reported it had 7 million paid subscribers.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Will+Shut+Down+Workplace%2C+Its+Business+Chat+Tool%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F05%2", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/1559204/meta-will-shut-down-workplace-its-business-chat-tool?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Will Shut Down Workplace, Its Business Chat Tool", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T15:39:38.228182+00:00", "description": "A panel of judges in the Netherlands has found Alexey Pertsev, one of the developers behind crypto anonymizing tool Tornado Cash, guilty of money laundering. Wired: Over the course of two days in March, the Russian national was tried on the allegation that the tool he developed had allowed criminals -- among them hackers with ties to North Korea -- to freely launder $1.2 billion in stolen cryptocurrency. \"The management of Tornado Cash welcomed the bank robbers with open arms,\" the prosecutors wrote in a March court filing. \n\nDutch judges sentenced Pertsev to five years and four months in prison on Tuesday, which was the term requested by prosecutors in the case. \"With Tornado Cash, the defendant created a shortcut for financing crimes and terrorism,\" said the court in a statement, translated from Dutch. \"He chose to look away from the abuse and did not take any responsibility.\" The purpose of tools like Tornado Cash, known as crypto mixers or tumblers, is to mask the origin and desti", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/14/1411258/tornado-cash-developer-found-guilty-of-laundering-12-billion-of-crypto?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Tornado Cash Developer Found Guilty of Laundering $1.2 Billion of Crypto", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T15:39:36.233438+00:00", "description": "The developers of team-based shooter Marvel Rivals have apologized for a contract clause that made creators promise not to provide \"subjective negative reviews of the game\" in exchange for early access to a closed alpha test. From a report: The controversial early access contract gained widespread attention over the weekend when streamer Brandon Larned shared a portion on social media. In the \"non-disparagement\" clause shared by Larned, creators who are provided with an early download code are asked not to \"make any public statements or engage in discussions that are detrimental to the reputation of the game.\" In addition to the \"subjective negative review\" example above, the clause also specifically prohibits \"making disparaging or satirical comments about any game-related material\" and \"engaging in malicious comparisons with competitors or belittling the gameplay or differences of Marvel Rivals.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?stat", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/14/144239/game-dev-says-contract-barring-subjective-negative-reviews-was-a-mistake?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Game Dev Says Contract Barring 'Subjective Negative Reviews' Was a Mistake", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T14:34:58.592902+00:00", "description": "AWS CEO Adam Selipsky is stepping down, effective June 3, according to an email from Amazon CEO Andy Jassy. Matt Garman, SVP of AWS sales, marketing, and global services at Amazon, will replace Selipsky as CEO.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AWS+CEO+To+Step+Down%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F05%2F14%2F1342220%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F05%2F14%2F1342220%2Faws-ceo-to-step-down%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/24/05/14/1342220/aws-ceo-to-step-down?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p>", "language": "en-us", "link": "https://slashdot.org/story/24/05/14/1342220/aws-ceo-to-step-down?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AWS CEO To Step Down", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T13:29:27.849200+00:00", "description": "An anonymous reader quotes a report from the Washington Post: Return-to-office mandates at some of the most powerful tech companies -- Apple, Microsoft and SpaceX -- were followed by a spike in departures among the most senior, tough-to-replace talent, according to a case study published last week by researchers at the University of Chicago and the University of Michigan. Researchers drew on resume data from People Data Labs to understand the impact that forced returns to offices had on employee tenure and the movement of workers between companies. What they found was a strong correlation between the departures of senior-level employees and the implementation of a mandate, suggesting that these policies \"had a negative effect on the tenure and seniority of their respective workforce.\" High-ranking employees stayed several months less than they might have without the mandate, the research suggests -- and in many cases, they went to work for direct competitors.\n \nAt Microsoft, the share", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/14/0313258/ordered-back-to-the-office-top-tech-talent-left-instead-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ordered Back To the Office, Top Tech Talent Left Instead, Study Finds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T10:14:06.397923+00:00", "description": "According to a new study published in the journal Technology, Mind and Behavior, researchers found that internet use is associated with greater wellbeing in people around the world. \"Our analysis is the first to test whether or not internet access, mobile internet access and regular use of the internet relates to wellbeing on a global level,\" said Prof Andrew Przybylski, of the University of Oxford, who co-authored the work. The Guardian reports: [T]he study describes how Przybylski and Dr Matti Vuorre, of Tilburg University in the Netherlands, analysed data collected through interviews involving about 1,000 people each year from 168 countries as part of the Gallup World Poll. Participants were asked about their internet access and use as well as eight different measures of wellbeing, such as life satisfaction, social life, purpose in life and feelings of community wellbeing.\n \nThe team analyzed data from 2006 to 2021, encompassing about 2.4 million participants aged 15 and above. The", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/031240/internet-use-is-associated-with-greater-wellbeing-global-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Internet Use Is Associated With Greater Wellbeing, Global Study Finds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T08:04:21.684269+00:00", "description": "Cruise's autonomous vehicles have resumed operation in Phoenix, Arizona, following an incident in San Francisco last October where a driverless vehicle dragged a pedestrian. The Verge reports: Cruise spokesperson Tiffany Testo said the company is deploying only two autonomous vehicles with safety drivers behind the wheel. In addition, the company has eight manually driven vehicles in the city. Eventually, the service area will \"gradually expand\" to include Scottsdale, Paradise Valley, Tempe, Mesa, Gilbert, and Chandler -- \"measured against predetermined safety benchmarks.\"\n \nCruise's slow return to the road is noteworthy, given the huge hurdles facing the company in the wake of the October incident. Regulators accused the company of misleading them about the nature and severity of the incident, in which a pedestrian was dragged over 20 feet by a driverless Cruise after first being struck by a hit-and-run driver.\n \nSeveral top executives have since left the company, including founder a", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/0235219/cruise-is-back-driving-autonomously-after-pedestrian-dragging-incident?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cruise Is Back Driving Autonomously After Pedestrian-Dragging Incident", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T03:44:07.307674+00:00", "description": "An anonymous reader quotes a report from Wired: On a side street outside the headquarters of the Department of Science, Innovation and Technology in the center of London on Monday, 20 or so protesters are getting their chants in order. \"What do we want? Safe AI! When do we want it?\" The protesters hesitate. \"Later?\" someone offers. The group of mostly young men huddle for a moment before breaking into a new chant. \"What do we want? Pause AI! When do we want it? Now!\" These protesters are part of Pause AI, a group of activists petitioning for companies to pause development of large AI models which they fear could pose a risk to the future of humanity. Other PauseAI protests are taking place across the globe: In San Francisco, New York, Berlin, Rome, Ottawa, and ahandful of other cities. Their aim is to grab the attention of voters and politicians ahead of the AI Seoul Summit -- a follow-up to the AI Safety Summit held in the UK in November 2023. But the loosely organized group of prote", "language": "en-us", "link": "https://ask.slashdot.org/story/24/05/14/0127226/slashdot-asks-how-do-you-protest-ai-development?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Slashdot Asks: How Do You Protest AI Development?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T02:39:11.701449+00:00", "description": "Josh Norem reports via ExtremeTech: At the recent International supercomputing conference called ISC 2024, Intel's newest Aurora supercomputer installed at Argonne National Laboratory raised a few eyebrows by finally surpassing the exascale barrier. Before this, only AMD's Frontier system had been able to achieve this level of performance. Intel also achieved what it says is the world's best performance for AI at 10.61 \"AI exaflops.\" Intel reported the news on its blog, stating Aurora was now officially the fastest supercomputer for AI in the world. It shares the distinction in collaboration with Argonne National Laboratory and Hewlett Packard Enterprise (HPE), which both built and houses the system in its current state, which Intel says was at 87% functionality for the recent tests. In the all-important Linpack (HPL) test, the Aurora computer hit 1.012 exaflops, meaning it has almost doubled the performance on tap since its initial \"partial run\" in late 2023, where it hit just 585.34", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/14/014243/intel-aurora-supercomputer-breaks-exascale-barrier?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Aurora Supercomputer Breaks Exascale Barrier", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T01:34:13.826048+00:00", "description": "Brandon Vigliarolo reports via The Register: Not everything in the semiconductor industry is about shearing off every last nanometer, which is why the Biden administration is splashing out CHIPS Act funding to those pursuing less cutting edge processor production. Case in point, today's announcement that Bloomington, Minnesota-based Polar Semiconductor could be getting up to $120 million in CHIPS funds to double production capacity over the next two years, along with a possible buyout to return the business to U.S. hands.\n \nPolar, which manufactures semiconductors used primarily for the energy industry and electric vehicles, will use the funds to double its production capacity of sensor and power chips and upgrade its manufacturing kit, as well as adding 160 jobs to boot. Along with expanding production, the U.S. Department of Commerce said the funding would trigger additional private capital investment to \"transform Polar from a majority foreign-owned in-house manufacturer to a major", "language": "en-us", "link": "https://slashdot.org/story/24/05/14/0046237/biden-admin-shells-out-120-million-to-return-chip-startup-to-us-ownership?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Biden Admin Shells Out $120 Million To Return Chip Startup To US Ownership", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T01:34:12.118059+00:00", "description": "OpenAI has launched an official macOS app for ChatGPT, with a Windows version coming \"later this year.\" \"Both free and paid users will be able to access the new app, but it will only be available to ChatGPT Plus users starting today before a broader rollout in 'the coming weeks,'\" reports The Verge. From the report: In the demo shown by OpenAI, users could open the ChatGPT desktop app in a small window, alongside another program. They asked ChatGPT questions about what's on their screen -- whether by typing or saying it. ChatGPT could then respond based on what it \"sees.\" OpenAI says users can ask ChatGPT a question by using the Option + Space keyboard shortcut, as well as take and discuss screenshots within the app. Further reading: OpenAI Launches New Free Model GPT-4o<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=ChatGPT+Is+Getting+a+Mac+App%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F05%2F14%2F0056209%2F%3Futm_source%3Dtwitter%26u", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/14/0056209/chatgpt-is-getting-a-mac-app?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "ChatGPT Is Getting a Mac App", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T00:29:07.387724+00:00", "description": "Melinda French Gates announced today she is stepping down from the Bill and Melinda Gates Foundation, three years after announcing her separation from Microsoft co-founder Bill Gates. With her departure as co-chair, the foundation will change its name to Gates Foundation and Bill Gates will be its sole chairperson, said CEO Mark Suzman. NBC News reports: In a statement posted on her Instagram account, she said that as part of her agreement to step down from the foundation, she will retain $12.5 billion that she plans to put toward her ongoing work supporting women and families. \"This is not a decision I came to lightly,\" French Gates wrote. \"I am immensely proud of the foundation that Bill and I built together and of the extraordinary work it is doing to address inequities around the world.\" In a separate statement, Bill Gates said, \"I am sorry to see Melinda leave, but I am sure she will have a huge impact in her future philanthropic work.\"\n \nNow worth $75.2 billion, the Gates Founda", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/13/2039214/melinda-gates-to-resign-from-gates-foundation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Melinda Gates To Resign From Gates Foundation", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T00:29:05.480456+00:00", "description": "An anonymous reader quotes a report from ZDNet: IBM managed the open sourcing of Granite code by using pretraining data from publicly available datasets, such as GitHub Code Clean, Starcoder data, public code repositories, and GitHub issues. In short, IBM has gone to great lengths to avoid copyright or legal issues. The Granite Code Base models are trained on 3- to 4-terabyte tokens of code data and natural language code-related datasets. All these models are licensed under the Apache 2.0 license for research and commercial use. It's that last word -- commercial -- that stopped the other major LLMs from being open-sourced. No one else wanted to share their LLM goodies.\n \nBut, as IBM Research chief scientist Ruchir Puri said, \"We are transforming the generative AI landscape for software by releasing the highest performing, cost-efficient code LLMs, empowering the open community to innovate without restrictions.\" Without restrictions, perhaps, but not without specific applications in mi", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/13/2054205/ibm-open-sources-its-granite-ai-models?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "IBM Open-Sources Its Granite AI Models", "user": null, "vote": 0}]