[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T20:30:05+00:00", "description": "World of Warcraft's Cataclysm is coming...again. Launching on May 20th for PC, the expansion will finally arrive for World of Warcraft Classic, allowing players to once again experience the thrill of battling Deathwing, the Worldbreaker, in a bid to save Azeroth.\n\nThough Cataclysm isn't the most fondly remembered expansion due to the wholesale changes brought to WoW, it still has plenty of new content to binge. Seven new dungeons, multiple new zones (with Kalimdor and the Eastern Kingdoms undergoing radical shifts), tons of new quests, two new races, and new raids await players.\n\nThere's also the introduction of Transmog, options for character transfers, a \"streamlined' Auction House and a new dungeon difficulty system, the last two still a mystery. Regardless, here's everything you need to know about World of Warcraft: Cataclysm Classic before picking it up and invariably falling down the rabbit hole.", "language": null, "link": "https://www.youtube.com/watch?v=hSXBJnFHyc4", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/hSXBJnFHyc4/hqdefault.jpg", "title": "World of Warcraft Cataclysm Classic – EVERYTHING You Need To Know", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T15:30:14+00:00", "description": "Free-to-play games with gacha mechanics are a dime-a-dozen these days, but very few have managed to capture the massive open-world exploration of Genshin Impact. However, Kuro Games' Wuthering Waves has emerged as a possible contender, packing a sci-fi twist and much more hard-hitting combat.\n\nAs the Rover, players venture across Solaris-3 following the Lament's destruction, seeking to regain their memories. They venture with the Resonators, who possess exceptional combat skills and can absorb Echoes from monsters to utilize their skills in battle. It makes the Rover a mysterious but considerable force to reckon with.\n\nSeveral aspects of Wuthering Waves mirror Genshin, but more than a few elements make it worth checking out. Here's what else you should know before it launches on May 22nd for iOS, Android and PC (via the Epic Games Store).", "language": null, "link": "https://www.youtube.com/watch?v=xrxBrjNh-mM", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/xrxBrjNh-mM/hqdefault.jpg", "title": "Wuthering Waves - 15 Things You Need To Know Before You Play", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-14T13:30:07+00:00", "description": "If the PS5 Pro leaks are accurate, the eventual PS6 is slated to be one powerful console. Leaks suggest the PS5 Pro will have 33.5 teraflops, upgraded from the base model’s 10.28, but it will feature the same Zen 2 CPU. \n\nSony’s partnership with AMD aims to use 8K PSSR upscaling, which will help offload CPU strain to keep resolutions high with consistent 60 FPS. The most top-of-the-line GPUs today still can’t render photorealism in dynamic playable spaces. This is partly due to an offset in optimization from the games and the limited CPU in such PCs, which inevitably bottleneck performance. \n\nUnreal Engine 5’s Nanite and Lumen systems help automate high-resolution rendering of 3D objects and ambient lighting, but it’s still a ways off from realizing photorealistic games that are not just static scenes. Gamers typically prefer framerate over resolution, but the PS5 Pro should allow both. \n\nHowever, with the same Zen 2 CPU and a lower teraflop count than current- gen GPUs, it’s still be", "language": null, "link": "https://www.youtube.com/watch?v=NEieBaAwpik", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NEieBaAwpik/hqdefault.jpg", "title": "Can PS6 Graphics Achieve Photorealism?", "user": null, "vote": 0}]