[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "What Made L.A. Noire ONE HELL OF A GAME?", "description": "Grand Theft Auto and Red Dead Redemption might be the only franchises that Rockstar thinks about at this point in time, but as those who have played the 2011 open world masterpiece L.A. Noire will tell you, that is another Rockstar property that needs to re-enter the zeitgeist sooner rather than later. \n\nL.A. Noire was a stellar game, and with its revolutionary use of facial capture technology, its authentic, detailed, and incredibly atmospheric setting, its gripping narrative and accomplished storytelling, and its unique and satisfying gameplay loop, it delivered a game that stands out in the memory. Here, we talk about all of that and more, as we break down just what made L.A. Noire one hell of a game.", "link": "https://www.youtube.com/watch?v=d_BFELZR7Vw", "date_published": "2023-11-21T16:00:32+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/d_BFELZR7Vw/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 MORE LIVELY AND DYNAMIC Open World Games of All Time", "description": "Video games possess the capability to transport players to a bunch of different locations that feel like the wildest of our imaginations have come true. The best games use a combination of environmental storytelling, intelligent design techniques, and unique art to create an impression of a world that feels truly alive - and players can spend just hours upon hours gawking at every little detail of such beautiful virtual worlds. \n\nWe’re talking about games such as Horizon Forbidden West and Grand Theft Auto 4 - but there's so many more games that belong to this category. With this feature, we will be taking a look at 15 more lively open world games that fans should definitely check out.", "link": "https://www.youtube.com/watch?v=9RWQ5THBUZ8", "date_published": "2023-11-21T14:00:05+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/9RWQ5THBUZ8/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "This Game Is Laughably Bad...(The Walking Dead: Destinies Review)", "description": "2023 has revived something no one was asking for- the grand tradition of absolutely irredeemably bad licensed games. In a year where we’ve already had a few of those, The Walking Dead: Destinies probably stands as the worst one yet- which, when you consider just how bad some of the earlier ones this year got, is really saying something. Is there anything nice to say about The Walking Dead: Destinies? \n\nI suppose conceptually, making a third-person shooter that follows the show and gives the player the chance to diverge from its events is an intriguing proposition, but after a point, you really need to ask yourself: is it really worth it putting up with all the cruft just for a horrifically poorly executed take on that idea? You can decide for yourself. For my money? Absolutely not.", "link": "https://www.youtube.com/watch?v=CzX4VE_qvX4", "date_published": "2023-11-21T10:30:05+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/CzX4VE_qvX4/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]