[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-23T22:30:06+00:00", "description": "Asphalt 9: Legends has been around since 2018, first launching on mobiles and PC and garnering attention for its visual fidelity. It's received extensive support through the years, including console ports, but Unite is perhaps its biggest yet and a pseudo-rebrand of sorts.\n\nFeaturing improved visuals, a new track in Singapore, overhauled multiplayer modes, a new PvP mode called Team Pursuit and crossplay, Unite purportedly offers a lot for long-time fans. Unfortunately, the matchmaking in its \"ranked\" modes is subpar, while Team Pursuit is a poor imitation of Hot Pursuit from the NFS series.\n\nCoupled with annoying progression systems, egregious monetization, horrendous rubberbanding and a repetitive Career Mode, Asphalt Legends Unite feels like a drag. Its arcade gameplay and visuals may prove enticing - plus it's free-to-play. However, the real meat of the experience is incredibly lacking when it's not actively trying to aggravate you.", "id": 917788, "language": null, "link": "https://www.youtube.com/watch?v=NZ6goQ2uQ8Q", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NZ6goQ2uQ8Q/hqdefault.jpg", "title": "Asphalt Legends Unite Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-23T17:30:06+00:00", "description": "We’re into the latter half of 2024 and rumours behind one of the gaming industry’s worst kept secrets is gathering momentum once again. A November 2024 release window sits atop of numerous PlayStation 5 Pro rumours, but despite November being merely 4 months away Sony are still yet to conclusively confirm or deny the existence of PS5 Pro. \n\nInstead, we’re reduced to pouring over the opinions of industry observers, journalists, and anonymous sources. To be clear, there is nothing concrete confirming or denying PS5 Pro’s November release window, but as this feature describes there are a handful of concerns that November might come too soon for this expected powerhouse of a mid-generation refresh. \n\nWe’ll just have to wait and see – the PS4 Pro was announced in the September prior to its November 2016 release after all.\n\nThumbnail credit: Wccftech", "id": 916048, "language": null, "link": "https://www.youtube.com/watch?v=tMFZau13tJk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/tMFZau13tJk/hqdefault.jpg", "title": "PS5 PRO - Where The Hell Is It?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-23T10:45:00+00:00", "description": "On the surface, Star Wars Outlaws is a dream come true for franchise fans. It's an open-world third-person shooter that embraces the space scoundrel fantasy that defines characters like Han Solo, set between The Empire Strikes Back and Return of the Jedi. With Massive Entertainment of The Division 2 fame onboard, it should be a slam-dunk.\n\nHowever, every new reveal makes it feel more generic and formulaic than anticipated. Granted, no one has fully explored the breadth and scale of the title or experienced the entire story, but there's something about the gameplay that's just not clicking, at least not like the best titles in the franchise have. What exactly is going on?\n\nFind out what's happening with Star Wars Outlaws and why players are concerned before its worldwide launch on August 30th for PS5, Xbox Series X/S, and PC.", "id": 913403, "language": null, "link": "https://www.youtube.com/watch?v=AwPZ5qinoDo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/AwPZ5qinoDo/hqdefault.jpg", "title": "What The HELL IS GOING ON With Star Wars Outlaws?", "user": null, "vote": 0}]