[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-15T18:59:43+00:00", "description": "<p>If Gemmell had a small crew of protégés, I think Cameron Johnston has placed himself at their forefront with The Last Shield. A heroic dark fantasy with plenty of grit, high stakes, battles, and bloody-grinned relentless no-giving-up protagonists, The Last Shield is an un-put-downable thrill ride. In The Last Shield, Briar is the leader of the Regent of Sunweald’s personal bodyguard. Armed with buckler and sword and honed by a lifetime of training, the Shields keep the leaders of their realm alive. When one of them goes rogue, and a mysterious bowman cripples Briar, a devious plot is revealed and it puts the one person Briar loves (but cannot have) in danger&#8211;and with that person in danger, all of Sunweald is in danger. If you mixed Gemmell’s storytelling with Die Hard, I think you would find The Last Shield. With a gruff hero who just won’t die, a villain with evil deeds on their mind, treachery, non stop action and bloody, rather inventive deaths hitting you every few pages ", "id": 868622, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-the-last-shield-by-cameron-johnston", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "Review: The Last Shield by Cameron Johnston", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-15T04:43:33+00:00", "description": "<p>Elizabeth Helen is the pen name of sister duo, Elizabeth and Helen, authors of a hot new fantasy series inspired by Beauty and the Beast. Fairy tales have traditionally explored the darker aspects of human nature and this is no different, the authors have created a dangerous world with flawed and complex characters who are trapped in cursed situation fully of their own making. We’re hooked already and couldn’t resist the opportunity to talk to the authors in advance of the July publication of the first three books of the series in stunning new hardback editions. [GdM] Congratulations on the beautiful new hardback editions of your series, Beasts of the Briar. Can you introduce the first book, Bonded by Thorns, in one or two sentences for our readers? [EH] Hi, thank you so much for having us! Bonded by Thorns is a why-choose, fantasy romance Beauty and the Beast retelling. When an adorkable bookworm wanders into the fae realm, she is imprisoned in an enchanted castle by four princes ", "id": 865549, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/an-interview-with-elizabeth-helen", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "An Interview with Elizabeth Helen", "user": null, "vote": 0}]