[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-15T18:00:03+00:00", "description": "Games as an interactive medium allow for a wealth of experiences and ways to have fun. Stories can be long in themselves, but that only get compounded further when you add things like world exploration on top. \n\nSome games on this feature plenty of side activities ranging from minigames, side quests, and optional NPCs to interact with. Others on this list, such as Helldivers 2, don’t have reams of dialogue to sift through, instead providing a long progression curve within the context of co-op missions. \n\nHalf of the games on this list can easily take you 100 hours to fully complete, making 2024 a year with some of the biggest games in quite a while.", "id": 869016, "language": null, "link": "https://www.youtube.com/watch?v=6mmm5CSA3Dc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/6mmm5CSA3Dc/hqdefault.jpg", "title": "10 LONGEST Games of 2024 So Far", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-15T16:00:50+00:00", "description": "Flock is a relaxing game where you collect a host of unique creatures and explore a painterly landscape. Throughout the game, you’ll fly atop a bird and fill out your Aunt Jane’s Creature Guide. Exploring the environments as you listen for the hems and haws of these creatures is a delight thanks to the excellent sound design, but the process of documenting them could be better. \n\nHowever, that isn’t all you do in Flock, you must locate the species-specific whistles in order to collect them. The guidance and flow of the environments is wonderful, though the ‘charm’ minigame gets repetitive pretty fast. With a wonderfully atmospheric soundtrack and colorful art style, Flock is a delight for the senses. It’s easy to pick and play and has full co-op functionality to boot. I’d especially recommend Flock to those who really enjoy Pokemon Snap or similar games where you fulfill the role of a zoologist.", "id": 869017, "language": null, "link": "https://www.youtube.com/watch?v=tZ1jChrOkmI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/tZ1jChrOkmI/hqdefault.jpg", "title": "FLOCK Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-15T16:00:08+00:00", "description": "This game's action elements are good, though some stiff controls and interface issues hold it back from being truly great. Thankfully, the strategy elements exist to add variation and variety. \n\nThe levels and bosses are designed around both action and strategy styles simultaneously, making for some truly memorable and interesting designs.\n\nYou can command villagers to construct various buildings. This is a game whose whole is greater than its individual parts, and I can’t recommend it enough if you’re a fan of either action or strategy games.", "id": 869018, "language": null, "link": "https://www.youtube.com/watch?v=BUu5WvTOzQY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/BUu5WvTOzQY/hqdefault.jpg", "title": "Kunitsu-Gami Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-15T09:30:00+00:00", "description": "In what's been a relatively barren year for PlayStation Studios, Firewalk Studios' Concord is one of the few exclusives that PS5 players have to look forward to (though it's also coming to PC). Set in a sci-fi universe, it sees players as members of the Northstar, venturing to different planets to complete various jobs.\n\nWhile the cinematic reveal trailer would make you think it's a single-player adventure, Concord is a 5v5 team-based hero shooter. You can select from 16 characters with different abilities and partake in modes like Team Deathmatch. Objective-based modes like Cargo Run and Clash Point are also available.\n\nConcord launches on August 23rd for $39.99. After playing the recent early access beta for a few hours - with an open beta scheduled for July 19th to 21st - I have more than a few concerns. Here's everything you should know before buying.", "id": 866208, "language": null, "link": "https://www.youtube.com/watch?v=0x0bt4WNv9Y", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/0x0bt4WNv9Y/hqdefault.jpg", "title": "Concord PS5 - 16 NEW Things You Need To Know Before You Buy", "user": null, "vote": 0}]