[{"thumbnail": "https://i2.ytimg.com/vi/5G9o8NkXYkk/hqdefault.jpg", "tags": [], "page_rating_visits": 1, "title": "15 Excellent Single Player Games That Are SHOCKINGLY CHEAP NOW", "page_rating_contents": 100, "age": null, "date_published": "2024-01-31T17:45:00+00:00", "page_rating_votes": 0, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "user": null, "page_rating": 100, "description": "Given how expensive gaming tends to be a as a hobby, it’s no surprise that as a group, we all tend to place as much value on games’ length and the breadth of their content as we historically have. \n\nThen again, games also have a habit of fluctuating in their pricing and often dropping to shockingly low levels on that front, which means there’s always a wealth of excellent titles to go back to and pick up at an absolute bargain of a price. Currently, there’s no shortage of incredible single player games out there that have dropped down to such price points, from AAA megatons to indie darlings. Here, that’s what we’ll be focusing on, as we go over a few standout single player titles that you can pick up for significantly slashed prices.", "permanent": false, "language": "en", "source_obj__id": 208, "dead": false, "artist": "GamingBolt", "album": "", "link": "https://www.youtube.com/watch?v=5G9o8NkXYkk", "bookmarked": false, "vote": 0}, {"thumbnail": "https://i2.ytimg.com/vi/1HVdwtasAGA/hqdefault.jpg", "tags": [], "page_rating_visits": 0, "title": "Granblue Fantasy: Relink PS5 Review - The Final Verdict", "page_rating_contents": 0, "age": null, "date_published": "2024-01-31T15:45:01+00:00", "page_rating_votes": 0, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "user": null, "page_rating": 0, "description": "It's hard to believe that Granblue Fantasy: Relink was first announced in 2016, with development handled by another developer before shifting to Cygames Osaka. As an action RPG spin-off to Cygames' successful free-to-play title, it feels like a slam-dunk concept, especially with its setting of boundless skies and floating isles.\n\nInstead of retelling the base game's setting, it offers an original campaign with Gran/Djeeta and friends dealing with new threats. Other characters join you for the ride, whether it's missions with suitably world-threatening stakes or garnering precious materials for the many upgrades.\n\nHowever, despite the fast-paced and fluid nature of combat, clean visuals, solid voice-acting and plentiful content (with an endgame that frequently recycled content), Granblue Fantasy: Relink leaves something to be desired.", "permanent": false, "language": null, "source_obj__id": 208, "dead": false, "artist": "GamingBolt", "album": "", "link": "https://www.youtube.com/watch?v=1HVdwtasAGA", "bookmarked": false, "vote": 0}, {"thumbnail": "https://i3.ytimg.com/vi/JmOP-daFG4w/hqdefault.jpg", "tags": [], "page_rating_visits": 0, "title": "Final Fantasy 7: Rebirth - 15 NEW THINGS To Know Before You Purchase", "page_rating_contents": 0, "age": null, "date_published": "2024-01-31T11:00:15+00:00", "page_rating_votes": 0, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "user": null, "page_rating": 0, "description": "Unsurprisingly, the hype for Final Fantasy 7 Rebirth is ridiculously high, and each time we learn more about the game, it grows higher still. The developer is well aware of that fact, and over the last few weeks and months, the publisher has revealed a bevy of new details on the highly anticipated action RPG, talking about everything from its side activities and minigames to its new party members and much, much more. \n\nWe’ve already covered a great many of the game’s key details in a past feature,  but given just how much there is to talk about, it’s no surprise that there’s still plenty that we haven’t touched on. To that end, with Final Fantasy 7 Rebirth’s launch drawing closer, here, we’re going to look at a few more details that you should know about the game.", "permanent": false, "language": null, "source_obj__id": 208, "dead": false, "artist": "GamingBolt", "album": "", "link": "https://www.youtube.com/watch?v=JmOP-daFG4w", "bookmarked": false, "vote": 0}]