[{"source": "https://www.arabnews.com/rss.xml", "title": "Al-Ittihad ready to wow home fans in FIFA Club World Cup opener, says coach", "description": "JEDDAH: Al-Ittihad head coach Marcelo Gallardo said his players are fully prepared for their FIFA Club World Cup opener on Tuesday and looking forward to putting on a show for the home fans in Saudi Arabia.\n\n\t“Our goal is to perform at our best and try to win the game to keep up our good run through the next round,” Gallardo said ahead of their match against Auckland city of New Zealand. “It is not an easy game and we do really respect Auckland City but we’re confident we can do a good job.”", "link": "https://www.arabnews.com/node/2424121/sport", "date_published": "2023-12-11T06:12:35+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "White House: US concerned about reports Israel used white phosphorus in Lebanon attack", "description": "NEW YORK: The United States is concerned about reports Israel used US-supplied white phosphorus munitions in an October attack in southern Lebanon, White House spokesperson John Kirby said on Monday.\n\t“We’ve seen the reports. Certainly concerned about that. We’ll be asking questions to try to learn a little bit more,” Kirby told reporters on Air Force One.\n\tKirby said white phosphorus has a “legitimate military utility” for illumination and producing smoke to conceal movements.", "link": "https://www.arabnews.com/node/2424116/middle-east", "date_published": "2023-12-11T06:12:07+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "UN needs $46.4 billion for aid in ‘bleak’ 2024", "description": "GENEV: The United Nations said Monday that it needed $46.4 billion next year to bring life-saving help to around 180 million people in desperate circumstances around the world.\n\tThe UN said the global humanitarian outlook for 2024 was “bleak,” with conflicts, climate emergencies and collapsing economies “wreaking havoc” on the most vulnerable.\n\tWhile global attention focuses on the conflict raging in the Gaza Strip, the UN said the wider Middle East, Sudan and Afghanistan were among the hotspots that also needed major international aid operations.", "link": "https://www.arabnews.com/node/2423771/world", "date_published": "2023-12-11T05:12:48+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "UNRWA staff honored at Doha Forum amid Gaza war", "description": "LONDON: The Doha Forum has honored staff from the United Nations Relief and Works Agency for Palestine Refugees in the Near East for their humanitarian work in Gaza and throughout the region.\n\n\tQatari Emir Sheikh Tamim bin Hamad Al-Thani presented the award to UNRWA Commissioner-General Philippe Lazzarini on Sunday.", "link": "https://www.arabnews.com/node/2424086/middle-east", "date_published": "2023-12-11T05:12:27+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Strong voter turnout on 2nd day of Egypt presidential election", "description": "CAIRO: Egyptian voters turned out in force on the second and penultimate day of a presidential election in which President Abdel Fattah El-Sisi was expected to sweep to a third, six-year term in office.\n\n\tQueues started forming on Monday at some polling stations in Cairo and elsewhere in the country long before they opened at 9 a.m.\n\n\tEl-Sisi is competing against three other candidates: Abdel-Sanad Yamama, the head of Wafd, Egypt’s oldest party, Hazem Omar, leader of the Republican People’s Party, and Farid Zahran, of the Social Democratic Party.", "link": "https://www.arabnews.com/node/2424096/middle-east", "date_published": "2023-12-11T05:12:25+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Pakistan rejects Indian Supreme Court decision to uphold revocation of Kashmir’s special status", "description": "ISLAMABAD: Authorities in Pakistan rejected a unanimous ruling by the Indian Supreme Court on Monday to uphold the 2019 decision by the government of Prime Minister Narendra Modi to revoke the special status of Indian-controlled Kashmir, describing the judges’ decision as a “travesty of justice.”\n\n\tIn response to more than a dozen petitions challenging the government’s actions, five judges sitting on the court’s constitutional bench said the region’s special status had been a “temporary provision” and removing it was constitutionally valid.", "link": "https://www.arabnews.com/node/2424111/world", "date_published": "2023-12-11T05:12:17+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Over 260,000 Saudi students gear up for AI Olympics", "description": "RIYADH: The National Olympics for Programming and Artificial Intelligence, or ATHKA, achieved a record-breaking enrolment of more than 260,000 Saudi students from over 10,000 schools at intermediate and secondary levels in the Kingdom.\n\n\tATHKA, a collaboration between the Saudi Data and AI Authority, the Ministry of Education, and the King Abdulaziz and His Companions Foundation for Giftedness and Creativity, or Mawhiba, aims to foster a generation skilled in programming and AI.", "link": "https://www.arabnews.com/node/2424106/saudi-arabia", "date_published": "2023-12-11T05:12:08+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Japan, UAE to cooperate towards stabilization of international oil market", "description": "TOKYO: Sheikh Mohamed bin Zayed Al-Nahyan, crown prince of Abu Dhabi and deputy supreme commander of the UAE Armed Forces, spoke with Japan’s Prime Minister Kishida Fumio about the Ukraine crisis and assured him that the UAE was keen to maintain energy security and keep global markets stable.\n\n\tIn a Japan-UAE Summit telephone talk, Sheikh Mohammed also told Kishida that his country was keen on boosting relations with Japan in the energy field.", "link": "https://www.arabnews.com/node/2424101/middle-east", "date_published": "2023-12-11T05:12:07+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Gaza war having ‘catastrophic’ health impact: WHO chief", "description": "GENEVA: The war between Israel and Hamas is having a catastrophic impact on health in Gaza, the WHO chief warned on Sunday, with medics facing an “impossible” job in unimaginable conditions.", "link": "https://www.arabnews.com/node/2423631/middle-east", "date_published": "2023-12-11T05:05:11.353698+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Eddie Howe questions Newcastle United squad capacity after Tottenham Hotspur hammering", "description": "LONDON: Newcastle United head coach Eddie Howe has for the first time hinted the Magpies’s squad is not equipped to fight on three fronts.\n\n\tThe Magpies were hammered in North London by Ange Postecoglou’s men, as Richarlison’s double and goals from Heung-Min Son and Destiny Udogie ensured Newcastle slipped further away from the Champions League places in the Premier League. It was also their second three-goal beating in four days, having lost at Everton on Thursday.", "link": "https://www.arabnews.com/node/2423636/sport", "date_published": "2023-12-11T05:05:11.352639+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Israel’s Netanyahu calls on Hamas militants to ‘surrender now’", "description": "JERUSALEM: Israel’s Prime Minister Benjamin Netanyahu on Sunday called for Hamas militants to lay down their arms, saying the Palestinian Islamist group’s end was near, as the war in the Gaza Strip raged more than two months after it began.\n\t“The war is still ongoing but it is the beginning of the end of Hamas. I say to the Hamas terrorists: It’s over. Don’t die for (Yahya) Sinwar. Surrender now,” Netanyahu said in a statement, referring to the chief of Hamas in the Gaza Strip.", "link": "https://www.arabnews.com/node/2423661/middle-east", "date_published": "2023-12-11T05:05:11.351678+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Kingdom’s Olympic committee VP announces third edition of Saudi Games for 2024", "description": "RIYADH: Prince Fahd bin Jalawi bin Abdulaziz, vice president of the Saudi Olympic and Paralympic Committee and director of the Saudi Games, on Sunday announced the third edition of the games would be held in 2024.\n\n\tPrince Fahd made the announcement on behalf of Prince Abdulaziz bin Turki bin Faisal, minister of sports, at the closing ceremony of the second edition on Sunday in the games’ Fan Zone.\n\n\tMore than 8,000 participants, competing in 53 sports, took part in this year’s edition.", "link": "https://www.arabnews.com/node/2423671/sport", "date_published": "2023-12-11T05:05:11.350685+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Philippines summons Chinese envoy over sea confrontations: foreign ministry", "description": "MANILA: The Philippines has summoned China’s envoy, the foreign ministry said Monday, following two days of confrontations between the countries’ vessels in the disputed South China Sea.\n\tDiplomatic protests had been filed and “the Chinese ambassador has also been summoned,” foreign ministry spokeswoman Teresita Daza told reporters.\n\tVideos released by the Philippine Coast Guard showed Chinese ships blasting water cannon at Philippine boats during two separate resupply missions to flashpoint reefs on Saturday and Sunday.", "link": "https://www.arabnews.com/node/2423761/world", "date_published": "2023-12-11T04:12:59+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Riyadh Theater Festival to kick off on Wednesday", "description": "RIYADH: Ten plays by Saudi theater groups will compete for 11 awards at the Riyadh Theater Festival, the Kingdom’s Theater and Performing Arts Commission has announced.\n\n\tThe festival will take place between Dec. 13-24 and its first session will take place at Princess Nourah bint Abdul Rahman University where shortlisted plays will be performed, the CEO of the Theater and Performing Arts Commission Sultan Al-Bazie said.\n\n\tThe plays were shortlisted according to factors including their appeal to audiences, quality, serious and creative presentation, and language used.", "link": "https://www.arabnews.com/node/2424081/saudi-arabia", "date_published": "2023-12-11T04:12:52+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "‘Shabab Al Bomb 11’ among Saudi Arabia’s top Google searches of 2023", "description": "DUBAI: \n\n\t“Shabab Al Bomb 11” was the top-trending Google search of 2023 in Saudi Arabia on a list of TV series, films, and programs.\n\n\tIt was followed by “Oppenheimer movie,” “Jawan movie,” “Barbie movie,” and “The Last of Us series.”\n\n\tThe tech giant’s annual survey, released on Monday, rounded up the most trending search queries experiencing a higher volume of search over a sustained period this year compared to 2022.\n\n\tLists included the top-searched news, platforms, events, movies, TV series, tournaments, and personalities.", "link": "https://www.arabnews.com/node/2424076/media", "date_published": "2023-12-11T04:12:50+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "UK retailer pulls Pan Am-themed jumper after Lockerbie offense", "description": "LONDON: UK clothing retailer Next has removed a Pan Am-themed Christmas jumper from sale after offending families whose relatives were killed in the 1988 Lockerbie bombing, Metro newspaper reported on Monday.\n\n\tDec. 21 will mark 35 years since Pam Am Flight 103 was destroyed over the Scottish town of Lockerbie by a bomb on board, killing all 259 people on board and 11 on the ground.\n\n\tNext was criticized over the jumper’s design in an online petition that was signed by hundreds of people.", "link": "https://www.arabnews.com/node/2424071/world", "date_published": "2023-12-11T04:12:07+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "US says China’s actions in South China Sea undermine regional stability", "description": "MANILA: The United States has called out China for interfering in the Philippines’ maritime operations and undermining regional stability, urging Beijing to stop “its dangerous and destabilizing conduct” in the South China Sea.\n\tThe Philippines and China have traded accusations over a ramming incident at the weekend involving their vessels while Manila’s vessels were on a resupply mission to Second Thomas Shoal where its soldiers are stationed in a deliberately grounded navy vessel.", "link": "https://www.arabnews.com/node/2423751/world", "date_published": "2023-12-11T03:12:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "EU ministers consider next steps in response to Israel-Hamas war", "description": "BRUSSELS: European Union foreign ministers on Monday consider possible next steps in response to the Middle East crisis, including a crackdown on Hamas’ finances and travel bans for Israeli settlers responsible for violence in the West Bank.\n\tAt a meeting in Brussels, ministers from the bloc’s 27 countries will also hear from Ukrainian counterpart Dmytro Kuleba as they discuss future security assistance to Kyiv.", "link": "https://www.arabnews.com/node/2423711/middle-east", "date_published": "2023-12-11T01:12:46+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Girona make a genuine title contender statement with 4-2 win at Barcelona to go top in Spain", "description": "MADRID: Girona made their strong case to be considered a genuine contender for the Spanish league title by beating Catalan rivals Barcelona 4-2 on Sunday and overtaking Real Madrid at the top of the standings.\n\n\tUkraine forward Artem Dovbyk and Viktor Tsygankov teamed up for Girona’s opener, and Miguel Gutierrez, Valery Fernandez and Cristhian Stuani scored a goal each to seal the away victory against the defending league champions. Robert Lewandowski and Ilkay Gundogan scored Barcelona’s goals.", "link": "https://www.arabnews.com/node/2423716/football", "date_published": "2023-12-11T01:12:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Lydia Ko delivers big moment to win mixed team event with Jason Day", "description": "NAPLES, Florida: Lydia Ko hit a fairway metal to 8 feet to set up the birdie she and Jason Day needed to win the Grant Thornton Invitational on Sunday. They closed with a 6-under 66 in modified fourballs to capture the first mixed-team event in 24 years.\n\n\tPlaying the par-5 17th hole, Ko and Day were tied with the Canadian duo of Corey Conners and Brooke Henderson, who had to settle for two closing pars and a 63.", "link": "https://www.arabnews.com/node/2423721/golf", "date_published": "2023-12-11T01:12:23+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "UK creates unit to clamp down on companies evading Russian sanctions", "description": "LONDON: The British government said on Monday it was creating an enforcement unit to increase its power to crack down on companies evading Russian sanctions.", "link": "https://www.arabnews.com/node/2423701/world", "date_published": "2023-12-11T00:12:41+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Australia plans to halve migrant intake, tighten student visa rules", "description": "SYDNEY: Australia on Monday said it would tighten visa rules for international students and low-skilled workers that could halve its migrant intake over the next two years as the government looks to overhaul what it said was a “broken” migration system.\n\tThe decision comes after net immigration was expected to have peaked at a record 510,000 in 2022-23. Official data showed it was forecast to fall to about a quarter of a million in 2024-25 and 2025-26, roughly in line with pre-COVID levels.", "link": "https://www.arabnews.com/node/2423696/world", "date_published": "2023-12-11T00:12:36+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "UN council envoys to visit Gaza crossing as crisis spirals", "description": "AL-ARISH: UN Security Council ambassadors arrived Monday in Egypt to visit the Rafah border crossing with the besieged Gaza Strip, days after the United States vetoed a council resolution for a ceasefire.\n\tThe informal one-day trip organized by the United Arab Emirates and Egypt comes amid a spiralling humanitarian crisis in war-torn Gaza, described as a “graveyard” by United Nations Secretary-General Antonio Guterres.\n\tAround a dozen ambassadors are taking part in the visit from countries including Russia and the United Kingdom.", "link": "https://www.arabnews.com/node/2423931/middle-east", "date_published": "2023-12-11T00:12:29+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "’Nothing more to say’: Trump cancels plan to testify in NY fraud trial", "description": "WASHINGTON: Donald Trump changed his mind about testifying in his own defense in his New York fraud case on Monday, he said, announcing that he will not take the stand as expected because he has “nothing more to say.”\n\tThe 77-year-old posted the surprise statement on Truth Social on Sunday, adding that he has “already testified to everything” in the ongoing trial against him, his eldest sons Don Jr and Eric, and other Trump Organization executives.", "link": "https://www.arabnews.com/node/2423706/world", "date_published": "2023-12-11T00:12:09+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]