[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "XBOX SERIES X REVIEW - THREE YEARS LATER", "description": "We’re three years into the lifecycle of the Xbox Series X/S, which means it’s time to pause and take a look back at what we’ve seen from Microsoft’s current console generation so far. \n\nMicrosoft was probably expected to do better than it has done, especially when you look at major errors like the launch of Redfall and the barren year that was 2022, but at the same time, there’s also been undeniable progress where the output of game releases is concerned. \n\nHere, we are talking about all of that and more, as we weigh the highs and the lows of the first three years of the Xbox Series X/S era.", "link": "https://www.youtube.com/watch?v=Hs56WmIs6yA", "date_published": "2023-11-11T15:30:04+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/Hs56WmIs6yA/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 2, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "GTA 6 - What Lessons Will It Take from GTA 5 And Red Dead Redemption 2", "description": "Rockstar is a developer that has, on more than a few occasions, delivered games that have gone on to set standards that the entire industry has followed at large for years on end, so with Grand Theft Auto 6 now finally on the horizon, one can’t help but wonder how exactly the developer is going to build on its incredible past and deliver an experience that lives up to its lofty standards. \n\nLooking back at the last decade, Grand Theft Auto 5 and Red Dead Redemption 2 are obviously some of the greatest games ever made, but what lessons can Rockstar take from the duo as it looks ahead and attempts to push the envelope even further with the upcoming GTA 6?", "link": "https://www.youtube.com/watch?v=NpepyvHVTbU", "date_published": "2023-11-11T09:30:07+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/NpepyvHVTbU/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]