[{"bookmarked": false, "page_rating_contents": 0, "album": "", "user": null, "dead": false, "artist": "GamingBolt", "page_rating_votes": 0, "comments": [], "link": "https://www.youtube.com/watch?v=T_2G_3qWw0E", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 208, "page_rating": 0, "vote": 0, "description": "With Banishers, Don’t Nod has delivered a solid RPG that’s easy to recommend for fans of the genre. It doesn’t break new ground by any means, and from clunky combat to overly straightforward progression mechanics, it does have some issues that drag it down at times, but there’s plenty else here that makes up for the game’s flaws. \n\nA strong, well-realized setting, an excellent pair of protagonists, and weight choice and consequence mechanics come together in a massive step forward for Don’t Nod in the action RPG space. Will it be remembered as one of the best games of its kind, or perhaps even its year? Maybe not- but there’s plenty to like here, nonetheless.", "thumbnail": "https://i1.ytimg.com/vi/T_2G_3qWw0E/hqdefault.jpg", "age": null, "title": "Banishers: Ghosts of New Eden Review - The Final Verdict", "date_published": "2024-02-12T17:00:20+00:00", "language": null, "permanent": false, "page_rating_visits": 0, "tags": []}, {"bookmarked": false, "page_rating_contents": 0, "album": "", "user": null, "dead": false, "artist": "GamingBolt", "page_rating_votes": 0, "comments": [], "link": "https://www.youtube.com/watch?v=O0fiQThGHgI", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 208, "page_rating": 0, "vote": 0, "description": "At its core, Helldivers 2 is a third-person shooter that's unapologetically like the original. It combines brutal action and near-insurmountable odds with over-the-top, arcade-like chaos while offering satisfying gunplay and an addictive gameplay loop.\n\nAs players battle the Terminids once more and contend with the new Automatons, they'll flex all kinds of explosive firepower, from Orbital Strikes to Eagle runs and automated turrets. Backed by incredible fidelity, it makes for some fun moments.\n\nDespite issues with matchmaking, glitches, lack of a proper lobby browser, and some desperately needed quality-of-life features, Helldivers 2 is worth checking out on PS5 and PC. The compelling sense of community and solid gameplay would be enough, but it also has one of the better monetization models in the live service sphere.", "thumbnail": "https://i4.ytimg.com/vi/O0fiQThGHgI/hqdefault.jpg", "age": null, "title": "Helldivers 2 Review - This Is How You Do A LIVE SERVICE GAME", "date_published": "2024-02-12T10:00:13+00:00", "language": null, "permanent": false, "page_rating_visits": 0, "tags": []}]