[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-11T19:00:12+00:00", "description": "For all the flak that Visual Concepts' NBA 2K series has received over the years, there's no denying that it's delivered some of the best basketball action. NBA 2K25 may very well be the modern era's best due to its diverse selection of content, excellent presentation, responsive gameplay, and new features.\n\nThe City feels more organic than before; the various Eras offer extensive customization and avenues to relive historical moments; and MyCareer feels engaging. Even the on-court action is solid, though the Shot Meter can take some getting used to (some extensive options to customize it do help).\n\nMyTeam isn't as appealing to me, though Breakout is occasionally fun, and some mechanics like blocking feel ineffective. The whole pay-to-win structure also doesn't sit well, which is a tale as old as time with the franchise. Nevertheless, as far as being the ideal basketball title, NBA 2K25 is worth checking out.", "id": 1127479, "language": null, "link": "https://www.youtube.com/watch?v=FWU-PTc1wvI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/FWU-PTc1wvI/hqdefault.jpg", "title": "NBA 2K25 Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-11T15:30:20+00:00", "description": "Acts of Blood is an indie beat ‘em up game in development by Eksil Game Studio. The game follows Hendra, a law student whose life is struck by tragedy when his family is killed by his father’s business rival. Hellbent on avenging his family, Hendra faces the criminal underworld of Bandung. \n\nAs an indie fighting game, Acts of Blood shares similar game mechanics with other successful titles in the genre, namely Sloclap’s Sifu and United Front Games’ Sleeping Dogs. \n\nFor instance, Acts of Blood’s melee combat is focused on using the environment against enemies just like Sifu while it also provides the players with firearms and parkour mechanics akin to Sleeping Dogs. Analyzing these similarities as well as Eksil Game Studio’s new takes on the genre is the aim of this video.", "id": 1126126, "language": null, "link": "https://www.youtube.com/watch?v=siFJ8_iSdj8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/siFJ8_iSdj8/hqdefault.jpg", "title": "This Game's BRUTAL COMBAT Will Instantly Remind You of Sifu And Sleeping Dogs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-11T06:30:10+00:00", "description": "Sony has official revealed the PS5 Pro and along with it, a host of other details that you may not be aware of. In this video we cover everything from form factor, specifications, GPU, Memory, to how the console will provide improved visuals and frame rate.\n\nWe also talk about the console's pricing and availability. Check out this video to know everything about the PlayStation 5 Pro before you buy one.", "id": 1123028, "language": null, "link": "https://www.youtube.com/watch?v=J0rOaUzbZsg", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/J0rOaUzbZsg/hqdefault.jpg", "title": "PS5 PRO - 10 Things You Absolutely Need To Know Before You Buy", "user": null, "vote": 0}]