[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-11T20:00:32+00:00", "description": "Kevin James: Irregardless is now streaming on Prime Video.\n\nAbout Kevin James: Irregardless: Beloved actor and comedian Kevin James returns to the stage with a highly anticipated family-friendly stand-up comedy special, delivering his hilariously unfiltered take on parenting, marriage and getting older. As only Kevin can, he covers a range of topics from motivating children to put down their video games, to why he doesn’t trust technology, and how many tater tots he can fit in his mouth.\n \nAbout Prime Video:\nWant to watch it now? We've got it. This week's newest movies, last night's TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Over 150,000 movies and TV episodes, including thousands for Amazon Prime members at no additional cost.\n \n#PrimeVideo #KevinJames #Shorts", "id": 1127951, "language": null, "link": "https://www.youtube.com/watch?v=sQy9512iuls", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "source_obj__id": 454, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/sQy9512iuls/hqdefault.jpg", "title": "The anxiety riddled life of apps. | Kevin James: Irregardless", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-11T19:00:30+00:00", "description": "Reacher and Dixon seem especially interested... REACHER is now streaming on Prime Video.. REACHER is now streaming on Prime Video.\n\n» Watch Reacher on Prime Video: https://amzn.to/32rqRzq\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n\nAbout Reacher: \nWhen retired Military Police Officer Jack Reacher is arrested for a murder he did not commit, he finds himself in the middle of a deadly conspiracy full of dirty cops, shady businessmen and scheming politicians. With nothing but his wits, he must figure out what is happening in Margrave, Georgia. The first season of Reacher is based on the international bestseller, Killing Floor by Lee Child.\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Prime Video offers a variety of unique and captivating entertainment, including original series “The Boys,” “Invincible,” “Haz", "id": 1127952, "language": null, "link": "https://www.youtube.com/watch?v=_N5YyrFCNPA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "source_obj__id": 454, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/_N5YyrFCNPA/hqdefault.jpg", "title": "Reacher Gets a Suite | REACHER Season 2 | Prime Video", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-11T18:00:17+00:00", "description": "Alan Ritchson is Jack Reacher, REACHER is now streaming on Prime Video.\n\nAbout Reacher Season 1: When retired Military Police Officer Jack Reacher is arrested for a murder he did not commit, he finds himself in the middle of a deadly conspiracy full of dirty cops, shady businessmen and scheming politicians. With nothing but his wits, he must figure out what is happening in Margrave, Georgia. The first season of Reacher is based on the international bestseller, The Killing Floor by Lee Child.\n\nAbout Reacher Season 2: When members of Reacher’s old military unit start turning up dead, Reacher has just one thing on his mind—revenge. \n \nAbout Prime Video:\nWant to watch it now? We've got it. This week's newest movies, last night's TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Over 150,000 movies and TV episodes, including thousands for Amazon Prime members at no additional cost.\n \n#PrimeVideo #Reacher #Shorts", "id": 1127183, "language": null, "link": "https://www.youtube.com/watch?v=JVDvvs_FAQ8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "source_obj__id": 454, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/JVDvvs_FAQ8/hqdefault.jpg", "title": "The headbutt heard round the world | REACHER", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-11T17:00:34+00:00", "description": "Still reeling from Hazbin Hotel's action-packed finale? Don't worry, Sharronda Williams has you covered! Find out what happened to Hell's hapless residents and heaven's not-so-virtuous angels at the end of season 1. Hazbin Hotel is now streaming on Prime Video.\n \n» Watch Hazbin Hotel on Prime Video: https://amzn.to/47xogiW\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n \nAbout Hazbin Hotel: Charlie Morningstar, the Princess of Hell, struggles to convince demons and angels alike that any soul can be redeemed. Sing and curse along in this adult animated musical comedy about second chances.\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Prime Video offers a variety of unique and captivating entertainment, including original series “The Boys,” “Invincible,” “Hazbin Hotel,” “The Summer I Turned Pretty,” and more.\n ", "id": 1126798, "language": null, "link": "https://www.youtube.com/watch?v=_Bp27c8Cc3w", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "source_obj__id": 454, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/_Bp27c8Cc3w/hqdefault.jpg", "title": "Hazbin Hotel Season 1 Finale Breakdown | Prime Video", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-11T16:00:30+00:00", "description": "Starring Anne Hathaway and Nicholas Galitzine, The Idea of You is now streaming only on Prime Video.\n\nAbout The Idea of You: Based on the acclaimed, contemporary love story of the same name, The Idea of You centers on Solène (Anne Hathaway), a 40-year-old single mom who begins an unexpected romance with 24-year-old Hayes Campbell (Nicholas Galitzine), the lead singer of August Moon, the hottest boy band on the planet.\n \nAbout Prime Video:\nWant to watch it now? We've got it. This week's newest movies, last night's TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. \n \n#PrimeVideo #TheIdeaofYou #Shorts", "id": 1126799, "language": null, "link": "https://www.youtube.com/watch?v=LwailS6NsS0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "source_obj__id": 454, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/LwailS6NsS0/hqdefault.jpg", "title": "Find someone who sees the real you. | The Idea Of You", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-11T13:59:56+00:00", "description": "Prince Durin is suspicious of Celebrimbor's new forging partner. \n\n» Watch The Lord of the Rings: The Rings of Power on Prime Video: https://amzn.to/3q5uWkN\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n\nAbout The Lord of the Rings: The Rings of Power: Set thousands of years before the events of J.R.R. Tolkien’s The Lord of the Rings, this epic drama follows an ensemble cast of characters, both familiar and new, as they confront the long-feared re-emergence of evil to Middle-earth.\n\nAbout The Lord of the Rings: The Rings of Power Season 2: Sauron has returned. Cast out by Galadriel, the Dark Lord must now rely on his own cunning to rebuild his strength and forge the legendary Rings of Power, threatening to bind all peoples of Middle-earth to his sinister will. Season 2 plunges its most beloved characters into a rising tide of darkness, challenging each to find his or her place in a world on the brink of calamity.\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s ne", "id": 1125669, "language": null, "link": "https://www.youtube.com/watch?v=TIGeAq9eF6Q", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "source_obj__id": 454, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/TIGeAq9eF6Q/hqdefault.jpg", "title": "Fault In The Ring Maker | The Lord of The Rings: The Rings of Power Season 2 | Prime Video", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-11T06:59:55+00:00", "description": "Diana Cavalieri (Matilda De Angelis), an undercover Citadel agent, is trapped behind enemy lines as a mole in Manticore. When she finally sees a way out and the chance to disappear forever, the only way to do so is trusting the most unexpected ally, Edo Zani (Lorenzo Cervasio), the heir of Manticore Italy and son of the head of the Italian organization, Ettore Zani (Maurizio Lombardi), who’s vying for leadership against the other European families.\n \nThe first season of Citadel, starring Richard Madden and Priyanka Chopra Jonas alongside Stanley Tucci and Lesley Manville, premiered in 2023. Executive produced by the Russo Brothers' AGBO, Citadel and its subsequent action-espionage Original Series traverse the globe, evolving the story of spy agency Citadel and its powerful enemy syndicate, Manticore. The Italian Original, Citadel: Diana, is the second series to debut from the world of Citadel and will be followed by India’s series, Citadel: Honey Bunny starring Varun Dhawan and Samant", "id": 1123194, "language": null, "link": "https://www.youtube.com/watch?v=S7AErSAxxJ8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ", "source_obj__id": 454, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/S7AErSAxxJ8/hqdefault.jpg", "title": "Citadel: Diana - Official Trailer | Prime Video", "user": null, "vote": 0}]