[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T23:38:28.451033+00:00", "description": "The free online tax filing program known as IRS Direct File will be made permanent for the 2025 tax season, with all 50 states and Washington D.C. invited to participate. Axios reports: Treasury announced earlier this month that more than 140,000 people participated in the Direct File pilot program in a dozen states claiming more than $90 million in refunds. The pilot exceeded its 100,000-person target during this past tax season.\n \n\"President Biden is committed to saving Americans time and money and ensuring families receive the tax benefits they're owed,\" Treasury Secretary Janet Yellen said in a statement. \"Providing a free tool to all Americans who want the option to file directly with the IRS is key to achieving those goals.\" The pilot program targeted people with simple tax returns based on W-2 forms. In her remarks today Yellen said that over the next few years they will expand Direct File to support more situations. The announcement from the Treasury Department comes a week af", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/30/2043227/irs-opening-free-online-tax-filing-program-to-all-states?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "IRS Opening Free Online Tax Filing Program To All States", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T23:38:26.313550+00:00", "description": "An anonymous reader quotes a report from Reuters: TikTok is working on a clone of its recommendation algorithm for its 170 million U.S. users that may result in a version that operates independently of its Chinese parent and be more palatable to American lawmakers who want to ban it, according to sources with direct knowledge of the efforts. The work on splitting the source code ordered by TikTok's Chinese parent ByteDance late last year predated a bill to force a sale of TikTok's U.S. operations that began gaining steam in Congress this year. The bill was signed into law in April. The sources, who were granted anonymity because they are not authorized to speak publicly about the short-form video sharing app, said that once the code is split, it could lay the groundwork for a divestiture of the U.S. assets, although there are no current plans to do so. The company has previously said it had no plans to sell the U.S. assets and such a move would be impossible. [...]\n \nIn the past few m", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/30/2057237/tiktok-preparing-a-us-copy-of-the-apps-core-algorithm?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "TikTok Preparing a US Copy of the App's Core Algorithm", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T22:32:03.826271+00:00", "description": "An anonymous reader quotes a report from Reuters: Sam Altman-led OpenAI said on Thursday it had disrupted five covert influence operations that sought to use its artificial intelligence models for \"deceptive activity\" across the internet. The artificial intelligence firm said the threat actors used its AI models to generate short comments, longer articles in a range of languages, made up names and bios for social media accounts over the last three months. These campaigns, which included threat actors from Russia, China, Iran and Israel, also focused on issues including Russia's invasion of Ukraine, the conflict in Gaza, the Indian elections, politics in Europe and the United States, among others.\n \nThe deceptive operations were an \"attempt to manipulate public opinion or influence political outcomes,\" OpenAI said in a statement. [...] The deceptive campaigns have not benefited from increased audience engagement or reach due to the AI firm's services, OpenAI said in the statement. Open", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/30/2025255/openai-disrupts-five-attempts-to-misuse-its-ai-for-deceptive-activity?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Disrupts Five Attempts To Misuse Its AI For 'Deceptive Activity'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T22:32:01.673045+00:00", "description": "If you contact Spotify's customer service with a valid receipt, the company will refund your Car Thing purchase. That's the latest development reported by Engadget. When Spotify first announced that it would brick every Car Thing device on December 9, 2024, it said that it wouldn't offer owners any subscription credit or automatic refund. From the report: Spotify has taken some heat for its announcement last week that it will brick every Car Thing device on December 9, 2024. The company described its decision as \"part of our ongoing efforts to streamline our product offerings\" (read: cut costs) and that it lets Spotify \"focus on developing new features and enhancements that will ultimately provide a better experience to all Spotify users.\"\n \nTechCrunch reports that Gen Z users on TikTok have expressed their frustration in videos, while others have complained directed toward Spotify in DMs on X (Twitter) and directly through customer support. Some users claimed Spotify's customer servi", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/30/2129202/spotify-says-it-will-refund-car-thing-purchases?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Spotify Says It Will Refund Car Thing Purchases", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T21:27:13.747324+00:00", "description": "Framework, a company known for its modular laptops, has announced a fourth round of iterative updates and upgrade options for its Framework Laptop 13. The upgrades include motherboards and pre-built laptops featuring new Intel Meteor Lake Core Ultra processors with Intel Arc dedicated GPUs, lower prices for AMD Ryzen 7000 and 13th-gen Intel editions, and a new display with a higher resolution and refresh rate. \n\nThe Core Ultra boards come with three CPU options, with prices starting at $899 for a pre-built or DIY model. Upgrading from an older Intel Framework board requires an upgrade to DDR5 RAM, and Framework charges $40 for every 8GB of DDR5-5600, which is above market rates. The new 13.5-inch display has a resolution of 2880x1920, a 120 Hz refresh rate, and costs $130 more than the standard display.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Framework+Boosts+Its+13-inch+Laptop+With+New+CPUs%2C+Lower+Prices%2C+and+Better+Screens%3A+htt", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/30/1949240/framework-boosts-its-13-inch-laptop-with-new-cpus-lower-prices-and-better-screens?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Framework Boosts Its 13-inch Laptop With New CPUs, Lower Prices, and Better Screens", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T20:22:24.805678+00:00", "description": "The New York governor, Kathy Hochul, plans to introduce a bill banning smartphones in schools, the latest in a series of legislative moves aimed at online child safety by New York's top official. From a report: \"I have seen these addictive algorithms pull in young people, literally capture them and make them prisoners in a space where they are cut off from human connection, social interaction and normal classroom activity,\" she said. Hochul said she would launch the bill later this year and take it up in New York's next legislative session, which begins in January 2025. If passed, schoolchildren will be allowed to carry simple phones that cannot access the internet but do have the capability to send texts, which has been a sticking point for parents. She did not offer specifics on enforcing the prohibition. \"Parents are very anxious about mass shootings in school,\" she said. \"Parents want the ability to have some form of connection in an emergency situation.\" The smartphone-ban bill w", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/30/1924202/new-york-governor-to-launch-bill-banning-smartphones-in-schools?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New York Governor To Launch Bill Banning Smartphones in Schools", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T20:22:22.813354+00:00", "description": "Microsoft seems to be concerned about some of OpenAI's business dealings. From a report: Satya Nadella recently met with Sam Altman to discuss an apparent deal between OpenAI and Apple, The Information reported [hard-paywalled]. According to the outlet, the OpenAI CEO recently reached an agreement with the iPhone maker to incorporate some OpenAI services into Apple products. Nadella was reportedly concerned about the potential impact of a deal on Microsoft's product ambitions, per the report. Apple was said to be considering both Google and OpenAI for the deal, which could be worth billions. \n\nIf OpenAI has indeed reached an agreement with Apple, it would be a much-needed win for Altman. The tech boss has faced heightened scrutiny after former employees and board members publicly criticized him. Helen Toner, a former OpenAI director, recently accused Altman of lying to the board \"multiple\" times and \"withholding information.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/30/1940229/microsofts-satya-nadella-worried-about-an-openai-apple-deal-report-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft's Satya Nadella Worried About an OpenAI-Apple Deal, Report Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T19:03:07.740729+00:00", "description": "Some of the world's most profitable -- and most polluting corporations -- have invested in carbon offset projects that have fundamental failings and are \"probably junk,\" suggesting industry claims about greenhouse gas reductions were likely overblown, according to new analysis. From a report: Delta, Gucci, Volkswagen, ExxonMobil, Disney, easyJet and Nestle are among the major corporations to have purchased millions of carbon credits from climate friendly projects that are \"likely junk\" or worthless when it comes to offsetting their greenhouse gas emissions, according to a classification system developed by Corporate Accountability, a non-profit, transnational corporate watchdog. Some of these companies no longer use CO2 offsets amid mounting evidence that carbon trading do not lead to the claimed emissions cuts -- and in some cases may even cause environmental and social harms. \n\nHowever, the multibillion-dollar voluntary carbon trading industry is still championed by many corporation", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/30/1813247/corporations-invested-in-carbon-offsets-that-were-likely-junk-analysis-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Corporations Invested in Carbon Offsets That Were 'Likely Junk', Analysis Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T19:03:06.196453+00:00", "description": "Google Cloud faced a major setback earlier this month when it accidentally deleted the account of UniSuper, an Australian pension fund managing $135 billion in assets, causing a two-week outage for its 647,000 members. Google Cloud has since completed an internal review of the incident and published a blog post detailing the findings. ArsTechnica: Google has a \"TL;DR\" at the top of the post, and it sounds like a Google employee got an input wrong. \n\n\"During the initial deployment of a Google Cloud VMware Engine (GCVE) Private Cloud for the customer using an internal tool, there was an inadvertent misconfiguration of the GCVE service by Google operators due to leaving a parameter blank. This had the unintended and then unknown consequence of defaulting the customer's GCVE Private Cloud to a fixed term, with automatic deletion at the end of that period. The incident trigger and the downstream system behavior have both been corrected to ensure that this cannot happen again.\"<p><div class", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/30/1839232/google-cloud-explains-how-it-accidentally-deleted-a-customer-account?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Cloud Explains How It Accidentally Deleted a Customer Account", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T17:57:48.123156+00:00", "description": "Mishaal Rahman, reporting for AndroidAuthority: Google just unveiled its latest Android Feature Drop earlier today, and it's one of the most exciting feature drops I can remember. The two features I'm most excited about are part of Play Services's new Cross-Device Services module, which brings some Apple Continuity-style magic to your Android devices. For example, the new Instant Hotspot feature lets you connect your Android tablet or Chromebook to your phone's hotspot with a single tap. Instant Hotspot works with phones running Android 11 or newer, with one notable exception: Samsung devices. According to Google, Instant Hotspot will not be available on any Samsung devices. [...] It's not clear exactly why Instant Hotspot isn't available on Samsung devices. The feature is part of Google Play Services, which is available on all Google-certified Android devices, including those from Samsung. It's likely that Samsung opted out of this particular feature, perhaps to encourage users to bu", "language": "en-us", "link": "https://slashdot.org/story/24/05/30/1728204/androids-new-instant-hotspot-feature-wont-be-available-on-samsung-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Android's New Instant Hotspot Feature Won't Be Available on Samsung Devices", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T16:52:59.039379+00:00", "description": "A widespread outage affecting over 600,000 routers connected to Windstream's Kinetic broadband service left customers without internet access for several days last October, according to a report by security firm Lumen Technologies' Black Lotus Labs. The incident, dubbed \"Pumpkin Eclipse,\" is believed to be the result of a deliberate attack using commodity malware known as Chalubo to overwrite router firmware. Windstream, which has about 1.6 million subscribers in 18 states, has not provided an explanation for the outage. The company sent replacement routers to affected customers, many of whom reported significant financial losses due to the disruption. ArsTechnica adds: After learning of the mass router outage, Black Lotus began querying the Censys search engine for the affected router models. A one-week snapshot soon revealed that one specific ASN experienced a 49 percent drop in those models just as the reports began. This amounted to the disconnection of at least 179,000 ActionTec ", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/30/165253/mystery-malware-destroys-600000-routers-from-a-single-isp-during-72-hour-span?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mystery Malware Destroys 600,000 Routers From a Single ISP During 72-hour Span", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T16:52:57.476432+00:00", "description": "Apple prioritizes device durability over easier repairs, according to John Ternus, the company's head of hardware engineering, in a recent interview with YouTuber MKBHD. \"It's objectively better for the customer to have that reliability,\" Ternus stated, adding that it is \"ultimately better for the planet\" due to significantly lower failure rates. Apple tests over 10,000 units of each product before release and incorporates real-world concerns into its testing suite.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Puts+iPhone+Durability+Ahead+of+Easy+Repairs%2C+Exec+Says%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F05%2F30%2F1647209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F05%2F30%2F1647209%2Fapple-puts-iphone-durability-ahead-of-easy-repairs-exec-says%", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/30/1647209/apple-puts-iphone-durability-ahead-of-easy-repairs-exec-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Puts iPhone Durability Ahead of Easy Repairs, Exec Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T15:48:10.511864+00:00", "description": "Google has confirmed the authenticity of 2,500 leaked internal documents detailing the company's data collection practices. The documents offer insights into Google's closely guarded search ranking algorithm. However, Google cautioned against making inaccurate assumptions based on incomplete information. The Verge adds: The leaked material suggests that Google collects and potentially uses data that company representatives have said does not contribute to ranking webpages in Google Search, like clicks, Chrome user data, and more. The thousands of pages of documents act as a repository of information for Google employees, but it's not clear what pieces of data detailed are actually used to rank search content -- the information could be out of date, used strictly for training purposes, or collected but not used for Search specifically. The documents also do not reveal how different elements are weighted in search, if at all.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"ht", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/30/1443235/google-confirms-the-leaked-search-documents-are-real?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Confirms the Leaked Search Documents Are Real", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T15:48:08.761588+00:00", "description": "The staggering electricity demand needed to power next-generation technology is forcing the US to rely on yesterday's fuel source: coal. From a report: Retirement dates for the country's ageing fleet of coal-fired power plants are being pushed back as concerns over grid reliability and expectations of soaring electricity demand force operators to keep capacity online. The shift in phasing out these facilities underscores a growing dilemma facing the Biden administration as the US race to lead in artificial intelligence and manufacturing drives an unprecedented growth in power demand that clashes with its decarbonisation targets. The International Energy Agency estimates the AI application ChatGPT uses nearly 10 times as much electricity as Google Search. \n\nAn estimated 54 gigawatts of US coal powered generation assets, about 4 per cent of the country's total electricity capacity, is expected to be retired by the end of the decade, a 40 per cent downward revision from last year, accord", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/30/1519248/us-slows-plans-to-retire-coal-fired-plants-as-power-demand-from-ai-surges?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Slows Plans To Retire Coal-Fired Plants as Power Demand From AI Surges", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T14:43:00.781999+00:00", "description": "Alphabet's Google and augmented reality startup Magic Leap are forming a strategic technology partnership and working on building immersive experiences that blend the physical and digital worlds. From a report: Magic Leap said in a blog post on Thursday that the two companies have agreed to a partnership. While short on details, the announcement adds to signals that Google may be plotting a return to the market for augmented and virtual reality (AR/VR) technologies that it so far has largely yielded to rivals Meta and Apple. The partnership would combine Florida-based Magic Leap's expertise in optics and device manufacturing with Google's technology platforms, Magic Leap said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google%2C+AR+Startup+Magic+Leap+Strike+Partnership+Deal%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F05%2F30%2F145231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/30/145231/google-ar-startup-magic-leap-strike-partnership-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google, AR Startup Magic Leap Strike Partnership Deal", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T13:38:15.022635+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Yesterday, Amazon failed to convince a US district court to dismiss the Federal Trade Commission's lawsuit targeting the tech giant's alleged history of tricking people into signing up for Prime. The FTC has alleged that Amazon \"tricked, coerced, and manipulated consumers into subscribing to Amazon Prime,\" a court order said, failing to get informed consent by designing a murky sign-up process. And to keep subscriptions high, Amazon also \"did not provide simple mechanisms for these subscribers to cancel their Prime memberships,\" the FTC alleged. Instead, Amazon forced \"consumers intending to cancel to navigate a four-page, six-click, fifteen-option cancellation process.\" In their motion to dismiss, Amazon outright disputed these characterizations of its business, insisting its enrollment process was clear, its cancellation process was simple, and none of its executives could be held responsible for failing to fix these processes w", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/30/0636247/amazon-execs-may-be-personally-liable-for-tricking-users-into-prime-sign-ups?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Execs May Be Personally Liable For Tricking Users Into Prime Sign-Ups", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T10:11:01.085481+00:00", "description": "A survey of 12,000 people in six countries -- Argentina, Denmark, France, Japan, the UK, and the USA -- found that very few people are regularly using AI products like ChatGPT. Unsurprisingly, the group bucking the trend are young people ages 18 to 24. The BBC reports: Dr Richard Fletcher, the report's lead author, told the BBC there was a \"mismatch\" between the \"hype\" around AI and the \"public interest\" in it. The study examined views on generative AI tools -- the new generation of products that can respond to simple text prompts with human-sounding answers as well as images, audio and video. \"Large parts of the public are not particularly interested in generative AI, and 30% of people in the UK say they have not heard of any of the most prominent products, including ChatGPT,\" Dr Fletcher said.\n \nThis research attempted to gauge what the public thinks, finding:\n- The majority expect generative AI to have a large impact on society in the next five years, particularly for news, media a", "language": "en-us", "link": "https://slashdot.org/story/24/05/30/0238230/very-few-people-are-using-much-hyped-ai-products-like-chatgpt-survey-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Very Few People Are Using 'Much Hyped' AI Products Like ChatGPT, Survey Finds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T08:00:55.490955+00:00", "description": "Last August, PayPal became the first major financial company to roll out a stablecoin. Labeled PayPal USD, or PYUSD, the coin was issued on the Ethereum blockchain and \"fully backed by U.S. dollar deposits, short-term Treasuries and similar cash equivalents.\" Now, the financial company is adding Solana as an option, \"making PayPal's stablecoin faster and cheaper to use.\"\n \n\"The Solana blockchain is known for processing massive amounts of transactions at high speeds with extremely low costs, providing significant benefits for commerce use cases,\" says the company in a press release. \"As the most used blockchain for stablecoin transfers, according to data from blockchain analytics platform Artemis, Solana has emerged as the leading blockchain to run tokenized transactions and is ideal for PYUSD as it continues to be used for payment use cases.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=PayPal+Adds+Stablecoin+To+Solana+Blockchain%3A+https%3", "language": "en-us", "link": "https://slashdot.org/story/24/05/30/0231232/paypal-adds-stablecoin-to-solana-blockchain?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "PayPal Adds Stablecoin To Solana Blockchain", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T03:40:35.045828+00:00", "description": "An anonymous reader quotes a report from Ars Technica: When used to generate power or move vehicles, fossil fuels kill people. Particulates and ozone resulting from fossil fuel burning cause direct health impacts, while climate change will act indirectly. Regardless of the immediacy, premature deaths and illness prior to death are felt through lost productivity and the cost of treatments. Typically, you see the financial impacts quantified when the EPA issues new regulations, as the health benefits of limiting pollution typically dwarf the costs of meeting new standards. But some researchers from Lawrence Berkeley National Lab have now done similar calculations -- but focusing on the impact of renewable energy. Wind and solar, by displacing fossil fuel use, are acting as a form of pollution control and so should produce similar economic benefits. Do they ever. The researchers find that, in the U.S., wind and solar have health and climate benefits of over $100 for every Megawatt-hour p", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/30/0035232/wind-and-solar-saved-the-us-250-billion-over-4-years-report-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Wind and Solar Saved the US $250 Billion Over 4 Years, Report Finds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T02:36:17.050835+00:00", "description": "schwit1 shares a report from NPR: When you first approach this bridge over Interstate 66 in northern Virginia, it may feel like you're driving on the wrong side of the road. Because, in a way, you are. \"There were a lot of people who looked at me like I was a little nuts,\" says traffic engineer Gilbert Chlewicki, the inventor of this unconventional interchange. \"Like, why are you putting me on the other side of the road?\" Chlewicki agreed to meet at this intersection 35 miles west of Washington, D.C. to explain the workings of the diverging diamond interchange, as it's known. He was easy to spot, wearing a neon yellow vest for safety.\n \nAs you enter the interchange, the right and left sides of the road cross over each other at a stop light. You are, in fact, driving on the left side of the road at this point. From there, left turns become a lot easier, because there's no oncoming traffic in the way. Instead of waiting for a signal, you get a free left turn. \"When we do the cross-over ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/30/0026222/road-planners-embrace-the-diverging-diamond-interchange-to-speed-up-traffic?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Road Planners Embrace the Diverging Diamond Interchange To Speed Up Traffic", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T01:30:29.002432+00:00", "description": "Michael Larabel reports via Phoronix: A massive uptick in traffic to Fedora's package mirrors is causing problems for the Linux distribution. Some five million additional systems have started putting additional strain on Fedora's mirror resources since March and appear to be coming from Amazon's cloud. Stephen Smoogen of Red Hat wrote a blog post today around 5+ million more EPEL-7 systems beginning in March. Fedora hosts the packaging mirrors for Extra Packages For Enterprise Linux (EPEL) to augment the package selection available on RHEL, CentOS, Amazon Linux, etc.\n \nThe past three months now there has been a 5+ million surge in Fedora/EPEL traffic and it's placed a strain on the systems. It's about doubling the number of unique IPs connecting to the mirror system. The massive uptick in Fedora/EPEL activity puts additional pressure on Fedora web proxies for mirror data and then the mirrors themselves that tend to be volunteer run. Much of this new traffic is coming from the Amazon/A", "language": "en-us", "link": "https://linux.slashdot.org/story/24/05/29/2237251/amazon-cloud-traffic-is-suffocating-fedoras-mirrors?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Cloud Traffic Is Suffocating Fedora's Mirrors", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T01:30:27.433830+00:00", "description": "Satellite-to-phones service provider AST SpaceMobile announced a deal with Verizon to provide remote coverage across the United States. \"Verizon's deal effectively includes a $100 million raise for AST, as well, in the form of $65 million in commercial service prepayments and $35 million in debt via convertible notes,\" reports CNBC. \"The companies said that $45 million of the prepayments 'are subject to certain conditions' such as needed regulatory approvals and signing of a definitive commercial agreement.\" Shares of AST jumped 69% in trading to close at $9.02 a share -- the largest single day rise for the company's stock since it went public in 2021. From the report: AST SpaceMobile is building satellites to provide broadband service to unmodified smartphones, in the nascent \"direct-to-device\" communications market. [...] The Verizon partnership follows a similar pattern to AT&amp;T's work with AST. Back in January, AT&amp;T was a co-debt investor in the company alongside Google and", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/29/2244236/ast-spacemobile-stock-surges-69-after-verizon-satellite-internet-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AST SpaceMobile Stock Surges 69% After Verizon Satellite Internet Deal", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T00:26:18.586255+00:00", "description": "The notorious hacker group ShinyHunters has claimed to have breached the security of Ticketmaster-Live Nation, compromising the personal data more than half a billion users. \"This massive 1.3 terabytes of data, is now being offered for sale on Breach Forums for a one-time sale for $500,000,\" reports Hackread. From the report: ShinyHunters has allegedly accessed a treasure trove of sensitive user information, including full names, addresses, email addresses, phone numbers, ticket sales and event details, order information, and partial payment card data. Specifically, the compromised payment data includes customer names, the last four digits of card numbers, expiration dates, and even customer fraud details. The data breach, if confirmed, could have severe implications for the affected users, leading to potential identity theft, financial fraud, and further cyber attacks. The hacker group's bold move to put this data on sale goes on to show the growing menace of cybercrime and the incre", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/29/226202/hackers-claim-to-have-breached-ticketmaster-stealing-personal-data-of-560-million-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Hackers Claim To Have Breached Ticketmaster, Stealing Personal Data of 560 Million Users", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T00:26:16.963292+00:00", "description": "An anonymous reader quotes an op-ed from The Globe and Mail, written by Kate Robertson and Ron Deibert. Robertson is a senior research associate and Deibert is director at the University of Toronto's Citizen Lab. From the piece: A federal cybersecurity bill, slated to advance through Parliament soon, contains secretive, encryption-breaking powers that the government has been loath to talk about. And they threaten the online security of everyone in Canada. Bill C-26 empowers government officials to secretly order telecommunications companies to install backdoors inside encrypted elements in Canada's networks. This could include requiring telcos to alter the 5G encryption standards that protect mobile communications to facilitate government surveillance. The government's decision to push the proposed law forward without amending it to remove this encryption-breaking capability has set off alarm bells that these new powers are a feature, not a bug.\n \nThere are already many insecurities i", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/29/2216251/ottawa-wants-the-power-to-create-secret-backdoors-in-our-networks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Ottawa Wants the Power To Create Secret Backdoors In Our Networks'", "user": null, "vote": 0}]