[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T18:30:27+00:00", "description": "On the surface, Wuthering Waves may seem like another free-to-play action RPG title in the vein of Genshin Impact. While some basic mechanics and systems are similar, Kuro Games' take on the genre offers sleeker action, a more post-apocalyptic vibe and an interesting take on creature collecting.\n\nFirst, you must navigate the underwhelming first hours that inundate you with lore and information without presenting a compelling plot. The English voice acting is uneven in this regard, with some characters sounding monotone. It also doesn't help that the localization has some errors.\n\nNevertheless, the combat is a strong foundation, anchoring everything else in a commendable fashion, whether battling powerful bosses or experimenting with different Concerto Skills. If you can make it past the opening to the better parts of the story, then Wuthering Waves is a solid experience, albeit one that would still benefit from more time and content.", "language": null, "link": "https://www.youtube.com/watch?v=bFQZbPBPIvA", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/bFQZbPBPIvA/hqdefault.jpg", "title": "Wuthering Waves Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T15:30:25+00:00", "description": "The Assassin's Creed franchise has often touched incredibly high highs with a number of its instalments, which have then gone on to become among the fanbase’s favorite games in the long running series.\n\nAnd one game in particular that is often in those conversations is Assassin’s Creed 4: Black Flag. Releasing over a decade ago in 2013, the game wasn’t necessarily one that many expected would be able to make that much of a mark, but with its core pirate conceit and its stellar naval gameplay, from combat to exploration, it ensured that people would be proven wrong. \n\nHere, we’ll be speaking about all of that and more.", "language": null, "link": "https://www.youtube.com/watch?v=wvlqjFuxdw0", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/wvlqjFuxdw0/hqdefault.jpg", "title": "Nobody Makes Pirate Games Like This Anymore...", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-30T09:30:26+00:00", "description": "Microsoft delivered a great first console with the Xbox, and the tech giant was able to capture a decent market share with that debut machine thanks to a combination of great hardware and strong first party titles.\n\nNot only that, but Xbox pioneered online gaming in the realm of consoles. Xbox Live was a truly revolutionary product that helped build many communities and enabled new avenues for developers to explore with online connectivity. \n\nFrom Halo to Project Gotham Racing and MechAssault, there was no shortage of great games to enjoy on Xbox and this video counts down 15 of the best Xbox games of all time.", "language": null, "link": "https://www.youtube.com/watch?v=lt5XT3NN-5E", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/lt5XT3NN-5E/hqdefault.jpg", "title": "15 Best Original Xbox Games of All Time [2024 Edition]", "user": null, "vote": 0}]