[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-26T15:30:15+00:00",
        "description": "If there’s one thing to remember gaming in 2024 by, it’s the memorable boss fights it gave us. Some of the most challenging games of the decade came out in 2024. Elden Ring: Shadow of the Erdtree, Black Myth Wukong, and some other surprise hits made players really work to earn their victories. \n\nAs per the rules of this year’s list, there’s only one entry per game. This limitation is applied so that boss-heavy games such as Wukong and Shadow of the Erdtree don’t completely dominate the list, making room for a variety of games.\n\nThe games on this list are quite diverse, with genres ranging from turn-based RPGs to action-platformers and even a third-person shooter. This video obviously won’t come close to covering every player’s experience combating this year’s toughest foes. That said, it does cover an exceptionally difficult boss from each respective game that kept us playing for hours on end.",
        "id": 1783379,
        "language": null,
        "link": "https://www.youtube.com/watch?v=WgcNEJ867mw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WgcNEJ867mw/hqdefault.jpg",
        "title": "10 Nightmarish Boss Fights of 2024 That Made Us Scream, \"IS THIS EVEN FAIR!?\"",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-26T09:30:03+00:00",
        "description": "When you look back on 2024, it'll be for many reasons. Maybe it's because of high-profile titles like Dragon's Dogma 2, S.T.A.L.K.E.R. 2: Heart of Chornobyl, Astro Bot, and Black Myth: Wukong. Perhaps you'll have a soft spot for indie games like Neva, Satisfactory, UFO 50, and more.\n\nHowever, other games may have caught but not outright demanded your time, money, and attention. We're talking about the acceptable single-player games with their fair share of significant flaws. Maybe they suffered from extensive technical issues and bugs, or the gameplay needed more polish. Does that mean they're outright terrible and not worth playing? Your mileage may vary.\n\nThey may be worth checking out on sale or if you're curious. It's just worth knowing their flaws before really diving in. Check out 15 flawed but still decent (and, in some cases, good) single-player games of 2024 that you probably missed.",
        "id": 1781633,
        "language": null,
        "link": "https://www.youtube.com/watch?v=9qPgVXV7--Q",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9qPgVXV7--Q/hqdefault.jpg",
        "title": "15 Flawed But Decent Single Player Games of 2024 You Likely Missed",
        "vote": 0
    }
]