[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-17T19:36:19+00:00", "description": "[Africa CDC] In my role as the African Union (AU) Champion on Pandemic Prevention, Preparedness, and Response (PPPR), I have been closely monitoring the evolving Mpox situation, regularly briefed by the Director General of Africa CDC and PPPR Commission. I am deeply concerned by the rapid spread of Mpox across multiple regions within the African Union, with a significant rise in both cases and fatalities, reflecting a concerning shift in the epidemiological pattern.", "id": 1017920, "language": "en", "link": "https://allafrica.com/stories/202408170156.html", "manual_status_code": 0, "page_rating": 29, "page_rating_contents": 90, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://allafrica.com/tools/headlines/rdf/africa/headlines.rdf", "source_obj__id": 15, "status_code": 0, "tags": [], "thumbnail": null, "title": "Africa: Statement By President Ramaphosa, the African Union Champion On Pandemic Prevention, Preparedness, and Response On the Mpox Outbreak in Africa", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-17T19:33:34+00:00", "description": "[Africa CDC] His Excellency Dr. Jean Kaseya, Director General of the Africa CDC, held a pivotal meeting with His Excellency Jo&#xe3;o Louren&#xe7;o, President of the Republic of Angola and Chairperson of the Southern African Development Community (SADC), to address the urgent health security challenges facing the continent. This high-level dialogue underscored Africa CDC's unwavering commitment to safeguarding the health of all Africans, particularly in the wake of the recent declaration of Mpox as a Public Health", "id": 1017921, "language": "en", "link": "https://allafrica.com/stories/202408170154.html", "manual_status_code": 0, "page_rating": 29, "page_rating_contents": 90, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://allafrica.com/tools/headlines/rdf/africa/headlines.rdf", "source_obj__id": 15, "status_code": 0, "tags": [], "thumbnail": null, "title": "Africa: Africa CDC Director General Meets Angola's President Jo&#xe3;o Louren&#xe7;o to Discuss Health Security and Continental Preparedness", "user": null, "vote": 0}]