[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-06T16:00:41+00:00", "description": "There's a distinct sense of adventure that's derived from exploring a virtual world, and no other medium quite gets that feeling of excitement and wonder as right as video games. \n\nThe best exploration games feature detailed visuals and compelling progression loops to keep you engaged for hours and hours upon end, and the coming weeks and months are chock full of games of this ilk. \n\nWith this feature, we will be taking a look at 16 new exploration games of 2024 and beyond, right from highly anticipated sequels like STALKER 2 to ambitious new IPs like Crimson Desert and much more.", "language": null, "link": "https://www.youtube.com/watch?v=rwd2LcAkeTg", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/rwd2LcAkeTg/hqdefault.jpg", "title": "16 NEW Games of 2024 And Beyond That Let You EXPLORE EVERYWHERE", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-06T11:00:17+00:00", "description": "There’s no one, single right way for a game to effectively transport players into its world, but a sure shot one is to ensure that said worlds are large ones that compel you to simply keep existing in them a little bit longer. \n\nFrom open world games to those that adopt a linear design style to others that straddle the line between those two styles in a variety of different ways, there has been many a game over the years that have managed to do just that- many of which are only found on PlayStation, if you’re looking to stay in that space space. \n\nHere, we’ll be following up on similar previous features and take a look at a few more of the biggest video game worlds we’ve explored in PlayStation console exclusives.", "language": null, "link": "https://www.youtube.com/watch?v=FWGctme3Q-Y", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/FWGctme3Q-Y/hqdefault.jpg", "title": "14 More BIGGEST PlayStation Game Worlds That Are A Treat To Explore", "user": null, "vote": 0}]