[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T23:37:03.460887+00:00", "description": "According to a partial teardown video of Apple's new Mac mini, the new machine features modular storage that can be removed. \"As we saw with the Mac Studio, however, replacing the modular storage is complicated,\" notes MacRumors. The teardown also reveals two 128GB storage chips in the 256GB model, enabling faster SSD speeds comparable to higher-capacity versions. From the report: The criticism surrounding Apple's decision to use a single 256GB chip in some base-model Macs a few years ago primarily came from a vocal contingent of tech enthusiasts, and the average customer is unlikely to even notice the slower speeds in common day-to-day tasks. Nevertheless, it appears that customers who do want the fastest SSD speeds do not need to worry about which storage capacity they choose when ordering the new Mac mini.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=New+Mac+Mini+Has+Modular+Storage%2C+256GB+Model+Will+Have+Fa", "id": 1481663, "language": null, "link": "https://hardware.slashdot.org/story/24/11/08/2240254/new-mac-mini-has-modular-storage-256gb-model-will-have-faster-ssd?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "New Mac Mini Has Modular Storage, 256GB Model Will Have Faster SSD", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T22:31:57.075003+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Anthropic has announced a partnership with Palantir and Amazon Web Services to bring its Claude AI models to unspecified US intelligence and defense agencies. Claude, a family of AI language models similar to those that power ChatGPT, will work within Palantir's platform using AWS hosting to process and analyze data. But some critics have called out the deal as contradictory to Anthropic's widely-publicized \"AI safety\" aims. On X, former Google co-head of AI ethics Timnit Gebru wrote of Anthropic's new deal with Palantir, \"Look at how they care so much about 'existential risks to humanity.'\"\n \nThe partnership makes Claude available within Palantir's Impact Level 6 environment (IL6), a defense-accredited system that handles data critical to national security up to the \"secret\" classification level. This move follows a broader trend of AI companies seeking defense contracts, with Meta offering its Llama models to defense partners a", "id": 1481444, "language": null, "link": "https://tech.slashdot.org/story/24/11/08/2229258/claude-ai-to-process-secret-government-data-through-new-palantir-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Claude AI To Process Secret Government Data Through New Palantir Deal", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T20:22:19.423663+00:00", "description": "Scalpers attempting to profit from Sony's new PlayStation 5 Pro are struggling to sell units above retail price, as widespread availability dampens resale prospects. The $699 console, launched this week with enhanced graphics capabilities, remains in stock at major retailers across the United States and Europe. eBay listings show PS5 Pro units selling below the manufacturer's suggested retail price, with some auctions starting at $640. \n\nWhile isolated listings reach $2,300, most hover near retail value. UK scalpers face similar challenges, offering units at or below the $900 retail price. Even in Sony's home market of Japan, where availability is tighter, resellers on Mercari barely break even after platform fees and shipping costs. The situation marks a sharp contrast to the original PS5's 2020 launch, when widespread shortages led to significant markups. Only the console's external disc drive, priced at $79.99, commands premiums up to $130 on secondary markets.<p><div class=\"share", "id": 1480720, "language": null, "link": "https://games.slashdot.org/story/24/11/08/1944205/scalpers-are-struggling-to-resell-the-playstation-5-pro-because-its-in-stock-at-most-retailers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Scalpers Are Struggling To Resell the PlayStation 5 Pro Because It's in Stock at Most Retailers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T18:12:26.592872+00:00", "description": "The FBI is warning that hackers are obtaining private user information -- including emails and phone numbers -- from U.S.-based tech companies by compromising government and police email addresses to submit \"emergency\" data requests. From a report: The FBI's public notice filed this week is a rare admission from the federal government about the threat from fraudulent emergency data requests, a legal process designed to help police and federal authorities obtain information from companies to respond to immediate threats affecting someone's life or property. \n\nThe abuse of emergency data requests is not new, and has been widely reported in recent years. Now, the FBI warns that it saw an \"uptick\" around August in criminal posts online advertising access to or conducting fraudulent emergency data requests, and that it was going public for awareness. \"Cyber-criminals are likely gaining access to compromised U.S. and foreign government email addresses and using them to conduct fraudulent e", "id": 1479914, "language": null, "link": "https://yro.slashdot.org/story/24/11/08/170208/fbi-says-hackers-are-sending-fraudulent-police-data-requests-to-tech-giants-to-steal-peoples-private-information?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "FBI Says Hackers Are Sending Fraudulent Police Data Requests To Tech Giants To Steal People's Private Information", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T17:07:41.024806+00:00", "description": "The chief executive of Cop29 has been filmed apparently agreeing to facilitate fossil fuel deals at the climate summit. From a report: The recording has amplified calls by campaigners who want the fossil fuel industry and its lobbyists to be banned from future Cop talks. The campaign group Global Witness posed undercover as a fake oil and gas group asking for deals to be facilitated in exchange for sponsoring the event.\n\nIn the calls, Elnur Soltanov, Azerbaijan's deputy energy minister and chief executive of Cop29, agreed to this and spoke of a future that includes fossil fuels \"perhaps for ever.\" Cop officials also introduced the fake investor to a senior executive at the national oil and gas company Socar to discuss investment opportunities. \n\nSoltanov told the fake investment group: &#226;oeI would be happy to create a contact between your team and their team [Socar] so that they can start discussions.\" Shortly after that they received an email from Socar. The UN framework convent", "id": 1479421, "language": null, "link": "https://news.slashdot.org/story/24/11/08/1545240/cop29-ceo-filmed-agreeing-to-facilitate-fossil-fuel-deals-at-climate-summit?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Cop29 CEO Filmed Agreeing To Facilitate Fossil Fuel Deals at Climate Summit", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T17:07:40.935110+00:00", "description": "From an opinion piece on GamesIndustry.biz about the recently launched PS5 Pro that went on sale this week: What I'd argue is actually more interesting about PS5 Pro in a wider perspective isn't what Sony has done to the chips in the system -- it's what they've chosen not to include, and what it tells us about the decision-making process that's likely occurring for the company's future hardware. PS5 Pro doesn't have a disc drive. Anyone who wants to play disc-based games on the system will need to buy one of the add-on drives Sony started selling when the PS5 Slim model was released, adding further to the cost of the already very expensive device. \n\nTo add insult to injury, Sony doesn't seem to have made any effort whatsoever to ensure that those drives are actually well-stocked for the launch of the Pro. I can only speak directly to the situation in Japan, where they've been out of stock at most major retailers for months and even second-hand units are being sold at three to four ti", "id": 1479420, "language": null, "link": "https://games.slashdot.org/story/24/11/08/163202/ps5-pro-signposts-a-disc-less-future-that-few-actually-want?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'PS5 Pro Signposts a Disc-Less Future That Few Actually Want'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T16:02:42.534311+00:00", "description": "Block will abandon development of its Web5 decentralized internet project and reduce investment in music streaming service Tidal to focus on bitcoin mining hardware and self-custody wallets, the payments company announced in its third-quarter letter to shareholders. The Jack Dorsey-led firm cited strong market demand for its bitcoin mining products and Bitkey wallet as key drivers behind the strategic shift.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Jack+Dorsey's+Block+Scraps+'Web5'+Project%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F11%2F08%2F1411243%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F11%2F08%2F1411243%2Fjack-dorseys-block-scraps-web5-project%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/s", "id": 1478870, "language": null, "link": "https://tech.slashdot.org/story/24/11/08/1411243/jack-dorseys-block-scraps-web5-project?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Jack Dorsey's Block Scraps 'Web5' Project", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T16:02:42.430429+00:00", "description": "An anonymous reader shares a report: AMD has gained a substantial 5.7 percentage points of share of the desktop x86 CPU market in the third quarter compared to Q2, the largest quarterly share gain since we began tracking the market share reports in 2016. It also represents an incredible ten percentage point improvement over the prior year. AMD also raked in a strong increase in revenue share, jumping 8.5 percentage points over the prior quarter, indicating that it is selling a strong mix of higher-end CPU models. \n\nDuring the quarter, AMD launched its new Ryzen 9000-series family of processors amid a scandal related to stability issues with Intel's Raptor Lake chips, which generated a flood of negative press for the company over the course of several months, and inventory adjustments for one of Intel's customers. AMD now commands 28.7% of the desktop processor market. AMD also continued to gain share in the laptop and server markets, though its gains on the desktop side of the busine", "id": 1478869, "language": null, "link": "https://tech.slashdot.org/story/24/11/08/1452245/amds-desktop-pc-market-share-skyrockets-amid-intels-raptor-lake-cpu-crashing-scandal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AMD's Desktop PC Market Share Skyrockets Amid Intel's Raptor Lake CPU Crashing Scandal", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T16:02:42.328511+00:00", "description": "UK government-appointed commissioners have labeled Birmingham City Council's Oracle Fusion rollout as \"the poorest ERP deployment\" they have seen. From a report: A report published by the UK council's Corporate Finance Overview and Scrutiny Committee found that 18 months after Fusion went live, the largest public authority in Europe \"had not tactically stabilized the system or formulated clear plans to resolve the system issues and recover the operation.\" \n\nThe city council's cloud-based Oracle tech replaced the SAP system that it began using in 1999, but the disastrous project encountered a string of landmark failures. The council has failed to produce auditable accounts since Oracle was implemented in 2022, costs have ballooned from around 19 million pound to a projected estimate of 131 million pound and, because the council chose not to use system audit features, it cannot tell if fraud has taken place on its multibillion-pound spending budget for an 18-month period. In September ", "id": 1478868, "language": null, "link": "https://it.slashdot.org/story/24/11/08/1529239/europes-largest-local-authority-slammed-for-poorest-erp-rollout-ever?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Europe's Largest Local Authority Slammed For 'Poorest' ERP Rollout Ever", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T13:26:47.869644+00:00", "description": "An anonymous reader quotes a report from Oregon Live: Intel told employees this week that it will bring back free coffee and tea at its work sites, one of many benefits the chipmaker eliminated last summer as it sought to slash $10 billion from its annual budget. \"Although Intel still faces cost challenges, we understand that small comforts play a significant role in our daily routines,\" Intel wrote on its internal messaging forum, called Circuit. \"We know this is a small step, but we hope it is a meaningful one in supporting our workplace culture.\" Intel declined comment. The company did not resume offering free fruit, another perk eliminated last summer. Employees say privately that morale has been devastated by Intel's poor financial performance and by cutbacks aimed at returning the business to profitability.\n \n[...] Christy Pambianchi, Intel's chief people officer, told employees that Intel had been spending $100 million annually on free and discounted food and beverages and cou", "id": 1478022, "language": null, "link": "https://developers.slashdot.org/story/24/11/08/0654257/intel-brings-back-workers-free-coffee-to-boost-morale?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Brings Back Workers' Free Coffee To Boost Morale", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T10:11:33.775039+00:00", "description": "According to Deadline's Mike Fleming Jr, Lucasfilm is developing a new Star Wars trilogy. It will be written by Simon Kinberg, who will also produce the films alongside Lucasfilm chief Kathleen Kennedy. From the report: I heard this will comprise Episodes 10-12 of The Skywalker Saga that began with George Lucas's 1977 first film, which, along with Steven Spielberg's Jaws, reshaped the global blockbuster game. Insiders disputed my intel that Kinberg will continue that storyline, saying this instead will begin a new saga, and sit alongside percolating Star Wars projects with James Mangold, Sharmeen Obaid-Chinoy, Taika Waititi and Donald Glover. As usual, Lucasfilm and Disney are not commenting.\n \nKinberg previously worked with Lucasfilm in co-creating with Dave Filoni and Carrie Beck the Emmy-nominated animated series Star Wars Rebels that ran for four seasons from 2014-2018. He was also a consultant on Star Wars Episode VII: The Force Awakens, the J.J. Abrams-directed film that revive", "id": 1476973, "language": null, "link": "https://entertainment.slashdot.org/story/24/11/08/0641215/new-star-wars-trilogy-in-the-works?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "New 'Star Wars' Trilogy In the Works", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T07:57:28.230276+00:00", "description": "IBM is facing a new lawsuit alleging that its Weather Channel website shared users' personal data with third-party ad partners without consent, violating the Video Privacy Protection Act (VPPA). The Register reports: In the absence of a comprehensive federal privacy law, the complaint [PDF] claims Big Blue violated America's Video Privacy Protection Act (VPPA), enacted in 1988 in response to the disclosure of Supreme Court nominee Robert Bork's videotape rental records. IBM was sued in 2019 (PDF) by then Los Angeles City Attorney Mike Feuer over similar allegations: That its Weather Channel mobile app collected and shared location data without disclosure. The IT titan settled that claim in 2020. A separate civil action against IBM's Weather Channel was filed in 2020 and settled in 2023 (PDF).\n \nThis latest legal salvo against alleged Weather Channel-enabled data collection takes issue with the sensitive information made available through the company's website to third-party ad partne", "id": 1476491, "language": null, "link": "https://yro.slashdot.org/story/24/11/08/0632236/ibm-sued-again-in-storm-over-weather-channel-data-sharing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "IBM Sued Again In Storm Over Weather Channel Data Sharing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T03:36:42.067339+00:00", "description": "An anonymous reader quotes a report from Variety: A \"Mass Effect\" TV series is officially in development at Amazon MGM Studios, Variety has learned exclusively. Daniel Casey is set to write and executive produce the adaptation. Karim Zreik will executive produce under his Cedar Tree Productions banner, with Ari Arad and EA's Michael Gamble also executive producing. Cedar Tree is currently under an overall deal at Amazon MGM Studios. Exact plot details are being kept under wraps. [...]\n \nThe first \"Mass Effect\" game launched to rave reviews in 2007. Since then, there have been three more games in the main series, with \"Mass Effect: Andromeda\" debuting in 2017. There have also been multiple mobile games in the franchise, as well as an animated film, novels, comic books, and other media. The story of the first three \"Mass Effect\" games revolves around Commander Shepard, a human soldier in the 22nd century trying to save humanity from a race of aliens known as the Reapers. \"Andromeda\" mo", "id": 1475709, "language": null, "link": "https://entertainment.slashdot.org/story/24/11/08/0024209/mass-effect-tv-series-is-in-the-works-at-amazon?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'Mass Effect' TV Series Is In the Works At Amazon", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T02:31:38.801369+00:00", "description": "Max will begin a gradual password-sharing crackdown with \"soft messaging\" over the next few months, with a potential price increase to follow. The Verge reports: During Warner Bros. Discovery's Q3 earnings call on Thursday, chief financial officer Gunnar Wiedenfels said this initial rollout would be followed by more progress in 2025 and 2026. Wiedenfels called password sharing \"a form of price rises,\" as the company is \"asking members who have not signed up, or multi-household members to pay a little bit more.\" This isn't the first time we've heard about Max's interest in password sharing, but now we have more details about when -- and how -- it will all begin. [...]\n \nWiedenfels didn't rule out the possibility of a Max price increase, either. He said that the \"premium nature\" of the service leaves \"a fair amount of room to continue to push a price we've been judicious about.\" Max last raised prices across its ad-free plans in June.<p><div class=\"share_submission\" style=\"position:rel", "id": 1475546, "language": null, "link": "https://news.slashdot.org/story/24/11/08/008206/max-is-getting-ready-for-its-own-password-sharing-crackdown?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Max Is Getting Ready For Its Own Password-Sharing Crackdown", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T01:26:24.346714+00:00", "description": "Elwood Edwards, the voice of AOL's \"You've Got Mail\" greeting, has died at age 74 following a long illness, according to local Ohio news station WKYC. \"He worked at 3News for many years as graphics guru, camera operator, and general jack-of-all-trades, yet it was a somewhat random opportunity in 1989 that earned him international fame.\" From the report: That year, Elwood received $200 from the then-unknown America Online, merely because his wife worked at a predecessor company. He was asked to simply record four voiceover lines:\n \n- \"Welcome\"\n- \"You've Got Mail\"\n- \"Files done\"\n- \"Goodbye\"\n \nOf course, the company better known as AOL blew up, and millions around the world would hear Elwood's voice telling them \"You've Got Mail\" every time they logged on to the internet. Despite his face not being visible, Elwood still achieved minor celebrity status. In 2015, he even appeared on \"The Tonight Show Starring Jimmy Fallon\" to utter the famous greeting as well as other audience-suggested p", "id": 1475336, "language": null, "link": "https://slashdot.org/story/24/11/07/2347232/elwood-edwards-voice-of-aols-youve-got-mail-dies-at-74?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Elwood Edwards, Voice of AOL's 'You've Got Mail,' Dies At 74", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T00:23:22.714303+00:00", "description": "U.S. Cellular has agreed to sell $1.02 billion worth of spectrum licenses to AT&amp;T as part of its strategy to monetize its spectrum assets that were not included in an earlier $4.4 billion deal with T-Mobile. Reuters reports: Last month, U.S. Cellular agreed to sell select spectrum licenses for $1 billion to Verizon. It also signed deals with two other mobile network operators, but did not disclose the details. The latest agreement \"adds a fourth mobile network operator, in addition to T-Mobile, to the list of those whose subscribers will benefit from the sale of our spectrum licenses,\" U.S. Cellular CEO Laurent Therivel said on Thursday. From a press release: Following this transaction, as well as those previously announced, UScellular will have reached definitive agreements to monetize approximately 55%, measured on a MHz-Pops basis, of the spectrum holdings (excluding mmWave) that were excluded from the proposed sale to T-Mobile, for a total consideration of approximately $2.02", "id": 1475128, "language": null, "link": "https://mobile.slashdot.org/story/24/11/07/2230235/us-cellular-to-sell-some-spectrum-licenses-to-att-for-1-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Cellular To Sell Some Spectrum Licenses To AT&amp;T For $1 Billion", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-08T00:23:22.564754+00:00", "description": "An anonymous reader quotes a report from 404 Media: If you voted in the U.S. presidential election yesterday in which Donald Trump won comfortably, or a previous election, a website powered by a right-wing group is probably doxing you. VoteRef makes it trivial for anyone to search the name, physical address, age, party affiliation, and whether someone voted that year for people living in most states instantly and for free. This can include ordinary citizens, celebrities, domestic abuse survivors, and many other people. Voting rolls are public records, and ways to more readily access them are not new. But during a time of intense division, political violence, or even the broader threat of data being used to dox or harass anyone, sites like VoteRef turn a vital part of the democratic process -- simply voting -- into a security and privacy threat. [...]\n \nThe Voter Reference Foundation, which runs VoteRef, is a right wing organization helmed by a former Trump campaign official, ProPubli", "id": 1475127, "language": null, "link": "https://politics.slashdot.org/story/24/11/07/233235/voted-in-america-voteref-probably-doxed-you?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Voted In America? VoteRef Probably Doxed You", "vote": 0}]