[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-29T19:30:05+00:00", "description": "Remnant 2's second paid DLC, The Forgotten Kingdom, is finally available.\nWhen taking the new dungeons and plethora of items into consideration, The Forgotten Kingdom works as a complement to the base game. However, it's narratively lacking, with much of the biome giving way to some serious deja vu. The new bosses are at least fun to fight, and the Invoker Archetype can make for some fun spell-slinging action.\n\nPicking up The Forgotten Kingdom is a foregone conclusion for most Remnant 2 players, especially if they want more items and secrets to pursue. While it's ideal for that and little else, here's hoping the third DLC does something more.", "language": null, "link": "https://www.youtube.com/watch?v=gnNArj9NNqw", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/gnNArj9NNqw/hqdefault.jpg", "title": "Remnant 2: The Forgotten Kingdom DLC Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-29T17:30:04+00:00", "description": "Back in the day, the Homeworld games were some of the best, most ambitious, most unique real time strategy games out there, though the franchise has been lying in the shadows for far too long. \n\nNow, however, after years of anticipation, the series’ 21 year hiatus is about to come to an end with the imminent launch of Homeworld 3. Promising a new, cinematic campaign that will continue the series’ gripping story, significant improvements to its tactical RTS gameplay in more ways than one, major visual and technical improvements to make the experience feel that much more cinematic, and even a new roguelike mode, Homeworld 3 is looking like a promising return to the limelight for the franchise. Here, we talk about all of that and more.", "language": null, "link": "https://www.youtube.com/watch?v=c1m5YR_EKaI", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/c1m5YR_EKaI/hqdefault.jpg", "title": "Homeworld 3 - 15 Things You Need To Know Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-29T13:30:28+00:00", "description": "For everything players know about Fallout 4, from the earth-shattering prologue to the various factions and choices to make, some things are suitably well-hidden. Sure, there's the Saw-impostor and his trap-filled garage or unexpected choices during quests, but there's even more to discover in the Commonwealth.\n\nThis is on top of certain gameplay-related aspects that you wouldn't expect to be impossible without giving them a try. Nevertheless, if you've ever wanted to clear the Settlements of all individuals, wondered what's the deal with the giant ship on a building in Charlestown, bought a house in Diamond City or even witnessed the various secrets and terrors that await in the Glowing Sea, you've come to the right place.\n\nHere are ten crazy things you didn't know you could do in Fallout 4 and what you should expect.", "language": null, "link": "https://www.youtube.com/watch?v=zPusZCh8zj0", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/zPusZCh8zj0/hqdefault.jpg", "title": "Fallout 4 - 10 CRAZY Things You Didn't Know You Could Do", "user": null, "vote": 0}]