[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 CRAZIEST Things We All Did In OPEN WORLD GAMES", "description": "Open-world games get a lot of flak for being formulaic, but the best ones provide extensive freedom to just about anything you want. Walk across the entire map on foot with no fast travel? Go for it. Create devastating vehicles and starships that can wipe out entire regions and fleets. The sky is sometimes the limit.\n\nOf course, for all the diving off skyscrapers (potentially creating nuclear explosions on landing) and mass destruction, there are some things which can be straight-up unhinged. Like spending hours in the character creator to perfect your avatar or stalking NPCs to see what they do next, which could lead to breaking into their houses.\n\nHere are 15 of the craziest things we've all done in open-world titles. They won't be first, and as the genre evolves, far from the last.", "link": "https://www.youtube.com/watch?v=mx0d5r0yP58", "date_published": "2024-01-04T15:30:12+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/mx0d5r0yP58/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 MOST DISAPPOINTING AAA GAMES That Failed To Deliver", "description": "The last couple of years have seen some wonderful experiences that will go down as some of the best games of all time, but it would be foolish to ignore the equal share of disappointments as well. \n\nWith this video, we will be looking at 15 biggest AAA games that showcased a lot of potential but clearly weren’t able to fulfill those promises.", "link": "https://www.youtube.com/watch?v=iCil-5xQtnE", "date_published": "2024-01-04T09:30:17+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/iCil-5xQtnE/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]