[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-06T15:30:12+00:00", "description": "Mech games have been few and far between over the years, but fortunately, MechWarrior 5: Clans signals a return to some good old-fashioned BattleMech combat. Not to be confused with MechWarrior 5: Mercenaries, launched in December 2019 for PC before coming to Xbox One, Xbox Series X/S, PS4, and PS5 in 2021, this is a separate experience that's more story-driven.\n\nMechWarrior 5: Clans launches on October 17th for Xbox Series X/S, PS5, and PC. After going hands-on with a recent preview build and stomping across lush training grounds and deserts alike to unleash explosive payloads and fiery lasers, the experience is shaping into something special for BattleMech fans. Here are 15 things you need to know before picking it up.", "id": 1275723, "language": null, "link": "https://www.youtube.com/watch?v=OALBjThClhA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/OALBjThClhA/hqdefault.jpg", "title": "MechWarrior 5: Clans - 15 Things You Need To Know Before You Buy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-06T13:30:31+00:00", "description": "The more we have seen of Dragon Age: The Veilguard, the more our excitement for it has grown. Against all odds, it looks like the upcoming action RPG is going to be worth the decade-long wait, with BioWare looking primed for a return to form. \n\nBased on everything that’s been shown so far, The Veilguard is clearly going to be an expansive game, with everything from its combat and choice and consequence mechanics to its companions and the progression mechanics promising an impressive level of depth. \n\nThat, of course, means there is no shortage of things in the game that we absolutely cannot wait to get our hands on, from some of its core systems to other, more obscure little features. Here, that’s exactly what we discuss.", "id": 1275724, "language": null, "link": "https://www.youtube.com/watch?v=g7q8pJieJU0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/g7q8pJieJU0/hqdefault.jpg", "title": "15 Things We Can't Wait To Do In Dragon Age: The Veilguard", "vote": 0}]