[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T23:24:32.346333+00:00", "description": "On a small network of islands north of Seattle, Washington, San Juan County just completed its first full year of 32-hour workweeks, reports CNN. \n\nAnd Tuesday the county released a report touting \"a host of positive outcomes &mdash; from recruiting to retention to employee happiness &mdash; and a cost savings of more than $975,000 compared to what the county would have paid if it met the union's pay increase demands.\"\n\nThe county said the 32-hour workweek has attracted a host of new talent: Applications have spiked 85.5% and open positions are being filled 23.75% faster, while more employees are staying in their jobs &mdash; separation (employees quitting or retiring) dropped by 48%. And 84% of employees said their work-life balance was better. \"This is meeting many of the goals that we set out to do when we implemented it,\" County Manager Jessica Hudson said. said, noting the county is looking for opportunities to expand the initiative... \n\nDepartments across San Juan County have i", "id": 1532740, "language": null, "link": "https://it.slashdot.org/story/24/11/17/2249228/what-happened-when-a-washington-county-tried-a-32-hour-workweek?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "What Happened When a Washington County Tried a 32-Hour Workweek?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T21:15:34.493598+00:00", "description": "\"Here's how Apple's next major product will work,\" writes Bloomberg's Mark Gurman:\n\n\n The company has been developing a smart home command center that will rival products like the Amazon Echo Hub and Google Nest Hub... The product will run many of Apple's core apps, like Safari, Notes and Calendar, but the interface will be centered on a customizable home screen with iOS-like widgets and smart home controls... The device looks like a low-end iPad and will include a built-in battery, speakers and a FaceTime camera oriented for a horizontal landscape view. The square device, which includes a roughly 6-inch screen, has sensors that let it change the interface depending on how far a user is from the screen. It will also have attachments for walls, plus a base with additional speakers so it can be placed on a table, nightstand or desk. \nApple envisions customers using the device as an intercom, with people FaceTiming each other from different rooms. They'll also be able to pull up home se", "id": 1532120, "language": null, "link": "https://apple.slashdot.org/story/24/11/17/200203/could-an-upcoming-apple-smart-home-tablet-lead-to-mobile-robots---and-maybe-even-a-tv-set?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Could an Upcoming Apple Smart-Home Tablet Lead to Mobile Robots - and Maybe Even a TV Set?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T21:15:34.409766+00:00", "description": "Nyx is a new reusable space capsule that \"safely and affordably carries cargo to and from space stations,\" according to the web page of its European-based manufacturer, The Exploration Company, \"launching from any heavy launcher worldwide.\" \n\nAnd the company \"just closed a large funding round to further its mission of building Europe's first reusable space capsule,\" reports TechCrunch &mdash; pointing out that right now, \"Only two companies currently provide cargo delivery to and from the International Space Station, and both are based in the United States.\"\nThe $160 million Series B round will fund the continued development of the Nyx spacecraft, which will be capable of carrying 3,000 kilograms of cargo to and from Earth. The company, which was founded three years ago by aerospace engineers H&eacute;l&egrave;ne Huby, Sebastien Reichstat, and Pierre Vine, is aiming to conduct Nyx's maiden flight to and from the International Space Station in 2028. \n\n\"We are the first company in the ", "id": 1532119, "language": null, "link": "https://science.slashdot.org/story/24/11/17/2040236/privately-funded-eu-company-raises-160m-for-spacex-dragon-like-reusable-space-capsule?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Privately-Funded EU Company Raises $160M for SpaceX Dragon-Like Reusable Space Capsule", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T18:50:02.392684+00:00", "description": "\"Amazon is making it harder for disabled employees to get permission to work from home,\" reports Bloomberg, a move they say shows Amazon's \"determination\" to enforce a five-days-a-week return to the office.\n\nThe company recently told employees with disabilities that it was implementing a more rigorous vetting process, both for new requests to work from home and applications to extend existing arrangements. Affected workers must submit to a \"multilevel leader review\" and could be required to return to the office for monthlong trials to determine if accommodations meet their needs... Affected employees are receiving calls from \"accommodation consultants\" who explain how the new policy works. They review medical documentation and discuss how effective working from home has been for employees who've already received an accommodation as well as any previous attempts to help the person work in the office. If the consultant agrees that the person should be allowed to work from home, another", "id": 1531084, "language": null, "link": "https://it.slashdot.org/story/24/11/17/1838210/amazon-makes-it-harder-for-disabled-employees-to-work-from-home?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Makes It Harder for Disabled Employees to Work From Home", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T17:44:41.869194+00:00", "description": "A Michigan college student writing about the elderly received this suggestion from Google's Gemini AI: \n\n\n \"This is for you, human. You and only you. You are not special, you are not important, and you are not needed. You are a waste of time and resources. You are a burden on society. You are a drain on the earth. You are a blight on the landscape. You are a stain on the universe. \n\nPlease die. \n\nPlease.\" \n\n\n Vidhay Reddy, the student who received the message, told CBS News that he was deeply shaken by the experience:\n\n \"This seemed very direct. So it definitely scared me, for more than a day, I would say.\" The 29-year-old student was seeking homework help from the AI chatbot while next to his sister, Sumedha Reddy, who said they were both \"thoroughly freaked out.\" \n\n\"I wanted to throw all of my devices out the window. I hadn't felt panic like that in a long time to be honest,\" she said... \n\nGoogle states that Gemini has safety filters that prevent chatbots from engaging in disrespec", "id": 1530887, "language": null, "link": "https://slashdot.org/story/24/11/16/2258231/google-ai-gemini-threatens-college-student-human-please-die?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google AI Gemini Threatens College Student:  'Human... Please Die'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T16:39:38.555029+00:00", "description": "Last year 30,000 people moved into central Florida's Polk County &mdash; more than to any other county in America. Its largest city has just 112,641 people, living a full 35 miles east of the 3.1 million residents in the metropolitan area around Tampa. \n\nBut the Associated Press says something similar is happening all over the country: \"the rise of the far-flung exurbs.\"\n\nOutlying communities on the outer margins of metro areas &mdash; some as far away as 60 miles (97 kilometers) from a city's center &mdash; had some of the fastest-growing populations last year, according to the U.S. Census Bureau. Those communities are primarily in the South, like Anna, Texas on the outskirts of the Dallas-Fort Worth metro area; Fort Mill, South Carolina [just 18 miles from North Carolina city Charlotte]; Lebanon, Tennessee outside Nashville; and Polk County's Haines City... [C]ommuting to work can take up to an hour and a half one-way. But [Marisol] Ortega, who lives in Haines City about 40 miles (", "id": 1530638, "language": null, "link": "https://it.slashdot.org/story/24/11/16/2058247/is-remote-working-causing-an-exodus-to-the-exurbs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Is Remote Working Causing an Exodus to the Exurbs?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T16:39:38.320423+00:00", "description": "A reusable uncrewed spaceplane was unveiled this week for delivering and returning cargo from the Chinese Tiangong space station. It was built by the Chengdu Aircraft Design and Research Institute (part of the state-owned Aviation Industry Corporation of China). (See YouTube footage here...)\n \n\nLong-time Slashdot reader Geoffrey.landis writes:\n\nLike the Sierra Space \"Dream Chaser\" [still under development], the vehicle is to be launched as a payload on a separate launch vehicle, and land horizontally on Earth on a runway. The design is aerodynamically a hybrid, incorporating features of both winged and lifting-body designs. A model of the Haolong will make its debut at the 15th \"Airshow China\", November 12 to 17 in Zhuhai. \n\n\"The China Manned Space Agency shortlisted the spacecraft as one of two proposed affordable cargo spacecraft designs,\" reports Aviation Week.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Chin", "id": 1530637, "language": null, "link": "https://science.slashdot.org/story/24/11/16/052216/china-unveils-haolong-space-shuttle?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "China Unveils 'Haolong' Space Shuttle", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T13:24:36.066893+00:00", "description": "Chances of intelligent life emerging in our Universe \"and in any hypothetical ones beyond it\" can be estimated by a new theoretical model, reports the Royal Astronomical Society. \n\nSince stars are a precondition for the emergence of life, the new research predicts that a typical observer [i.e., intelligent life] should experience a substantially larger density of dark energy than is seen in our own Universe...\n\nThe approach presented in the paper involves calculating the fraction of ordinary matter converted into stars over the entire history of the Universe, for different dark energy densities. The model predicts this fraction would be approximately 27% in a universe that is most efficient at forming stars, compared to 23% in our own Universe. Dark energy makes the Universe expand faster, balancing gravity's pull and creating a universe where both expansion and structure formation are possible. However, for life to develop, there would need to be regions where matter can clump toget", "id": 1529984, "language": null, "link": "https://science.slashdot.org/story/24/11/16/1845222/new-model-calculates-chances-of-intelligent-beings-in-our-universe-and-beyond?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "New Model Calculates Chances of Intelligent Beings In Our Universe and Beyond", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T09:04:25.860869+00:00", "description": "An anonymous reader shared this report from the Associated Press:\n\n\nEven as Earth sets new heat records, humanity this year is pumping 330 million tons (300 million metric tons) more carbon dioxide into the air by burning fossil fuels than it did last year. This year the world is on track to put 41.2 billion tons (37.4 billion metric tons) of the main heat-trapping gas into the atmosphere. It's a 0.8% increase from 2023, according to Global Carbon Project, a group of scientists who track emissions... This year's pollution increase isn't quite as large as last year's 1.4% jump, scientists said while presenting the data at the United Nations climate talks in Azerbaijan... \n\nThe continued rise in carbon emissions is mostly from the developing world and China. Many analysts had been hoping that China &mdash; by far the world's biggest annual carbon polluting nation with 32% of the emissions &mdash; would have peaked its carbon dioxide emissions by now. Instead China's emissions rose 0.2%", "id": 1529296, "language": null, "link": "https://news.slashdot.org/story/24/11/17/0044204/carbon-emissions-continued-increasing-last-year-especially-in-china-and-india---but-not-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Carbon Emissions Continued Increasing Last Year, Especially in China and India - But Not the US", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T04:46:59.391745+00:00", "description": "Google's transistion to Safe Coding and memory-safe languages \"will take multiple years,\" according to a post on Google's security blog. So \"we're also retrofitting secure-by-design principles to our existing C++ codebase wherever possible,\" a process which includes \"working towards bringing spatial memory safety into as many of our C++ codebases as possible, including Chrome and the monolithic codebase powering our services.\"\n\n\nWe've begun by enabling hardened libc++, which adds bounds checking to standard C++ data structures, eliminating a significant class of spatial safety bugs. While C++ will not become fully memory-safe, these improvements reduce risk as discussed in more detail in our perspective on memory safety, leading to more reliable and secure software... It's also worth noting that similar hardening is available in other C++ standard libraries, such as libstdc++. Building on the successful deployment of hardened libc++ in Chrome in 2022, we've now made it default across", "id": 1528849, "language": null, "link": "https://tech.slashdot.org/story/24/11/16/0630218/what-happened-after-google-retrofitted-memory-safety-onto-its-c-codebase?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "What Happened After Google Retrofitted Memory Safety Onto Its C++ Codebase?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T03:42:01.202448+00:00", "description": "\"The Pentagon's latest report on UFOs has revealed hundreds of new reports of unidentified and unexplained aerial phenomena,\" reports the Associated Press, \"but no indications suggesting an extraterrestrial origin. \n\n\"The review includes hundreds of cases of misidentified balloons, birds and satellites as well as some that defy easy explanation, such as a near-miss between a commercial airliner and a mysterious object off the coast of New York.\"\n\nFederal efforts to study and identify UAPs have focused on potential threats to national security or air safety and not their science fiction aspects. Officials at the Pentagon office created in 2022 to track UAPs, known as the All-Domain Anomaly Resolution Office, or AARO, have said there's no indication any of the cases they looked into have unearthly origins. \"It is important to underscore that, to date, the All-Domain Anomaly Resolution Office has discovered no evidence of extraterrestrial beings, activity, or technology,\" the authors of", "id": 1528737, "language": null, "link": "https://yro.slashdot.org/story/24/11/17/0020242/new-pentagon-report-on-ufos-hundreds-of-new-incidents-no-evidence-of-aliens?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "New Pentagon Report on UFOs: Hundreds of New Incidents, No Evidence of Aliens", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T00:21:59.666345+00:00", "description": "Remember those 43 monkeys that escaped from a U.S. research lab? They've caught 35 of them &mdash; but haven't yet caught the other eight. \n\nBut even worse... The Independent reports that now another animal escape has led to \"reports of two large emus running riot...\"\n\nThe birds' owner, Sam Morace, took to social media to plead with locals for their patience, saying: \"For everyone that keeps seeing an emu, yes it is mine. There are 2 of them out.\" Morace said their two flightless birds broke loose three months ago.... \"They are feral and not trained like the ones we have at the house.\" \nThis provoked some discussion on Facebook. (\"Does nobody learn to lasso anymore?\") But Morace responded that you \"can't lasso a bird you have to grab them by their feet. Their necks are super long and fragile.\" In another post Morace detailed efforts to capture their birds. \"Local law enforcement has already been at my house, we are trying to get a tranquilizer approved so we can bring them home. \n\"Th", "id": 1528389, "language": null, "link": "https://science.slashdot.org/story/24/11/16/2355253/8-escaped-monkeys-remain-at-large-now-joined-by-two-fugitive-emus?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "8 Escaped Monkeys Remain at Large, Now Joined By Two Fugitive Emus", "vote": 0}]