[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T17:45:00+00:00", "description": "With Farming Simulator 23 faltering (and skipping most consoles), Farming Simulator 25 seemed like a strong homecoming for fans. The sheer number of machines, improved visuals and attention to detail, more crops, new farmsteads - what more could you want?\n\nAnd make no mistake - this is the gameplay loop that fans love, from cultivating, ploughing, seeding, and harvesting to slowly discovering different types of crops, taking on contracts, and expanding your business. Unfortunately, this year's iteration is beset by questionable choices with the user interface, contract balancing, and lackluster polish.\n\nEven the gorgeous visuals, which should be the experience of the highlight, suffer issues like flickering, pop-in, stuttering, and odd texture rendering. If Giants Software can polish it up enough, Farming Simulator 25 should be another solid iteration in the franchise. However, as of right now, it's a significant step down from the series' best.", "id": 1531112, "language": null, "link": "https://www.youtube.com/watch?v=6WfBmkc3vuI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/6WfBmkc3vuI/hqdefault.jpg", "title": "Farming Simulator 25 Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T15:45:01+00:00", "description": "Hero shooters and live service games in general are a mighty risky business, as we’ve seen with some pretty high profile failures over the years (and even rather recently), but when you do it right, you can turn into a massive, industry-shaking game. \n\nWill Marvel Rivals be able to achieve that kind of success? It’s always hard to make concrete predictions in this particular arena, but with a strong license attached and the game itself looking increasingly promising in all that we have seen of it so far, it’s fair to say that there’s every reason for players to be optimistic. \n\nAhead of the game’s imminent release, here, we’re going to go over a few key details that you should know about Marvel Rivals.", "id": 1530664, "language": null, "link": "https://www.youtube.com/watch?v=LwZj7KFC3zo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/LwZj7KFC3zo/hqdefault.jpg", "title": "Marvel Rivals - 10 NEW DETAILS You Need To Know Before You Play", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-17T06:30:08+00:00", "description": "STALKER 2: Heart of Chornobyl is shaping up to be a massive game, not just in terms of the stature of the release, but also the size and scale of the game itself. There’s going to be a lot going on in the first- person shooter’s version of an open world Chornobyl Exclusion Zone, and in the months and years leading up to the game’s release, developer GSC Game World has revealed abundant details on what players can expect. \n\nTo that end, here, we’re going to go over a few more key details that you should know about S.T.A.L.K.E.R. 2: Heart of Chornobyl.", "id": 1529066, "language": null, "link": "https://www.youtube.com/watch?v=NRtadIhJ3dI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NRtadIhJ3dI/hqdefault.jpg", "title": "STALKER 2: Heart of Chornobyl - 12 Things You Need To Know BEFORE YOU PURCHASE", "vote": 0}]