[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Why Do Some GAMERS HATE Starfield?", "description": "Expectations were high from Starfield, and given Bethesda Game Studios’ track record, with the likes of Morrowind, Skyrim, and others under its belt, it was easy to understand why. But rather than turning out to be the universally acclaimed revelation that many had hoped it would be, BGS’ sci-fi RPG has instead divided opinion in a way that has taken many by surprise. \n\nThere’s certainly a not-insignificant contingent of people who have fallen in love with Starfield’s expansive offerings, but the game’s issues – which it undoubtedly has its fair share of – have been on the receiving end of some pretty vociferous criticism as well. So, what exactly is it that make Starfield as divisive as it clearly is? Here, that’s exactly what we’ll be talking about.", "link": "https://www.youtube.com/watch?v=gOn_vrgdN0M", "date_published": "2024-01-18T15:30:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": "en", "thumbnail": "https://i4.ytimg.com/vi/gOn_vrgdN0M/hqdefault.jpg", "age": null, "page_rating_contents": 94, "page_rating_votes": 0, "page_rating_visits": 2, "page_rating": 94, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Palworld - 15 Things You NEED TO KNOW BEFORE YOU BUY", "description": "Few would have expected a Pokemon-like title with cute creatures running around with submachine guns and assault rifles, but Pocketpair's Palworld offers that and much more. On the surface, it's all about exploring a massive 3D world and collecting Pals to add to your collection.\n\nHowever, as a survivor who suddenly appears in this mysterious archipelago, your job is to survive and reach the Towers adorning the land. There's a lot of resource gathering and crafting involved, along with leveling up your Pals and improving their abilities. However, you can ignore the main objective and explore the world, taking on Dungeons, trading with merchants and much more.\n\nPalworld launches into early access on January 19th. Here are 15 things you should know before jumping in.", "link": "https://www.youtube.com/watch?v=mHCAacAiXkk", "date_published": "2024-01-18T11:30:21+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i2.ytimg.com/vi/mHCAacAiXkk/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]