[
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T22:46:13+00:00",
        "description": "A heart-pounding film that follows seasoned deep-sea divers as they battle the raging elements to rescue their crewmate trapped hundreds of feet below the ocean’s surface. Based on a true story, Last Breath is an electrifying story about teamwork, resilience, and a race against time to do the impossible.",
        "id": 1637802,
        "language": null,
        "link": "https://www.youtube.com/watch?v=nE6WebpaTms",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nE6WebpaTms/hqdefault.jpg",
        "title": "Last Breath - Official Trailer (2025) Woody Harrelson, Simu Liu, Cliff Curtis",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T22:17:10+00:00",
        "description": "Halo Infinite's Operation: Snowbound is available now until January 7, 2025, bringing the 1v1 Showdown, snow-themed maps, the Snowball Fight mode (coming soon), a free 20-tier pass, and more. Watch the Halo Infinite trailer to see what to expect with the Operation: Snowbound festive event.",
        "id": 1637803,
        "language": null,
        "link": "https://www.youtube.com/watch?v=TF94PtCVsH0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TF94PtCVsH0/hqdefault.jpg",
        "title": "Halo Infinite - Official Snowbound Launch Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T20:48:01+00:00",
        "description": "Check out this clip from The Outer Worlds 2 episode of Secret Level, an upcoming adult-animated anthology series from Amazon MGM Studios and Blur Studio. Secret Level features original stories set within the worlds of some of the most beloved video games. Secret Level will be available exclusively on Prime Video starting December 10, 2024.\n\nSecret Level showcases a star-studded cast including Arnold Schwarzenegger (The Terminator Franchise), Kevin Hart (Jumanji), Keanu Reeves (John Wick), Temuera Morrison (The Book of Boba Fett, Chief of War), Ariana Greenblatt (Barbie), Heaven Hart, Emily Swallow (The Mandalorian), Gabriel Luna (The Last of Us, Terminator: Dark Fate), Ricky Whittle (American Gods, Land of Bad), Patrick Schwarzenegger (The White Lotus), Merle Dandridge (The Last of Us), Claudia Doumit (The Boys), Adewale Akinnuoye-Agbaje (Lost, The Union), Clive Standen (Vikings, The Morning Show), Laura Bailey (The Legend of Vox Machina), and Michael Beach (The Perfect Couple, Tulsa",
        "id": 1637314,
        "language": null,
        "link": "https://www.youtube.com/watch?v=2cMwkb7ML4w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2cMwkb7ML4w/hqdefault.jpg",
        "title": "Secret Level - Official The Outer Worlds 2 Clip (2024)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T20:47:09+00:00",
        "description": "It’s not the best choice, it’s your choice. Check out the latest Secret Level trailer for The Outer Worlds 2 episode of the upcoming adult-animated anthology series from Amazon MGM Studios and Blur Studio. Secret Level features original stories set within the worlds of some of the most beloved video games. Secret Level will be available exclusively on Prime Video starting December 10, 2024.\n\nSecret Level showcases a star-studded cast including Arnold Schwarzenegger (The Terminator Franchise), Kevin Hart (Jumanji), Keanu Reeves (John Wick), Temuera Morrison (The Book of Boba Fett, Chief of War), Ariana Greenblatt (Barbie), Heaven Hart, Emily Swallow (The Mandalorian), Gabriel Luna (The Last of Us, Terminator: Dark Fate), Ricky Whittle (American Gods, Land of Bad), Patrick Schwarzenegger (The White Lotus), Merle Dandridge (The Last of Us), Claudia Doumit (The Boys), Adewale Akinnuoye-Agbaje (Lost, The Union), Clive Standen (Vikings, The Morning Show), Laura Bailey (The Legend of Vox Ma",
        "id": 1637315,
        "language": null,
        "link": "https://www.youtube.com/watch?v=KHTaVScTViI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KHTaVScTViI/hqdefault.jpg",
        "title": "Secret Level - Official The Outer Worlds 2 Trailer (2024)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T20:12:22+00:00",
        "description": "Here's your look at gameplay from The Hidden Ones in this trailer for the upcoming 3D action-fighting game with a cinematic animation style. The Hidden Ones gameplay trailer gives us a peek at features like the story campaign, characters, and combat. The Hidden Ones will be available in 2025 on PC and mobile. A pre-alpha test for The Hidden Ones will be available on January 7, 2025. Players in the United States and Brazil can also now sign up for a chance to participate in the pre-alpha test on the game's official website.\n\nThe Hidden Ones, based on the popular manga and anime ‘Hitori No Shita: The Outcast,' is set in a mythical world rooted in ancient Chinese urban legends, myths and philosophies such as Taoism and Yin Yang. The Hidden Ones features three game modes, including Story, Duel, and Trial, along with more features.\n\n#IGN #Gaming",
        "id": 1636888,
        "language": null,
        "link": "https://www.youtube.com/watch?v=02AWs6ADE9Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/02AWs6ADE9Y/hqdefault.jpg",
        "title": "The Hidden Ones - Official Gameplay Trailer (Hitori No Shita: The Outcast)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T19:09:55+00:00",
        "description": "Over the course of decades, Alienware has established itself as a trusted brand for gaming. This year, they launched a new model called the Alienware m18 R2 that continues that trend. So if you’re doing your holiday shopping and need some help finding the right laptop (whether it’s for you or a loved one), we can help you out by breaking down the most impressive features from Alienware’s latest offering. Here are the top 5 features of the new Alienware m18 R2 gaming laptop!\nOrder yours today by heading on over to: https://www.alienware.com/deals\n\nAdvertised by Alienware",
        "id": 1636534,
        "language": null,
        "link": "https://www.youtube.com/watch?v=-dB-YNS-0vg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/-dB-YNS-0vg/hqdefault.jpg",
        "title": "Top 5 Features of the Alienware m18 R2 Gaming Laptop",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T19:03:29+00:00",
        "description": "Selling Superman traces Darren Watts’ emotional journey after discovering his father’s lifelong secret—an obsession that left behind a legacy of over 300,000 comic books, including one of the rarest treasures in the comic world: a Superman #1 comic graded 7.0, valued at over $3.5 million. This compulsive collection by Darren’s father, who lived with Asperger’s (ASD), filled every corner of their home, straining family bonds and leaving profound emotional marks. After his father’s passing, Darren is now faced with the bittersweet challenge of managing this incredible collection while confronting the pain and memories it holds.",
        "id": 1636535,
        "language": null,
        "link": "https://www.youtube.com/watch?v=6UIVnwJiV8g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6UIVnwJiV8g/hqdefault.jpg",
        "title": "Selling Superman - Official Trailer (2024)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T18:00:26+00:00",
        "description": "Natasha Romanoff is fully prepared - even if the world is on the brink of disaster. Meet Black Widow in the latest Marvel Rivals trailer and see the character in action from this upcoming superhero team-based PVP shooter game. Marvel Rivals will be available on PC (Steam and Epic Games Store), PS5, and Xbox Series X/S on December 6, 2024.\n\nTrained in the infamous Red Room to anticipate anything, the Black Widow is always ready for action! For years, she put her unrivaled combat skills to use as a member of the Avengers, keeping pace with some of the most powerful beings who ever lived.\n\nImbued with a life-extending formula and having outlasted most of her enemies and allies, she continues her battle decades into the future. Her goal? Lead the Red Room in its relentless campaign to overthrow the oppressive reign of Doom 2099.\n\n#IGN #Gaming #MarvelRivals",
        "id": 1636061,
        "language": null,
        "link": "https://www.youtube.com/watch?v=OeNiEIiJt94",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/OeNiEIiJt94/hqdefault.jpg",
        "title": "Marvel Rivals - Official Black Widow Reveal Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T17:30:02+00:00",
        "description": "Watch the latest Call of Duty: Black Ops 6 Zombies trailer to see gameplay from the upcoming Citadelle des Morts content update. The Citadelle des Morts free content update will be available in Call of Duty: Black Ops 6 Zombies on December 5, 2024.\n\nCitadelle des Morts awaits. This abandoned medieval village and castle hides incredible power—and incredible danger. Survive the horde and overcome new horrors looking to claim their newest victims.\n\n#CallOfDuty #BlackOps6 #Gaming",
        "id": 1636062,
        "language": null,
        "link": "https://www.youtube.com/watch?v=7PbDB-mgbGY",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/7PbDB-mgbGY/hqdefault.jpg",
        "title": "Call of Duty: Black Ops 6 Zombies - Official Citadelle des Morts Gameplay Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T16:30:04+00:00",
        "description": "With new Indiana Jones game, Indiana Jones and the Great Circle, launching this week, now is the perfect time to dive into the history of Indiana Jones games throughout the years. You may know plenty about indie games, but what about Indy games? The good Dr. Jones’ video game history dates back over 40 years, and we're not just talking about the best Indiana Jones games! So, kick back as we dust off some antique hardware and whip through the history of Indiana Jones games, from Raiders of the Lost Ark (Atari 2600) to Indiana Jones and the Fate of Atlantis, an appearance in Fortnite, LEGO Indiana Jones, the new Indiana Jones game 2024, and more!\n\n#IndianaJones #Gaming #Games",
        "id": 1635579,
        "language": null,
        "link": "https://www.youtube.com/watch?v=JyHLYLHuCSA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/JyHLYLHuCSA/hqdefault.jpg",
        "title": "The History of Indiana Jones Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T16:21:13+00:00",
        "description": "Check out the latest GTA Online trailer to meet the characters and take a peek at what you can expect from the upcoming Agents of Sabotage update. GTA Online: Agents of Sabotage will be available on PS5 (PlayStation 5), PS4 (PlayStation 4), Xbox Series X/S, Xbox One, and PC on December 10, 2024.\n\nFormer FIB operative turned rogue agent Jodi Marshall has a serious grudge against her former handlers. She’s maintained backdoor access to the Bureau’s files and is not above exploiting this privileged information for personal gain. \n\nTake ownership of the Darnell Bros Garment Factory — where plans for some of Los Santos’ most legendary crimes have been hatched — and use it as a covert ops installation in GTA Online: Agents of Sabotage.\n\nPartner with Jodi, in addition to a familiar face, your first mate Pavel from The Cayo Perico Heist. Together, you’ll utilize the latest clandestine tech to zero in on some of the city’s preeminent scores.\n\n#GTA #GTAOnline #Gaming",
        "id": 1635054,
        "language": null,
        "link": "https://www.youtube.com/watch?v=H3QbQ0Uy9b8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/H3QbQ0Uy9b8/hqdefault.jpg",
        "title": "GTA Online: Agents of Sabotage - Official Release Date Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T16:10:05+00:00",
        "description": "Watch the Fortnite OG: Chapter 1 - Season 1 cinematic teaser trailer and get ready to experience nostalgia. Prepare to go all the way back to day one of Season 1 for the classic Fortnite experience. In Fortnite OG, relive the origins of Fortnite Battle Royale, complete with OG loot, OG locations, and OG gameplay in Fortnite OG Chapter 1 - Season 1.\n\nFortnite OG returns December 6, 2024.\n\n#Fortnite #Gaming #Games",
        "id": 1635055,
        "language": null,
        "link": "https://www.youtube.com/watch?v=lGM9VZq_60c",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lGM9VZq_60c/hqdefault.jpg",
        "title": "Fortnite OG: Chapter 1 Season 1 - Official Cinematic Teaser Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T16:00:49+00:00",
        "description": "Watch the opening eight minutes of New Line Cinema’s original anime feature The Lord of the Rings: The War of the Rohirrim, which returns audiences to the epic world brought to life in The Lord of the Rings Trilogy, based on the revered books by J.R.R. Tolkien. The footage was first screened at New York Comic Con 2024.\n\nUnder the direction of award-winning filmmaker Kenji Kamiyama (the Blade Runner: Black Lotus and Ghost in the Shell: Stand Alone Complex TV series), the talented voice cast is led by Brian Cox (Succession) as Helm Hammerhand, the mighty King of Rohan; Gaia Wise (A Walk in the Woods) as his daughter Héra; and Luke Pasqualino (Snowpiercer) as Wulf.  Miranda Otto, who delivered an unforgettable, award-winning performance in The Lord of the Rings Trilogy, reprises her role as Éowyn, Shieldmaiden of Rohan, who serves as the tale’s narrator.  The voice ensemble also includes Lorraine Ashbourne (Netflix’s Bridgerton), Yazdan Qafouri (I Came By), Benjamin Wainwright (World on",
        "id": 1635056,
        "language": null,
        "link": "https://www.youtube.com/watch?v=uQL8ruJvTLE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/uQL8ruJvTLE/hqdefault.jpg",
        "title": "The Lord of the Rings: The War of the Rohirrim - Exclusive Official First 8 Minutes (2024) Brian Cox",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T15:28:28+00:00",
        "description": "Watch our exclusive IGN Kingdom Come: Deliverance 2 preview, featuring new KCD2 gameplay, on December 4 at 9am PT/ 12pm ET/ 5pm GMT / December 5 at 4am AEDT.\n\nKeep it locked to IGN for the rest of December as we'll have plenty more from Kingdom Come: Deliverance II, including interviews with developers at Warhorse Studios, Kingdom Come Deliverance 2 gameplay features, and more.\n\nThe Kingdom Come: Deliverance 2 release date is February 11, 2025, for Xbox Series X/S, PS5 (PlayStation 5) and PC.\n\n#KingdomComeDeliverance2 #Gaming #Games",
        "id": 1635580,
        "language": null,
        "link": "https://www.youtube.com/watch?v=GPVc-uxToXw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GPVc-uxToXw/hqdefault.jpg",
        "title": "Kingdom Come: Deliverance 2 - Exclusive Hands-On Preview",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T15:09:12+00:00",
        "description": "Check out the new Disney’s Snow White trailer for the upcoming live-action musical reimagining of the studio’s classic 1937 film. Disney's Snow White stars Rachel Zegler (“West Side Story”) as Snow White and Gal Gadot (“Wonder Woman”) as her Stepmother, the Evil Queen. Magic mirror on the wall, show us the story that started it all.\n\nFrom the producer and executive producer of “Wicked,” Marc Platt and Jared LeBoff, and director Marc Webb (“The Amazing Spider-Man”) comes Disney’s Snow White. Journey to the whimsical world in this first trailer for Disney's Snow White, and meet Bashful, Doc, Dopey, Grumpy, Happy, Sleepy, and Sneezy. The trailer also features the power ballad 'Waiting on a Wish,' one of the all-new original songs from EGOT winners Benj Pasek and Justin Paul (“The Greatest Showman”).\n\nDisney’s Snow White debuts exclusively in theaters on March 21, 2025.\n\n#SnowWhite #Disney #Movies",
        "id": 1634488,
        "language": null,
        "link": "https://www.youtube.com/watch?v=VMWLeqR-7Fs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VMWLeqR-7Fs/hqdefault.jpg",
        "title": "Disney’s Snow White - Official Trailer (2025) Rachel Zegler, Gal Gadot",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T15:00:30+00:00",
        "description": "Get a look at the intricate physics system at the heart of Maximum Football, the upcoming (American) simulation football game coming to Early Access for PC (Steam) with a release on PlayStation 4 (PS4), PlayStation 5 (PS5), Xbox One, Xbox Series X|S, and PC (Steam) in early 2025.\n\n#IGN #Gaming",
        "id": 1634489,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ItCOTqVvp9g",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ItCOTqVvp9g/hqdefault.jpg",
        "title": "Maximum Football - Official Physics Showcase Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T15:00:17+00:00",
        "description": "We played a few hours of a preview build of Monster Hunter Wilds gameplay and experienced some new MH Wilds monster fights plus Monster Hunter Wilds customization options! See new moments against Monster Hunter Wilds Congalala, Lala Barina, Quematrice, and Scarlet Forest’s Apex, Uth Duna. Don't miss our Monster Hunter Wilds impressions after going hands-on with the upcoming action RPG.\n\nKeep an eye out for more detailed coverage soon! Monster Hunter Wilds is currently in development and content may differ in the final product, so keep that in mind when watching preview footage. The Monster Hunter Wilds release date is February 28, 2025 for PS5 (PlayStation 5), Xbox Series X/S, and PC (Steam)\n\n#MonsterHunterWilds #MonsterHunter #Gaming",
        "id": 1634490,
        "language": null,
        "link": "https://www.youtube.com/watch?v=IWLJs6ZRLQ0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/IWLJs6ZRLQ0/hqdefault.jpg",
        "title": "6 New Things We Experienced in Monster Hunter Wilds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T14:00:28+00:00",
        "description": "Watch the latest Warhammer 40,000: Darktide trailer to see what to expect with the Grim Protocols update, which brings a new game mode, a new mission, new weapon families, a time-limited special event to celebrate the second anniversary of Warhammer 40,000: Darktide, quality of life improvements and more to the co-op FPS game. Warhammer 40,000: Darktide is out now on PS5 (PlayStation 5). The Grim Protocols free update is available now on all platforms: PC (Steam and Microsoft Store), Xbox Series X|S, and PS5 (PlayStation 5).",
        "id": 1633968,
        "language": null,
        "link": "https://www.youtube.com/watch?v=KtHDbI6XgBo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KtHDbI6XgBo/hqdefault.jpg",
        "title": "Warhammer 40,000: Darktide - Official Grim Protocols Launch Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T14:00:26+00:00",
        "description": "Path of Exile 2 game director Jonathan Rogers sat down with us multiple times over the last year to discuss the industry, the sequel to Path of Exile, and how to find success. Here's what he had to say.\n\n#IGN #Gaming #PathOfExile2",
        "id": 1633969,
        "language": null,
        "link": "https://www.youtube.com/watch?v=HtTxuE5aP88",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/HtTxuE5aP88/hqdefault.jpg",
        "title": "Path of Exile 2 Director on What an ARPG Needs to Succeed",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T02:37:09+00:00",
        "description": null,
        "id": 1631077,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Qw-x8ienK88",
        "manual_status_code": 0,
        "page_rating": 26,
        "page_rating_contents": 82,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Qw-x8ienK88/hqdefault.jpg",
        "title": "New PS5 update is so cool!",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T02:26:36+00:00",
        "description": null,
        "id": 1631078,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Yw9c_iZKVmM",
        "manual_status_code": 0,
        "page_rating": 26,
        "page_rating_contents": 82,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Yw9c_iZKVmM/hqdefault.jpg",
        "title": "Kraven opening action scene",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T02:00:22+00:00",
        "description": "Star Wars: Skeleton Crew episodes 1 & 2 reviewed by Sam Barsanti on Disney+. Premieres December 2, 2024.\nThe way it stands now, after these first two episodes, there’s a lot of good momentum carrying Star Wars: Skeleton Crew forward after it’s set up its “Goonies in Space” cast of kids who escape the suburban doldrums and find themselves hurtling toward adventure and conflict with cartoonish space pirates. This show will actually have to pay off its foreshadowed mysteries in a satisfying way if it hopes to leave us with something half as memorable as its inspiration, but the fact that there seems to be a story justification for the ‘80s nostalgia bait aesthetics it slathers on is a good sign for things to come.",
        "id": 1630859,
        "language": null,
        "link": "https://www.youtube.com/watch?v=jjI25iz9XPo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/jjI25iz9XPo/hqdefault.jpg",
        "title": "Star Wars: Skeleton Crew Review",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T02:00:07+00:00",
        "description": null,
        "id": 1630860,
        "language": null,
        "link": "https://www.youtube.com/watch?v=9cB1C-b_3Mw",
        "manual_status_code": 0,
        "page_rating": 26,
        "page_rating_contents": 82,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/9cB1C-b_3Mw/hqdefault.jpg",
        "title": "Star Wars: Skeleton Crew has its first two episodes streaming now on @disneyplus !",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T00:02:47+00:00",
        "description": null,
        "id": 1630406,
        "language": null,
        "link": "https://www.youtube.com/watch?v=S8AdB1SQXXY",
        "manual_status_code": 0,
        "page_rating": 26,
        "page_rating_contents": 82,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/S8AdB1SQXXY/hqdefault.jpg",
        "title": "Sony says THANK YOU for 30 years (video contains spoilers!) #sony #playstation #ps5 #30thanniversary",
        "vote": 0
    }
]