[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T18:30:34+00:00",
        "description": "Dragon Age: The Veilguard has now launched after a decade of anticipation, and BioWare has now confirmed that rather than working on DLC for the fantasy action RPG, the studio is now shifting its full attention to Mass Effect 5, or whatever it is that the next Mass Effect game ends up being called.\n\nArguably the more popular of BioWare’s two main franchises, the sci-fi RPG series will be returning to the limelight after a long hiatus, which means its diehard fans will have many different and specific expectations that they’ll be hoping the series’ next instalment will meet. \n\nFrom its writing and choice mechanics and how it handles its alien races, what kind of structure it adopts, and more, here, we talk about what we want to see from the next Mass Effect.",
        "id": 1636204,
        "language": null,
        "link": "https://www.youtube.com/watch?v=YuA2Ak5W6Uo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/YuA2Ak5W6Uo/hqdefault.jpg",
        "title": "MASS EFFECT 5 - 15 Things It Needs To Do To Surpass Expectations",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T15:00:08+00:00",
        "description": "Delta Force series is back, except it's not handled by the same studio or even part of the same genre. Instead of a tactical shooter, it's now a free-to-play competitive shooter a la Battlefield, mixed with an extraction shooter mode akin to Escape from Tarkov.\n\nIt's not the most inspired title by a long shot, especially when you look at the Operators. However, it's also not bad. Warfare is your 32v32 mode with various maps, each offering different sectors, vehicles to pilot, and roles to cover. The action is fast-paced and intense, especially as territory control moves back and forth, though the maps are run-of-the-mill.\n\nOperations is the extraction shooter mode but offers a PvE Raid with support for up to three players. It's also mechanically decent, liberally borrowing from Tarkov but offering some fun gameplay. Overall, Delta Force may seem out of line with previous titles, but there is a free-to-play vision here for something unique, even if it's nothing you haven't seen before.",
        "id": 1634651,
        "language": null,
        "link": "https://www.youtube.com/watch?v=5FsjYsCARXs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5FsjYsCARXs/hqdefault.jpg",
        "title": "Delta Force Review - EVERYTHING You Need To Know Before You Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-03T13:00:15+00:00",
        "description": "At one point, it almost seemed the industry was moving away from single-player titles to focus more on live-service games and games-as-a-service. Of course, that didn't exactly happen, and more studios are embracing the former than ever, opting to deliver excellent solo experiences.\n\nIt's not quite like the old days, of course. Certain features like cheat codes aren't common in today's biggest titles. Others offer some pretty notable secrets, though they're the exception rather than the rule. Some titles act as nothing more than cliffhangers for the next entry, while others continue pushing for more bloat and busywork. And single-player or multiplayer, certain games still suffer from a distinct lack of polish.\n\nWe can't return to the glory days of gaming, but it doesn't hurt to hope. Check out 15 things we'd like to see return in triple-A single-player titles and why.",
        "id": 1633700,
        "language": null,
        "link": "https://www.youtube.com/watch?v=FDXuSLXD1BQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/FDXuSLXD1BQ/hqdefault.jpg",
        "title": "15 Things AAA Single Player Games Need To Bring Back",
        "vote": 0
    }
]