[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T18:30:32+00:00", "description": "This upcoming action RPG from developer ILCA, Inc. and publisher Bandai Namco promises to be one of the most unique open world games of the year. \n\nImmediately eye catching is the anime style character designs, but there’re heaps of gameplay mechanics to discover in this experience too. This feature aims to unpack all there is the know on the various gameplay systems in Sand Land, from its host of varied vehicles fit for traversal and combat, to the various skills trees with distinct unlockable abilities for our main character Beelzebub and their cast of companions. \n\nHand-to-hand combat has a wide variety of facets to understand too, as does the open world at large, said to be replete with secrets and challenges to discover alongside a basecamp city with a burgeoning personality of its own.", "language": null, "link": "https://www.youtube.com/watch?v=bPWLiiRVLb8", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/bPWLiiRVLb8/hqdefault.jpg", "title": "SAND LAND - 15 Things You Need To Know Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T15:30:13+00:00", "description": "From Morrowind to Oblivion to Skyrim and more, Bethesda Game Studios has delivered a number of standout, genre-defining open world RPGs over the years, but the one (or one of the ones) that the masses have collectively turned their attention to right now is 2008’s Fallout 3. \n\nWith Amazon’s Fallout TV series receiving widespread praise and reigniting general interest in the post-apocalyptic franchise, many are going back to Fallout 3 (and other titles in the series) either to experience it for the first time ever or to get another taste of its offerings.\n\nAnd with that has come a reexamination of the landmark game and its many, many qualities. Here, we’re taking a retrospective look at the spectacular Fallout 3 and what made it the genre-defining game that we all now know it as.", "language": null, "link": "https://www.youtube.com/watch?v=t3EE0Zn6y1s", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/t3EE0Zn6y1s/hqdefault.jpg", "title": "How Fallout 3 Took Gaming by Storm 16 Years Ago", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T13:30:16+00:00", "description": "It’s hard to believe that it’s been nearly a decade since Fallout 4 came out, and even harder to believe that it’s probably going to be about as long before Fallout releases. \n\nThankfully, series fans haven’t been left entirely in the dust, especially with the recent, widely acclaimed Amazon Prime TV show, while Bethesda is also set to release the game’s long-awaited Next-Gen Update as well. With its upcoming native PS5 and Xbox Series X/S launch, and with the Amazon show having reignited widespread interest in the franchise in general, it’s likely that Fallout 4 will soon be welcoming plenty of entirely new players who’ve never played the game before. \n\nIf you’re in that group, here, we’re going to go over a few core details that you should know about the game itself, as well as what its upcoming update will bring.", "language": null, "link": "https://www.youtube.com/watch?v=hn9mjXUreC4", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/hn9mjXUreC4/hqdefault.jpg", "title": "Fallout 4 - 15 Things You Need To Know BEFORE YOU BUY", "user": null, "vote": 0}]