[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T23:42:52.226232+00:00", "description": "A software glitch in the \"ticket in, cash out\" (TICO) machines at Star Casino in Sydney, Australia, saw it inadvertently give away $2.05 million over several weeks. This glitch allowed gamblers to reuse a receipt for slot machine winnings, leading to unwarranted cash payouts which went undetected due to systematic failures in oversight and audit processes. The Register reports: News of the giveaway emerged on Monday at an independent inquiry into the casino, which has had years of compliance troubles that led to a finding that its operators were unsuitable to hold a license. In testimony [PDF] given on Monday to the inquiry, casino manager Nicholas Weeks explained that it is possible to insert two receipts into TICO machines. That was a feature, not a bug, and allowed gamblers to redeem two receipts and be paid the aggregate amount. But a software glitch meant that the machines would return one of those tickets and allow it to be re-used -- the barcode it bore was not recognized as ha", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/18/2037259/software-glitch-saw-aussie-casino-give-away-millions-in-cash?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Software Glitch Saw Aussie Casino Give Away Millions In Cash", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T23:42:50.719096+00:00", "description": "An anonymous reader quotes a report from Ars Technica: The US Constitution's Fifth Amendment protection against self-incrimination does not prohibit police officers from forcing a suspect to unlock a phone with a thumbprint scan, a federal appeals court ruled yesterday. The ruling does not apply to all cases in which biometrics are used to unlock an electronic device but is a significant decision in an unsettled area of the law. The US Court of Appeals for the 9th Circuit had to grapple with the question of \"whether the compelled use of Payne's thumb to unlock his phone was testimonial,\" the ruling (PDF) in United States v. Jeremy Travis Payne said. \"To date, neither the Supreme Court nor any of our sister circuits have addressed whether the compelled use of a biometric to unlock an electronic device is testimonial.\"\n \nA three-judge panel at the 9th Circuit ruled unanimously against Payne, affirming a US District Court's denial of Payne's motion to suppress evidence. Payne was a Calif", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/18/2047225/cops-can-force-suspect-to-unlock-phone-with-thumbprint-us-court-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cops Can Force Suspect To Unlock Phone With Thumbprint, US Court Rules", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T22:39:02.517784+00:00", "description": "WhatsApp users in the U.S. will soon see support for real-time AI image generation. The Verge reports: As soon as you start typing a text-to-image prompt in a chat with Meta AI, you'll see how the image changes as you add more detail about what you want to create. In the example shared by Meta, a user types in the prompt, \"Imagine a soccer game on mars.\" The generated image quickly changes from a typical soccer player to showing an entire soccer field on a Martian landscape. If you have access to the beta, you can try out the feature for yourself by opening a chat with Meta AI and then start a prompt with the word \"Imagine.\"\n \nAdditionally, Meta says its Meta Llama 3 model can now produce \"sharper and higher quality\" images and is better at showing text. You can also ask Meta AI to animate any images you provide, allowing you to turn them into a GIF to share with friends. Along with availability on WhatsApp, real-time image generation is also available to US users through Meta AI for ", "language": "en-us", "link": "https://meta.slashdot.org/story/24/04/18/2026247/meta-is-adding-real-time-ai-image-generation-to-whatsapp?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Is Adding Real-Time AI Image Generation To WhatsApp", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T21:33:02.754401+00:00", "description": "The US Consumer Financial Protection Bureau (CFPB) has slapped coding boot camp BloomTech -- formerly known as Lambda School -- with several punishments for alleged deceptive business practices. From a report: The business, which claims on its site it will help students land their \"dream job\" in tech at companies like Amazon, Cisco, and Google, accepted the consent order without admitting or denying any wrongdoing. In an announcement yesterday, the CFPB said it had taken action against BloomTech and its CEO Austen Allred for allegedly not disclosing the true cost of its loans to students and allegedly claiming overoptimistic hiring rates for BloomTech graduates. BloomTech, formerly Lambda School, has operated since 2017 and offers six- to nine-month vocational programs in science and engineering, with a focus on computer technology. \n\n\"BloomTech and its CEO sought to drive students toward income share loans that were marketed as risk-free, but in fact carried significant finance charg", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/18/1946251/feds-hit-coding-boot-camp-with-big-fine-for-allegedly-conning-students?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Feds Hit Coding Boot Camp With Big Fine For Allegedly Conning Students", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T21:33:01.269027+00:00", "description": "An anonymous reader quotes a report from the New York Times: Consumers have grown accustomed to the prospect that their personal data, such as email addresses, social contacts, browsing history and genetic ancestry, are being collected and often resold by the apps and the digital services they use. With the advent of consumer neurotechnologies, the data being collected is becoming ever more intimate. One headband serves as a personal meditation coach by monitoring the user's brain activity. Another purports to help treat anxiety and symptoms of depression. Another reads and interprets brain signals while the user scrolls through dating apps, presumably to provide better matches. (\"'Listen to your heart' is not enough,\" the manufacturer says on its website.) The companies behind such technologies have access to the records of the users' brain activity -- the electrical signals underlying our thoughts, feelings and intentions.\n \nOn Wednesday, Governor Jared Polis of Colorado signed a bi", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/18/2017226/colorado-bill-aims-to-protect-consumer-brain-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Colorado Bill Aims To Protect Consumer Brain Data", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T20:28:40.143154+00:00", "description": "U.S. aircraft manufacturer Boeing plans to enter the flying car business in Asia by 2030, looking to tap demand for the fast travel the vehicles could provide in the region's traffic-choked cities. Nikkei: Boeing Chief Technology Officer Todd Citron revealed the plans in an interview with Nikkei. The company is developing electric vertical take-off and landing (eVTOL) craft at subsidiary Wisk Aero. The aircraft will adopt autonomous technology, rare among eVTOL craft. The plan is to first obtain certification in the U.S. before expanding into Asia. Details of the Asia business will be finalized in the future, including whether Boeing will sell the aircraft to companies aiming to provide eVTOL transportation services or operate the services itself. \n\nBoeing is currently considering which country in Asia to enter first, including Japan. In Japan, domestic startup SkyDrive and Germany's Volocopter are scheduled to operate air taxi services at the 2025 Osaka World Expo. Boeing opened a re", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/18/188205/boeing-aims-to-bring-flying-cars-to-asia-by-2030?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Boeing Aims To Bring Flying Cars To Asia By 2030", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T20:28:38.635847+00:00", "description": "A jury found Avraham \"Avi\" Eisenberg guilty on all three counts of fraud and manipulation in a $110 million crypto trade scheme using the Mango Markets platform. Axios: The case was the first known test for a jury to decide whether existing U.S. laws governing fraud and market manipulation apply to the world of decentralized finance (DeFi). The 28-year-old Eisenberg will be held to account for his actions on Oct. 11, 2022, when a series of trades he made intentionally boosted the price of Mango Markets' native token, MNGO, as well as the price of futures contracts. \n\nHe used the inflated futures holdings as collateral to borrow other cryptocurrencies on the platform, then quickly withdrew those assets and walked away from his collateral. Eisenberg never disputed the facts of the strategy but contended that what he did was legal and permitted by the DeFi protocol, a principle in the industry known as \"code is law.\" U.S. laws apply to DeFi: \"Avraham Eisenberg ran a con,\" prosecutors sai", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/18/1941251/crypto-trader-eisenberg-convicted-of-fraud-in-110-million-mango-markets-scheme?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Crypto Trader Eisenberg Convicted of Fraud in $110 Million Mango Markets Scheme", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T19:23:09.998742+00:00", "description": "Nigeria will criminalize the destruction of broadband fiber cables following repeated complaints by MTN Nigeria and other telecommunications companies that they are losing billions of naira, Bloomberg News reported, citing people familiar with the matter. From the report: Nigeria's works ministry, which supervises federal road constructors, is finalizing the regulation that will be signed as an executive order by President Bola Tinubu, said the people, asking not to be identified as they weren't authorized to comment. While there are presently laws against vandalism, the authorities are aiming to regulate construction firms more closely.\n\nThe order will enforce stiff penalties on offenders, said the people, declining to provide more details or say when it will be signed. \"Telecom assets are critical backbone that supports the economy across sectors,\" said Temitope Ajayi, a senior presidential aide, who noted that the Association of Telecommunications Companies has been demanding the c", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/18/1614201/nigeria-to-criminalise-fiber-cable-damage-costing-telecoms-billions?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Nigeria To Criminalise Fiber Cable Damage Costing Telecoms Billions", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T18:17:59.233868+00:00", "description": "An anonymous reader shares a report: A financially motivated criminal hacking group says it has stolen a confidential database containing millions of records that companies use for screening potential customers for links to sanctions and financial crime. The hackers, which call themselves GhostR, said they stole 5.3 million records from the World-Check screening database in March and are threatening to publish the data online. \n\nWorld-Check is a screening database used for \"know your customer\" checks (or KYC), allowing companies to determine if prospective customers are high risk or potential criminals, such as people with links to money laundering or who are under government sanctions.The hackers told TechCrunch that they stole the data from a Singapore-based firm with access to the World-Check database, but did not name the firm. A portion of the stolen data, which the hackers shared with TechCrunch, includes individuals who were sanctioned as recently as this year.<p><div class=\"sh", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/18/1722241/hackers-are-threatening-to-publish-a-huge-stolen-sanctions-and-financial-crimes-watchlist?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Hackers Are Threatening To Publish a Huge Stolen Sanctions and Financial Crimes Watchlist", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T18:17:57.740145+00:00", "description": "The U.S. Copyright Office has granted a copyright registration to Elisa Shupe, a retired U.S. Army veteran, for her novel \"AI Machinations: Tangled Webs and Typed Words,\" which extensively used OpenAI's ChatGPT in its creation. The registration is among the first for creative works incorporating AI-generated text, but with a significant caveat - Shupe is considered the author of the \"selection, coordination, and arrangement\" of the AI-generated content, not the text itself. \n\nShupe, who writes under the pen name Ellen Rae, initially filed for copyright in October 2022, seeking an Americans with Disabilities Act (ADA) exemption due to her cognitive impairments. The Copyright Office rejected her application but later granted the limited copyright after Shupe appealed. The decision, as Wired points out, highlights the agency's struggle to define authorship in the age of AI and the nuances of copyright protection for AI-assisted works.<p><div class=\"share_submission\">\n<a class=\"slashpop\" ", "language": "en-us", "link": "https://slashdot.org/story/24/04/18/1741255/author-granted-copyright-over-book-with-ai-generated-text---with-a-twist?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Author Granted Copyright Over Book With AI-Generated Text - With a Twist", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T17:13:22.679357+00:00", "description": "Meta debuted a new version of its powerful Llama AI model, its latest effort to keep pace with similar technology from companies like OpenAI, X and Google. The company describes Llama 3 8B and Llama 3 70B, containing 8 billion and 70 billion parameters respectively, as a \"major leap\" in performance compared to their predecessors. \n\nMeta claims that the Llama 3 models, trained on custom-built 24,000 GPU clusters, are among the best-performing generative AI models available for their respective parameter counts. The company supports this claim by citing the models' scores on popular AI benchmarks such as MMLU, ARC, and DROP, which attempt to measure knowledge, skill acquisition, and reasoning abilities. Despite the ongoing debate about the usefulness and validity of these benchmarks, they remain one of the few standardized methods for evaluating AI models. Llama 3 8B outperforms other open-source models like Mistral's Mistral 7B and Google's Gemma 7B on at least nine benchmarks, showcas", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/18/1640213/meta-releases-llama-3-ai-models-claiming-top-performance?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Releases Llama 3 AI Models, Claiming Top Performance", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T16:09:04.311241+00:00", "description": "Researchers in Canada got most of what they were hoping for in the country's 2024 federal budget, with a big boost in postgraduate pay and more funding for research and scientific infrastructure. From a report: \"We are investing over $5 billion in Canadian brainpower,\" said finance minister Chrystia Freeland in her budget speech on 16 April. \"More funding for research and scholarships will help Canada attract the next generation of game-changing thinkers.\" \n\nPostgraduate students and postdoctoral researchers have been advocating for higher pay for the past two years through a campaign called Support Our Science. They requested an increase in the value, and number, of federal government scholarships, and got more than they asked for. Stipends for master's students will rise from Can$17,500 (US$12,700) to $27,000 per year, PhDs stipends that ranged from $20,000 to $35,000 will be set to a uniform annual $40,000 and most postdoctoral-fellowship salaries will increase from $45,000 to $70,", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/18/1452205/canadian-science-gets-biggest-boost-to-phd-and-postdoc-pay-in-20-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Canadian Science Gets Biggest Boost To PhD and Postdoc Pay in 20 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T16:09:02.827269+00:00", "description": "Google CEO Sundar Pichai announced substantial internal reorganizations on Thursday, including the creation of a new team called \"Platforms and Devices\" that will oversee all of Google's Pixel products, all of Android, Chrome, ChromeOS, Photos, and more. From a report: The team will be run by Rick Osterloh, who was previously the SVP of devices and services, overseeing all of Google's hardware efforts. Hiroshi Lockheimer, the longtime head of Android, Chrome, and ChromeOS, will be taking on other projects inside of Google and Alphabet. This is a huge change for Google, and it likely won't be the last one. There's only one reason for all of it, Osterloh says: AI. \"This is not a secret, right?\" he says. \n\nConsolidating teams \"helps us to be able to do full-stack innovation when that's necessary,\" Osterloh says. He uses the example of the Pixel camera: \"You had to have deep knowledge of the hardware systems, from the sensors to the ISPs, to all layers of the software stack. And, at the t", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/18/1550204/google-is-combining-its-android-and-hardware-teams?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google is Combining Its Android and Hardware Teams", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T14:52:51.848064+00:00", "description": "Amazon staff went undercover on Walmart, eBay and other marketplaces as a third-party seller called \"Big River,\" WSJ reports. The mission: to scoop up information on pricing, logistics and other business practices. From the report: For nearly a decade, workers in a warehouse in Seattle's Denny Triangle neighborhood have shipped boxes of shoes, beach chairs, Marvel T-shirts and other items to online retail customers across the U.S. The operation, called Big River Services International, sells around $1 million a year of goods through e-commerce marketplaces including eBay, Shopify, Walmart and Amazon under brand names such as Rapid Cascade and Svea Bliss. \"We are entrepreneurs, thinkers, marketers and creators,\" Big River says on its website. \"We have a passion for customers and aren't afraid to experiment.\" \n\nWhat the website doesn't say is that Big River is an arm of Amazon that surreptitiously gathers intelligence on the tech giant's competitors. Born out of a 2015 plan code named \"", "language": "en-us", "link": "https://slashdot.org/story/24/04/18/0636230/inside-amazons-secret-operation-to-gather-intel-on-rivals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Inside Amazon's Secret Operation To Gather Intel on Rivals", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T14:52:50.367519+00:00", "description": "Google said on Thursday it had terminated 28 employees after some staff participated in protests against the company's cloud contract with the Israeli government. From a report: The Alphabet unit said a small number of protesting employees entered and disrupted work at a few unspecified office locations. \"Physically impeding other employees' work and preventing them from accessing our facilities is a clear violation of our policies, and completely unacceptable behavior,\" the company said in a statement. \n\nGoogle said it had concluded individual investigations, resulting in the termination of 28 employees, and would continue to investigate and take action as needed. In a statement on Medium, Google workers affiliated with the No Tech for Apartheid campaign called it a \"flagrant act of retaliation\" and said that some employees who did not directly participate in Tuesday's protests were also among those Google fired.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitt", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/18/136235/google-terminates-28-employees-for-protest-of-israeli-cloud-contract?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Terminates 28 Employees For Protest of Israeli Cloud Contract", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T14:52:48.902843+00:00", "description": "The US Air Force is putting AI in the pilot's seat. In an update on Thursday, the Defense Advanced Research Projects Agency (DARPA) revealed that an AI-controlled jet successfully faced a human pilot during an in-air dogfight test carried out last year. From a report: DARPA began experimenting with AI applications in December 2022 as part of its Air Combat Evolution (ACE) program. It worked to develop an AI system capable of autonomously flying a fighter jet, while also adhering to the Air Force's safety protocols. After carrying out dogfighting simulations using the AI pilot, DARPA put its work to the test by installing the AI system inside its experimental X-62A aircraft. That allowed it to get the AI-controlled craft into the air at the Edwards Air Force Base in California, where it says it carried out its first successful dogfight test against a human in September 2023.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Air+Force+Confirms+", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/18/148205/us-air-force-confirms-first-successful-ai-dogfight?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Air Force Confirms First Successful AI Dogfight", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T14:52:47.401142+00:00", "description": "U.S. lawmakers have moved closer to enacting a countrywide ban on TikTok. From a report: Last month, the House of Representatives passed a bill by a wide margin that would ban distribution of TikTok in U.S. unless TikTok's Chinese parent, ByteDance, sells its ownership in the app within 165 days of the law's enactment. On Wednesday, House Speaker Mike Johnson issued a new proposal that would extend the sale requirement deadline to nine months, with a potential for a 90-day extension -- addressing a key concern of Sen. Maria Cantwell (D-Wash.), chair of the Senate's Commerce, Science and Transportation Committee, that the divestiture timeline was too short. \n\nThe revised TikTok ban proposal is tied to a broader bill providing emergency aid for Ukraine and Israel; the House is expected to vote on the measure Saturday, and if it passes would move to the Senate. President Biden has said he will sign the TikTok divest-or-ban legislation into law. On Wednesday evening, Cantwell said she sup", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/18/1437245/odds-of-us-tiktok-ban-increase-after-house-fast-tracks-revised-bill-picking-up-key-senate-support?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Odds of US TikTok Ban Increase After House Fast-Tracks Revised Bill, Picking Up Key Senate Support", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T11:36:31.976475+00:00", "description": "Sweden is the newest nation to sign onto NASA's Artemis Accords -- a series of non-binding bilateral arrangements for peaceful and responsible exploration. Space.com reports: During a signing event in Stockholm on Tuesday (April 16), Swedish Minister for Education Mats Persson penned the agreement alongside U.S. Ambassador Erik D. Ramanathan. \"By joining the Artemis Accords, Sweden strengthens its strategic space partnership with the U.S. on space covering areas such as Swedish space research and the space industry, which in turn also strengthens Sweden's total defense capability,\" Persson said in a NASA statement. The event in Stockholm comes just on the heels of Switzerland's signing of the Artemis Accords the day before. Greece and Uruguay were also included in February. Sweden is now the 38th nation to join the accords, which were established in 2020, as the first Artemis moon launch inched closer to reality.\n \nThe Accords mirror principles set out in 1967, as part of the Outer Sp", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/17/2331211/sweden-becomes-38th-country-to-sign-nasas-artemis-accords-for-moon-exploration?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Sweden Becomes 38th Country To Sign NASA's Artemis Accords For Moon Exploration", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T11:36:30.460603+00:00", "description": "Apple is doubling down on 8GB of RAM for many of its entry-level Macs, claiming that it's \"suitable for many tasks,\" including browsing, video streaming and even \"light\" video and image editing. As of this writing, all MacBook Air laptops, the Mac Mini, and the MacBook Pro 14 all start with a base configuration of 8GB RAM -- which can't be upgraded at a later date since the RAM is soldered onto the motherboard. \"That might have been OK were it not for the fact that Apple charges a ridiculous $200 to upgrade any of those machines from 8GB to 16GB,\" notes PC Gamer's Jeremy Laird. Even if an 8GB Mac does some of the previously stated tasks tolerably well, Laird argues that \"8GB still isn't acceptable.\" From the report: That's because a Mac with 8GB can easily run out of memory just browsing the web. That's particularly true with Chrome, which just so happens to be the most popular browser around. Regular Chrome users will know what a memory hog Chrome can be. Right now, I have about 15 t", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/17/2324242/is-8gb-of-ram-enough-for-a-mac?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is 8GB of RAM Enough For a Mac?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T06:33:36.280694+00:00", "description": "TikTok has started testing its Instagram competitor, TikTok Notes, in Canada and Australia. TechCrunch reports: The company said on X that it is in the \"early stage\" of the app's rollout and that the app is \"a dedicated space for photo and text content.\" \"We hope that the TikTok community will use TikTok Notes to continue sharing their moments through photo posts. Whether documenting adventures, expressing creativity, or simply sharing snapshots of one's day, the TikTok Notes experience is designed for those who would like to share and engage through photo content,\" it said.\n \nThe company didn't say much about the app's features and functionality apart from the fact that users can log in with their existing TikTok account. Even the app's description in the app stores is pretty light on details. The screenshots on the App Store listing suggest that the posts will appear in two-column grids on the home page. The screenshots also indicate that you can post multiple photos through a carou", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/17/2114208/tiktok-starts-testing-its-instagram-competitor-tiktok-notes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "TikTok Starts Testing Its Instagram Competitor 'TikTok Notes'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T06:33:33.739427+00:00", "description": "CNBC reports that nine Google workers were arrested on trespassing charges Tuesday night in protest of the company's $1.2 billion contract providing cloud computing services to the Israeli government. The sit-in happened at Google Cloud CEO Thomas Kurian's office in Sunnyvale and the 10th floor commons of Google's New York office. From the report: The arrests, which were livestreamed on Twitch by participants, follow rallies outside Google offices in New York, Sunnyvale and Seattle, which attracted hundreds of attendees, according to workers involved. [...] Protesters in Sunnyvale sat in Kurian's office for more than nine hours until their arrests, writing demands on Kurian's whiteboard and wearing shirts that read \"Googler against genocide.\" In New York, protesters sat in a three-floor common space. Five workers from Sunnyvale and four from New York were arrested.\n \n\"On a personal level, I am opposed to Google taking any military contracts -- no matter which government they're with o", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/17/236253/google-workers-arrested-after-nine-hour-protest-in-cloud-chiefs-office?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Workers Arrested After Nine-Hour Protest In Cloud Chief's Office", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-18T06:33:31.385810+00:00", "description": "An anonymous reader quotes a report from The Hill: The House on Wednesday approved a bill that would limit how the government can purchase data from third parties &mdash; legislation that scored a vote after negotiations with a group of GOP colleagues who briefly tanked a vote on warrantless spy powers. Dubbed the Fourth Amendment is Not For Sale, the legislation passed 219-199. It requires law enforcement and other government entities to get a warrant before buying information from third-party data brokers who purchase information gleaned from apps. [...] Senior administration officials said the measure would blind U.S. intelligence outfits from getting information easily purchased by foreign intelligence operations.\n \n\"In practice, these standards make it impossible for the [intelligence community], law enforcement to acquire a whole host of readily available information that they currently rely on,\" an administration official said. \"Covered customer records as defined in the bill i", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/17/2313239/house-passes-bill-requiring-warrant-to-purchase-data-from-third-parties?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "House Passes Bill Requiring Warrant To Purchase Data From Third Parties", "user": null, "vote": 0}]