[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "10 Gaming Trends of 2023 That Were ACTUALLY GOOD", "description": "We all have a tendency to talk about and (rightly) criticize developers and publishers in the industry who chase trends in the worst, most misguided way possible, but at the same time, there are also plenty of trends in the industry that more often than not lead to good things. \n\n2023 in and of itself has seen plenty of these, from practices that suddenly grew in popularity this year to those that had steadily been gathering momentum for some time before reaching their peak over the course of the last few months. \n\nHere, that’s exactly what we’re here to talk about, as we take a look at a few gaming trends of 2023 that we only have good things to say about.", "link": "https://www.youtube.com/watch?v=ObvQCFuN1Jk", "date_published": "2023-12-30T15:30:04+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/ObvQCFuN1Jk/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 Best Shooters of 2023 You NEED TO TRY OUT", "description": "Along with other genres, 2023 was an excellent year for shooters. First-person shooters, third-person shooters, competitive multiplayer, single-player focused, action RPGs - the list goes on. There's something for everyone, even some latecomers that earned a well-deserved spot.\n\nTrepang2 offered a lot of action, while THE FINALS offered a fresh destruction-heavy multiplayer shooter. Of course, survival horror fans had their share too with Dead Space remake. Here are our picks for the best shooters of 2023.", "link": "https://www.youtube.com/watch?v=VrgOs32K_QQ", "date_published": "2023-12-30T09:30:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/VrgOs32K_QQ/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]