[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-02T20:30:04+00:00", "description": "An age has passed since Slitterhead was first announced on December 9th, 2021, at The Game Awards but alas the time is now upon us and the debut outing from fledgling developer Bokeh Game Studio Inc. is on the horizon. \n\nSlitterhead’s initial reveal showcased twisted monstrosities lurching out the cracked skulls of still living humans in a dense, chaotic Asian city. That initial image still burns the retinas but thanks to a recent flurry of gameplay previews and dev diaries we’re a little closer to understanding what Slitterhead is all about (although there’s still an element of ‘what the hell is going on’ with this one). \n\nThis video aims to unpack 15 things you need to know about this upcoming battle-action horror game before you hit that pre-order button.", "id": 1442365, "language": null, "link": "https://www.youtube.com/watch?v=j9Lvn7QebOQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/j9Lvn7QebOQ/hqdefault.jpg", "title": "Slitterhead - 15 Things You NEED To Know Before You Buy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-02T18:30:13+00:00", "description": "Horizon Zero Dawn easily stands tall as one of the best open-worlds of the recent console generation, and it surprisingly holds up well even to this day - both from a functional and a graphical perspective. \n\nAs such, the thought of remastering the game seems frivolous at first glance. However, Nixxes Software has promised many changes to make this upgrade feel worthwhile. \n\nWe put these claims to the test and break down the Remastered version of Horizon Zero Dawn to better understand what has exactly changed and how it stacks up against the original release. We also take a look at the performance side of things on the PC release in an effort to understand what optimizations have been made this time around.", "id": 1441868, "language": null, "link": "https://www.youtube.com/watch?v=Iwcx_r79LdE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/Iwcx_r79LdE/hqdefault.jpg", "title": "Horizon Zero Dawn Remastered vs Original Graphics Comparison - Are The Visual Changes Drastic?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-02T11:00:20+00:00", "description": "Not many games come with the hype that Dragon Age: The Veilguard carries, and for good reason. Very few are following up on a beloved trilogy of titles from a studio specializing in the same. Even fewer make sweeping changes to the combat, exploration, and more while going for a different atmosphere.\n\nThe results range from intriguing and enjoyable to somewhat baffling. While The Veilguard mostly excels with its combat, even as it takes time to open up in abilities, builds, and loot, the companions aren't BioWare's best. Then there's the story, which waffles between a predictable plot and disappointing cameos.\n\nThis isn't to say that The Veilguard is a disaster - far from it, as there's definitely a vibe to some of the interactions and exploring the different regions for what secrets they may hold. But it may not be everything that Dragon Age fans are looking for, much less competing with the best that the genre has to offer.", "id": 1438538, "language": null, "link": "https://www.youtube.com/watch?v=K2uvUZOlfL0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/K2uvUZOlfL0/hqdefault.jpg", "title": "Dragon Age: The Veilguad Review - Bioware's Greatest Or Just Another Middling Experience?", "vote": 0}]