[{"source_obj__id": 210, "tags": [], "bookmarked": false, "description": "The full 1.0 release for Sons of the Forest is nearly here! In a way to symbolically put the Early Access version to rest, ride along with Evan Haley, the Lead Tester for Endnight Games, as he sees how speedrunners were breaking Sons of the Forest before the full release.\n\n#IGN #Gaming", "age": null, "link": "https://www.youtube.com/watch?v=rfwkS6u6T50", "artist": "IGN", "album": "", "user": null, "title": "Sons of the Forest Developers React to 7 Minute Speedrun (Early Access)", "permanent": false, "page_rating_visits": 0, "comments": [], "vote": 0, "page_rating": 0, "page_rating_contents": 0, "language": null, "dead": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "page_rating_votes": 0, "date_published": "2024-02-17T16:00:37+00:00", "thumbnail": "https://i3.ytimg.com/vi/rfwkS6u6T50/hqdefault.jpg"}, {"source_obj__id": 210, "tags": [], "bookmarked": false, "description": "The first trailer for X-Men ‘97 has finally arrived, and with it the release date for this long-awaited revival. Starting on March 20, 2024, ‘90s kids will finally get to see the next chapter of X-Men: The Animated Series. And one thing is clear - the X-Men still have a lot of enemies nearly 30 years later.\n\nBut just what is X-Men ‘97 about? Who are the X-Men fighting this time around? And what does it mean now that Jean Grey is pregnant? Let’s break down what we know about X-Men ‘97 based on the trailer and the classic comic book storylines the show is adapting. Buckle up, bubs!\n\nX-Men ‘97 is produced by Marvel Animation and features the voices of Cal Dodd, Lenore Zann, George Buza, Catherine Disher, Chris Potter, Alison Sealy-Smith, Adrian Hough, Christopher Britton, Alyson Court, Lawrence Bayne and Ron Rubin. The series will stream exclusively on Disney+.", "age": null, "link": "https://www.youtube.com/watch?v=OaFxEY0FqYQ", "artist": "IGN", "album": "", "user": null, "title": "X-Men ‘97: Our Biggest Burning Questions From the New Trailer", "permanent": false, "page_rating_visits": 0, "comments": [], "vote": 0, "page_rating": 0, "page_rating_contents": 0, "language": null, "dead": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "page_rating_votes": 0, "date_published": "2024-02-17T15:15:03+00:00", "thumbnail": "https://i4.ytimg.com/vi/OaFxEY0FqYQ/hqdefault.jpg"}, {"source_obj__id": 210, "tags": [], "bookmarked": false, "description": "Warframe is a free-to-play third-person action looter shooter RPG developed by Digital Extremes. Players will be able to continue the progression of their Tenno on the go with full Cross Platform Save functionality. Continue the sci-fi expansive journey in a variety of missions alone or with friends in co-op with Warframe launching on iOS on February 20 alongside its release on PlayStation 4, PlayStation 5, Xbox One, Xbox Series S|X, Nintendo Switch, and PC.\n\n#IGN #Gaming #Warframe #iOS", "age": null, "link": "https://www.youtube.com/watch?v=qlhbIqirw04", "artist": "IGN", "album": "", "user": null, "title": "Warframe - Official iOS Release Date Announcement Trailer", "permanent": false, "page_rating_visits": 0, "comments": [], "vote": 0, "page_rating": 0, "page_rating_contents": 0, "language": null, "dead": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "page_rating_votes": 0, "date_published": "2024-02-17T15:00:48+00:00", "thumbnail": "https://i2.ytimg.com/vi/qlhbIqirw04/hqdefault.jpg"}, {"source_obj__id": 210, "tags": [], "bookmarked": false, "description": "The MCU as we know it wouldn’t exist without Robert Downey, Jr. While that sounds hyperbolic — and not particularly original — it is a fact. His embodiment of Tony Stark, a character who up until that point was best known for his stint as an alcoholic in Bob Layton, David Michelinie, and John Romita Jr.'s fantastic Bronze Age Iron Man arc, gave the Marvel film franchise its first smash hit and a beating heart to keep its blood flowing. However you feel about the movies that have been released since Tony's death in Avengers: Endgame it's fair to say that the MCU has struggled to find that same consistency without Iron Man around to anchor the ever-more cosmic and sprawling franchise.\n\nBut with the massive Valentine's Day casting announcement of the Fantastic Four which finally confirmed that Pedro Pascal will be taking on the role of Reed Richards, the MCU may have found its next North Star. The fan-favorite actor has proven his chops time and time again and could change the M", "age": null, "link": "https://www.youtube.com/watch?v=gsRd3RmSd8M", "artist": "IGN", "album": "", "user": null, "title": "Why Pedro Pascal Could Be Marvel’s New Robert Downey, Jr. - Fantastic Four", "permanent": false, "page_rating_visits": 0, "comments": [], "vote": 0, "page_rating": 0, "page_rating_contents": 0, "language": null, "dead": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "page_rating_votes": 0, "date_published": "2024-02-17T14:15:05+00:00", "thumbnail": "https://i4.ytimg.com/vi/gsRd3RmSd8M/hqdefault.jpg"}, {"source_obj__id": 210, "tags": [], "bookmarked": false, "description": "Helldivers 2 reviewed by Will Borger on PlayStation 5, also available on PC.\n\nHelldivers 2 is the rare modern multiplayer game that does almost everything right. It gives you a ton of freedom, feels fantastic to play, and has a smart progression system that doesn’t nickel and dime you or rely too much on a paid battle pass. It manages to keep its missions fresh by introducing a ton of enemies, modifiers, and objectives, and varying them in interesting ways. There are some matchmaking and performance issues that still need to be worked out, and you can only go so far by yourself or with random players – but if you’ve got a solid squad, it’s an incredible time, and certainly one of the most fun multiplayer shooters in years.\n\n#IGN #Gaming #Helldivers2 #Review", "age": null, "link": "https://www.youtube.com/watch?v=gwSYHqPLnhs", "artist": "IGN", "album": "", "user": null, "title": "Helldivers 2 Review", "permanent": false, "page_rating_visits": 0, "comments": [], "vote": 0, "page_rating": 0, "page_rating_contents": 0, "language": null, "dead": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "page_rating_votes": 0, "date_published": "2024-02-17T13:50:00+00:00", "thumbnail": "https://i4.ytimg.com/vi/gwSYHqPLnhs/hqdefault.jpg"}, {"source_obj__id": 210, "tags": [], "bookmarked": false, "description": "Joker: Folie a Deux, the sequel to 2019’s Joker is still on track to release October 4th of next year. and to hold us over till then, director Todd Phillips took to Instagram to give us new looks at the clown prince and his new partner in crime. In the first photo, we have actor Joquin Phoenix suited up with the infamous Joker makeup, pictured alongside Lady Gaga’s version of Harley Quinn. In the next photo, we’ve got Arthur Fleck behind bars, presumably in Arkham Asylum, budding noses with Dr. Quinn. And finally, the two share an embrace on a rooftop in Gotham. Keep in mind this movie is also supposed to be a musical, so this could be one of those scenes. With Lady Gaga in the mix, it’s no surprise there’ll be musical elements throughout the film. Definitely a different take from what we’ve gotten in the past pertaining to Harley Quinn, as we’ve only gotten Margot Robbie’s take on the DC villain on the big screen. #Joker2 will be part of the DC Elseworlds set of films within", "age": null, "link": "https://www.youtube.com/watch?v=22mMlfsooNc", "artist": "IGN", "album": "", "user": null, "title": "Joker 2 Director Releases New Images of Joaquin Phoenix & Lady Gaga - IGN The Fix: Entertainment", "permanent": false, "page_rating_visits": 0, "comments": [], "vote": 0, "page_rating": 0, "page_rating_contents": 0, "language": null, "dead": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "page_rating_votes": 0, "date_published": "2024-02-17T00:41:27+00:00", "thumbnail": "https://i3.ytimg.com/vi/22mMlfsooNc/hqdefault.jpg"}, {"source_obj__id": 210, "tags": [], "bookmarked": false, "description": "The first-ever IGN Fan Fest Game Trailer Showcase is a celebration of some of your soon-to-be favorite horror video games, with new looks at the following titles:\n\n#Blud\nDarkweb Streamer\nHorror Stories: Harvest Hunt\nJanet DeMornay is a Slumlord (and a Witch)\nKiller Klowns from Outer Space\nOutbreak Island\nStill Wakes the Deep\nThe Outlast Trials\n\nTune-in tomorrow, Wednesday Feb. 21, for more exclusive trailer drops and previews including Sand Lands, Dave the Diver, Hitman: World of Assassination, and more!\n\n#IGN #Gaming #IGNFanFest", "age": null, "link": "https://www.youtube.com/watch?v=JzD5vyX39Cs", "artist": "IGN", "album": "", "user": null, "title": "IGN Fan Fest Game Trailer Showcase Part 1", "permanent": false, "page_rating_visits": 0, "comments": [], "vote": 0, "page_rating": 0, "page_rating_contents": 0, "language": null, "dead": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "page_rating_votes": 0, "date_published": "2024-02-17T00:18:55+00:00", "thumbnail": "https://i3.ytimg.com/vi/JzD5vyX39Cs/hqdefault.jpg"}]