[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T20:30:12+00:00", "description": "During the good old days of gaming, Gran Turismo was the premier racing while Need for Speed still ruled among more mainstream audiences. Forza Motorsport would get its start around the mid-2000s, but another franchise began drawing attention: Test Drive Unlimited.\n\nThough Test Drive had been around for years prior, Unlimited was a new start for the series, offering an expansive 3D world, a wider selection of cars, and a focus on more luxury-based racing. It was followed by Test Drive Unlimited 2, which expanded on its predecessor even further, but then the franchise went silent for a long time.\n\nUntil now, that is. Test Drive Unlimited Solar Crown launches on September 12th for Xbox Series X/S, PS5, and PC after years of delays and serves as another fresh start. How does it compare to the previous game? Check out some of the biggest differences here.", "id": 1076868, "language": null, "link": "https://www.youtube.com/watch?v=oq92bHl9QXM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/oq92bHl9QXM/hqdefault.jpg", "title": "Test Drive Unlimited Solar Crown vs. Test Drive Unlimited 2 - 14 MAJOR DIFFERENCES", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T20:30:01+00:00", "description": "The games in the Ace Attorney Investigations Collection come with all the bells and whistles you have come to expect from these kinds of collections at this point. \n\nYou get a collection of concept art, promotional art, a Story Mode has been added which basically solves all the puzzles for you, and there is even a Chapter Select so that you can jump into any chapter of the story – certainly useful for replays.", "id": 1076869, "language": null, "link": "https://www.youtube.com/watch?v=5MbAA3CwfxQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/5MbAA3CwfxQ/hqdefault.jpg", "title": "Ace Attorney Investigations Collection Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T13:00:18+00:00", "description": "On the surface, The Casting of Frank Stone seems like the perfect match. Supermassive Games and its work on The Dark Picture Anthology combined with the lore and intrigue of Behaviour Interactive's Dead by Daylight. A single-player narrative set in the world of Dead by Daylight. What could go wrong?\n\nUnfortunately, that's not enough. The Casting of Frank Stone fails to really capitalize on its characters, much less build upon them and their connections. The gameplay is simple enough from a narrative adventure perspective, but the use of Dead by Daylight's skill checks feels pedestrian at best, while the 8mm mechanic is throwaway at worst.\n\nCombine this with dull puzzles, a Cutting Room Floor that's a headache to revisit and change past decisions, and an overarching plot that suffers from its fair of holes, and it's hard to see who The Casting of Frank Stone could appeal to.", "id": 1073968, "language": null, "link": "https://www.youtube.com/watch?v=GjbxtKMAUNM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/GjbxtKMAUNM/hqdefault.jpg", "title": "The Casting of Frank Stone Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T10:00:54+00:00", "description": "Why is it that there’s a subset of gamers out there who seem uncomfortable of linear games? Yes, tight level design, curated storylines, scripted events, these can reduce player agency and freedom and thus be perceived as a negative for some, but complaints surrounding replayability and end-game content seem unfair given that linear games by definition are supposed to have a set end point. \n\nWhat the games on this video do identify though is that strict definitions of linear games can still be fine-tuned. If we consider linear to mean a pre-determined beginning, middle, and end with an overall identical experience despite the number of playthroughs then we’re leaving out games with slightly open levels or modicums of exploration. We’re not talking open world here, but the linear games on this rundown do have elements of breadth in how you reach the end.\n\nLink to 2023 edition: https://www.youtube.com/watch?v=RQbkfCHN8uU\n\nIntro 0:00\nThe Last of Us Part II 1:06\nUncharted: Drake’s Fortune", "id": 1072939, "language": null, "link": "https://www.youtube.com/watch?v=p7JmOwnyVgQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/p7JmOwnyVgQ/hqdefault.jpg", "title": "15 Greatest Linear Games of All Time YOU NEED TO EXPERIENCE [2024 Edition]", "user": null, "vote": 0}]