[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T17:55:05.970424+00:00", "description": "Intel launched its new Core Ultra 200V-series processors on Tuesday, promising significant improvements in power efficiency, performance, and battery life over competitors and previous generations. The company claims the chips offer \"historic x86 power efficiency\" and the \"world's fastest mobile CPU cores.\" The processors, available for pre-order in OEM systems and shipping September 24, feature four Lion Cove P-cores and four Skymont E-cores with boost speeds up to 5.1 GHz. \n\nIntel says the chips deliver up to 20.1 hours of battery life, Tom's Hardware reports, outperforming Qualcomm's Snapdragon X Elite by nearly two hours and AMD's chips by almost four hours. Intel asserts a 30% faster gaming performance than competing processors and highlighted compatibility issues with Qualcomm's chips, noting that nearly two dozen games used for benchmarking failed to run on X Elite chips. The company claims up to 64% advantage in single-threaded performance over Qualcomm Snapdragon X Elite and ", "id": 1075786, "language": null, "link": "https://hardware.slashdot.org/story/24/09/03/1635235/intel-launches-lunar-lake-claims-arm-beating-battery-life-worlds-fastest-mobile-cpu-cores?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Launches Lunar Lake: Claims Arm-Beating Battery Life, World's Fastest Mobile CPU Cores", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T17:55:05.887197+00:00", "description": "U.S. oilfield services firm Halliburton said on Tuesday an unauthorized third party had accessed and removed data from its systems, providing details regarding the cyberattack in August. From a report: The company said it is evaluating the nature and scope of information that was removed, but added that the incident is not reasonably likely to have a material impact. Halliburton declined to comment in response to Reuters' requests for additional information on the nature of data removed and expenses incurred due to the cyber incident. It also did not immediately confirm whether it had been contacted by the hackers. U.S energy firms have suffered multiple cyberattacks, including ransomware attacks, in recent years. In 2021, Colonial Pipeline was forced to pay $4.4 million in ransom as its executives were not sure about the severity of the breach.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Halliburton+Says+Hackers", "id": 1075785, "language": null, "link": "https://it.slashdot.org/story/24/09/03/1650252/halliburton-says-hackers-removed-data-in-august-cyberattack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Halliburton Says Hackers Removed Data in August Cyberattack", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T16:49:55.611240+00:00", "description": "Mobile phones are not linked to brain and head cancers, a comprehensive review of the highest quality evidence available commissioned by the World Health Organization has found. From a report: Led by the Australian Radiation Protection and Nuclear Safety Agency (Arpansa), the systematic review examined more than 5,000 studies from which the most scientifically rigorous were identified and weak studies were excluded. The final analysis included 63 observational studies in humans published between 1994 and 2022, making it \"the most comprehensive review to date,\" the review lead author, associate prof Ken Karipidis, said. \"We concluded the evidence does not show a link between mobile phones and brain cancer or other head and neck cancers.\" \n\nPublished on Wednesday, the review focused on cancers of the central nervous system (including brain, meninges, pituitary gland and ear), salivary gland tumours and brain tumours. The review found no overall association between mobile phone use and c", "id": 1075409, "language": null, "link": "https://science.slashdot.org/story/24/09/03/1610238/mobile-phones-not-linked-to-brain-cancer-biggest-study-to-date-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mobile Phones Not Linked To Brain Cancer, Biggest Study To Date Finds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T15:44:48.450847+00:00", "description": "Nvidia dominates the chips at the center of the AI boom. It wants to conquer almost everything else that makes those chips tick, too. From a report: Chief Executive Jensen Huang is increasingly broadening his company's focus -- and seeking to widen its advantage over competitors -- by offering software, data-center design services and networking technology in addition to its powerful silicon brains. More than a supplier of a valuable hardware component, he is trying to build Nvidia into a one-stop shop for all the key elements in the data centers where tools like OpenAI's ChatGPT are created and deployed -- or what he calls \"AI factories.\" \n\nHuang emphasized Nvidia's growing prowess at data-center design following an earnings report Wednesday that exceeded Wall Street forecasts. The report came days after rival AMD agreed to pay nearly $5 billion to buy data-center design and manufacturing company ZT Systems to try to gain ground on Nvidia. \"We have the ability fairly uniquely to inte", "id": 1074882, "language": null, "link": "https://tech.slashdot.org/story/24/09/03/1414215/nvidia-takes-an-added-role-amid-ai-craze-data-center-designer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Nvidia Takes an Added Role Amid AI Craze: Data-Center Designer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T15:44:48.355271+00:00", "description": "Japan has recorded its hottest summer on record after a sweltering three months marked by thousands of instances of \"extreme heat,\" with meteorologists warning that unseasonably high temperatures will continue through the autumn. From a report: The average temperature in June, July and August was 1.76C higher than the average recorded between 1991 and 2020, the Japan meteorological agency said, according to Kyodo news agency. It was the hottest summer since comparable records were first kept in 1898 and tied the record set in 2023, the agency said. Japan has recorded 8,821 instances of \"extreme heat\" -- a temperature of 35C or higher -- so far this year, easily beating the previous record of 6,692 set in 2023, it added. The brutal heat was not confined to Japan. Swathes of China logged the hottest August on record, the weather service said. \n\nThe hot weather prompted delays to the start of the new school year in some Chinese cities. State media reported on Tuesday that some schools an", "id": 1074881, "language": null, "link": "https://news.slashdot.org/story/24/09/03/1540211/japan-swelters-through-hottest-summer-while-parts-of-china-log-warmest-august-on-record?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Japan Swelters Through Hottest Summer While Parts of China Log Warmest August on Record", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T14:39:41.605418+00:00", "description": "Scientists have finally solved a long-standing mystery about the geologic process behind these large pieces of gold found in quartz rock. From a report: Gold has always been a hot commodity. But these days, finding a nugget isn't too tricky: Much of the world's gold is mined from natural veins of quartz, a glassy mineral that streaks through large chunks of Earth's squashed-up crust. But the geologic process that put gold nuggets there in the first place was a mystery. Now, a new study published today in Nature Geoscience has come up with a convincing, and surprising, answer: electricity, and earthquakes -- lots of them. \n\nThose nuggets owe their existence to the strange electrical properties of common quartz. When squished or jiggled, the mineral generates electricity. That drags gold particles out of fluid in Earth's crust. The particles crystallize out as grains of gold -- and, over time, with enough electrical stimulation, those grains bloom into nuggets. \"If you shake quartz, it ", "id": 1074414, "language": null, "link": "https://science.slashdot.org/story/24/09/03/1332228/how-do-gold-nuggets-form-earthquakes-may-be-the-key?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How Do Gold Nuggets Form? Earthquakes May Be the Key", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T13:34:36.860259+00:00", "description": "Canva, a popular online design platform, plans to significantly increase prices for some of its business subscriptions next year, citing the addition of generative AI features. The company's Teams subscription, which supports multiple users, will see price hikes of up to 300% in some regions. From a report: Subscribers to Canva Teams, which is targeted at businesses with several users, were emailed late last week to notify them of the price increase, which amounts to a three-times jump. A spokesperson for Canva said the price rise was due in part to the introduction of a number of new features on the Canva platform, including many powered by AI and generative AI.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Canva+To+Hike+Subscription+Prices+Up+To+300%25+Amid+AI+Push%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F09%2F03%2F1254250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitt", "id": 1074050, "language": null, "link": "https://slashdot.org/story/24/09/03/1254250/canva-to-hike-subscription-prices-up-to-300-amid-ai-push?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Canva To Hike Subscription Prices Up To 300% Amid AI Push", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T11:24:59.202785+00:00", "description": "Kotaku reviews Star Wars Outlaws, Ubisoft's latest AAA title: I was staring at a wall. It was an early mission in Ubisoft's latest behemothic RPG, Star Wars Outlaws, in which I was charged with infiltrating an Empire base to recover some information from a computer, and this wall really caught my attention. \n\nIt was a perfect wall. It absolutely captured that late-70s sci-fi aesthetic of dark gray cladding broken up by utilitarian-gray panels covered in dull blinking lights, and I stopped to think about how much work must have gone into that wall. Looking elsewhere on the screen, I was then overwhelmed. This wall was the most bland thing in a vast hanger, where TIE Fighters hung from the ceiling, Stormtroopers wandered in groups below, and even the little white sign with the yellow arrow looked like it was a decade old, meticulously crafted to fit into this universe. I felt sheer astonishment at the achievement of this. Ubisoft, via multiple studios across the whole world, and the wor", "id": 1073180, "language": null, "link": "https://entertainment.slashdot.org/story/24/09/03/1014230/star-wars-outlaws-is-a-crappy-masterpiece?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Star Wars Outlaws Is A Crappy Masterpiece", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T10:19:31.498193+00:00", "description": "Children under the age of two should not be exposed to any screens whatsoever and teenagers should have no more than three hours of screen time a day, according to guidelines announced by health authorities in Sweden. From a report: Parents and guardians should think about how they use screens with their children and tell them what they are doing on their phones when they use them in their presence, the advice says. The guidelines, announced on Monday, mark the first time that Folkhalsomyndigheten, Sweden's public health authority, has stipulated how parents should regulate screen time. \n\nScreen use among two- to five-year-olds should be limited to a maximum of one hour, while children aged between six and 12 should not use screens for more than two hours. Among 13- to 18-year-olds, the limit is three hours. This is a sharp reduction on the current average screen time figures among Swedish children and young people, which is estimated to be four hours a day for nine- to 12-year-olds a", "id": 1072841, "language": null, "link": "https://news.slashdot.org/story/24/09/03/0838232/no-screens-before-age-of-two-swedish-health-authority-tells-parents?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": " No Screens Before Age of Two, Swedish Health Authority Tells Parents", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T09:14:19.119163+00:00", "description": "Children under the age of two should not be exposed to any screens whatsoever and teenagers should have no more than three hours of screen time a day, according to guidelines announced by health authorities in Sweden. From a report: Parents and guardians should think about how they use screens with their children and tell them what they are doing on their phones when they use them in their presence, the advice says. The guidelines, announced on Monday, mark the first time that Folkhalsomyndigheten, Sweden's public health authority, has stipulated how parents should regulate screen time. \n\nScreen use among two- to five-year-olds should be limited to a maximum of one hour, while children aged between six and 12 should not use screens for more than two hours. Among 13- to 18-year-olds, the limit is three hours. This is a sharp reduction on the current average screen time figures among Swedish children and young people, which is estimated to be four hours a day for nine- to 12-year-olds a", "id": 1072522, "language": null, "link": "https://news.slashdot.org/story/24/09/03/0838232/sweden-caps-screen-time-for-kids-and-teens?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Sweden Caps Screen Time for Kids and Teens", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T08:11:02.725337+00:00", "description": "Hewlett Packard Enterprise has confirmed it will push ahead with a high court lawsuit against the estate of the deceased tech tycoon Mike Lynch in which it is seeking damages of up to $4 billion. From a report: The US company said in a statement it would follow the legal proceedings \"through to their conclusion\" despite Lynch's death last month when his yacht sank off the coast of Italy. HPE won a civil claim against Lynch in the English high court in 2022, after accusing him and his former finance director Sushovan Hussain of fraud over its $11 billion takeover of his software company Autonomy in 2011. \n\nA ruling on damages is expected soon, although the judge presiding over the case, Mr Justice Hildyard, wrote in 2022 that he expected final damages to be \"substantially less than is claimed.\" Lynch, 59, who was cleared in a separate criminal fraud trial over the Autonomy deal in the US in June, and his 18-year-old daughter Hannah, were among seven people who died after the Bayesian s", "id": 1071987, "language": null, "link": "https://slashdot.org/story/24/09/03/0228251/hewlett-packard-to-pursue-mike-lynchs-estate-for-up-to-4-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Hewlett Packard To Pursue Mike Lynch's Estate For Up To $4 Billion", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T08:11:02.641384+00:00", "description": "Elastic, creator of popular search engine Elasticsearch and visualization tool Kibana, plans to introduce the AGPL open-source license alongside its existing licenses. The move comes three years after Elastic ditched the Apache 2.0 license, sparking controversy in the tech community. \n\nFounder Shay Banon says the change aims to clarify Elastic's market position following AWS's creation of OpenSearch, a fork of Elasticsearch. Despite initial friction, Banon claims Elastic's relationship with AWS has improved, citing growth in Elastic Cloud revenue and customer base.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Elasticsearch+Will+Be+Open+Source+Again+as+CTO+Declares+Changed+Landscape%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F09%2F03%2F0511245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.", "id": 1071986, "language": null, "link": "https://news.slashdot.org/story/24/09/03/0511245/elasticsearch-will-be-open-source-again-as-cto-declares-changed-landscape?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Elasticsearch Will Be Open Source Again as CTO Declares Changed Landscape", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-03T08:11:02.542025+00:00", "description": "Night trains are experiencing a resurgence across Europe as travelers seek more environmentally friendly alternatives to flying. European Sleeper, a Dutch cooperative, recently launched a new overnight route from Brussels to Prague, extending its existing service to Berlin. The 13-hour journey traverses Germany in refurbished 1970s-era carriages, accommodating up to 600 passengers. Bart Poels, head of service, reports high demand with most routes fully booked through September. \n\nPassengers are citing various reasons for choosing night trains, including reduced carbon footprint, city center-to-center convenience, and cost savings on hotel accommodations, El Pais reports. The diverse clientele includes executives, families, and retirees. This revival comes after years of decline in night train services. Austrian railway OBB's Nightjet brand, launched in 2016, has also sparked renewed interest in overnight rail travel. The COVID-19 pandemic further accelerated the trend as travelers sou", "id": 1071985, "language": null, "link": "https://tech.slashdot.org/story/24/09/03/0718243/europe-jumps-on-the-train?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Europe Jumps On the Train", "user": null, "vote": 0}]