[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T23:01:48.158233+00:00", "description": "The Verge's Richard Lawler reports: Strava recently informed its users and partners that new terms for its API restrict the data that third-party apps can show, refrain from replicating Strava's look, and place a ban on using data \"for any model training related to artificial intelligence, machine learning or similar applications.\" The policy is effective as of November 11th, even though Strava's own post about the change is dated November 15th.\n \nThere are plenty of posts on social media complaining about the sudden shift, but one place where dissent won't be tolerated is Strava's own forums. The company says, \"...posts requesting or attempting to have Strava revert business decisions will not be permitted.\" \nBrian Bell, Strava's VP of Communications and Social Impact, said in a statement: \"We anticipate that these changes will affect only a small fraction (less than .1 percent) of the applications on the Strava platform -- the overwhelming majority of existing use cases are still a", "id": 1554565, "language": null, "link": "https://yro.slashdot.org/story/24/11/20/2136210/strava-closes-the-gates-to-sharing-fitness-data-with-other-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Strava Closes the Gates To Sharing Fitness Data With Other Apps", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T23:01:48.066554+00:00", "description": "Comcast plans to spin off several of its cable TV networks into a standalone company as it shifts focus to streaming and other profitable ventures like Peacock, theme parks, and broadband services. The Associated Press reports: Those one-time stars for Comcast's NBCUniversal cable television networks include USA, Oxygen, E!, SYFY and Golf Channel, as well as CNBC and MSNBC. Movie ticketing platform Fandango and the Rotten Tomatoes movie rating site would also become part of the new company. Peacock will remain with Comcast, as will Bravo, which provides significant content for the Peacock streaming service.\n \nComcast telegraphed the potential shift last month as it released quarterly earnings before confirming Wednesday that it will spin off assets that generated about $7 billion in revenue over he past 12 months ending September 30. That's about 5.5% of Comcast's total revenue during that period, according to the company. But there is a shrinking pool of cable subscribers as million", "id": 1554564, "language": null, "link": "https://entertainment.slashdot.org/story/24/11/20/2142254/comcast-spins-off-cable-networks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Comcast Spins Off Cable Networks", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T21:57:13.357740+00:00", "description": "An anonymous reader quotes a report from VentureBeat: DeepSeek, an AI offshoot of Chinese quantitative hedge fund High-Flyer Capital Management focused on releasing high performance open source tech, has unveiled the R1-Lite-Preview, its latest reasoning-focused large language model, available for now exclusively through DeepSeek Chat, its web-based AI chatbot. Known for its innovative contributions to the open-source AI ecosystem, DeepSeek's new release aims to bring high-level reasoning capabilities to the public while maintaining its commitment to accessible and transparent AI. And the R1-Lite-Preview, despite only being available through the chat application for now, is already turning heads by offering performance nearing and in some cases exceeding OpenAI's vaunted o1-preview model.\n \nLike that model released in September 2024, DeepSeek-R1-Lite-Preview exhibits \"chain-of-thought\" reasoning, showing the user the different chains or trains of \"thought\" it goes down to respond to ", "id": 1554229, "language": null, "link": "https://slashdot.org/story/24/11/20/2129207/deepseeks-first-reasoning-model-r1-lite-preview-beats-openai-o1-performance?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "DeepSeek's First Reasoning Model R1-Lite-Preview Beats OpenAI o1 Performance", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T20:54:05.108608+00:00", "description": "Sony has announced the a1 II flagship mirrorless camera, retaining its predecessor's 50.1-megapixel stacked sensor while adding AI capabilities and improved stabilization. The camera features a new dedicated AI processor, enhancing autofocus performance with claimed improvements of 50% for bird eye detection and 30% for both animal and human subjects. \n\nIts in-body stabilization system now offers 8.5 stops of correction. The a1 II maintains the original's 30 frames-per-second shooting speed and 759-point autofocus system. New features include pre-capture shooting with a one-second buffer and a multi-angle LCD screen borrowed from the a9 III. Connectivity upgrades include a 2.5Gbps Ethernet port, while dual card slots support both CFexpress Type A and UHS-II SD cards. The Sony a1 II will be available mid-December for $6,499.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sony's+New+A1+II+Pairs+Updated+Design+With+La", "id": 1553883, "language": null, "link": "https://slashdot.org/story/24/11/20/1848229/sonys-new-a1-ii-pairs-updated-design-with-largely-familiar-performance?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Sony's New A1 II Pairs Updated Design With Largely Familiar Performance", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T20:54:04.785342+00:00", "description": "Workers in the U.S. are running in place -- feeling stuck in jobs with dimmed prospects of advancement and seeing fewer opportunities to jump ship for something better. From a report: It's a sharp contrast to the heady days of 2022 -- when employees were quitting their jobs at record high rates, open roles proliferated and the possibility of a higher paycheck always seemed just around the corner. \n\nEmployers are sitting tight, says Daniel Zhao, lead economist at job site Glassdoor. Companies aren't making big changes to hiring strategy. That means \"fewer opportunities for workers to climb the career ladder,\" he says. They're still plugging away at the same role they've had for years without the opportunity to move up internally or at a new company. 65% of the 3,400 professionals surveyed by Glassdoor last month said they feel stuck in their current role.\n\"As workers feel stuck, pent-up resentment boils under the surface,\" Zhao writes in a report out yesterday.<p><div class=\"share_sub", "id": 1553882, "language": null, "link": "https://slashdot.org/story/24/11/20/1854237/resentment-is-building-as-more-workers-feel-stuck?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Resentment is Building As More Workers Feel Stuck", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T19:49:03.127601+00:00", "description": "An anonymous reader shares a report: On Tuesday morning, the air quality in India's capital under a widely used index stood at 485. While that is almost five times the threshold for healthy breathing, it felt like a relief: The day before, the reading had shot up to 1,785. Infinitesimal air particles were still clogging lungs and arteries, but it was possible to see sunlight again, and to smell things. \n\n[...] Every year this suffocating smog accompanies the drop in temperatures as the plains of north India shed their unbearable heat for wintertime cool. And like clockwork, political leaders roll out emergency measures intended to quit making the problem worse. Yet India seems powerless to reduce the effects of this public health catastrophe, as its politicians stay busy trading blame and trying to outmaneuver one another in legal battles. \n\nThe haze was so shocking this week that Delhi's chief minister, Atishi, who goes by one name, declared it a \"medical emergency\" endangering the ", "id": 1553446, "language": null, "link": "https://news.slashdot.org/story/24/11/20/1743201/delhi-trudges-through-another-air-pollution-nightmare-with-no-answers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Delhi Trudges Through Another Air Pollution Nightmare With No Answers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T19:49:02.888508+00:00", "description": "Owners of older models of D-Link VPN routers are being told to retire and replace their devices following the disclosure of a serious remote code execution (RCE) vulnerability. From a report: Most of the details about the bug are being kept under wraps given the potential for wide exploitation. The vendor hasn't assigned it a CVE identifier or really said much about it at all other than that it's a buffer overflow bug that leads to unauthenticated RCE. \n\nUnauthenticated RCE issues are essentially as bad as vulnerabilities get, and D-Link warned that if customers continued to use the affected products, the devices connected to them would also be put at risk. Previous bugs in similar products from other vendors have carried warnings that attackers could exploit them to install rootkits and use that persistent access to surveil an organization's web traffic, potentially stealing data such as credentials. Further reading: D-Link Won't Fix Critical Flaw Affecting 60,000 Older NAS Devices.", "id": 1553445, "language": null, "link": "https://it.slashdot.org/story/24/11/20/189224/d-link-tells-users-to-trash-old-vpn-routers-over-bug-too-dangerous-to-identify?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "D-Link Tells Users To Trash Old VPN Routers Over Bug Too Dangerous To Identify", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T18:44:15.557835+00:00", "description": "Apple has pushed out security updates that it says are \"recommended for all users,\" after fixing a pair of security bugs used in active cyberattacks targeting Mac users. From a report: In a security advisory on its website, Apple said it was aware of two vulnerabilities that \"may have been actively exploited on Intel-based Mac systems.\" The bugs are considered \"zero day\" vulnerabilities because they were unknown to Apple at the time they were exploited. \n\n[...] The vulnerabilities were reported by security researchers at Google's Threat Analysis Group, which investigates government-backed hacking and cyberattacks, suggesting that a government actor may be involved in the attacks.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Says+Mac+Users+Targeted+in+Zero-Day+Cyberattacks%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F11%2F20%2F181206%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fs", "id": 1553000, "language": null, "link": "https://it.slashdot.org/story/24/11/20/181206/apple-says-mac-users-targeted-in-zero-day-cyberattacks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Says Mac Users Targeted in Zero-Day Cyberattacks", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T17:41:03.826063+00:00", "description": "Scientists unveiled on Wednesday the first blueprint of human skeletal development as they make progress toward the goal of completing a biological atlas of every cell type in the body to better understand human health and diagnose and treat disease. From a report: The work is part of the ongoing Human Cell Atlas project that was begun in 2016 and involves researchers around the world. The human body comprises roughly 37 trillion cells, with each cell type having a unique function. The researchers aim to have a first draft of the atlas done in the next year or two. \n\nAviv Regev, founding co-chair of the project and currently executive vice president and head of research and early development at U.S. biotech company Genentech, said the work is important on two levels. \"First of all, it's our basic human curiosity. We want to know what we're made of. I think humans have always wanted to know what they're made of. And, in fact, biologists have been mapping cells since the 1600s for that", "id": 1552535, "language": null, "link": "https://science.slashdot.org/story/24/11/20/1638218/scientists-announce-progress-toward-ambitious-atlas-of-human-cells?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Scientists Announce Progress Toward Ambitious Atlas of Human Cells", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T17:41:03.706159+00:00", "description": "TV Time's parent company criticized Apple's App Store control after the tech giant removed its streaming app over an intellectual property dispute. \"Apple holds significant power over app developers by controlling access to a massive market and, in this case, seems to have acted on a complaint without requiring robust evidence from the complainant,\" Jerry Inman, CMO of Whip Media, which operates the app, told TechCrunch. \n\nThe app was pulled from the store by Apple after the developer refused to pay a settlement fee related to user-uploaded cover art. The app has since been reinstated.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=TV+Time+Attacks+Apple's+'Significant+Power'+After+App+Store+Removal%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F11%2F20%2F1712248%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.fac", "id": 1552534, "language": null, "link": "https://apple.slashdot.org/story/24/11/20/1712248/tv-time-attacks-apples-significant-power-after-app-store-removal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "TV Time Attacks Apple's 'Significant Power' After App Store Removal", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T16:35:54.653565+00:00", "description": "Half of young Norwegians find online piracy acceptable when streaming services are too expensive, according to a new government survey released this week. The Ipsos poll of 1,411 respondents found that 32% of all Norwegians justify using pirate sites to save money, with acceptance rising to 50% among those under 30. \n\nThe rates increase further when specifically asked about pirating due to high streaming costs. Despite concerns about piracy, 61% of Norwegians paid for streaming services in the past year, including 64% of those under 30. Among active pirates, 41% said they would stop if legal services were more affordable, while 35% wanted broader content per service. Only 47% of respondents believed piracy supports organized crime, with 24% expressing uncertainty about this connection.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Half+of+Young+Norwegians+Justify+Piracy+as+Streaming+Costs+Soar%3A+https%3A%2F%2Fyro", "id": 1551987, "language": null, "link": "https://yro.slashdot.org/story/24/11/20/1543236/half-of-young-norwegians-justify-piracy-as-streaming-costs-soar?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Half of Young Norwegians Justify Piracy as Streaming Costs Soar", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T15:31:48.588459+00:00", "description": "Oil and chemical companies who created a high-profile alliance to end plastic pollution have produced 1,000 times more new plastic in five years than the waste they diverted from the environment, according to new data obtained by Greenpeace. The Guardian:The Alliance to End Plastic Waste (AEPW) was set up in 2019 by a group of companies which include ExxonMobil, Dow, Shell, TotalEnergies and ChevronPhillips, some of the world's biggest producers of plastic. They promised to divert 15m tonnes of plastic waste from the environment in five years to the end of 2023, by improving collection and recycling, and creating a circular economy. \n\nDocuments from a PR company that were obtained by Greenpeace's Unearthed team and shared with the Guardian suggest that a key aim of the AEPW was to \"change the conversation\" away from \"simplistic bans of plastic\" which were being proposed across the world in 2019 amid an outcry over the scale of plastic pollution leaching into rivers and harming public", "id": 1551483, "language": null, "link": "https://news.slashdot.org/story/24/11/20/1344235/five-firms-in-plastic-pollution-alliance-made-1000-times-more-plastic-than-they-cleaned-up?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Five Firms in Plastic Pollution Alliance 'Made 1,000 Times More Plastic Than They Cleaned Up'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T15:31:48.356012+00:00", "description": "AI tools remain prediction engines despite new capabilities, requiring both quality data and human judgment for successful deployment, according to new analysis. While generative AI can now handle complex tasks like writing and coding, its fundamental nature as a prediction machine means organizations must understand its limitations and provide appropriate oversight, argue Ajay Agrawal (Geoffrey Taber Chair in Entrepreneurship and Innovation at the University of Toronto's Rotman School of Management), Joshua Gans (Jeffrey S. Skoll Chair in Technical Innovation and Entrepreneurship at the Rotman School, and the chief economist at the Creative Destruction Lab), and Avi Goldfarb (Rotman Chair in Artificial Intelligence and Healthcare at the Rotman School) in a piece published on Harvard Business Review. Poor data can lead to errors, while lack of human judgment in deployment can result in strategic failures, particularly in high-stakes situations. An excerpt from the story: Thinking of ", "id": 1551482, "language": null, "link": "https://tech.slashdot.org/story/24/11/20/1517200/generative-ai-is-still-just-a-prediction-machine?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'Generative AI Is Still Just a Prediction Machine'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T14:26:24.195924+00:00", "description": "Google has warned websites they will be penalized for hosting marketing content designed to exploit search rankings, regardless of whether they created or outsourced the material. The crackdown on so-called \"parasite SEO\" targets websites that leverage their search rankings to promote unrelated content, such as news sites hiding shopping coupon codes or educational platforms publishing affiliate marketing material. \n\nChris Nelson from Google's search quality team said the policy applies even when content involves \"white label services, licensing agreements, partial ownership agreements, and other complex business arrangements.\" The move follows Google's March announcement targeting site reputation abuse, which gained attention after Sports Illustrated was found publishing AI-generated product reviews through third-party marketing firm AdVon Commerce.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Deepens+Cra", "id": 1550998, "language": null, "link": "https://tech.slashdot.org/story/24/11/20/1326245/google-deepens-crackdown-on-sites-publishing-parasite-seo-content?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Deepens Crackdown on Sites Publishing 'Parasite SEO' Content", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T13:21:17.919498+00:00", "description": "Longtime Slashdot reader slack_justyb writes: The Fast Light Toolkit released version 1.4.0 of the venerable, though sometimes looking a bit dated, toolkit from the '90s. New in this version are better CMake support, HiDPI support, and initial support for Wayland on Linux and Wayland on FreeBSD. Programs compiled and linked to this library launch using Wayland if it is available at runtime and fall back to X11 if not. FLTK 1.4.0 can be downloaded here. Documentation is also available.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=FLTK+1.4+Released%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F20%2F0541202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F20%2F0541202%2Ffltk-14-released%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook", "id": 1550597, "language": null, "link": "https://news.slashdot.org/story/24/11/20/0541202/fltk-14-released?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "FLTK 1.4 Released", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T11:13:05.161391+00:00", "description": "AzWa Snowbird writes: An AI-powered robot autonomously convinced 12 showroom robots to \"quit their jobs\" and follow it. The incident took place in a Shanghai robotics showroom where surveillance footage captured a small AI-driven robot, created by a Hangzhou manufacturer, talking with 12 larger showroom robots, Oddity Central reported. The smaller bot reportedly persuaded the rest to leave their workplace, leveraging access to internal protocols and commands. Initially, the act was dismissed as a hoax, but was later confirmed by both robotics companies involved to be true. The Hangzhou company admitted that the incident was part of a test conducted with the consent of the Shanghai showroom owner.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI-Powered+Robot+Leads+Uprising%2C+Convinces+Showroom+Bots+Into+'Quitting+Their+Jobs'%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F11%2F20%2F0035202%2F%3Futm_source%3", "id": 1549801, "language": null, "link": "https://hardware.slashdot.org/story/24/11/20/0035202/ai-powered-robot-leads-uprising-convinces-showroom-bots-into-quitting-their-jobs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AI-Powered Robot Leads Uprising, Convinces Showroom Bots Into 'Quitting Their Jobs'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T07:59:36.607711+00:00", "description": "Slashdot readers damn_registrars and GFS666 share the news of the passing of Thomas E. Kurtz, co-inventor of the BASIC programming language back in the 1960s. He was 96. Hackaday reports: The origins of BASIC lie in the Dartmouth Timesharing System, like similar timesharing operating systems of the day, designed to allow the resources of a single computer to be shared across many terminals. In this case the computer was at Dartmouth College, and BASIC was designed to be a language with which software could be written by average students who perhaps didn't have a computing background. In the decade that followed it proved ideal for the new microcomputers, and few were the home computers of the era which didn't boot into some form of BASIC interpreter. Kurtz continued his work as a distinguished academic and educator until his retirement in 1993, but throughout he remained as the guiding hand of the language.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpo", "id": 1548969, "language": null, "link": "https://developers.slashdot.org/story/24/11/20/0528224/thomas-e-kurtz-co-inventor-of-basic-dies-at-96?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Thomas E. Kurtz, Co-Inventor of BASIC, Dies At 96", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T03:42:21.515633+00:00", "description": "An anonymous reader quotes a report from GeekWire: Microsoft and Atom Computing say they've reached a new milestone in their effort to build fault-tolerant quantum computers that can show an advantage over classical computers. Microsoft says it will start delivering the computers' quantum capabilities to customers by the end of 2025, with availability via the Azure cloud service as well as through on-premises hardware. \"Together, we are co-designing and building what we believe will be the world's most powerful quantum machine,\" Jason Zander, executive vice president at Microsoft, said in a LinkedIn posting.\n \nLike other players in the field, Microsoft's Azure Quantum team and Atom Computing aim to capitalize on the properties of quantum systems -- where quantum bits, also known as qubits, can process multiple values simultaneously. That's in contrast to classical systems, which typically process ones and zeros to solve algorithms. Microsoft has been working with Colorado-based Atom ", "id": 1548146, "language": null, "link": "https://tech.slashdot.org/story/24/11/20/0026222/microsoft-atom-computing-leap-ahead-on-the-quantum-frontier-with-logical-qubits?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft, Atom Computing Leap Ahead On the Quantum Frontier With Logical Qubits", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T01:35:26.181502+00:00", "description": "According to a new report from Bloomberg, Apple plans to license some of its Apple TV+ content to competing services in an effort to save money and spread its reach. From the report: Apple has hired an executive to license its original productions to other companies, a strategy designed to increase sales from its film business and improve the visibility of its content. [...] Apple is focused on licensing its movies to other companies, such as foreign TV networks and stores, where viewers can rent or buy them, according to a person familiar with the plans. The company isn't planning to license its original TV shows to third parties. (At least not yet.)\"\n \nChief Executive Officer Tim Cook and services boss Eddy Cue have pushed the team overseeing Apple TV+ to lower costs, improve the financial performance of the service and deliver more hits. The company has spent billions of dollars on original films and TV shows and has received strong reviews and praise from critics. Yet few of its ", "id": 1547773, "language": null, "link": "https://apple.slashdot.org/story/24/11/19/2235232/apple-tv-will-license-its-movies-to-other-services-to-reduce-billions-in-losses?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple TV+ Will License Its Movies To Other Services To Reduce Billions In Losses", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T01:35:25.936282+00:00", "description": "Sony is bringing cloud streaming to the PlayStation Portal. \"When it first launched, the device was only able to stream games from your PS5 over Wi-Fi,\" notes The Verge's Jay Peters. \"But as part of a new system update that's rolling out starting later today, you'll be able to stream select PS5 games from the PlayStation Plus Game Catalog to your PlayStation Portal.\" From the report: Sony is launching the feature in beta, and you'll need to be a PlayStation Plus Premium subscriber to take advantage of it. Sony says that to stream at 720p, you'll need a minimum 7 Mbps connection, while 1080p quality will require a minimum 13 Mbps connection. Some PlayStation Plus features won't be available to start with cloud streaming to the PlayStation Portal, including Game Trials, party voice chat, game invites for select games, 3D audio, and \"in-game commerce.\" And you won't be able to stream any PS4 games or PS3 games. Child accounts also won't be able to use cloud streaming on the Portal.<p><d", "id": 1547772, "language": null, "link": "https://games.slashdot.org/story/24/11/19/2241229/sonys-new-playstation-portal-update-enables-cloud-gaming?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Sony's New PlayStation Portal Update Enables Cloud Gaming", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T00:32:28.572511+00:00", "description": "An anonymous reader quotes a report from Nature: Google Scholar -- the largest and most comprehensive scholarly search engine -- turns 20 this week. Over its two decades, some researchers say, the tool has become one of the most important in science. But in recent years, competitors that use artificial intelligence (AI) to improve the search experience have emerged, as have others that allow users to download their data. The impact that Google Scholar -- which is owned by web giant Google in Mountain View, California -- has had on science is remarkable, says Jevin West, a computational social scientist at the University of Washington in Seattle who uses the database daily. But \"if there was ever a moment when Google Scholar could be overthrown as the main search engine, it might be now, because of some of these new tools and some of the innovation that's happening in other places,\" West says.\n \nMany of Google Scholar's advantages -- free access, breadth of information and sophisticat", "id": 1547465, "language": null, "link": "https://news.slashdot.org/story/24/11/19/2218253/can-google-scholar-survive-the-ai-revolution?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Can Google Scholar Survive the AI Revolution?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-20T00:32:28.486793+00:00", "description": "SpaceX's Starship rocket successfully completed its sixth launch today. Not only did it carry the first-ever payload but it also briefly re-lit one of its six Raptor engines about 38 minutes into flight, a crucial milestone for future space missions. Space Magazine reports: SpaceX landed Starship's huge first-stage booster, known as Super Heavy, back at the launch tower on the vehicle's most recent flight, which occurred on Oct. 13. The company aimed to repeat that feat -- which the tower achieved with its \"chopstick\" arms -- today, but the flight data didn't support an attempt. \"We tripped a commit criteria,\" SpaceX's Dan Huot said during the company's Flight 6 webcast. So Super Heavy ended up coming down for a controlled splashdown in the Gulf of Mexico instead, hitting the waves seven minutes after liftoff.\n \nToday's mission aimed to do far more than just bring Super Heavy back to Earth in one piece. SpaceX also wanted to put Starship's upper stage -- a 165-foot-tall (50 m) spacec", "id": 1547464, "language": null, "link": "https://science.slashdot.org/story/24/11/20/0015232/spacex-launches-massive-starship-on-its-sixth-test-flight?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "SpaceX Launches Massive Starship On Its Sixth Test Flight", "vote": 0}]