[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-26T09:00:53+00:00", "description": "Bobby Carter | April 26, 2024\nThere's nothing like hearing the oohs and aahs from the Tiny Desk audience when a recognizable note hits the soul. Ne-Yo's setlist stoked up audible gasps with nonstop hits from his catalog and a few he's written for megastars. He came draped in a bedazzled outfit and his signature fedora (one we had to ask him to adjust to see his eyes.) Not to be outdone, the band came outfitted in matching earth tones and sounded just as good as they looked.\n\nAs with most artists who've spent years on the radio, the charts and in the club, the challenge in our space is encapsulating those moments. He accepted this challenge by putting together a medley of some of his most celebrated jams, showing off just how prolific his pen is. \"I've written a couple songs since I've been doing this thang,\" the singer said before passing Rihanna's \"Take a Bow\" to background singer, Pamela Westbrook. Before the premiere of his \"confessional,\" the song \"Two Million Secrets,\" the singer", "language": null, "link": "https://www.youtube.com/watch?v=vR6_ZVKEhJ4", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "source_obj__id": 225, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/vR6_ZVKEhJ4/hqdefault.jpg", "title": "Ne-Yo: Tiny Desk Concert", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-26T09:00:21+00:00", "description": "Tom Huizenga | April 26, 2024\n\nI knew we were in for something spectacular when the Norwegian soprano Lise Davidsen came to our Tiny Desk — especially when she could be heard, loud and clear, from far down the hall, warming up in our green room. Once she got to the Desk itself, to rehearse with pianist and Metropolitan Opera assistant conductor Bryan Wagorn, the sublime amplitude of her extraordinary voice rendered the space even tinier.\nDavidsen’s voice, which is incongruously gigantic and intimate, has been called “one-in-a-million.” I was completely sold on the hype after only a few seconds of singing. A couple of us reached for tissues to wipe away tears of disbelief. The voice gleams like pure polished silver, powerful enough to surge past massive orchestras and yet capable of paring down to a single silvery strand of tone, perfectly supported to reach the rafters.\n\nIt’s all the more remarkable since Davidsen was already in her 20s before she saw an opera for the first time. Her ", "language": null, "link": "https://www.youtube.com/watch?v=TR2hG7ke2YQ", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "source_obj__id": 225, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/TR2hG7ke2YQ/hqdefault.jpg", "title": "Lise Davidsen: Tiny Desk Concert", "user": null, "vote": 0}]