[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-26T19:30:03+00:00", "description": "For what early access has to offer, it's worth trying, especially with its different scenario objectives, ranging from peaceful to outright domination and difficulty sliders to customize your experience. \n\nWhether or not it caters to others' expectations and offers this sweeping medieval playground or a peaceful city-builder that makes you ponder each decision carefully, Manor Lords is an all-around solid title. Albeit one that needs more time to grow, yet equipped with its own charm and engaging gameplay loop right out of the gate.", "language": null, "link": "https://www.youtube.com/watch?v=_-ByZjHb5w8", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/_-ByZjHb5w8/hqdefault.jpg", "title": "Manor Lords Early Access Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-26T17:30:06+00:00", "description": "What started life as an absolute disaster of a game in late 2018 has turned itself around in remarkable fashion over the years. Fallout 76 has enjoyed consistently solid support from Bethesda with new updates and content additions over the years, owing to which it has built up a sizable and dedicated player base. Recent weeks, in fact, have seen that player base growing at an even faster rate, thanks to the explosion in popularity that the Fallout franchise has enjoyed as a whole courtesy of the success of Amazon Prime's recently released adaptation.\n\nFallout 76 has, as such, seen a large number of new players jumping in for the first time, and looking at its current momentum, it's safe to say that that surge will continue for a while. If you're among those who're gearing up to step out of Vault 76 for the first time, here, we've compiled a few key details that you should know about Bethesda's multiplayer RPG.", "language": null, "link": "https://www.youtube.com/watch?v=lGMhV3X1lOU", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/lGMhV3X1lOU/hqdefault.jpg", "title": "Fallout 76 - 15 Things To Know Before You Purchase (For Newcomers)", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-26T13:30:09+00:00", "description": "Stellar Blade is a technically sound game that makes good use of Unreal Engine 4’s visual features to paint a world that is brimming with detail. Despite not making use of cutting-edge technologies like ray tracing, developer Shift Up has delivered a quality experience through and through. \n\nThe performance does exhibit occasional dips in the framerate department, but it generally does a good job of holding its targets - which rounds out this surprisingly polished experience from a previously unproven developer.", "language": null, "link": "https://www.youtube.com/watch?v=DqM8o6Nm7aE", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/DqM8o6Nm7aE/hqdefault.jpg", "title": "Stellar Blade PS5 Graphics Analysis - Technically Stunning", "user": null, "vote": 0}]