[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-24T19:30:01+00:00", "description": "Moon Studios' No Rest for the Wicked is a Souls-like, survival-lite, town-building, platforming, action RPG with a heavy narrative focus. You may think it just needs farming and co-op to complete the ensemble of genres. Don't worry - those are on the way in subsequent updates.\n\nAvailable for PC via Steam Early Access, it's a stunning title with a grim medieval fantasy aesthetic and unique premise, not to mention strong characterization and voice acting. The combat response is also something to behold, with a solid weight and heft. It would seem to have all the ingredients for success. And it's getting there. Slowly.\n\nWhat's here may be worth checking out, but No Rest for the Wicked still needs more work with its enemy balancing, scaling, movement, inventory management and performance before it can achieve greatness.", "language": null, "link": "https://www.youtube.com/watch?v=M2yyrzd-gtY", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/M2yyrzd-gtY/hqdefault.jpg", "title": "No Rest for The Wicked Early Access Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-24T17:30:00+00:00", "description": "With the Fallout franchise enjoying a surge of popularity, it's interesting to look back on what could have been. What would be the result if Bethesda had focused on developing and releasing Fallout 5 instead of Starfield?\n\nWhile the latter earned its fair share of acclaim for the studio attempting new things, especially on such a massive scale, it already had a strong base with Fallout 4. It could have devoted the time and resources to the next single-player-focused title in its post-apocalyptic franchise, building on it further and providing something more contemporary for all the newer players to enjoy.\n\nBethesda may have even applied its learnings from Far Harbor and created a more compelling experience for the hardcore. Would things have worked out so perfectly? Join us as we ponder the same.", "language": null, "link": "https://www.youtube.com/watch?v=488jO5Ip98c", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/488jO5Ip98c/hqdefault.jpg", "title": "Should Bethesda Have Developed Fallout 5 Instead of Starfield?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-24T14:00:41+00:00", "description": "Stellar Blade feels like a blast from the past in the best way possible. In everything from its setting to its combat, it wears its inspirations on its sleeves, and though the result is a game that doesn’t necessarily tread new ground in any meaningful way, its qualities are undeniable. \n\nIts sci-fi post-apocalyptic world is brimming with scenery, its combat is fast and fluid and consistently a blast, and it boasts a staggering amount of variety in the enemies that you fight. \n\nSporting higher production values than many would expect, Stellar Blade brings its vision to life in impressive fashion, even if some non-combat related parts of the gameplay experience – like the platforming – can drag things down at times.", "language": null, "link": "https://www.youtube.com/watch?v=tnnEoV7mBEc", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/tnnEoV7mBEc/hqdefault.jpg", "title": "Stellar Blade PS5 Review - The Final Verdict", "user": null, "vote": 0}]