[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Batman Arkham Trilogy Switch Review - ARKHAM KNIGHT IS A DUMPSTER FIRE!", "description": "Batman: Arkham Trilogy on the Switch is tough to recommend. There are surely reasons to purchase this package, primarily the fact that the incredible Arkham Asylum and Arkham City are still unmissable experiences, even if their Switch ports have some performance issues. \n\nHowever, the trilogy’s version of Arkham Knight is an absolute mess, to the extent that it’s hard to believe it was allowed to release. It looks ugly as sin, it runs like an absolute dumpster fire, and absolutely none of the game’s strengths – of which it admittedly has many – are able to rise to the surface in this horrid port. That, combined with the fact that even Asylum and City have better versions available on other platforms, makes this collection a tough sell.", "link": "https://www.youtube.com/watch?v=iJaZOHSK6f4", "date_published": "2023-12-07T17:30:05+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/iJaZOHSK6f4/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "10 Beginners Tips And Tricks Avatar: Frontiers of Pandora Doesn't Tell You", "description": "As gorgeous as it is, the Western Frontier in Avatar: Frontiers of Pandora can be unforgiving, especially when jumping in for the first time. If it's not the RDA that's out to get you, it's the wildlife which can attack at a moment's notice or scrounge for different materials.\n\nFortunately, there are several ways to survive. Hunting without guns to ensure the best materials, various Skills, and the Hunter's Guide are just some ways to thrive in the wilderness and gain an edge. Of course, completing some side quests for better gear also doesn't hurt.\n\nCheck out these ten tips and tricks before playing Avatar: Frontiers of Pandora.", "link": "https://www.youtube.com/watch?v=QsfL_ACFvfQ", "date_published": "2023-12-07T12:30:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/QsfL_ACFvfQ/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "GTA 6's Main Duo Are Going To BLOW OUR MINDS", "description": "There’s never any shortage of reasons to be excited about a new Grand Theft Auto game, and the protagonist is often one of the biggest ones. Like its predecessor, Grand Theft Auto 6 is set to feature multiple protagonists – two this time, instead of three – and though we have only seen a tiny little bit of them in the game’s reveal trailer so far, we’re already more than a little excited to be spending more time with them. \n\nNot only are they promising to bring a fresh dynamic to Rockstar storytelling that we haven’t seen before, Rockstar’s own excellent track record with protagonists also paints an exciting picture for GTA 6. Here, we talk about all of that and more.", "link": "https://www.youtube.com/watch?v=Zj1xWSJfL2E", "date_published": "2023-12-07T07:00:12+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/Zj1xWSJfL2E/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]