[{"artist": "GamingBolt", "age": null, "source_obj__id": 208, "thumbnail": "https://i4.ytimg.com/vi/gPjZ1oIQRZY/hqdefault.jpg", "bookmarked": false, "tags": [], "page_rating_votes": 0, "permanent": false, "user": null, "page_rating_visits": 0, "link": "https://www.youtube.com/watch?v=gPjZ1oIQRZY", "album": "", "page_rating": 0, "date_published": "2024-02-03T18:30:29+00:00", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "dead": false, "language": null, "title": "What The Hell Is Going On In Death Stranding 2?", "page_rating_contents": 0, "comments": [], "description": "When Hideo Kojima releases a new game for one of his upcoming games, you’re pretty much guaranteed to be in for something of a rollercoaster, something that was proven yet again with the enormous trailer for Death Stranding 2: On the Beach as part of Sony’s recent State of Play presentation. \n\nFrom how the upcoming sequel’s setting is building on the events of the first game to the characters that will populate that setting to what we can expect in terms of gameplay shake-ups and improvements, after the recent trailer, we have no shortage of questions about Death Stranding 2, as well as observations from the trailer that reveal some intriguing details. \n\nHere, we’re going to talk about all of that and more.", "vote": 0}, {"artist": "GamingBolt", "age": null, "source_obj__id": 208, "thumbnail": "https://i2.ytimg.com/vi/1sAz0fFFq58/hqdefault.jpg", "bookmarked": false, "tags": [], "page_rating_votes": 0, "permanent": false, "user": null, "page_rating_visits": 0, "link": "https://www.youtube.com/watch?v=1sAz0fFFq58", "album": "", "page_rating": 0, "date_published": "2024-02-03T10:30:01+00:00", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "dead": false, "language": null, "title": "Suicide Squad: Kill The Justice League Review (Including Endgame Verdict)", "page_rating_contents": 0, "comments": [], "description": "Suicide Squad: Kill the Justice League is finally here, and between an inconsequential story, uneven dialogue, repetitive activities, lackluster enemy variety and various other issues, it manages to be aggressively mediocre. The cast turns in solid performances, and the cutscenes are well-animated, even as the story goes off the rails. \n\nThere's even some fun loot to earn, and once you get the hang of the traversal, the gameplay isn't half-bad. However, those expecting a well-rounded story with a satisfying conclusion - or smooth segue into post-launch seasons - will be disappointed. Those hoping for a hefty endgame with fresh, fulfilling activities will also be left wanting. \n\nSuicide Squad: Kill the Justice League isn't the worst game ever made, but it's a massive step down for Rocksteady and a reminder, once again, of the perils of live service.", "vote": 0}]