[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-13T16:30:01+00:00", "description": "From 2019’s Resident Evil 2 to 2020’s Final Fantasy 7 Remake to Final Fantasy 7 Rebirth just a few months ago, we have seen more than a few times in recent years that even though it can be a huge risk for remakes to deviate from the script, if they do it well, it can also pay off handsomely.\n\n That was the approach that many were hoping the upcoming Metal Gear Solid Delta: Snake Eater would take, so it’s unsurprising to see people reacting disappointingly to how faithful of a remake of Metal Gear Solid 3 it is going to be. \n\nAnd while that is easy to understand, given the unique situation that Metal Gear is (and has been in for several years), playing it safe is perhaps the smartest thing that Konami can do for the IP right now.", "id": 859789, "language": null, "link": "https://www.youtube.com/watch?v=6uU6nfOZqJE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/6uU6nfOZqJE/hqdefault.jpg", "title": "Is Metal Gear Solid: Delta Snake Eater Playing It TOO SAFE?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-13T13:30:03+00:00", "description": "If you’re a fan of first person shooters, you have probably not had a lack of great options to choose between over the course of more than the last two decades or so, if not even longer, but given how popular the genre has been for so long, it also goes without saying that we have seen our fair share of terrible first person shooters in our time. \n\nFrom low effort licensed games and uninspired sequels to unbelievably broken remakes and so much more, we’ve had to endure quite a few awful shooters over the years, and here, that is exactly what we will be talking about. Join us as we go over what we feel are some of the worst first person shooters ever made.", "id": 859211, "language": null, "link": "https://www.youtube.com/watch?v=5MTRchVZxAA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/5MTRchVZxAA/hqdefault.jpg", "title": "15 Worst First Person Shooters Gamers Wish Never Existed", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-13T07:45:01+00:00", "description": "Overall, Once Human still elicits a mixed reaction. It's not bad – there are far worse survival crafting games with less enjoyable gameplay loops and more grinding. \n\nThe mashing of multiple different titles and genres, from looter shooters to horror and MMOs, is easy to get lost in, despite the wild tonal shifts. That feeling of mimicking other, superior games is present, like with The First Descendant, but at least the lore and cosmic horror aspects have something to them. \n\nFor now, it could use more original ideas, revamp its blueprint system, better story-telling, etc. alongside more features and quality-of-life changes.", "id": 858118, "language": null, "link": "https://www.youtube.com/watch?v=kUjNaDJ-NYA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/kUjNaDJ-NYA/hqdefault.jpg", "title": "Once Human Review - The Final Verdict", "user": null, "vote": 0}]