[{"source": "https://www.arabnews.com/rss.xml", "title": "‘We know how violence ends, and the consequences,’ Somalia’s president tells Arab News", "description": "RIYADH: Somalia knows from bitter experience that a political end cannot be reached by means of violence, Hassan Sheikh Mohamud, the Somali president, has said, discussing the ongoing cycle of violence between Israel and the Palestinians.\n\n\tAfter decades of political instability, terrorist violence, and foreign intervention, the war-scarred nation on the Horn of Africa has seen a gradual shift toward stabilization, reflected in its recent outreach to African neighbors and the Arab world.", "link": "https://www.arabnews.com/node/2408136/middle-east", "date_published": "2023-11-13T07:11:53+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Yanbu gets largest hypermarket with new LuLu store", "description": "LuLu Group International has announced the opening of its new outlet in the port city of Yanbu, located on the Red Sea coast of Saudi Arabia.\n\n\tThe store — the largest hypermarket in the city — was declared open by Prince Faisal bin Salman Al-Saud, governor of Madinah. He congratulated the LuLu Group on the new store and commended the group’s role in Saudi Arabia’s growth.", "link": "https://www.arabnews.com/node/2407791/corporate-news", "date_published": "2023-11-13T07:11:47+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Jailed former Philippine senator granted bail: Lawyer", "description": "MANILA: Jailed Philippine former senator Leila de Lima was granted bail on Monday, her lawyer said.\n\t“Bail granted,” Filibon Tacardon said in a message sent to reporters.\n\tOutside the court, Tacardon said: “We’re ecstatic, happy. Ma’am (de Lima) cried.”\n\tDe Lima, one of the most outspoken critics of former president Rodrigo Duterte and his deadly anti-drug war, has been in prison for nearly seven years on narcotics-related charges.\n\tShe says the three charges — two of which have been dismissed — were fabricated to silence her.", "link": "https://www.arabnews.com/node/2407786/world", "date_published": "2023-11-13T07:11:13+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "All 40 workers in India tunnel collapse ‘safe’", "description": "DEHRADUN, India: Rescue workers in northern India said Monday they had made contact with 40 workers trapped for over 24 hours after the road tunnel they were building collapsed.\n\t“All the 40 workers trapped inside the tunnel are safe,” Karamveer Singh Bhandari, a senior commander in the National Disaster Response Force said, from the site in the Himalayan state of Uttarakhand. “We sent them water and food.”\n\tThe collapse occurred early Sunday morning, with rescue teams using heavy excavators to clear piles of debris in desperate efforts to reach the 40 men.", "link": "https://www.arabnews.com/node/2407781/world", "date_published": "2023-11-13T06:11:56+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "40 Spanish citizens evacuate Gaza through the Rafah border crossing", "description": "LONDON: Around 40 Palestinians of Spanish nationality left Gaza on Monday through the Rafah border crossing, the Spanish Foreign Ministry announced.\n\n\tSpanish Foreign Minister Jose Manuel Albares said that half of the group were minors. Meanwhile, 180 people of dual Spanish-Palestinian nationality remain in Gaza.\n\n\tAlbares added that the citizens, along with their spouses and family members, will be evacuated from Gaza in groups of 30 to 40 people in the coming days and transported to Spain via Egypt.", "link": "https://www.arabnews.com/node/2408131/middle-east", "date_published": "2023-11-13T06:11:22+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi Crown Prince, Eritrean president hold meeting in Riyadh", "description": "RIYADH: Saudi Crown Prince Mohammed bin Salman met with President Isaias Afwerki of Eritrea in Riyadh on Monday, the Saudi Press Agency reported.\n\n\tThe two leaders discussed Saudi-Eritrean relations and opportunities for joint cooperation between the countries, particularly in the development and trade sectors.\n\n\tA number of other issues of regional and international importance were also discussed.", "link": "https://www.arabnews.com/node/2408116/saudi-arabia", "date_published": "2023-11-13T06:11:18+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Miss Universe Bahrain embraces responsibility ahead of El Salvador pageant", "description": "DUBAI: Lujane Yacoub has been planning her gap year for a while, but things have gotten more interesting than she could have anticipated. Yacoub was crowned Miss Universe Bahrain 2023 at the age of 19 and is heading to the grand stage in El Salvador on Nov. 18.\n\n\tThe Miss Universe qualifying pageant is a young event in Bahrain — it only started in 2021, but it is already making waves. For Yacoub, the win has come with a whirlwind of change.", "link": "https://www.arabnews.com/node/2407776/lifestyle", "date_published": "2023-11-13T06:11:08+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Jordan’s lower house tasks legal committee to examine all Amman-Israel deals amid Gaza war", "description": "AMMAN: The Jordanian lower house on Monday tasked its legal committee with examining the agreements Jordan has signed with Israel.\n\n\tThe house speaker, Ahmad Safadi, proposed during Monday’s session that all Jordanian-Israeli agreements be examined by the legal committee, which will then refer its recommendations to the government for any necessary actions.\n\n\tNearly all lawmakers present during the session voted in favor of Safadi’s proposal.", "link": "https://www.arabnews.com/node/2408121/middle-east", "date_published": "2023-11-13T06:11:07+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Daesh fighter from torture-murder cell jailed in UK for 8 years", "description": "LONDON: A British Muslim convert who was allegedly part of the Daesh group’s notorious “Beatles” kidnap-and-murder cell was jailed for eight years for terrorist offenses on Monday.\n\tAine Davis, 39, had last month admitted two charges of financing terrorism between 2013 and 2014 and one of possessing a firearm for a purpose connected to terrorism.\n\tThe “Beatles” group, so called because of the members’ distinctive British accents, tortured and beheaded victims and released videos of the gruesome murders.", "link": "https://www.arabnews.com/node/2408096/world", "date_published": "2023-11-13T05:11:55+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Jordan focuses on attracting Kuwaiti investments", "description": "LONDON: Jordanian Investment Minister Kholoud Saqqaf stressed on Monday the importance of Kuwaiti investments in Jordan, which account for the country’s largest foreign investments in the finance, tourism, communications, energy, real estate, and infrastructure sectors.\n\n\tSaqqaf met with Kuwaiti Ambassador to Jordan Hamad Rashid Al-Marri on Monday to discuss ways to strengthen bilateral relations in the investment sector, Jordan News Agency reported.", "link": "https://www.arabnews.com/node/2408101/middle-east", "date_published": "2023-11-13T05:11:47+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Foreign ministers co-chair inaugural Saudi-Omani Coordination Council meeting", "description": "RIYADH: Saudi Foreign Minister Prince Faisal bin Farhan and his Omani counterpart, Sayyid Badr Al-Busaidi, co-chaired the inaugural meeting of the Saudi-Omani Coordination Council on Monday in Muscat.\n\n\tPrince Faisal highlighted the efforts by the leaderships of both countries to enhance the bilateral relationship and said: “The formation of the coordination council is a testament to our shared vision,” the Saudi Press Agency reported.\n\n\t“It is a platform that harnesses our collective potential with the goal of maximizing mutual benefits and interests.”", "link": "https://www.arabnews.com/node/2408111/saudi-arabia", "date_published": "2023-11-13T05:11:32+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Three Indian cities among world’s 10 most polluted after Diwali", "description": "NEW DELHI: Two Indian cities joined New Delhi to be among the world’s worst 10 for pollution on Monday morning, with smoke heavy in the air a day after revelers let loose with firecrackers for Diwali — the annual Hindu festival of light.\n\tThe capital New Delhi took, as it often does, the top spot. It had an air quality index (AQI) figure of 420, putting it the ‘hazardous’ category, according to Swiss group IQAir.", "link": "https://www.arabnews.com/node/2407761/offbeat", "date_published": "2023-11-13T04:11:49+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi manufacturing sector fast adopting new technologies, says Alkhorayef", "description": "RIYADH: Saudi Arabia is at the forefront of countries ready to embrace cutting-edge manufacturing technologies, the Kingdom’s minister of industry and mineral resources said on Monday.\n\n\tBandar Alkhorayef affirmed his outlook during his participation in the “RAD” Entrepreneurship Forum in the Eastern Province, noting that investment opportunities in the industrial sector have undergone radical changes, reported the Saudi Press Agency.", "link": "https://www.arabnews.com/node/2408086/business-economy", "date_published": "2023-11-13T04:11:39+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "UN flags at half-mast for staff killed in Gaza", "description": "BANGKOK: Flags flew at half-mast at United Nations compounds across Asia on Monday, as staff observed a minute’s silence in memory of colleagues killed in Gaza during the Israel-Hamas conflict.\n\tThe blue and white UN flag was lowered at 9:30 a.m. local time at offices in Bangkok, Tokyo and Beijing, a day after the world body reported “a significant number of deaths and injuries” in strikes on a facility in Gaza.\n\tThe UN agency for supporting Palestinians (UNRWA) announced on Friday that more than 100 of its employees had died in the Gaza Strip since the start of the war.", "link": "https://www.arabnews.com/node/2407751/world", "date_published": "2023-11-13T04:11:37+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Dubai Airshow opening as aviation soars following pandemic lockdowns, even as wars cloud horizon", "description": "DUBAI: The biennial Dubai Air Show opens Monday as airlines are poised to make major aircraft purchases after rebounding from the groundings of the coronavirus pandemic, even as Israel’s war with Hamas clouds regional security.That conflict, as well as Russia’s war on Ukraine, likely will influence the five-day show at Al Maktoum Airport at Dubai World Central. It is the city-state’s second airfield after Dubai International Airport, which is the world’s busiest for international travel and home base for the long-haul carrier Emirates.", "link": "https://www.arabnews.com/node/2407746/middle-east", "date_published": "2023-11-13T04:11:10+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Kenya’s Edwin Kiptoo wins Athens Marathon in a course record of 2:10:34", "description": "ATHENS: Kenya’s Edwin Kiptoo has won the 40th Athens Marathon in a course-record time of 2 hours, 10 minutes and 34 seconds.\n\n\tThe 30-year-old Kiptoo gradually shook off his main challengers, most of them his compatriots, over the second half of the course, running the last 10 kilometers alone.\n\n\tAs Kiptoo was crossing the finish line, about a 100 people in Athens’ Panathenaic stadium unfurled a banner saying “Free Palestine” and waved Palestinian flags. Some spectators also held and waved Palestinian flags along the course.", "link": "https://www.arabnews.com/node/2407716/sport", "date_published": "2023-11-13T03:11:58+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Lebanon front with Israel heats up, stoking fears of wider war", "description": "BEIRUT/JERUSALEM, Nov 13 : Weeks of hostilities across the Lebanese-Israeli border have escalated, with growing casualties on both sides and a war of words fueling concerns of a widening conflict between Israel and the Iran-backed Lebanese group Hezbollah.\n\tIsraeli strikes killed two people in south Lebanon on Monday, according to a first-responder organization affiliated to the Hezbollah-allied Amal Movement.", "link": "https://www.arabnews.com/node/2408081/middle-east", "date_published": "2023-11-13T03:11:28+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Lilia Vu surges to victory at LPGA’s The Annika, back to No. 1 in world", "description": "MIAMI: Lilia Vu grabbed her fourth LPGA title of the year on Sunday, firing a four-under par 66 to win The Annika by three strokes and return to the top of the world rankings.\n\n\tVu had five birdies and one bogey at Pelican Golf Club in Belleair, Florida, more than enough to overhaul overnight leader Emily Kristine Pedersen of Denmark.\n\n\tPedersen’s bid for a first US LPGA title stalled, the Dane finishing with two bogeys and a closing double-bogey that left her tied for fifth.", "link": "https://www.arabnews.com/node/2407711/golf", "date_published": "2023-11-13T03:11:22+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "COP28 president, EU climate commissioner meet in Brussels", "description": "LONDON: COP28 President Sultan bin Ahmed Al-Jaber met with EU Climate Commissioner Wopke Hoekstra on Monday in Brussels, Emirates News Agency reported.\n\n\tAl-Jaber and Hoekstra released a joint statement outlining several key elements that will shape COP28 outcomes.\n\n\t“COP28 must accelerate practical action on mitigation, adaptation, loss and damage and climate finance and build a fully inclusive COP28 that leaves no one behind,” the statement declared.", "link": "https://www.arabnews.com/node/2408076/middle-east", "date_published": "2023-11-13T03:11:11+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Green Falcons prep in Al-Ahsa for Pakistan, Jordan World Cup qualifiers", "description": "RIYADH: Saudi national team footballers trained in Al-Ahsa on Sunday ahead of World Cup qualifiers against Pakistan and Jordan.\n\tKhalid Al-Ghanam was called up to the side after Ayman Yahya was declared unfit by medical staff. Salem Al-Dawsari took part in a therapy program and did not train.\n\tThe team will face Pakistan in the Eastern Province on Thursday before they play Jordan on Tuesday to kick off a  campaign to get the Green Falcons back to the World Cup, taking place in 2026 in North America.", "link": "https://www.arabnews.com/node/2407646/saudi-football", "date_published": "2023-11-13T01:45:06.717821+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "US carries out two air strikes in Syria against Iran-aligned groups", "description": "WASHINGTON: The United States carried out strikes against two Iran-linked sites in Syria on Sunday in response to attacks on American personnel, Defense Secretary Lloyd Austin said.\n\tIt is the third time in less than three weeks that the US military has targeted locations in Syria it said were tied to Iran, which supports various armed groups that Washington blames for a spike in attacks on its forces in the Middle East.", "link": "https://www.arabnews.com/node/2407651/middle-east", "date_published": "2023-11-13T01:45:06.717333+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "OPEC slightly raises 2023 forecast for global oil demand", "description": "RIYADH: Blaming speculators for a drop in prices, the Organization of the Petroleum Exporting Countries on Monday said the market fundamentals were strong despite “exaggerated negative sentiments.”\n\n\tThe producers’ group in its monthly report also slightly raised its 2023 forecast for global oil demand growth and stuck to its relatively high 2024 prediction.\n\n\t“Recent data confirms robust major global growth trends and healthy oil market fundamentals,” OPEC said in a feature article at the start of its report.", "link": "https://www.arabnews.com/node/2407986/business-economy", "date_published": "2023-11-13T01:11:32+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Djokovic secures year-end No. 1 ranking for record-extending 8th time by beating Rune at ATP Finals", "description": "TURIN, Italy: Novak Djokovic has secured the year-end No. 1 ranking for a record-extending eighth time.\n\n\tDjokovic needed only one match win at the ATP Finals to be sure of keeping the top spot and the 24-time Grand Slam champion did it in his opener, beating Holger Rune 7-6 (4), 6-7 (1), 6-3 over more than three hours on Sunday and into Monday morning.\n\n\t“It was a very emotional and tough win because of the significance of tonight’s match,” Djokovic said. “That was added pressure, and attention.”", "link": "https://www.arabnews.com/node/2407706/tennis", "date_published": "2023-11-13T01:11:26+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Lyon finally taste victory in French league at 11th attempt", "description": "PARIS: Nearly six months after their last victory, seven-time champion Lyon finally got back to winning ways in the French league by beating 10-man Rennes 1-0 on Sunday.\n\n\tThat ended a 10-game winless run this season in the league for Lyon, whose previous win dated back last term to May 27, a 3-0 defeat of Reims.\n\n\t“It’s a big release. We’ve been waiting for this win for a long time,” Lyon midfielder Corentin Tolisso said.", "link": "https://www.arabnews.com/node/2407696/football", "date_published": "2023-11-13T01:11:17+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "World’s largest lights festival returns to Riyadh", "description": "RIYADH: Noor Riyadh, the largest global festival of light and art, returns to illuminate the Saudi capital from Nov. 30 following the resounding success of its previous two editions.\n\n\tAn initiative under Riyadh Art, it will host over 120 artworks by 100 artists from around the world, showcasing diverse practices and backgrounds such as performance art, architecture, engineering, graphic design and medicine.", "link": "https://www.arabnews.com/node/2407991/saudi-arabia", "date_published": "2023-11-13T01:11:14+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "New Zealand says 11 of its citizens have left Gaza for Egypt", "description": "WELLINGTON: New Zealand’s government on Monday said 11 New Zealanders left Gaza overnight on Sunday and entered Egypt via the Rafah border crossing.\n\tA Ministry of Foreign Affairs and Trade (MFAT) spokeswoman in an email said the people were met by a New Zealand consular team and provided with support.\n\tThe Middle Eastern territory has been bombarded by Israeli forces since early last month in retaliation for an attack by Palestinian militant group Hamas.", "link": "https://www.arabnews.com/node/2407691/world", "date_published": "2023-11-13T01:11:01+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Dur Hospitality inks partnership with TDS to become top pick for global travel agents", "description": "RIYADH: Saudi Arabia’s Dur Hospitality is set to be the preferred choice for global travel agents after it announced a strategic partnership with Travel Destinations Solutions. \n\n\tThe new agreement will allow Riyadh-based TDS to secure exclusive hotels for its business-to-business clients, promising competitive profit margins even amid peak religious festivities.   \n\n\tFormalized at World Travel Market London 2023, the partnership aims to bolster direct international sales for Dur Hospitality’s properties.", "link": "https://www.arabnews.com/node/2407971/business-economy", "date_published": "2023-11-13T00:11:46+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Emerging global trends to create $20tn development opportunities in next decade", "description": "RIYADH: Space manufacturing, advanced agriculture and the next generation of artificial intelligence are among a variety of prospective opportunities identified by the UAE government as outlined in a report.\n\n\tThrough a collaboration between the Government Development &amp; The Future Office and the New York-based Future Today Institute, the statement highlighted the key movements that will help leaders and decision-makers to keep pace and prepare for rapid global transformations worth around $20 trillion over the next decade.", "link": "https://www.arabnews.com/node/2407961/business-economy", "date_published": "2023-11-13T00:11:44+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Preparations for Dakar Saudi Arabia 2024 fully underway", "description": "RIYADH: Preparations for the 2024 edition of Dakar Saudi Arabia – the world’s most challenging rally – are now fully underway, organizers have announced.\n\n\tThe 46th edition of the prestigious Dakar Rally, and the fifth one hosted in the Kingdom, will take place across the country from Jan. 5 to 19.\n\n\tImmediately following the last rally in February, the groundwork for the fifth edition commenced with scouting for the 2024 editions of both the Dakar Rally and Dakar Classic routes, ensuring competitors face no unforeseen dangers or challenges.", "link": "https://www.arabnews.com/node/2407981/motorsport", "date_published": "2023-11-13T00:11:44+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Catholic nun becomes ‘symbol of Filipino spirituality’ as she chooses to stay in Gaza", "description": "MANILA: A Catholic nun who has categorically refused to leave her church in Gaza City and will likely remain as the last Philippine national there has symbolized Filipino spirituality and solidarity, the Department of Foreign Affairs said on Monday.  \n\n\tOf the 137 Filipinos trapped in Gaza since Israel began its daily bombardment of the densely populated enclave last month, authorities have so far evacuated 111 people to Egypt through the Rafah crossing.", "link": "https://www.arabnews.com/node/2407956/world", "date_published": "2023-11-13T00:11:12+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Gulf International Bank reports 255% profit growth in Q3", "description": "RIYADH: Gulf International Bank, with Saudi Arabia’s Public Investment Fund as its main shareholder, witnessed a 255 percent increase in profits during the third quarter of 2023.  \n\n\tThe Manama-headquartered bank, owned by the Gulf Cooperation Council countries, revealed a net profit of $41.2 million as of the end of September, representing a surge from the $11.6 million reported in the same period last year, according to an official statement.", "link": "https://www.arabnews.com/node/2407976/business-economy", "date_published": "2023-11-13T00:11:10+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]