[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-13T20:30:00+00:00", "description": "Platformers come and go; platforming franchises are a long-term dream of sequels and follow-ups. However, the indies remain, and as Braid Anniversary Edition showcases, they're still as relevant as ever.\n\nPacked with gorgeous, updated visuals, animation improvements, and revamped music, this is essentially a 1:1 re-release of Number None's 2008 classic. As Tim, you traipse multiple worlds to find and rescue the Princess from a horrible monster... or so it seems. Time bends to your will when it's not falling out of place, and it slowly becomes apparent that things aren't what they seem.\n\nThat makes for an incredible experience with ingenious mechanics and puzzle-solving, but there's more. There are hours of developer commentary, presented through new levels, and a deep dive into the game's inspiration, mechanics, challenges and more. Whether you're a new or old player, Braid is essential and the Anniversary Edition even more.", "language": null, "link": "https://www.youtube.com/watch?v=4F6uzDl9r1A", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/4F6uzDl9r1A/hqdefault.jpg", "title": "Braid Anniversary Edition Review - An Essential Experience", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-13T17:30:04+00:00", "description": "It's been a long ten years for Bungie's Destiny series, starting with the threat of the Darkness and the player's mission to help the Traveller. Throughout all the twists, turns and seasonal grinding, players finally near Destiny 2's The Final Shape, the finale to the saga.\n\nLaunching June 4th for Xbox, PlayStation and PC, it sees Guardians venturing into the Pale Heart of the Traveller to defeat its nemesis, The Witness, and prevent the Final Shape's completion. That means venturing through surreal environments reminiscent of familiar locales, fighting off new enemy types and discovering new subclasses and weapons to even the odds.\n\nOf course, as with everything Destiny-related, there's more, from the post-launch raid that promises a proper end to the campaign to the new Exotic class items that players can farm. Here's everything you need to know about Destiny 2: The Final Shape.", "language": null, "link": "https://www.youtube.com/watch?v=GccRrfKKKRk", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/GccRrfKKKRk/hqdefault.jpg", "title": "Destiny 2: The Final Shape DLC – 15 Things You NEED TO KNOW Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-13T09:30:09+00:00", "description": "Of course, there isn’t much that we can do on the matter - and Rockstar seems adamant about continuing to use the same strategy as it did with its previous releases for the PC platform. \n\nBut that doesn’t detract from the fact that it is indeed a sad state of affairs, albeit not a surprising one to be honest. As it stands, it seems very likely that Grand Theft Auto 6 on the PC will be releasing at least a year after the game’s debut on consoles. It’s also very likely that the developer would turn in a massive profit through the segregation of platforms. \n\nSo, in essence, Rockstar might just be failing its PC gamers by choosing not to release GTA 6 on PC day one since there’s a lot more to be gained for the developer with this decision than us gamers.", "language": null, "link": "https://www.youtube.com/watch?v=Zuqqj47rTbg", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/Zuqqj47rTbg/hqdefault.jpg", "title": "Is Rockstar FAILING GAMERS By Not Launching GTA 6 Day One On PC?", "user": null, "vote": 0}]