[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T20:30:06+00:00", "description": "There’s something about the enjoyment you get out of playing through a game with a friend – or a group of friends – that you just cannot find in any other kind of game. It’s a unique kind of experience that, as more than a few prominent examples have proven in the past, can live incredibly long in the memory. \n\nLuckily enough, for those who enjoy a good co-op game, looking ahead, there’s quite a few of them coming out in 2024 and beyond that have caught the eye. From survival games to all manner of shooters, from action RPGs to even horror games, there’s a number of co-op games currently in the pipeline that are looking quite promising. Here, we’re going to take a look at a few such games.", "language": null, "link": "https://www.youtube.com/watch?v=epmRtDcfrX8", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/epmRtDcfrX8/hqdefault.jpg", "title": "16 NEW Co-op Games of 2024 And Beyond", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T17:30:01+00:00", "description": "Ever since its launch in 2015, Fallout 4 has been a game that has divided opinion, and it’s easy to see why. It’s a game with its fair share of strengths as well as weaknesses, with things such as its open world and its bevy of content deserving genuine praise, but other areas like its pared back role playing mechanics, the streamlined dialogue system, and a lackluster story having attracted plenty of justified criticism. \n\nEither way, if there’s one thing that’s clear at this moment in time, it’s that whenever Fallout 5 arrives (which, by all accounts, won’t happen for several more years yet), it definitely is going to have to improve on its predecessor in a number of departments. Here, that’s exactly what we’ll be talking about.", "language": null, "link": "https://www.youtube.com/watch?v=CcK46U9cgQo", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/CcK46U9cgQo/hqdefault.jpg", "title": "10 Ways Fallout 5 Should Improve On Fallout 4", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T13:30:00+00:00", "description": "Wolfenstein is widely considered to be one of the most influential games of all time, and the franchise itself has survived more than a couple of highs and lows throughout its decades-long run. \n\nAfter a failed reboot from Raven, it was MachineGames’ Wolfenstein: The New Order that saved the franchise from eventual extinction. Released in 2014, The New Order’s adrenaline-packed gunplay and surprisingly moving mechanics were the primary reasons behind its success, and many of those merits continue to remain true even after all these years. \n\nTo that end, we will be taking a look back at the game and discuss what exactly makes it so enjoyable and timeless, and why you should give it another shot if you haven’t already.", "language": null, "link": "https://www.youtube.com/watch?v=-mXQqaWw71w", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/-mXQqaWw71w/hqdefault.jpg", "title": "10 Years Later, Wolfenstein: The New Order Is A Complete Blast", "user": null, "vote": 0}]