[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T23:13:42.270668+00:00", "description": "An anonymous reader shared this report from the Wall Street Journal:\nDrunken-driving deaths in the U.S. have risen to levels not seen in nearly two decades, federal data show, a major setback to long-running road-safety efforts. At the same time, arrests for driving under the influence have plummeted, as police grapple with challenges like hiring woes and heightened concern around traffic stops... About 13,500 people died in alcohol impairment-related crashes in 2022, according to data released in April by the National Highway Traffic Safety Administration. That is 33% above 2019's toll and on par with 2021's. The last time so many people died as a result of accidents involving intoxicated drivers was in 2006. \nThat's still down from the early 1980s, when America was seeing over 20,000 drunk-driving deaths a year, according to the article. \"By 2010, that number had fallen to around 10,000 thanks to high-profile public-education campaigns by groups like MADD, tougher laws, and aggressi", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/05/2214210/can-technology-help-reduce-drunk-driving-deaths?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Can Technology Help Reduce Drunk-Driving Deaths?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T22:08:37.460041+00:00", "description": "A \"string of legal victories\" by America's market-regulating Securities and Exchange Commission \"has jolted some of crypto's biggest players,\" reports Politico &mdash; even as they're seeking more credibility with U.S. lawmakers:\nJudges have recently rebuked claims that the SEC lacks authority to police the market. Coinbase, the largest U.S. exchange, lost a bid to throw out charges that it is violating investor-protection rules. And a New York jury found one-time billionaire entrepreneur Do Kwon and his firm liable for fraud. Now, the crackdown is about to expand, with the SEC preparing for a new round of lawsuits. \"The SEC just keeps winning,\" said John Reed Stark, a former agency attorney and prominent crypto critic. \"The law is catching up....\" \n\n [I]t's the SEC crackdown that is raising foundational questions about crypto's future. [SEC Chairman Gary] Gensler has been among the industry's most implacable foes, saying most crypto tokens are unregistered securities that are being s", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/05/2057223/americas-federal-regulators-are-preparing-more-lawsuits-against-crypto-companies?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "America's Federal Regulators Are Preparing More Lawsuits Against Crypto Companies", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T21:03:34.293274+00:00", "description": "\"What if the big tech companies achieved their ultimate business goal &mdash; maximizing engagement on their platforms &mdash; in a way that has undermined our ability to function as an open society?\" \n\nThat's the question being asked by Chuck Todd, chief political analyst for NBC News:\n\n\n What if they realized that when folks agree on a solution to a problem, they are most likely to log off a site or move on? It sure looks like the people at these major data-hoarding companies have optimized their algorithms to do just that. As a new book argues, Big Tech appears to have perfected a model that has created rhetorical paralysis. Using our own data against us to create dopamine triggers, tech platforms have created \"a state of perpetual disagreement across the divide and a concurrent state of perpetual agreement within each side,\" authors Frank McCourt and Michael Casey write, adding: \"Once this uneasy state of divisive 'equilibrium' is established, it creates profit-making opportunitie", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/05/2016246/could-better-data-protections-reduce-big-techs-polarizing-power?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Could Better Data Protections Reduce Big Tech's Polarizing Power?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T18:53:35.148922+00:00", "description": "An anonymous reader shared this report from SFGate:\nLate last year, tales of tech workers paying $700 a month for tiny \"bed pods\" in downtown San Francisco went viral. The story provided a perfect distillation of SF's wild (and wildly expensive) housing market &mdash; and inspired schadenfreude when the city deemed the situation illegal. But the provocative living situation wasn't an anomaly, according to a city official. \n\"We've definitely seen an uptick of these 'pod'-type complaints,\" Kelly Wong, a planner with San Francisco's code enforcement and zoning and compliance team, told SFGATE... Wong stressed that it's not that San Francisco is inherently against bed pod-type arrangements, but that the city is responsible for making sure these spaces are safe and legally zoned. \nSo Brownstone Shared Housing is still renting one bed pod location &mdash; but not accepting new tenants &mdash; after citations for failing to get proper permits and having a lock on the front door that required", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/05/1749244/some-san-francisco-tech-workers-are-renting-cheap-bed-pods?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Some San Francisco Tech Workers are Renting Cheap 'Bed Pods'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T17:48:34.819598+00:00", "description": "The Associated Press reports that an F-16 performing aerial combat tests at 550 miles per hour was \"controlled by artificial intelligence, not a human pilot.\" \nAnd riding in the front seat was the U.S. Secretary of the Air Force...\n\n\nAI marks one of the biggest advances in military aviation since the introduction of stealth in the early 1990s, and the Air Force has aggressively leaned in. Even though the technology is not fully developed, the service is planning for an AI-enabled fleet of more than 1,000 unmanned warplanes, the first of them operating by 2028. \nIt was fitting that the dogfight took place at [California's] Edwards Air Force Base, a vast desert facility where Chuck Yeager broke the speed of sound and the military has incubated its most secret aerospace advances. Inside classified simulators and buildings with layers of shielding against surveillance, a new test-pilot generation is training AI agents to fly in war. [U.S. Secretary of the Air Force] Frank Kendall traveled", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/05/1630222/ai-operated-f-16-jet-carries-air-force-official-into-550-mph-aerial-combat-test?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI-Operated F-16 Jet Carries Air Force Official Into 550-MPH Aerial Combat Test", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T16:43:16.282919+00:00", "description": "Last month Reuters reported that Venezuela's state-run oil company \"plans to increase digital currency usage in its crude and fuel exports as the U.S. reimposes oil sanctions on the country, three people familiar with the plan said.\"\n\n[The oil company] since last year had been slowly moving oil sales to USDT, a digital currency also known as Tether whose value is pegged to the U.S. dollar and designed to maintain a stable value. The return of oil sanctions is speeding up the shift, a move to reduce the risk of sale proceeds getting frozen in foreign bank accounts due to the measures, the people said... \n\nTether said in an email it respects the U.S. Treasury's list of sanctioned entities and \"is committed to working to ensure sanction addresses are frozen promptly.\" \n\nThis week Reuters reported that now experts are saying the situation \"will require greater scrutiny by regulators and law enforcement.\" They spoke to Kristofer Doucett, national security leader at U.S. blockchain analysis", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/05/0410237/will-calls-to-scrutinize-digital-currency-purchases-of-oil-bring-new-regulations-for-crypto?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Will Calls to Scrutinize Digital-Currency Purchases of Oil Bring New Regulations For Crypto?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T15:38:25.999684+00:00", "description": "An anonymous reader shared this report from the Guardian:\n\nNewly deciphered passages from a papyrus scroll that was buried beneath layers of volcanic ash after the AD79 eruption of Mount Vesuvius may have shed light on the final hours of Plato, a key figure in the history of western philosophy. In a groundbreaking discovery, the ancient scroll was found to contain a previously unknown narrative detailing how the Greek philosopher spent his last evening, describing how he listened to music played on a flute by a Thracian slave girl. Despite battling a fever and being on the brink of death, Plato &mdash; who was known as a disciple of Socrates and a mentor to Aristotle, and who died in Athens around 348BC &mdash; retained enough lucidity to critique the musician for her lack of rhythm, the account suggests.... \n\nIn a presentation of the research findings at the National Library of Naples, Prof Graziano Ranocchia, of the University of Pisa, who spearheaded the team responsible for uneart", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/05/0314231/platos-final-hours-recounted-in-scroll-found-in-vesuvius-ash?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Plato's Final Hours Recounted In Scroll Found In Vesuvius Ash", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T15:38:24.433862+00:00", "description": "The blog Its FOSS has 15,000 followers for its Mastodon account &mdash; which they think is causing problems:\n\nWhen you share a link on Mastodon, a link preview is generated for it, right? With Mastodon being a federated platform (a part of the Fediverse), the request to generate a link preview is not generated by just one Mastodon instance. There are many instances connected to it who also initiate requests for the content almost immediately. And, this \"fediverse effect\" increases the load on the website's server in a big way. \n\nSure, some websites may not get overwhelmed with the requests, but Mastodon does generate numerous hits, increasing the load on the server. Especially, if the link reaches a profile with more followers (and a broader network of instances)... We tried it on our Mastodon profile, and every time we shared a link, we were able to successfully make our website unresponsive or slow to load. \n\nSlashdot reader nunojsilva is skeptical that \"blurbs with a thumbnail and", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/05/0241211/is-mastodons-link-previewing-overloading-servers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is Mastodon's Link-Previewing Overloading Servers?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T12:23:48.544835+00:00", "description": "\"A leap in our ability to see the chemistry of matter in three-dimensions at the nanoscale was achieved, allowing scientists to understand how nanomaterials are chemically arranged,\" writes Slashdot reader Hovden:\n\nTraditionally, seeing matter at the smallest sizes requires too many high-energy electrons for 3D chemical imaging. The high beam exposure destroys the specimen before an experiment is completed. Even larger doses are required to achieve high resolution. \n\nThus, chemical mapping in 3D has been unachievable except at lower resolution with the most radiation-hard materials. \n\nHigh-resolution 3D chemical imaging is now achievable near or below one-nanometer resolution. A team from Dow Chemical and the University of Michigan used a newly introduced method, called multi-modal data fusion, high-resolution chemical tomography, that provides 99% less dose by linking information encoded within both elastic and inelastic scattered signals. The researchers showed sub-nanometer 3D reso", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/04/2350234/breakthrough-achieved-in-nanometer-resolution-imaging-of-3d-chemistry?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Breakthrough Achieved In Nanometer-Resolution Imaging of 3D Chemistry", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T08:03:16.795586+00:00", "description": "Thursday the Verge reported that a new report from Microsoft \"outlines the steps the company took to release responsible AI platforms last year.\"\n\n\nMicrosoft says in the report that it created 30 responsible AI tools in the past year, grew its responsible AI team, and required teams making generative AI applications to measure and map risks throughout the development cycle. The company notes that it added Content Credentials to its image generation platforms, which puts a watermark on a photo, tagging it as made by an AI model. \n\nThe company says it's given Azure AI customers access to tools that detect problematic content like hate speech, sexual content, and self-harm, as well as tools to evaluate security risks. This includes new jailbreak detection methods, which were expanded in March this year to include indirect prompt injections where the malicious instructions are part of data ingested by the AI model. \n\nIt's also expanding its red-teaming efforts, including both in-house red", "language": "en-us", "link": "https://slashdot.org/story/24/05/05/0521206/microsoft-details-how-its-developing-ai-responsibly?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Details How It's Developing AI Responsibly", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T04:47:57.981818+00:00", "description": "Come 2029, all cars sold in the U.S. \"must be able to stop and avoid contact with a vehicle in front of them at speeds up to 62 mph,\" reports Car and Driver. \n\n\"Additionally, the system must be able to detect pedestrians in both daylight and darkness. As a final parameter, the federal standard will require the system to apply the brakes automatically up to 90 mph when a collision is imminent, and up to 45 mph when a pedestrian is detected.\"\n\nNotably, the federal standardization of automated emergency braking systems includes pedestrian-identifying emergency braking, too. Once implemented, the NHTSA projects that this standard will save at least 360 lives a year and prevent at least 24,000 injuries annually. Specifically, the federal agency claims that rear-end collisions and pedestrian injuries will both go down significantly... \n\n \"Automatic emergency braking is proven to save lives and reduce serious injuries from frontal crashes, and this technology is now mature enough to require ", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/04/2250221/the-us-just-mandated-automated-emergency-braking-systems-by-2029?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The US Just Mandated Automated Emergency Braking Systems By 2029", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-05T02:38:28.210336+00:00", "description": "In 2016, an online \"swarm intelligence\" platform generated a correct prediction for the Kentucky Derby &mdash; naming all four top finishers, in order. (But the next year their predictions weren't even close, with TechRepublic suggesting 2016's race had an unusual cluster of just a few top racehorses.) \n\nSo this year Decrypt.co tried crafting their own system \"that can be called up when the next Kentucky Derby draws near.\nThere are a variety of ways to enlist artificial intelligence in horse racing. You could process reams of data based on your own methodology, trust a third-party pre-trained model, or even build a bespoke solution from the ground up. We decided to build a GPT we named HorseGPT to crunch the numbers and make the picks for us... \n\nWe carefully curated prompts to instill HorseGPT with expertise in data science specific to horse racing: how weather affects times, the role of jockeys and riding styles, the importance of post positions, and so on. We then fed it a mix of r", "language": "en-us", "link": "https://idle.slashdot.org/story/24/05/05/0037217/ai-powered-horsegpt-fails-to-predict-this-years-kentucky-derby-winner?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI-Powered 'HorseGPT' Fails to Predict This Year's Kentucky Derby Winner", "user": null, "vote": 0}]