[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-11T17:30:09+00:00", "description": "When you talk about first-person shooters, Doom always comes up. id Software's revolutionary title didn't just blaze a path for others to follow but delivered a bloody, action-packed, memorable experience.\n\nOver 31 years since its initial launch, Doom has received arguably the most definitive compilation yet - DOOM 1 + DOOM 2. It contains all of the good stuff added in 2020 but piles on even more, from new deathmatch maps and quality-of-life features to a remixed soundtrack and a whole new campaign, Legacy of Rust.\n\nThat's not even talking about the first-ever integration of in-game mods, opening up a whole new world for players on consoles. There are shortcomings, from the iffy sound mixing to the lackluster mod browser. However, DOOM 1 + DOOM 2 is still an excellent celebration of the series and the best gateway for any player to jump into the franchise.", "id": 1008085, "language": null, "link": "https://www.youtube.com/watch?v=kPKAIHWXeoY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/kPKAIHWXeoY/hqdefault.jpg", "title": "Doom 1 + Doom 2 Enhanced Edition Review - Everything You Need To Know Before You Purchase", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-11T13:30:18+00:00", "description": "2024 may not be as packed as last year was, but halfway through the year, we've still already had a deluge of excellent new games, to the extent that many have, as is often the case, passed under the radar for a great many people. \n\nHere, we're going to shine the spotlight on a few such smaller or relatively less mainstream titles that deserve to have more eyes on them.\n\nIntro 00:00\nNumber 1 0:28\nNumber 2 0:59\nNumber 3 1:27\nNumber 4 1:51\nNumber 5 2:22\nNumber 6 2:56\nNumber 7 3:30\nNumber 8 4:04\nNumber 9 4:50\nNumber 10 5:17\nNumber 11 5:57\nNumber 12 6:28\nNumber 13 6:53\nNumber 14 7:28\nNumber 15 8:02", "id": 1007272, "language": null, "link": "https://www.youtube.com/watch?v=NFWcypxysBY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NFWcypxysBY/hqdefault.jpg", "title": "15 Great Single Player Games of 2024 You Are TOTALLY IGNORING", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-11T05:30:07+00:00", "description": "Character-focused action titles are about style and presentation as much as tight gameplay, responsive controls and memorable bosses. Game Science's Black Myth: Wukong is no different, but it's also one of the best-looking titles we've seen in quite some time.\n\nDeveloped on Unreal Engine 5, it offers some truly unreal (pardon the pun) visuals. Water reflections, lighting, shadows, particle effects, incredible texture work, realistic water physics, and snow deformation - the sheer graphical splendor alone is worth focusing on and praising. However, Game Science hasn't held back when it comes to attention to detail either.\n\nWhether it's interesting little nuances to bosses and their moves or the hero's own powers and abilities, Black Myth: Wukong offers so many spectacular details. Check out eleven of them here before its launch on August 20th for PS5 and PC.", "id": 1006051, "language": null, "link": "https://www.youtube.com/watch?v=Pik5JVtkoco", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/Pik5JVtkoco/hqdefault.jpg", "title": "Black Myth Wukong - 11 STUNNING Details You Likely Missed", "user": null, "vote": 0}]