[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-27T18:30:44+00:00", "description": "When it first came out back in 2010, World of Warcraft: Cataclysm was an expansion that essentially brought an end to what many would consider the “classic” World of Warcraft. \n\nIt bought sweeping changes to the entire leveling experience for characters between 1 and 60, while also changing just about every aspect of how a class played. World of Warcraft: Cataclysm Classic’s release might stretch the meaning of the word “Classic” to quite an extent.\n\nIt still manages to be different enough from modern-day World of Warcraft to justify its existence, however. It certainly helps that the entire expansion has quite a few interesting stories and fun boss fights to take part in along the way.", "language": null, "link": "https://www.youtube.com/watch?v=xWmQ1kdf15w", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/xWmQ1kdf15w/hqdefault.jpg", "title": "World of Warcraft: Cataclysm Classic Review", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-27T18:30:14+00:00", "description": "Launching for PC via Steam Early Access on May 27th, the animated title sees the Prince attempting to stop a Hun invasion, which he inadvertently triggers. Like the developer's acclaimed Dead Cells, that means venturing through multiple regions, defeating enemies, scrounging for weapons and navigating traps.\n\nOf course, there's much more to The Rogue Prince of Persia, from the intriguing non-linear story to the involved combat system and the gorgeous presentation. Even if it could use more polish, content and difficulty tuning, it's a worthwhile early-access title.", "language": null, "link": "https://www.youtube.com/watch?v=NCxrYBqLMSk", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NCxrYBqLMSk/hqdefault.jpg", "title": "The Rogue Prince of Persia Early Access Review", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-27T15:30:12+00:00", "description": "June isn't looking super-packed when considering major new game releases. The focus is more on the upcoming gaming showcases and new reveals, from the wildly rumored to the never-happening (you know which one). On the bright side, the few upcoming titles worth talking about are pretty significant.\n\nThere's Destiny 2: The Final Shape, Bungie's long-awaited conclusion to the Light and Darkness saga that's packed with more nerfs than expected; Shadow of the Erdtree, Elden Ring's first paid expansion that offers new weapons, armor and bosses than any of FromSoftware's previous DLC; and Still Wakes the Deep, The Chinese Room's next thrilling survival horror.\n\nOtherwise, if you want to play Monster Hunter Stories and Luigi's Mansion: Dark Moon at high resolutions and on modern platforms, then there are remasters for both to look forward to. Check out the 12 biggest titles launching in June 2024.", "language": null, "link": "https://www.youtube.com/watch?v=TwvW6IwR0ok", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/TwvW6IwR0ok/hqdefault.jpg", "title": "12 NEW Games of June 2024 To Look Forward To [PS5, Xbox Series X | S, PC And More]", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-27T09:30:01+00:00", "description": "Ordinarily, if a game’s first expansion was releasing two years after the game itself came out, most of us would find it hard to care too much, but given the fact that we’re talking about FromSoftware and Elden Ring here, we all can’t help but be incredibly excited about the looming launch of Shadow of the Erdtree. \n\nThe seminal 2022 open world action RPG’s expansion is set to launch in the very near future, and as we approach its release, new details on its offerings are continuing to emerge at a steady clip. \n\nFrom bosses and the expansion’s setting to details on the story and some key characters, there’s plenty that we’ve learned about Shadow of the Erdtree so far. Here, we’re going to talk about all of that and more.", "language": null, "link": "https://www.youtube.com/watch?v=6GP0KZHZAe0", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/6GP0KZHZAe0/hqdefault.jpg", "title": "Elden Ring: Shadow of the Erdtree DLC - 15 Things You NEED TO KNOW Before You Buy", "user": null, "vote": 0}]