[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T23:45:30.703918+00:00", "description": "USENIX, the long-running OS/networking research group, also publishes a magazine called ;login:. Today the magazine's editor &mdash; security consultant Rik Farrow &mdash; stopped by Slashdot to share some new research. rikfarrow writes:\nCaching means using faster memory to store frequently requested data, and the most commonly used algorithm for determining which items to discard when the cache is full is Least Recently Used [or \"LRU\"]. These researchers have come up with a more efficient and scalable method that uses just a few lines of code to convert LRU to SIEVE. \nJust like a sieve, it sifts through objects (using a pointer called a \"hand\") to \"filter out unpopular objects and retain the popular ones,\" with popularity based on a single bit that tracks whether a cached object has been visited:\n\nAs the \"hand\" moves from the tail (the oldest object) to the head (the newest object), objects that have not been visited are evicted... During the subsequent rounds of sifting, if objects ", "id": 795522, "language": "en-us", "link": "https://developers.slashdot.org/story/24/06/30/2337238/caching-is-key-and-sieve-is-better-than-lru?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Caching Is Key, and SIEVE Is Better Than LRU", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T21:35:33.681820+00:00", "description": "America's Justice Department \"is pushing for Boeing to plead guilty to a criminal charge,\" reports Reuters, \"after finding the planemaker violated a settlement over fatal 737 MAX crashes in 2018 and 2019 that killed 346 people, two people familiar with the matter said on Sunday.\"\n\nBoeing previously paid $2.5 billion as part of the deal with prosecutors that granted the company immunity from criminal prosecution over a fraud conspiracy charge related to the 737 MAX's flawed design. Boeing had to abide by the terms of the deferred prosecution agreement for a three-year period that ended on Jan. 7. Prosecutors would then have been poised to ask a judge to dismiss the fraud conspiracy charge. But in May, the Justice Department found Boeing breached the agreement, exposing the company to prosecution. \nA guilty plea could \"carry implications for Boeing's ability to enter into government contracts,\" the article points out, \"such as those with the U.S. military that make up a significant port", "id": 795125, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/30/2125256/boeing-fraud-violated-fatal-max-crash-settlement-says-justice-department-seeking-guilty-plea-on-criminal-charges?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Boeing Fraud Violated Fatal MAX Crash Settlement, Says Justice Department, Seeking Guilty Plea on Criminal Charges", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T20:30:30.308070+00:00", "description": "A new study \"has found direct evidence linking a key chemical ingredient of plastic bottles to a higher risk of type 2 diabetes,\" reports the Independent:\n\n\nThe study, published in the journal Diabetes, found that the chemical BPA used to make food and drink packages, including plastic water bottles, can reduce sensitivity to the hormone insulin which regulates the body's sugar metabolism. The findings, to be presented at the 2024 Scientific Sessions of the American Diabetes Association, call for the US Environmental Protection Agency to reconsider the safe limits for exposure to BPA in bottles and food containers. Previous studies have already shown that the chemical Bisphenol A (BPA) used to make plastic and epoxy resins could disrupt hormones in humans. While research has linked BPA to diabetes, no previous study has directly assessed if administration of this chemical to humans increases this risk in adults. \n\nThe researchers administered the dosage considered safe by America's FD", "id": 794906, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/30/2017240/a-safe-chemical-in-plastic-bottles-could-reduce-insulin-responsiveness-increase-diabetes-risk?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "A 'Safe' Chemical in Plastic Bottles Could Reduce Insulin Responsiveness, Increase Diabetes Risk", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T19:26:08.047656+00:00", "description": "To stop their smartphone battery from swelling, long-time Slashdot reader shanen bought a Samsung Galaxy with a \"restrictive charging option.\" But what setting should they use?\n\nThe way this battery protection option worked was to stop charging the phone at 85%. That left me enough charge for my normal daily travels, which rarely took the phone below 50%, and the battery remained unswollen after a year, which included a month of quite heavy tethering, too. Unfortunately... After a recent upgrade, now my Galaxy has three options for the battery where it had two. The 85% option is still there, but it has been lowered to 80%. I've been using that for now and it still seems good enough. However my main concern is with the best option to maximize the overall lifespan of the smartphone... \n\nThe other old option says something about using AI to control the battery charging, but I don't trust it and think it is just the old approach that causes phones to die quickly... The new third option is", "id": 794660, "language": "en-us", "link": "https://ask.slashdot.org/story/24/06/30/1846204/ask-slashdot-whats-the-best-way-to-charge-your-smartphone-battery?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ask Slashdot: What's the Best Way to Charge Your Smartphone Battery?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T18:21:11.095583+00:00", "description": "Commercial space efforts continue around the world, as the Chinese company Space Pioneer fired up a partially-fueled rocket engine Sunday for a short-duration test of its reusable rocket on the ground. But Space News reports that the test \"ended in catastrophic failure and a dramatic explosion.\" \n\n\"Amateur footage captured by Gongyi citizens and posted on Chinese social media shows the nine-engine test stage igntiing and then, exceptionally, taking off.\"\nHold-down clamps and other structures are typically used to securely keep stages in place. The stage is seen climbing into the sky before halting, apparently with its engines shutting off, and returning to Earth. The stage impacted the ground around 50 seconds after it took off, apparently with much of its kerosene-liquid oxygen propellant remaining, causing a large explosion. \n\nThe Tianlong-3 first stage would likely fire for a number of minutes on an orbital flight. Space Pioneer was conducting its test as a buildup to an orbital la", "id": 794487, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/30/1728229/chinese-space-companys-static-rocket-test-ends-in-premature-launch-huge-explosion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Chinese Space Company's Static Rocket Test Ends In Premature Launch, Huge Explosion", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T17:16:17.317764+00:00", "description": "Bloomberg and The Washington Post \"claim AI power usage is dire,\" writes Slashdot reader NoWayNoShapeNoForm. But Ars Technica \"begs to disagree with those speculations.\" \n\nFrom Ars Technica's article:\n\nThe high-profile pieces lean heavily on recent projections from Goldman Sachs and the International Energy Agency (IEA) to cast AI's \"insatiable\" demand for energy as an almost apocalyptic threat to our power infrastructure. The Post piece even cites anonymous \"some [people]\" in reporting that \"some worry whether there will be enough electricity to meet [the power demands] from any source.\" Digging into the best available numbers and projections available, though, it's hard to see AI's current and near-future environmental impact in such a dire light... While the headline focus of both Bloomberg and The Washington Post's recent pieces is on artificial intelligence, the actual numbers and projections cited in both pieces overwhelmingly focus on the energy used by Internet \"data centers\" ", "id": 794263, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/30/0354220/is-ais-demand-for-energy-really-insatiable?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is AI's Demand for Energy Really 'Insatiable'?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T16:11:18.460258+00:00", "description": "It was analgous to the \"Blue Screen of Death\" that Windows gives for critical errors, Phoronix wrote. To enable error messages for things like a kernel panic, Linux 6.10 introduced a new panic handler infrastructure for \"Direct Rendering Manager\" (or DRM) drivers. \n\nPhoronix also published a follow-up from Red Hat engineer Javier Martinez Canillas (who was involved in the new DRM Panic infrastructure).\n\nGiven complaints about being too like Microsoft Windows following his recent Linux \"Blue Screen of Death\" showcase... Javier showed that a black screen of death is possible if so desired... After all, it's all open-source and thus can customize to your heart's content.\n \nAnd now the panic handler is getting even more new features, Phoronix reported Friday:\n\nWith the code in Linux 6.10 when DRM Panic is triggered, an ASCII art version of Linux's mascot, Tux the penguin, is rendered as part of the display. With Linux 6.11 it will also be able to handle displaying a monochrome image as th", "id": 794027, "language": "en-us", "link": "https://linux.slashdot.org/story/24/06/29/1958207/new-linux-screen-of-death-options-black---or-a-monochrome-tux-logo?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New Linux 'Screen of Death' Options:  Black - or a Monochrome Tux Logo", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T15:06:22.743019+00:00", "description": "What if across the bottom of the Atlantic Ocean, six high-voltage power cables stretched -- each over 2,000 miles long. \n\nCNN reports that a group of entrepreneurs \"wants to build what would be the world&#226;(TM)s largest subsea energy interconnector between continents, linking Europe and North America...to connect places like the United Kingdom&#226;(TM)s west with eastern Canada, and potentially New York with western France... \n\n\"The Europe-US cables could send 6 gigawatts of energy in both directions at the speed of light, said Laurent Segalen, founder of the London-based Megawatt-X renewable energy firm, who is also part of the trio proposing the transatlantic interconnector. That&#226;(TM)s equivalent to what six large-scale nuclear power plants can generate, transmitted in near-real time.\"\n\n The interconnector would send renewable energy both east and west, taking advantage of the sun&#226;(TM)s diurnal journey across the sky. &#226;oeWhen the sun is at its zenith, we probably ", "id": 793809, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/30/0424240/new-undersea-power-cables-could-carry-green-energy-from-country-to-country?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New Undersea Power Cables Could Carry Green Energy From Country to Country", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T11:51:15.270632+00:00", "description": "It transforms water into the fuel &mdash; one of the first fuel plants in the world to do so. \n\nThe Washington Post visits a facility in Corpus Christi, Texas using renewable energy to produce \"green\" hydrogen.\n\nThe plant feeds water through machines that pull out its hydrogen atoms... [T]he hydrogen is chemically transformed into diesel for delivery trucks. This process could represent the biggest change in how fuel for planes, ships, trains and trucks is made since the first internal combustion engine fired up in the 19th century... Turning hydrogen into liquid fuel could help slash planet-warming pollution from heavy vehicles, cutting a key source of emissions that contribute to climate change. But to fulfill that promise, companies will have to build massive numbers of wind turbines and solar panels to power the energy-hungry process. Regulators will have to make sure hydrogen production doesn't siphon green energy that could go towards cleaning up other sources of global warming ", "id": 793110, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/29/215217/fuel-from-water-visiting-a-texas-green-hydrogen-plant?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Fuel From Water?  Visiting a Texas 'Green Hydrogen' Plant", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T08:36:08.285016+00:00", "description": "Slashdot reader Required Snark shared this article from Ars Technica:\nAlmost exactly two years ago, as it prepared for the next generation of human spaceflight, NASA chose a pair of private companies to design and develop new spacesuits. These were to be new spacesuits that would allow astronauts to both perform spacewalks outside the International Space Station as well as walk on the Moon as part of the Artemis program. Now, that plan appears to be in trouble, with one of the spacesuit providers &mdash; Collins Aerospace &mdash; expected to back out, Ars has learned. It's a blow for NASA, because the space agency really needs modern spacesuits. \n\nNASA's Apollo-era suits have long been retired. The current suits used for spacewalks in low-Earth orbit are four decades old. \"These new capabilities will allow us to continue on the International Space Station and allows us to do the Artemis program and continue on to Mars,\" said the director of Johnson Space Center, Vanessa Wyche, during ", "id": 792509, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/30/0223238/nasas-commercial-spacesuit-program-just-hit-a-major-snag?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA's Commercial Spacesuit Program Just Hit a Major Snag", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T04:15:58.445646+00:00", "description": "Today the Wall Street Journal reported that restoring net neutrality to America is \"on shakier legal footing after a Supreme Court decision on Friday shifted power away from federal agencies.\"\n\n\"It's hard to overstate the impact that this ruling could have on the regulatory landscape in the United States going forward,\" said Leah Malone, a lawyer at Simpson Thacher &amp; Bartlett. \"This could really bind U.S. agencies in their efforts to write new rules.\" Now that [the \"Chevron deference\"] is gone, the Federal Communications Commission is expected to have a harder time reviving net neutrality &mdash; a set of policies barring internet-service providers from assigning priority to certain web traffic... \n\nThe Federal Communications Commission reclassified internet providers as public utilities under the Communications Act. There are pending court cases challenging the FCC's reinterpretation of that 1934 law, and the demise of Chevron deference heightens the odds of the agency losing in ", "id": 791983, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/30/035256/will-a-us-supreme-court-ruling-put-net-neutrality-at-risk?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Will a US Supreme Court Ruling Put Net Neutrality at Risk?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T02:06:20.663081+00:00", "description": "An anonymous Slashdot reader shared this report from the Verge:\n\nThreads will now let people like and see replies to their Threads posts that appear on other federated social media platforms, the company announced on Tuesday. \n\nPreviously, if you made a post on Threads that was syndicated to another platform like Mastodon, you wouldn't be able to see responses to that post while still inside Threads. That meant you'd have to bounce back and forth between the platforms to stay up-to-date on replies... [I]n a screenshot, Meta notes that you can't reply to replies \"yet,\" so it sounds like that feature will arrive in the future. \n\"Threads is Meta's first app built to be compatible with the fediverse...\" according to a Meta blog post. \"Our vision is that people using other fediverse-compatible servers will be able to follow and interact with people on Threads without having a Threads profile, and vice versa, connecting communities...\" [If you turn on \"sharing\"...] \"Developers can build new", "id": 791751, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/29/2158237/threads-expands-fediverse-beta-letting-users-see-replies-and-likes-on-other-fediverse-sites-like-mastodon?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Threads Expands Fediverse Beta, Letting Users See Replies (and Likes) on Other Fediverse Sites like Mastodon", "user": null, "vote": 0}]