[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T19:30:01+00:00", "description": "F1 Manager may be another yearly release sports title, but the 2024 edition is adding the most content we’ve seen from the series to date. The big addition this year is the Create A Team mode, which allows you to create your own backstory and hire any driver from F1 through F3. \n\nBundled with Create A Team is the long-requested livery editor, featuring a variety of colors and ability to create your own logos. There’s a number of features that go a long way toward fleshing out the managing side of things as well. Management sim fans will be delighted to hear about the new Mentality system, and new players will appreciate the research and design element already baked into the series. \n\nThe modest price point and slew of new modes for this year’s iteration of F1 Manager should put F1 Manager 2024 on more gamers’ radars.", "id": 794773, "language": null, "link": "https://www.youtube.com/watch?v=IgfcipAui84", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/IgfcipAui84/hqdefault.jpg", "title": "F1 Manager 2024 - 15 Things You ABSOLUTELY Need To Know Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T13:30:29+00:00", "description": "From Project Magnum to The First Descendant, Nexon's free-to-play shooter has had an intriguing journey thus far. Despite relatively non-existent hype over the years, it quickly emerged as a player in the looter shooter genre, especially in a year where some of its competitors have already disappointed.\n\nPreviews are promising so far, but it's not just because of the amount of content or the sheer end-game offered at launch. It's also due to the extensive quality of life features, many cribbed from the biggest games. It's also interesting to see the approach to the various playable characters and the extensive build-crafting players can do.\n\nWhile its long-term success is unknown, The First Descendant looks poised to take the genre by storm. Let's delve further into why it's one of the bigger games of the year and how it could serve as a viable alternative to other looter shooters.", "id": 793453, "language": null, "link": "https://www.youtube.com/watch?v=dLGa9RvvTzU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/dLGa9RvvTzU/hqdefault.jpg", "title": "This Game Could Be One of The BIGGEST SURPRISES of 2024", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-30T09:30:00+00:00", "description": "Flintlock provides a satisfying Souls-lite formula wrapped around a mythical setting. The bonfire infrastructure is pretty much identical to the FromSoftware games it’s influenced by, but other aspects are quite different. \n\nFor example, there’s three difficulty options in Flintlock, and the story is told in a straightforward manner. There’s a strong emphasis on quick maneuverability, though I find the dodging and air dash to be imprecise during combat. Weapons fall into three groups: melee axe, mid-range flintlock pistol, and long-range musket.\n\nFlintlock provides a fun Souls-lite experience, one that isn’t fettered down by annoying ultimate editions or an always- online live-service.", "id": 792683, "language": null, "link": "https://www.youtube.com/watch?v=asIUhUCZYHM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/asIUhUCZYHM/hqdefault.jpg", "title": "Flintlock: The Siege of Dawn - 15 Things You NEED To Know Before You Buy", "user": null, "vote": 0}]