[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T19:30:03+00:00",
        "description": "Introducing a unique concept in the first-person shooter space, much less for competitive shooters, is challenging. So when a title like Double Eleven's Blindfire comes along for Xbox Series X/S, PS5, and PC, it's fascinating to witness the execution (even in early access).\n\nThe idea is deathmatches inside of pitch-black levels where players must rely on sound, environmental cues (including blacklight that illuminates other players), light traps, and a scanning ability to locate each other. Though it can result in tense stand-offs, with opponents desperately trying to keep quiet and find each other first, the overall result is one that's still very undeveloped.\n\nThough it performs well enough, Blindfire needs more than its novel concept to succeed. The $8.99 may also seem appealing, but the amount of content just doesn't cut it, even if you're a fan. And even if it's only just begun the early access journey, Double Eleven will have to do something to increase the player base if it wa",
        "id": 1622319,
        "language": null,
        "link": "https://www.youtube.com/watch?v=dpYJ9CfIcwI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/dpYJ9CfIcwI/hqdefault.jpg",
        "title": "Blindfire PS5 Early Access Review - Dead On Arrival",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T16:30:05+00:00",
        "description": "Thanks to their interactive nature, video games can serve up some of the most visceral experiences in any form of media. Of course, these experiences aren’t always going to be uplifting and beautiful. \n\nNo, time and again video games have served up some of the darkest moments ever created, and these instances are all the more tangible when compared to movies or TV shows given we’re in control. \n\nThe darkest moments included in this rundown might not be especially dark to you. Each person’s version of what traumatises them varies, but it’s inescapable that the 15 featured here are dark – ranging from upsetting, through horrific, to downright harrowing moments which imprint themselves permanently in your brain.",
        "id": 1621372,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Rjj6AiAzbaE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/Rjj6AiAzbaE/hqdefault.jpg",
        "title": "15 DARKEST Things Gamers Have Seen In Video Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T13:30:34+00:00",
        "description": "There's nothing more enjoyable than celebrating games and everything to do with them, and though we are obviously going to be doing plenty of that as we close out the year and look back at everything that it had to offer, we have to acknowledge that good games always come with the bad ones- and yes, 2024 did have a few stinkers up its sleeve. \n\nHere, we're going to call out what we felt were the seventeen worst games to have been released this year.",
        "id": 1620789,
        "language": null,
        "link": "https://www.youtube.com/watch?v=sb3BLK7YHJg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/sb3BLK7YHJg/hqdefault.jpg",
        "title": "17 WORST Games of 2024 You Wish You Had Never Played",
        "vote": 0
    }
]