[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T23:17:48.056456+00:00",
        "description": "United Nations members gathered this week in Busan, South Korea to negotiate the first treaty reducing plastic pollution. But Politico reports that \"talks collapsed late Sunday after negotiators failed to resolve their differences and agree on a global plastic treaty.\nAt the heart of the disagreement was a refusal by oil-rich nations led by Saudi Arabia to accept a deal that put limits on plastic production... Throughout the two years of talks, oil-rich and plastic-producing states had repeatedly clashed with nations that wanted to reduce plastic production to solve a worsening plastic pollution crisis. Many went to Busan hopeful differences would be put aside in the name of combatting a common global threat. But in the end this proved too optimistic... \n\nThe EU, alongside more than 100 other countries that included the U.K., on Thursday had backed a new proposal spearheaded by Panama pushing for a global target to reduce plastic production to \"sustainable levels\", drawing a clear ba",
        "id": 1623078,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/01/2226229/un-plastic-treaty-talks-collapse-without-a-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UN Plastic Treaty Talks Collapse Without a Deal",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T21:08:19.729075+00:00",
        "description": "Bluesky now has more active website users than Threads in the U.S., according to a graph from the Financial Times. And though Threads still leads in app usage, \"Prior to November 5 Threads had five times more daily active users in the U.S. than Bluesky... Now, Threads is only 1.5 times larger than its rival, Similarweb said.\" \nBut \"the influx of new users has opened up new opportunities for scammers and impersonators,\" Engadget reported this week:\n\nA recent analysis by Alexios Mantzarlis, director of the Security Trust and Safety Initiative at Cornell Tech found that 44 percent of the top 100 most-followed accounts on Bluesky had at least one \"doppelganger,\" with most looking like \"cheap knock-offs of the bigger account, down to the same bio and profile picture,\" Mantzarlis wrote in his newsletter Faked Up. \n\nThe article highlighted issues with Bluesky's loose account verification policies. And then, Bluesky announced a new change-of-policy Friday. Engadget reports:\n\n\nThe Bluesky Saf",
        "id": 1622592,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/01/2056219/bluesky-passes-threads-for-active-website-users-but-confronts-scammers-and-impersonators?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bluesky Passes Threads for Active Website Users, But Confronts 'Scammers and Impersonators'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T20:03:46.879026+00:00",
        "description": "Greg Kroah-Hartman noted some coming changes in Linux 6.13 will make it possible to create \"way more\" Rust-based kernel drivers. \"The veteran kernel developer believes we're at a tipping point of seeing more upstream Rust drivers ahead,\" reports Phoronix:\n\nThese Rust char/misc changes are on top of the main Rust pull for Linux 6.13 that brought 3k lines of code for providing more Rust infrastructure. Linux 6.13 separately is also bringing Rust file abstractions.\n \n\n\"Sorry for doing this at the end of the merge window,\" Greg Kroah-Hartman wrote in the pull request, explaining that \"conference and holiday travel got in the way on my side (hence the 5am pull request emails...)\"\n\nLoads of things in here... \n &mdash; Rust misc driver bindings and other rust changes to make misc drivers actually possible. I think this is the tipping point, expect to see way more rust drivers going forward now that these bindings are present. \nNext merge window hopefully we will have pci and platform driver",
        "id": 1622293,
        "language": null,
        "link": "https://linux.slashdot.org/story/24/12/01/1837222/greg-kroah-hartman-sees-tipping-point-for-rust-drivers-in-linux-kernel?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Greg Kroah-Hartman Sees 'Tipping Point' for Rust Drivers in Linux Kernel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T18:58:39.016162+00:00",
        "description": "Long-time Slashdot reader jaromil writes:\nAs a fun project, we hacked together a C interpreter (based on Tiny C Compiler) that compiles C code in-memory and runs it live. \n\nCJIT today is a 2MB executable that can do a lot, including call functions from any installed library on Linux, Windows, and MacOSX.\n \nSlashdot reader oliwer points out \"they are also including a REPL, which could be interesting.\" And the CJIT web page promises there's \"no EULA to sign, no IDE to install... 100% Free and open source!\" \n\nIt also says the project was inspired by Terry Davis (TempleOS) and Fabrice Bellard (Tiny C Compiler).<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=CJIT+-+C%2C+Just+In+Time!%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F01%2F0016250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/share",
        "id": 1621995,
        "language": null,
        "link": "https://developers.slashdot.org/story/24/12/01/0016250/cjit---c-just-in-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "CJIT - C, Just In Time!",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T17:53:00.574188+00:00",
        "description": "Primarily used by law enforcement, Graykey unlocks mobile devices to extract data from both Android and iOS systems, according to the blog AppleInsider, \"though its effectiveness varies depending on the specific hardware and software involved.\"\n\nBut while its capabilities are rarely disclosed, \"a leak of some Grayshift's internal documents was recently reported on by 404 Media.\"\n\nAccording to the data, Graykey can only perform \"partial\" data retrieval from iPhones running iOS 18 and iOS 18.0.1. These versions were released in September and early October, respectively. A partial extraction likely includes unencrypted files and metadata, such as folder structures and file sizes, according to past reports. Notably, Graykey struggles with beta versions of iOS 18.1. Under the latest update, the tool fails to extract any data, as per the documents. \nMeanwhile, Graykey's performance with Android phones varies, largely due to the diversity of devices and manufacturers. On Google's Pixel line",
        "id": 1621680,
        "language": null,
        "link": "https://mobile.slashdot.org/story/24/11/30/2359220/leaked-documents-show-what-phones-secretive-tech-graykey-can-unlock?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Leaked Documents Show What Phones Secretive Tech 'Graykey' Can Unlock",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T16:47:52.525643+00:00",
        "description": "Nonprofit Code.org has posted this year's cartoon for \"Hour of Code,\" their annual learn-to-code event for schoolchildren. \n\nLong-time Slashdot reader theodp notes its animated pigeon gives a shout-out to the AI that could ultimately replace programmers:\n\nIn an Instagram post introducing the video, Code.org explains: \"Bartlett the Pigeon just learned how to code and now thinks he's smarter than us. Honestly...he might be. Meet the face (and feathers) of this year's #HourOfCode.\" In the video, Bartlett wows a social media influencer with his coding skills. \"Is this pigeon typing code?\" she asks in disbelief. \"I'm going to film this for my socials!\" Bartlett goes on to explain that the song he remixes with coding blocks &mdash; Aloe Blacc's \"I Need a Dollar\" &mdash; could have instead been generated by simply using AI, which he says is \"like having a personal DJ assistant who never misses a beat!\" \n\nInterestingly, Blacc noted in a 2011 interview that he wrote \"I Need a Dollar\" after be",
        "id": 1621347,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/30/2343244/hour-of-code-cartoon-includes-a-shout-out-to-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Hour of Code' Cartoon Includes a Shout-Out to AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T15:43:14.146946+00:00",
        "description": "\"Spacecraft, satellites, and space-based systems all face cybersecurity threats that are becoming increasingly sophisticated and dangerous,\" reports CNBC. \n\n\"With interconnected technologies controlling everything from navigation to anti-ballistic missiles, a security breach could have catastrophic consequences.\"\n\nCritical space infrastructure is susceptible to threats across three key segments: in space, on the ground segment and within the communication links between the two. A break in one can be a cascading failure for all, said Wayne Lonstein, co-founder and CEO at VFT Solutions, and co-author of Cyber-Human Systems, Space Technologies, and Threats. \"In many ways, the threats to critical infrastructure on Earth can cause vulnerabilities in space,\" Lonstein said. \"Internet, power, spoofing and so many other vectors that can cause havoc in space,\" he added. The integration of artificial intelligence into space projects has heightened the risk of sophisticated cyber attacks orchest",
        "id": 1621066,
        "language": null,
        "link": "https://science.slashdot.org/story/24/11/30/2221228/spacecraft-face-sophisticated-and-dangerous-cybersecurity-threats?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Spacecraft Face 'Sophisticated and Dangerous' Cybersecurity Threats",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T13:32:51.389481+00:00",
        "description": "To help replace power plants, Japan's northernmost island, Hokkaido, \"is turning to a new generation of batteries designed to stockpile massive amounts of energy,\" reports the Washington Post. \n\n\"The Hokkaido Electric Power Network (HEPCO Network) is deploying flow batteries, an emerging kind of battery that stores energy in hulking tanks of metallic liquid.\"\n\n[F]low batteries are making their debut in big real-world projects. Sumitomo Electric, the company that built the Hokkaido plant, has also built flow batteries in Taiwan, Belgium, Australia, Morocco and California. Hokkaido's flow battery farm was the biggest in the world when it opened in April 2022 &mdash; a record that lasted just a month before China built one that is eight times bigger and can deliver as much energy as an average U.S. natural gas plant. \"It looks like flow batteries are finally about to take off with interest from China,\" said Michael Taylor, an energy analyst at the International Renewable Energy Agency, ",
        "id": 1620483,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/11/30/0659210/utilities-are-trying-enormous-flow-batteries-big-enough-to-oust-coal-power-plants?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Utilities Are Trying Enormous 'Flow' Batteries Big Enough to Oust Coal Power Plants",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T09:15:12.173378+00:00",
        "description": "It's one of the most successful &mdash; and oldest &mdash; computer games of all-time. This week CBS News Minnesota interviewed Bill Heinemann, who in 1971 co-created \"The Oregon Trail\" as an educational video game simulating pioneers travelling west.\n\n\"It's surprising and gratifying and humbling, in a way, that a little thing that I spent two weeks on has become a worldwide phenomenon,\" Heinemann said... The game's become known for the many ways players can die, including by dysentery, but Heinemann's favorite was death by snake bite. \"It only happened once every several hundred times, and so people could've played it for months and all of a sudden, 'What? I got bit by a snake and died? This has never happened to me before!'\" he said. \nThe game has been the subject of numerous satirical articles by McSweeney's. And long-time Slashdot reader whois_drek points out that a sketch comedy group also based a movie on the videogame in 2023. \n\n\nSo how does the game's co-creator feel about Ap",
        "id": 1619498,
        "language": null,
        "link": "https://games.slashdot.org/story/24/12/01/0112232/what-the-oregon-trail-co-creator-thinks-of-apples-plans-for-a-movie?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "What 'The Oregon Trail' Co-Creator Thinks of Apple's Plans for a Movie",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T04:54:28.244398+00:00",
        "description": "The world's use of clean energy \"is rapidly growing\", reports the Washington Post, \"but not fast enough to keep temperatures in check...\" \n\nMany experts say it will be the economics of clean energy that defines the future of the planet &mdash; and how developing countries choose to meet their growing electricity demands. \"What happens in emerging and developing economies in the next decade in some sense is the whole ballgame,\" said Jason Bordoff, founding director of the Center for Global Energy Policy at Columbia University. Global greenhouse gas emissions could peak as soon as next year, according to the International Energy Agency, but are not on course to drop sharply enough to contain warming. The world would have to cut its emissions roughly in half by 2035 to meet the 1.5 C target, scientists warn, in part because carbon dioxide stays in the atmosphere for centuries. \n\nInstead, the U.N. projects that nations' current policies will lead to 3.1 C of warming by 2100, or as little",
        "id": 1618924,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/30/0727246/despite-clean-energy-use-global-warming-is-still-projected-to-continue?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Despite Clean Energy Use, Global Warming is Still Projected to Continue",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-01T02:44:52.474931+00:00",
        "description": "Friday the Software Freedom Conservancy announced the production release of the new OpenWrt One network router &mdash; designed specifically for running the Linux-based router OS OpenWrt (a member project of the SFC). \"This is the first wireless Internet router designed and built with your software freedom and right to repair in mind. \n\n\"The OpenWrt One will never be locked down and is forever unbrickable.\"\n This device services your needs as its owner and user. Everyone deserves control of their computing. The OpenWrt One takes a great first step toward bringing software rights to your home: you can control your own network with the software of your choice, and ensure your right to change, modify, and repair it as you like. \n\nThe OpenWrt One demonstrates what's possible when hardware designers and manufacturers prioritize your software right to repair; OpenWrt One exuberantly follows these requirements of the copyleft licenses of Linux and other GPL'd programs. This device provides ",
        "id": 1618664,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/11/30/1948202/openwrt-one-released-first-router-designed-specifically-for-openwrt?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenWRT One Released: First Router Designed Specifically For OpenWrt",
        "vote": 0
    }
]