[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "The Lord of the Rings: Return to Moria PS5 Review - The Final Verdict", "description": "It’s clear that the people involved with this game tried to capitalize on the recognition of The Lord of the Rings and mesh that with the recent burst in popularity of survival games to create a video game, but  Return to Moria lacks in quality. It’s not a fun game, and it’s even worse that the developer didn’t put any real effort into fixing these problems with the console release.\n\nIf you are someone who is really into The Lord of the Rings, you could find something of value here - provided you are able to look past the buffet of issues present in the final product. Others are advised to skip this game since you will find a much better and more entertaining experience with other survival games.", "link": "https://www.youtube.com/watch?v=CShLfCvcMzM", "date_published": "2023-12-09T17:30:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/CShLfCvcMzM/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 MORE Games With Excellent Combat Mechanics That Are A COMPLETE BLAST!", "description": "Games are undoubtedly pieces of art, and like how any piece of art like music or movies can grip you with its themes and melodies - games have the ability to achieve a similar effect through their forms of interaction. \n\nThe best developers pay a ton of attention to how their games are crafted, how well the mechanics mesh with each other, and how they help in achieving the creative vision of the game. \n\nWhen done right, these games can be really addictive experiences where it’s almost impossible to stop playing. With this feature, we will be looking at 15 such games that feature addictive combat loops. We will also be briefly analyzing the design of each of these games in an effort to understand what exactly makes them tick.\n\nCheck out our previous parts on this topic:\n\nhttps://www.youtube.com/watch?v=1JhTa2GDKRc\nhttps://www.youtube.com/watch?v=VFLy9kmW_F4\nhttps://www.youtube.com/watch?v=gdYSOTYhxWY", "link": "https://www.youtube.com/watch?v=UscVhcaYbU8", "date_published": "2023-12-09T14:00:28+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/UscVhcaYbU8/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 MORE UNDERRATED PS4 Games You Didn't Care About [2023 Edition]", "description": "Sony had a great run with the PS4 last generation. The gaming giant was able to sell over a hundred million units on the back of its strong library of first-party and third-party games - many of which have gone on to become some of the best games of the last generation. \n\nHowever, there has also been no shortage of equally great games that never quite reached the heights of critical or commercial reception that they were capable of. Some of these games had rough edges, some had poor marketing - but they are some of the most underrated games that you will find on the PS4. With this feature, we take a look at 15 such underrated video games that are worth a second shot.", "link": "https://www.youtube.com/watch?v=y9wDPPIubsI", "date_published": "2023-12-09T09:00:40+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/y9wDPPIubsI/hqdefault.jpg", "age": null, "page_rating_contents": 52, "page_rating_votes": 0, "page_rating_visits": 1, "page_rating": 52, "tags": [], "comments": [], "vote": 0}]