[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T15:30:05+00:00", "description": "Assassin’s Creed Origins was a true nexus point for the genre, hosting the largest number of new features an open world game has ever had. It was the first time the genre leaned heavily into action RPG mechanics with its expanded skill trees, experience points, and upgrade system. \n\nThe combat was very flexible, allowing you to stealth through situations using your eagle to tag marks and objectives, or to go in guns blazing using your giant axe. \n\nI loved the feel of the swings, dodges, and parries. Movement in general is intuitive and fluid, which leads to the exploration. Exploration was top notch in Origins. Seriously, the wildlife is the best it's ever been, with crocodiles, camels, unicorns, lions, and cats that you can pet and tame. Future games would force heavy grinding to get past certain enemies, but Origins hit the sweet spot of RPG balance.", "id": 823372, "language": null, "link": "https://www.youtube.com/watch?v=DcR1LUOSbJw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/DcR1LUOSbJw/hqdefault.jpg", "title": "What Made Assassin’s Creed Origins So Good?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T10:00:34+00:00", "description": "What’s more dangerous than a game with an endless ocean of content to dive into? A game with an endless ocean of content that is backed up by an equally addictive core gameplay loop. When you put those things together, it’s more than a little likely that you’re going to be creating a game that’s going to bite straight into its players and refuse to let go for hundreds and hundreds of hours. \n\nFrom multiplayer masterpieces to open world epics, from beloved indie gems to unlikely success stories, from single player behemoths to live service time sinks, there is no shortage of games out there that can be that dangerously addictive. Here, we are going to talk about a few such games.", "id": 822336, "language": null, "link": "https://www.youtube.com/watch?v=XFc6r0gyx1w", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/XFc6r0gyx1w/hqdefault.jpg", "title": "10 Games To AVOID If You Want To Get Stuff Done", "user": null, "vote": 0}]