[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T23:13:35.294863+00:00", "description": "\"China may be the world's second-largest economy,\" writes Fortune's news editor, \"but when it comes to startup funding, the U.K. is punching above its weight.\"\n\n\nStartups in the U.K. raised $6.7 billion in funding during the first half of 2024, helping dethrone China and propelling the U.K. to second place globally for funds raised, according to a new report. Crucial to the U.K.'s success were a dozen funding rounds worth over $100 million each, including those of digital bank Monzo ($620 million), lender Abound ($862 million), and automated driving startup Wayve ($1.05 billion). \n\n\nWhile the overall U.K. figure was down 2% year on year, according to data from global market intelligence platform Tracxn, it remained more robust than that of China, whose funding sat at $6.1 billion in H1 2024, helping the U.K. move into the No. 2 spot globally. The win is a milestone for the U.K. tech sector, which has remained under pressure owing to a string of challenges, including Brexit, COVID-19, ", "id": 824689, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/07/2249235/uk-tech-overtakes-china-as-worlds-second-largest-country-for-startup-funding-raised?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "UK Tech Overtakes China as World's Second Largest Country for Startup Funding Raised", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T22:08:20.416238+00:00", "description": "Linux's vDSO (or virtual dynamic shared object) is \"a small shared library that the kernel automatically maps into the address space of all user-space applications,\" according to its man page. \"There are some system calls the kernel provides that user-space code ends up using frequently, to the point that such calls can dominate overall performance... due both to the frequency of the call as well as the context-switch overhead that results from exiting user space and entering the kernel.\"\n\n \n\nBut Linus Torvalds had a lot to say about a proposed getrandom() upgrade, reports Phoronix:\n\n This getrandom() work in the vDSO has been through 20+ rounds of review over the past 2+ years, but... Torvalds took some time out of his U.S. Independence Day to argue the merits of the patches on the Linux kernel mailing list. Torvalds kicked things off by writing: \n\nNobody has explained to me what has changed since your last vdso getrandom, and I'm not planning on pulling it unless that fundamental fl", "id": 824493, "language": "en-us", "link": "https://linux.slashdot.org/story/24/07/07/2116225/linus-torvalds-tactfully-discusses-value-of-getrandom-upgrade-for-linux-vdso?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Linus Torvalds Tactfully Discusses Value of getrandom() Upgrade for Linux vDSO", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T18:50:29.123395+00:00", "description": "As Amazon's stock hits a record high (rising 32% just this year), long-time Slashdot reader theodp writes:\n\nGeekWire reports that Jeff Bezos keeps selling Amazon stock after announcing his move away from Washington state &mdash; and its 7% tax on capital gains of more than $262,000 from the sale of stocks and bonds &mdash; to Florida, which does not have a capital gains tax (like WA, FL also does not tax personal income). Taylor Soper writes, \"Bezos saved more than $600 million by moving to Miami and avoiding Washington's capital gains tax, CNBC reported in February, based on his sale of 50 million shares [$8.5 billion] earlier this year. With the sale of 25 million additional shares [$5 billion], revealed this week in a regulatory filing, Bezos will likely have saved close to $1 billion in total so far. It's a giant chunk of change that would have otherwise gone to the state of Washington.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Jeff", "id": 823953, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/07/186222/jeff-bezoss-move-from-wa-to-fl-has-saved-him-close-to-1b-in-taxes-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Jeff Bezos's Move From WA To FL Has Saved Him Close To $1B in Taxes This Year", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T17:45:49.942444+00:00", "description": "Workers at delivery company Shipt \"found that their paychecks had become...unpredictable,\" according to an article in IEEE Spectrum. \"They were doing the same work they'd always done, yet their paychecks were often less than they expected. And they didn't know why....\" \n\nThe article notes that \"Companies whose business models rely on gig workers have an interest in keeping their algorithms opaque.\" But \"The workers showed that it's possible to fight back against the opaque authority of algorithms, creating transparency despite a corporation's wishes.\"\nOn Facebook and Reddit, workers compared notes. Previously, they'd known what to expect from their pay because Shipt had a formula: It gave workers a base pay of $5 per delivery plus 7.5 percent of the total amount of the customer's order through the app. That formula allowed workers to look at order amounts and choose jobs that were worth their time. But Shipt had changed the payment rules without alerting workers. When the company fina", "id": 823737, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/07/1740214/shipts-pay-algorithm-squeezed-gig-workers-they-fought-back?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Shipt's Pay Algorithm Squeezed Gig Workers. They Fought Back", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T16:40:59.528148+00:00", "description": "An anonymous reader shared this report from NPR:\n\n\nA teenage computer whiz who used the early-aughts internet to spread awareness of the Catholic faith will become the church's first millennial saint. \n\nCarlo Acutis, who died of leukemia at age 15 in 2006, is already referred to as \"God's influencer\" and the \"patron saint of the internet\" for his work cataloging Eucharistic miracles around the world &mdash; and soon it will be official. Pope Francis and a group of cardinals approved Acutis for canonization at a meeting at the Vatican on Monday, Vatican News announced. It says he will likely be proclaimed a saint at some point in 2025, during the church's jubilee year. \n\nAcutis was a devout Catholic who taught himself programming from an early age and created websites with a spiritual focus, including his widely praised database of miracles. He is credited with helping homeless people and defending victims of bullying during his lifetime, and having a hand in two healing miracles after", "id": 823574, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/07/0121243/15-year-old-webmaster-nicknamed-gods-influencer-will-be-catholic-churchs-first-millennial-saint?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "15-Year-Old Webmaster Nicknamed 'God's Influencer' Will Be Catholic Church's First Millennial Saint", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T16:40:56.807686+00:00", "description": "At one point on Friday the entire cryptocurrency market shed more than $170 billion in capitalization within 24 hours, CNBC reported (citing data from CoinGecko). \n\n\"Cryptocurrencies plunged... as investors focused on the payout of nearly $9 billion to users of collapsed bitcoin exchange Mt. Gox.\"\n\n\nThis dumping of coins onto the market is expected to lead to some significant selling action. The slump in crypto prices led to hefty liquidations in the derivatives markets, according to crypto data firm Coinglass, which suggests that 229,755 traders had their positions worth a combined $639.58 million liquidated [within 24 hours]. Of this sum, $540.46 million represented long trades &mdash; financial positions taken when an investor expects the price of an asset to appreciate over the long term. Also pressuring crypto markets, the German government on Thursday sold roughly 3,000 bitcoins &mdash; worth approximately $175 million as of today's prices &mdash; from a 50,000-bitcoin pile seiz", "id": 823573, "language": "en-us", "link": "https://slashdot.org/story/24/07/07/1546226/170-billion-selloff-in-cryptocurrencies-friday-as-mt-gox-payout-looms?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "$170 Billion Selloff in Cryptocurrencies Friday as Mt. Gox Payout Looms", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T15:36:18.675348+00:00", "description": "\"After sixteen years since the introduction of Python 3, the Fedora project announces that Python 2.7, the last of the Python 2 series, will be retired,\" according to long-time Slashdot reader slack_justyb. \n\n From the announcement on the Fedora changes page: The python2.7 package will be retired without replacement from Fedora Linux 41. There will be no Python 2 in Fedora 41+ other than PyPy. Packages requiring python2.7 on runtime or buildtime will have to deal with the retirement or be retired as well. \n\n\"This also comes with the announcement that GIMP 3 will be coming to Fedora 41 to remove any last Python 2 dependencies,\" adds slack_justyb. GIMP 2 was originally released on March 23, 2004.\n\nGIMP will be updated to GIMP 3 with Python 3 support. Python 2 dependencies of GIMP will be retired. \n\nPython 2's end of life was originally 2015, but was extended to 2020. The Python maintainers close with this:\n\n\nThe Python maintainers will no longer regularly backport security fixes to Pyth", "id": 823349, "language": "en-us", "link": "https://developers.slashdot.org/story/24/07/06/234249/fedora-41-finally-retires-python-27?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Fedora 41 Finally Retires Python 2.7", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T12:21:18.707490+00:00", "description": "Harvard Business School has an \"Institute for Business in Global Society\" that explores the societal impacts of business. And they've recently published some new AI-powered research about EV charging infrastructure, according to the Institute's blog, conducted by climate fellow Omar Asensio. \n\n\"Asensio and his team, supported by Microsoft and National Science Foundation awards, spent years building models and training AI tools to extract insights and make predictions,\" using the reviews drivers left (in more than 72 languages) on the smartphone apps drivers use to pay for charging. And ultimately this research identified \"a significant obstacle to increasing electric vehicle (EV) sales and decreasing carbon emissions in the United States: owners' deep frustration with the state of charging infrastructure, including unreliability, erratic pricing, and lack of charging locations...\"\n\n [C]harging stations in the U.S. have an average reliability score of only 78%, meaning that about one i", "id": 822715, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/07/0511243/new-research-finds-americas-ev-chargers-are-just-78-reliable-and-underfunded?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New Research Finds America's EV Chargers Are Just 78% Reliable (and Underfunded)", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T08:02:55.200489+00:00", "description": "In Communications of the ACM,/em&gt;, long-time FreeBSD contributor Poul-Henning Kamp mocks the idea that the free and open-source software has \"come apart\" and \"will end in tears and regret.\"\n \nEconomists and others focused on money &mdash; like my bank &mdash; have had a lot of trouble figuring out the free and open source software (FOSS) phenomenon, and eventually they seem to have reached the conclusion that it just makes no sense. So, they go with the flow. Recently, very serious people in the FOSS movement have started to write long and thoughtful opinion pieces about how it has all come apart and will end in tears and regret. Allow me to disagree... \n\nWhat follows is a humorous history of how the Open Source movement bested a series of ill-conceived marketing failures starting after the \"utterly bad\" 1980s when IBM had an \"unimaginably huge monopoly\" &mdash; and an era of vendor lock-in from companies trying to be the next IBM:\n\nOut of that utter market failure came Minix, (Net", "id": 821993, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/07/0243241/freebsd-contributor-mocks-gloomy-predictions-for-the-open-source-movement?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FreeBSD Contributor Mocks Gloomy Predictions for the Open Source Movement", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T04:47:00.644030+00:00", "description": "Slashdot reader joshuark shared this report from Windows Central\n\n\n\nMicrosoft may have opened a can of worms with recent comments made by the tech giant's CEO of AI Mustafa Suleyman. The CEO spoke with CNBC's Andrew Ross Sorkin at the Aspen Ideas Festival earlier this week. In his remarks, Suleyman claimed that all content shared on the web is available to be used for AI training unless a content producer says otherwise specifically. \nThe whole discussion was interesting &mdash; but this particular question was very direct. CNBC's interviewer specifically said, \"There are a number of authors here... and a number of journalists as well. And it appears that a lot of the information that has been trained on over the years has come from the web &mdash; and some of it's the open web, and some of it's not, and we've heard stories about how OpenAI was turning YouTube videos into transcripts and then training on the transcripts.\" \nThe question becomes \"Who is supposed to own the IP, who is su", "id": 821592, "language": "en-us", "link": "https://slashdot.org/story/24/07/07/0054220/microsofts-ai-ceo-web-content-without-a-robotstxt-file-is-freeware-for-ai-training?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft's AI CEO: Web Content (Without a Robots.txt File) is 'Freeware' for AI Training", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-07T02:37:03.398554+00:00", "description": "Monday Boeing announced plans to acquire its key supplier, Spirit AeroSystems, for $4.7 billion, according to the Associated Press &mdash; \"a move that it says will improve plane quality and safety amid increasing scrutiny by Congress, airlines and the Department of Justice. Boeing previously owned Spirit, and the purchase would reverse a longtime Boeing strategy of outsourcing key work on its passenger planes.\" \n\nBut meanwhile, an anonymous reader shared this report from Newsweek:\n\n\nMore than a hundred Boeing whistleblowers have contacted the U.S. aviation watchdog since the start of the year, Newsweek can reveal. Official figures show that the Federal Aviation Administration's (FAA) whistleblowing hotline has seen a huge surge of calls from workers concerned about safety problems. Since January the watchdog saw a total of 126 reports, via various channels, from workers concerned about safety problems. In 2023, there were just 11.... \n\nAfter a visit from FAA Administrator Mike Whitak", "id": 821402, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/06/2359257/amid-whistleblower-complaints-boeing-buys-spirit-ending-outsourcing-of-key-work-on-planes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amid Whistleblower Complaints, Boeing Buys Spirit, Ending Outsourcing of Key Work on Planes", "user": null, "vote": 0}]