[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T23:20:10.441939+00:00", "description": "Jess Weatherbed reports via The Verge: At least 224 people with diabetes have reported injuries linked to a defective iOS app that caused their insulin pumps to shut down prematurely, according to the US Food and Drug Administration (FDA). On Wednesday, the agency announced that California-based medical device manufacturer Tandem Diabetes Care has issued a recall for version 2.7 of the iOS t:connect mobile app, which is used in conjunction with the company's t:slim X2 insulin pump. Specifically, the recall relates to a software issue that can cause the app to repeatedly crash and relaunch, resulting in the pump's battery being drained by excessive Bluetooth communication.\n \nThis battery drain can cause the pump to shut down \"earlier than typically expected\" according to Tandem, though the pump will notify users of an imminent shutdown via an alarm and low-power alert. The company has notified customers to update the mobile app to version 2.7.1 or later, which should fix the defective ", "language": "en-us", "link": "https://slashdot.org/story/24/05/09/2125246/fda-recalls-defective-ios-app-that-injured-over-200-insulin-pump-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FDA Recalls Defective iOS App That Injured Over 200 Insulin Pump Users", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T22:15:14.567910+00:00", "description": "An anonymous reader quotes a report from CNBC: In 2022, at the height of the \"great resignation,\" a record 4.5 million workers each month -- about 3% of the U.S. workforce -- were quitting their jobs. While some economists have said this pandemic-era trend is over, new research from Microsoft and LinkedIn forecasts that even more people plan to leave their jobs in 2024. Nearly half (46%) of professionals say they're considering quitting in the year ahead -- higher than the 40% who said the same ahead of 2021s great resignation, according to new research from Microsoft and LinkedIn, which surveyed more than 30,000 people in 31 countries between February and March 2024.\n \nIn the U.S., LinkedIn has seen a 14% increase in job applications per opening since last fall, with 85% of workers saying they plan to look for a new role in 2024, a survey of 1,013 U.S. professionals conducted between November and December 2023 found. And Americans' confidence in their job-hunting prospects has reache", "language": "en-us", "link": "https://slashdot.org/story/24/05/09/1956241/nearly-50-of-people-are-considering-leaving-their-jobs-in-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Nearly 50% of People Are Considering Leaving Their Jobs In 2024", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T22:15:12.666926+00:00", "description": "T-Mobile and Verizon are in talks to buy parts of U.S. Ceullar in separate transactions, the Wall Street Journal reported on Thursday. Reuters reports: T-Mobile is closing in on a deal to buy a chunk of U.S. Cellular for more than $2 billion, taking over some operations and wireless spectrum licenses, the report said citing people familiar with the matter. Verizon's talks with the regional carrier is expected to take longer and might not result in an agreement, the report added.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=T-Mobile%2C+Verizon+In+Talks+To+Buy+Parts+of+US+Cellular%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F24%2F05%2F09%2F2121239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F24%2F05%2F09%2F2121239%2Ft-mobile-verizon-in-talks-to-buy-parts-of-us-cellular", "language": "en-us", "link": "https://mobile.slashdot.org/story/24/05/09/2121239/t-mobile-verizon-in-talks-to-buy-parts-of-us-cellular?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "T-Mobile, Verizon In Talks To Buy Parts of US Cellular", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T21:09:51.608766+00:00", "description": "ArchieBunker quotes a report from Bloomberg: Texas electricity prices soared almost 100-fold as a high number of power-plant outages raised concerns of a potential evening shortfall. Spot prices at the North Hub, which includes Dallas, jumped to more than $3,000 a megawatt-hour just before 7 p.m. local time, versus about $32 at the same time Tuesday, according to data from the Electric Reliability Council of Texas. This morning, Ercot, as the state's main grid operator is known, issued a \"watch\" for a potential capacity reserve shortage from about 7-9 p.m., meaning the buffer of spare supplies could fall to low enough levels to call on back-up generation, cancel or delay outages or curb usage. \nThe conditions are the tightest of the year so far and raises the risk of prices rising to the $5,000 cap -- which they last did on April 16, when Ercot also warned of a potential shortfall. Unusually hot weather in the region has boosted demand for cooling and lowered the efficiency of many po", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/09/1948203/texas-spot-power-prices-jump-almost-100-fold-on-tight-supply?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Texas Spot Power Prices Jump Almost 100-Fold On Tight Supply", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T20:05:23.152495+00:00", "description": "An anonymous reader quotes a report from The Verge: The Maryland legislature passed two bills over the weekend limiting tech platforms' ability to collect and use consumers' data. Maryland Governor Wes Moore is expected to sign one of those bills, the Maryland Kids Code, on Thursday, MoCo360 reports. If signed into law, the other bill, the Maryland Online Privacy Act, will go into effect in October 2025. The legislation would limit platforms' ability to collect user data and let users opt out of having their data used for targeted advertising and other purposes. Together, the bills would significantly limit social media and other platforms' ability to track their users -- but tech companies, including Amazon, Google, and Meta, have opposed similar legislation. Lawmakers say the goal is to protect children, but tech companies say the bills are a threat to free speech.\n \nPart of the Maryland Kids Code -- the Maryland Age-Appropriate Design Code Act -- will go into effect much sooner, on", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/09/1925225/maryland-passes-two-bills-limiting-tech-platforms-ability-to-track-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Maryland Passes Two Bills Limiting Tech Platforms' Ability To Track Users", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T20:05:21.380100+00:00", "description": "Citing a memo distributed to Apple Store employees, 9to5Mac reports that the new iPad Pro and iPad Air lineups will not include Apple stickers in the box -- \"a key piece of memorabilia\" that dates back as far as 1977's Apple II, notes Ars Technica. While the company says that this is part of its environmental goals to completely remove plastic from its packaging, it begs the question: is the era of stickers in Apple boxes coming to an end? 9to5Mac reports: The M3 MacBook Air that launched in March includes stickers in the box, but Apple Vision Pro (which launched in February) does not. Will the iPhone 16 include stickers in the box? Only time will tell. Ars' Andrew Cunningham writes about the origins of the Apple stickers: Apple has included stickers with its products at least as far back as the Apple II in 1977 when the stickers still said \"Apple Computer\" on them in the company's then-favored Motter Tektura typeface (I couldn't track down a vintage Apple II unboxing, but I did find ", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/09/1940256/is-the-era-of-stickers-in-apple-boxes-coming-to-an-end?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is the Era of Stickers In Apple Boxes Coming To an End?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T18:52:43.141844+00:00", "description": "Apple will deliver some of its upcoming AI features this year via data centers equipped with its own in-house processors, part of a sweeping effort to infuse its devices with AI capabilities. From a report: The company is placing high-end chips -- similar to ones it designed for the Mac -- in cloud-computing servers designed to process the most advanced AI tasks coming to Apple devices, according to people familiar with the matter. Simpler AI-related features will be processed directly on iPhones, iPads and Macs, said the people, who asked not to be identified because the plan is still under wraps. \n\nThe move is part of Apple's much-anticipated push into generative artificial intelligence -- the technology behind ChatGPT and other popular tools. The company is playing catch-up with Big Tech rivals in the area but is poised to lay out an ambitious AI strategy at its Worldwide Developers Conference on June 10. Apple's plan to use its own chips and process AI tasks in the cloud was hatch", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/09/188254/apple-to-power-ai-tools-with-in-house-server-chips-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple To Power AI Tools With In-House Server Chips This Year", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T17:49:00.944601+00:00", "description": "The largest ever recorded leap in the amount of carbon dioxide laden in the world's atmosphere has just occurred, according to researchers who monitor the relentless accumulation of the primary gas that is heating the planet. From a report: The global average concentration of carbon dioxide in March this year was 4.7 parts per million (or ppm) higher than it it was in March last year, which is a record-breaking increase in CO2 levels over a 12-month period. The increase has been spurred, scientists say, by the periodic El Nino climate event, which has now waned, as well as the ongoing and increasing amounts of greenhouse gases expelled into the atmosphere due to the burning of fossil fuels and deforestation. \n\n\"It's really significant to see the pace of the increase over the first four months of this year, which is also a record,\" said Ralph Keeling, director of the CO2 Program at UC San Diego's Scripps Institution of Oceanography. \"We aren't just breaking records in CO2 concentration", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/09/1648249/record-breaking-increase-in-co2-levels-in-worlds-atmosphere?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Record-Breaking Increase in CO2 Levels in World's Atmosphere", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T17:48:59.428092+00:00", "description": "The world is on the verge of a climate abyss, the UN has warned, in response to a Guardian survey that found that hundreds of the world's foremost climate experts expect global heating to soar past the international target of 1.5C. From a report: A series of leading climate figures have reacted to the findings, saying the deep despair voiced by the scientists must be a renewed wake-up call for urgent and radical action to stop burning fossil fuels and save millions of lives and livelihoods. Some said the 1.5C target was hanging by a thread, but it was not yet inevitable that it would be passed, if an extraordinary change in the pace of climate action could be achieved. The Guardian got the views of almost 400 senior authors of reports by the authoritative Intergovernmental Panel on Climate Change. Almost 80% expected a rise of at least 2.5C above preindustrial levels, a catastrophic level of heating, while only 6% thought it would stay within the 1.5C limit. Many expressed their perso", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/09/1716204/world-is-on-edge-of-climate-abyss-un-warns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "World is On Edge of Climate Abyss, UN Warns", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T16:43:34.689328+00:00", "description": "An anonymous reader shares a report: Sonos has responded to the avalanche of feedback -- some good, plenty bad -- about the company's redesigned mobile app that was released on May 7th. In the days since, customers have complained about missing features like sleep timers, broken local music library management, and no longer having the ability to edit playlists or the upcoming song queue. More alarmingly, the Sonos app's accessibility has also taken a hit, something the company says it's aiming to resolve by next month. \n\nIn a statement provided to The Verge, Sonos confirms that it's keenly aware of the gripes that customers have expressed about the new app. It's hearing their response and is working to address the functionality that has (for now) gone missing. But the company is also standing behind its decision to roll out the app this week, basically describing it as a rough patch that will, in theory, lead to a much better experience for everyone down the line. \"Redesigning the Son", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/09/1554231/sonos-says-its-controversial-app-redesign-took-courage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Sonos Says Its Controversial App Redesign Took 'Courage'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T15:37:34.930180+00:00", "description": "Technology giant Dell notified customers on Thursday that it experienced a data breach involving customers' names and physical addresses. TechCrunch: In an email seen by TechCrunch and shared by several people on social media, the computer maker wrote that it was investigating \"an incident involving a Dell portal, which contains a database with limited types of customer information related to purchases from Dell.\" \n\nDell wrote that the information accessed in the breach included customer names, physical addresses, and \"Dell hardware and order information, including service tag, item description, date of order and related warranty information.\" Dell did not say if the incident was caused by malicious outsiders or inadvertent error. The breached data did not include email addresses, telephone numbers, financial or payment information, or \"any highly sensitive customer information,\" according to the company. The company downplayed the impact of the breach in the message.<p><div class=\"sh", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/09/1527252/dell-says-data-breach-involved-customers-physical-addresses?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Dell Says Data Breach Involved Customers' Physical Addresses", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T14:33:05.032355+00:00", "description": "The sudden closure of several video-game studios at Microsoft's Xbox division was the result of a widespread cost-cutting initiative that still isn't finished. From a report: This week, Xbox began offering voluntary severance agreements to producers, quality assurance testers and other staff at ZeniMax, which it purchased in 2020 for $7.5 billion, according to people familiar with the company's plans. Others across the Xbox organization have been told that more cuts are on the way. Employees were shocked by the unexpected shuttering Tuesday of three Xbox subsidiaries and the absorption of a fourth. The closures included Tokyo-based Tango Gameworks, which last year released the critically acclaimed action game Hi-Fi Rush. Tango was in the process of pitching a sequel, said the people, who asked not to be identified discussing nonpublic information. \n\nDuring a town hall with ZeniMax staff on Wednesday morning, Xbox president Matt Booty praised Hi-Fi Rush but did not specify why the comp", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/09/1414219/microsofts-xbox-is-planning-more-cuts-after-studio-closings?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft's Xbox Is Planning More Cuts After Studio Closings", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T13:28:09.690858+00:00", "description": "An anonymous reader quotes a report from TechCrunch: The federal government agency responsible for granting patents and trademarks is alerting thousands of filers whose private addresses were exposed following a second data spill in as many years. The U.S. Patent and Trademark Office (USPTO) said in an email to affected trademark applicants this week that their private domicile address -- which can include their home address -- appeared in public records between August 23, 2023 and April 19, 2024. U.S. trademark law requires that applicants include a private address when filing their paperwork with the agency to prevent fraudulent trademark filings.\n \nUSPTO said that while no addresses appeared in regular searches on the agency's website, about 14,000 applicants' private addresses were included in bulk datasets that USPTO publishes online to aid academic and economic research. The agency took blame for the incident, saying the addresses were \"inadvertently exposed as we transitioned t", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/09/0058228/us-patent-and-trademark-office-confirms-another-leak-of-filers-address-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Patent and Trademark Office Confirms Another Leak of Filers' Address Data", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T10:13:02.852792+00:00", "description": "The North Yorkshire Council in England announced it will ban apostrophes on street signs as it can affect geographical databases. Resident Anne Keywood told the BBC that she urged the authority to retain apostrophes, saying: \"If you start losing things like that then everything goes downhill doesn't it?\" From the report: North Yorkshire Council said it \"along with many others across the country\" had opted to \"eliminate\" the apostrophe from street signs. A spokesperson added: \"All punctuation will be considered but avoided where possible because street names and addresses, when stored in databases, must meet the standards (PDF) set out in BS7666.\n \n\"This restricts the use of punctuation marks and special characters (e.g. apostrophes, hyphens and ampersands) to avoid potential problems when searching the databases as these characters have specific meanings in computer systems.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=North+Yorkshire+Coun", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/09/0046211/north-yorkshire-council-to-ban-apostrophes-on-street-signs-to-avoid-database-problems?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "North Yorkshire Council To Ban Apostrophes On Street Signs To Avoid Database Problems", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T08:03:19.905434+00:00", "description": "Carl Zimmer reports via the New York Times: Ever since the discovery of whale songs almost 60 years ago, scientists have been trying to decipher their lyrics. Are the animals producing complex messages akin to human language? Or sharing simpler pieces of information, like dancing bees do? Or are they communicating something else we don't yet understand? In 2020, a team of marine biologists and computer scientists joined forces to analyze the click-clacking songs of sperm whales, the gray, block-shaped leviathans that swim in most of the world's oceans. On Tuesday, the scientists reported that the whales use a much richer set of sounds than previously known, which they called a \"sperm whale phonetic alphabet.\" In the study published in the journal Nature Communications, researchers found that sperm whales communicate using sequences of clicks, called codas, that exhibit contextual and combinatorial structure. MIT News reports: The researchers identified something of a \"sperm whale phon", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/09/0031231/scientists-find-an-alphabet-in-whale-songs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Scientists Find an 'Alphabet' In Whale Songs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T03:42:46.422892+00:00", "description": "An anonymous reader quotes a report from MIT Technology Review: Once a week, Sun Kai has a video call with his mother. He opens up about work, the pressures he faces as a middle-aged man, and thoughts that he doesn't even discuss with his wife. His mother will occasionally make a comment, like telling him to take care of himself -- he's her only child. But mostly, she just listens. That's because Sun's mother died five years ago. And the person he's talking to isn't actually a person, but a digital replica he made of her -- a moving image that can conduct basic conversations. They've been talking for a few years now. After she died of a sudden illness in 2019, Sun wanted to find a way to keep their connection alive. So he turned to a team at Silicon Intelligence, an AI company based in Nanjing, China, that he cofounded in 2017. He provided them with a photo of her and some audio clips from their WeChat conversations. While the company was mostly focused on audio generation, the staff ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/08/2323247/deepfakes-of-your-dead-loved-ones-are-a-booming-chinese-business?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Deepfakes of Your Dead Loved Ones Are a Booming Chinese Business", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T02:37:43.833632+00:00", "description": "Dell is making sure its employees follow the company's updated return-to-office policy through a series of new tracking techniques. According to The Register, Dell will track employees' badge swipes and VPN connections and include a color-coded attendance grading system that summarizes employee presence.\n \n\"In the latest Jeff Clarke return-to-grade-school initiative, HR will be keeping an attendance report card on employees, grading them at four levels based on how well they meet the goal of being in the office 39 days a quarter,\" a source familiar with Dell told The Register, referring to the IT giant's chief operating officer. \"Employees who do not meet the attendance requirement will have their status escalated up the ladder to Jeff Clarke, who apparently believes that being a hall monitor trumps growing revenue.\" From the report: Starting next Monday, May 13, the enterprise hardware slinger plans to make weekly site visit data from its badge tracking available to employees through", "language": "en-us", "link": "https://slashdot.org/story/24/05/08/2152247/dell-makes-return-to-office-push-with-vpn-badge-tracking?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Dell Makes Return-To-Office Push With VPN, Badge Tracking", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T01:32:44.808674+00:00", "description": "A new national survey (PDF) from CNBC/Generation Lab of 1,033 people aged 18 to 34 found that an overwhelming 81% of respondents believe a four-day workweek would boost their company's productivity, while 19% said productivity would decline. CNBC reports: Those results from the \"Youth &amp; Money in the USA\" survey come amid discussions around the potential benefits of switching from the standard five-day U.S. workweek to a four-day cadence without a pay cut. Some companies have begun testing the arrangement, and say it has mitigated employee burnout and strengthened business performance. Exos, a U.S. coaching company that trains top athletes and leads corporate wellness programs, recently reported results from the first six months of an ongoing four-day workweek experiment. The company said the shortened workweek increased efficiency along with revenue and retention.\n \nAlthough respondents to the CNBC/Generation Lab survey largely agreed on workweek length, they were less unified whe", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/08/229210/81-of-young-people-say-a-4-day-workweek-would-boost-productivity-survey-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "81% of Young People Say a 4-Day Workweek Would Boost Productivity, Survey Finds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T01:32:43.306681+00:00", "description": "Google announced on Tuesday that it will be exiting One Market Plaza, a prominent office complex in San Francisco that it had been occupying since 2018. The company's lease for the 300,000-square-foot-office will expire next April. The San Francisco Chronicle reports: Many of Google's employees are already working outside of the giant waterfront office, in light of the company's flexible approach to office attendance. As one of the city's largest office properties and a prominent feature on its skyline, the 1.6-million-square-foot One Market Plaza complex features two high-rise towers and a 11-story office annex building known as the Landmark.\" Ryan Lamont, a spokesperson for Google, said the company will be moving out of One Market's Spear Tower, but will continue to occupy the smaller Landmark building. He declined to comment on how long Google plans to remain in the latter.\" As we've said before, we're focused on investing in real estate efficiently to meet the current and future n", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/08/2221245/google-will-exit-prominent-san-francisco-waterfront-office-tower?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Will Exit Prominent San Francisco Waterfront Office Tower", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T00:29:00.315851+00:00", "description": "Librarians are fighting a nationwide battle against high e-book prices, which so far has yielded minimal results. Despite efforts and temporary legislative victories, strict renewal and loan policies imposed by publishers keep e-book costs high, limiting the number of popular titles libraries can offer and leading to frustration among patrons. Axios reports: Publishers typically require libraries to renew the license to each e-book every two years, or after 26 loans -- policies that libraries call prohibitively expensive. This restricts the number of e-books -- particularly popular bestsellers -- that they can lend out to patrons, who are angry and baffled by the limitations. Readers love the free (to them) apps that allow them to borrow countless e-books and audiobooks: Libby (the dominant one, run by OverDrive) and hoopla. But some libraries say that the cost of renewing their contracts with OverDrive and hoopla are prohibitive, so they're dropping the apps -- hoopla in particular.\n", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/08/2057218/us-libraries-are-battling-high-prices-for-better-e-book-access?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Libraries Are Battling High Prices For Better E-Book Access", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-09T00:28:58.819368+00:00", "description": "An anonymous reader quotes a report from The Register: Ransomware infections have morphed into \"a psychological attack against the victim organization,\" as criminals use increasingly personal and aggressive tactics to force victims to pay up, according to Google-owned Mandiant. \"We saw situations where threat actors essentially SIM swap the phones of children of executives, and start making phone calls to executives, from the phone numbers of their children,\" Charles Carmakal, Mandiant's CTO, recounted during a Google Security Threat Intelligence Panel at this year's RSA Conference in San Francisco on Monday.\n \n\"Think about the psychological dilemma that the executive goes through &ndash; seeing a phone call from the children, picking up the phone and hearing that it's somebody else's voice? Sometimes, it's caller ID spoofing. Other times, we see demonstrated SIM swapping family members.\" Either way, it's horrifying. It's the next step in the evolution of ransomware tactics, which hav", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/08/211245/ransomware-crooks-now-sim-swap-executives-kids-to-pressure-their-parents?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ransomware Crooks Now SIM Swap Executives' Kids To Pressure Their Parents", "user": null, "vote": 0}]