[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T19:47:39.079378+00:00", "description": "An anonymous reader quotes a report from The Register: Thirty-six flights were cancelled at Japan's New Chitose airport on Saturday after a pair of scissors went missing. Japanese media report that retail outlets at the airport -- which serves the regional city of Chitose on Japan's northernmost island, Hokkaido -- are required to store scissors in a locker. When staff need to cut something, they withdraw the scissors and then replace them after they're done snipping. But last Saturday, an unnamed retailer at the airport was unable to find a pair of scissors. A lengthy search ensued, during which security checks for incoming passengers were paused for at least two hours.\n \nChaos ensued as queues expanded, passengers were denied entry, and airport authorities scrambled to determine whether the scissors had been swiped by somebody with malicious intent. The incident saw over 200 flights delayed, and 36 cancelled altogether. The mess meant some artists didn't appear at a music festival. ", "id": 1037673, "language": "en-us", "link": "https://slashdot.org/story/24/08/21/011258/missing-scissors-cause-36-flight-cancellations-in-japan?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Missing Scissors Cause 36 Flight Cancellations In Japan", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T19:47:37.509805+00:00", "description": "Microsoft is launching three new Xbox Series S / X console options in October. From a report: There's the $449.99 white discless Xbox Series X, a 2TB \"Galaxy Black\" special-edition Xbox Series X priced at $599.99, and a $349.99 1TB Xbox Series S. All three models will be available in the US on October 15th, with other markets to follow on October 29th. \n\nThe white coating on the exterior of this new discless Xbox Series X matches the \"robot white\" found on the Xbox Series S, Microsoft's smaller $299 console. While leaks of the white Xbox Series X hinted that Microsoft may upgrade the heatsink used to cool the console, the company hasn't detailed any hardware changes beyond the removal of the disc drive here.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft's+White+Xbox+Series+X+and+2TB+Special-edition+Model+Launching+in+October%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F08%2F21%2F145259%2F%3Futm_source%3Dtwitter%26utm_medium%3", "id": 1037672, "language": "en-us", "link": "https://games.slashdot.org/story/24/08/21/145259/microsofts-white-xbox-series-x-and-2tb-special-edition-model-launching-in-october?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft's White Xbox Series X and 2TB Special-edition Model Launching in October", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T19:47:35.958609+00:00", "description": "Slack AI, an add-on assistive service available to users of Salesforce's team messaging service, is vulnerable to prompt injection, according to security firm PromptArmor. From a report: The AI service provides generative tools within Slack for tasks like summarizing long conversations, finding answers to questions, and summarizing rarely visited channels. \n\n\"Slack AI uses the conversation data already in Slack to create an intuitive and secure AI experience tailored to you and your organization,\" the messaging app provider explains in its documentation. Except it's not that secure, as PromptArmor tells it. A prompt injection vulnerability in Slack AI makes it possible to fetch data from private Slack channels.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Slack+AI+Can+Be+Tricked+Into+Leaking+Data+From+Private+Channels%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F08%2F21%2F1448249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img sr", "id": 1037671, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/21/1448249/slack-ai-can-be-tricked-into-leaking-data-from-private-channels?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Slack AI Can Be Tricked Into Leaking Data From Private Channels", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T19:47:34.399469+00:00", "description": "An anonymous reader shares a report: U.S. agencies are increasingly accessing parts of a half-billion encrypted chat message haul that has rocked the global organized crime underground, using the chats as part of multiple drug trafficking prosecutions, according to a 404 Media review of U.S. court records. In particular, U.S. authorities are using the chat messages to prosecute alleged maritime drug smugglers who traffic cocaine using speedboats and commercial ships. \n\nThe court records show the continued fallout of the massive hack of encrypted phone company Sky in 2021, in which European agencies obtained the intelligence goldmine of messages despite Sky being advertised as end-to-end encrypted. European authorities have used those messages as the basis for many prosecutions and drug seizures across the continent. Now, it's clear that the blast radius extends to the United States.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Feds+Are+T", "id": 1037670, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/21/1513224/us-feds-are-tapping-a-half-billion-encrypted-messaging-goldmine?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Feds Are Tapping a Half-Billion Encrypted Messaging Goldmine", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T19:47:32.814529+00:00", "description": "CrowdStrike's president hit out at \"shady\" efforts by its cyber security rivals to scare its customers and steal market share in the month since its botched software update sparked a global IT outage. From a report: Michael Sentonas told the Financial Times that attempts by competitors to use the July 19 disruption to promote their own products were \"misguided.\" After criticism from rivals including SentinelOne and Trellix, the CrowdStrike executive said no vendor could \"technically\" guarantee that their own software would never cause a similar incident. \n\n\"Our industry is built on trust,\" Sentonas said. For rivals to take advantage of the meltdown to push their own products \"lets themselves down because, ultimately, people know really quickly fact from, possibly, some shady commentary.\" Texas-based CrowdStrike had a reputation as many major companies' first line of defense against cyber attacks, but the high-profile nature of its clients exacerbated the impact of July's global disrup", "id": 1037669, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/21/1611202/crowdstrike-unhappy-with-shady-commentary-from-competitors-after-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "CrowdStrike Unhappy With 'Shady Commentary' From Competitors After Outage", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T19:47:31.192681+00:00", "description": "South Africa's telecoms industry body is pushing for digital content and service providers to help pay for the roll out of network infrastructure because they generate a huge part of the internet traffic. From a report: The Association of Comms and Technology (ACT) CEO Nomvuyiso Batyi said that the revenues generated by over-the-top (OTT) platforms and the continued success of the OTT model was dependent on the availability of high-quality, reliable and efficient network infrastructure. So \"what we're saying is that the OTTs should contribute towards the network upgrades, the network building,\" she added. OTT platforms or services deliver digital content such as video, audio and messaging directly to consumers over the internet. \"Fair share\" arrangements ensure that OTT providers contribute to the costs of building, maintaining, and upgrading the infrastructure that supports their business.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=South", "id": 1037668, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/21/1635236/south-africas-telco-industry-calls-for-tech-firms-to-help-fund-infrastructure?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "South Africa's Telco Industry Calls For Tech Firms To Help Fund Infrastructure", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T19:47:29.638033+00:00", "description": "bobdevine writes: The Linux operating system has reached a notable milestone in desktop market share, according to the latest data from StatCounter. As of July 2024, Linux has achieved a 4.45% market share for desktop operating systems worldwide. While this percentage might seem small to those unfamiliar with the operating system landscape, it represents a significant milestone for Linux and its dedicated community. What makes this achievement even more thrilling is the upward trajectory of Linux's adoption rate.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Linux+Market+Share+Hits+Record+High%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F08%2F21%2F1733236%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F08%2F21%2F1733236%2Flinux-market-share-hits-record-high%3Futm", "id": 1037667, "language": "en-us", "link": "https://linux.slashdot.org/story/24/08/21/1733236/linux-market-share-hits-record-high?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Linux Market Share Hits Record High", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T19:47:27.626674+00:00", "description": "A growing body of scientific evidence shows that microplastics are accumulating in critical human organs, including the brain, leading researchers to call for more urgent actions to rein in plastic pollution. From a report: Studies have detected tiny shards and specks of plastics in human lungs, placentas, reproductive organs, livers, kidneys, knee and elbow joints, blood vessels and bone marrow. Given the research findings, \"it is now imperative to declare a global emergency\" to deal with plastic pollution, said Sedat Gundogdu, who studies microplastics at Cukurova University in Turkey. Humans are exposed to microplastics -- defined as fragments smaller than 5mm in diameter -- and the chemicals used to make plastics from widespread plastic pollution in air, water and even food. \n\nThe health hazards of microplastics within the human body are not yet well-known. Recent studies are just beginning to suggest they could increase the risk of various conditions such as oxidative stress, whi", "id": 1037666, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/21/1810207/microplastics-are-infiltrating-brain-tissue-studies-show?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microplastics Are Infiltrating Brain Tissue, Studies Show", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T19:47:26.068437+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Chrome users who declined to sync their Google accounts with their browsing data secured a big privacy win this week after previously losing a proposed class action claiming that Google secretly collected personal data without consent from over 100 million Chrome users who opted out of syncing. On Tuesday, the 9th US Circuit Court of Appeals reversed (PDF) the prior court's finding that Google had properly gained consent for the contested data collection. The appeals court said that the US district court had erred in ruling that Google's general privacy policies secured consent for the data collection. The district court failed to consider conflicts with Google's Chrome Privacy Notice (CPN), which said that users' \"choice not to sync Chrome with their Google accounts meant that certain personal information would not be collected and used by Google,\" the appeals court ruled.\n \nRather than analyzing the CPN, it appears that the US d", "id": 1037665, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/21/1921221/google-cant-defend-shady-chrome-data-hoarding-as-browser-agnostic-court-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Can't Defend Shady Chrome Data Hoarding As 'Browser Agnostic,' Court Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T11:16:02.726505+00:00", "description": "The Verge's Tom Warren reports: Valve is banning Counter-Strike 2 players from using keyboard features to automate perfect counter-strafes. Razer was the first keyboard maker to add a Simultaneous Opposing Cardinal Directions (SOCD) feature to its range of Huntsman V3 Pro keyboards last month, followed shortly by Wooting. Using Snap Tap as Razer calls it or Wooting's Snappy Tappy will now get you kicked from Counter-Strike 2 games.\n \n\"Recently, some hardware features have blurred the line between manual input and automation, so we've decided to draw a clear line on what is or isn't acceptable in Counter-Strike,\" says Valve. \"We are no longer going to allow automation (via scripting or hardware) that circumvent these core skills and, moving forward, (and initially -- exclusively on Valve Official Servers) players suspected of automating multiple player actions from a single game input may be kicked from their match.\" [...]\n \nRazer and Wooting's SOCD features both let players automate s", "id": 1036041, "language": "en-us", "link": "https://games.slashdot.org/story/24/08/21/0053227/valve-bans-razer-and-wootings-new-keyboard-features-in-counter-strike-2?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Valve Bans Razer and Wooting's New Keyboard Features In Counter-Strike 2", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T07:33:00.148313+00:00", "description": "Approvals for new coal-fired power plants in China dropped by 80% in the first half of this year compared to last, according to an analysis from Greenpeace and the Shanghai Institutes for International Studies. The Associated Press reports: A review of project documents by Greenpeace East Asia found that 14 new coal plants were approved from January to June with a total capacity of 10.3 gigawatts, down 80% from 50.4 gigawatts in the first half of last year. Authorities approved 90.7 gigawatts in 2022 and 106.4 gigawatts in 2023, a surge that raised alarm among climate experts. China leads the world in solar and wind power installations but the government has said that coal plants are still needed for periods of peak demand because wind and solar power are less reliable. While China's grid gives priority to greener sources of energy, experts worry that it won't be easy for China to wean itself off coal once the new capacity is built.\n \n\"We may now be seeing a turning point,\" Gao Yuhe, ", "id": 1035313, "language": "en-us", "link": "https://slashdot.org/story/24/08/21/0045249/china-is-backing-off-coal-power-plant-approvals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China Is Backing Off Coal Power Plant Approvals", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T04:43:47.926433+00:00", "description": "A new TV series is capturing the dramatic saga of the The Pirate Bay, the notorious file-sharing website that openly challenged the entertainment industry in the early 2000s. A just-launched teaser is available on YouTube. TorrentFreak reports: A few years ago, news broke that The Pirate Bay story was being turned into a TV series. Written by Piotr Marciniak and directed by Jens Sjogren, who also made the \"I am Zlatan\" documentary, production was in the hands of B-Reel Films, working for the Swedish broadcaster SVT. American distribution company Dynamic Television scooped up worldwide rights. As far as we know, international deals have not yet been announced. The Swedish premiere on November 8 is coming closer, however, and a few days ago SVT released an official teaser.\n \nThe founders of The Pirate Bay -- Anakata, Brokep and Tiamo -- are played by Arvid Swedrup, Simon Greger Carlsson and Willjam Lempling. The teaser doesn't give away much, but it's interesting that one of The Pirate ", "id": 1034418, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/08/20/2116212/the-pirate-bay-tv-series-teaser-appears-online?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'The Pirate Bay' TV Series Teaser Appears Online", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T04:43:46.382829+00:00", "description": "OpenAI has announced a partnership with Conde Nest, allowing the company's AI products to display content from Vogue, The New Yorker, Conde Nast Traveler, GQ, Architectural Digest, Vanity Fair, Wired, Bon Appetit and other outlets. CNBC reports: \"With the introduction of our SearchGPT prototype, we're testing new search features that make finding information and reliable content sources faster and more intuitive,\" OpenAI wrote in a blog post. \"We're combining our conversational models with information from the web to give you fast and timely answers with clear and relevant sources.\" OpenAI added that the SearchGPT prototype offers direct links to news stories and that the company plans \"to integrate the best of these features directly into ChatGPT in the future.\" It is the latest in a recent trend of some media outlets joining forces with AI startups such as OpenAI to enter into content deals.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Op", "id": 1034417, "language": "en-us", "link": "https://news.slashdot.org/story/24/08/20/2124239/openai-announces-content-deal-with-conde-nest?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Announces Content Deal With Conde Nest", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T04:43:44.569665+00:00", "description": "U.S. District Judge Ada Brown in Dallas blocked the FTC's rule banning noncompete agreements, arguing the FTC lacks authority to implement such broad regulations and did not adequately justify the sweeping prohibition. Reuters reports: Brown had temporarily blocked the rule in July while she considered a bid by the U.S. Chamber of Commerce, the country's largest business lobby, and tax service firm Ryan to strike it down entirely. The rule was set to take effect Sept. 4. Brown in her ruling said that even if the FTC had the power to adopt the rule, the agency had not justified banning virtually all noncompete agreements. \"The Commission's lack of evidence as to why they chose to impose such a sweeping prohibition ... instead of targeting specific, harmful non-competes, renders the Rule arbitrary and capricious,\" wrote Brown, an appointee of Republican former President Donald Trump.\n \nFTC spokesperson Victoria Graham said the agency was disappointed with the ruling and is \"seriously co", "id": 1034416, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/20/2226217/federal-judge-strikes-down-ban-on-worker-noncompete-agreements?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Federal Judge Strikes Down Ban On Worker 'Noncompete' Agreements", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T04:43:42.512090+00:00", "description": "An anonymous reader quotes a report from The Guardian, written by Julian Benson: It's been eight years since Civilization 6 -- the most recent in a very long-running strategy game series that sees you take a nation from the prehistoric settlement of their first town through centuries of development until they reach the space age. Since 2016 it has amassed an abundance of expansions, scenario packs, new nations, modes and systems for players to master -- but series producer Dennis Shirk at Firaxis Games feels that enough it enough. \"It was getting too big for its britches,\" he says. \"It was time to make something new.\"\n \n\"It's tough to even get through the whole game,\" designer Ed Beach says, singling out the key problem that Firaxis aims to solve with the forthcoming Civilization 7. While the early turns of a campaign in Civilization 6 can be swift, when you're only deciding the actions for the population of a single town, \"the number of systems, units, and entities you must manage ex", "id": 1034415, "language": "en-us", "link": "https://games.slashdot.org/story/24/08/20/224251/civilization-7-captures-the-chaos-of-human-history-in-manageable-doses?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Civilization 7 Captures the Chaos of Human History In Manageable Doses'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T04:43:39.978842+00:00", "description": "Toyota confirmed a breach of its network after 240GB of data, including employee and customer information, was leaked on a hacking forum by a threat actor. The company has not provided details on how or when the breach occurred. BleepingComputer reports: ZeroSevenGroup (the threat actor who leaked the stolen data) says they breached a U.S. branch and were able to steal 240GB of files with information on Toyota employees and customers, as well as contracts and financial information. They also claim to have collected network infrastructure information, including credentials, using the open-source ADRecon tool that helps extract vast amounts of information from Active Directory environments.\n \n\"We have hacked a branch in United States to one of the biggest automotive manufacturer in the world (TOYOTA). We are really glad to share the files with you here for free. The data size: 240 GB,\" the threat actor claims. \"Contents: Everything like Contacts, Finance, Customers, Schemes, Employees, ", "id": 1034414, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/20/2214213/toyota-confirms-breach-after-stolen-data-leaks-on-hacking-forum?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Toyota Confirms Breach After Stolen Data Leaks On Hacking Forum", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T04:43:37.858278+00:00", "description": "Ars Technica's Dan Goodwin writes: Last Tuesday, loads of Linux users&#226;\"many running packages released as early as this year -- started reporting their devices were failing to boot. Instead, they received a cryptic error message that included the phrase: \"Something has gone seriously wrong.\" The cause: an update Microsoft issued as part of its monthly patch release. It was intended to close a 2-year-old vulnerability in GRUB, an open source boot loader used to start up many Linux devices. The vulnerability, with a severity rating of 8.6 out of 10, made it possible for hackers to bypass secure boot, the industry standard for ensuring that devices running Windows or other operating systems don't load malicious firmware or software during the bootup process. CVE-2022-2601 was discovered in 2022, but for unclear reasons, Microsoft patched it only last Tuesday. [...]\n \nWith Microsoft maintaining radio silence, those affected by the glitch have been forced to find their own remedies. On", "id": 1034413, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/21/0031243/something-has-gone-seriously-wrong-dual-boot-systems-warn-after-microsoft-update?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Something Has Gone Seriously Wrong,' Dual-Boot Systems Warn After Microsoft Update", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T04:43:35.718751+00:00", "description": "An anonymous reader quotes a report from The Hill: Births in the United States dropped again between 2022 and 2023, according to new data from the Centers for Disease Control and Prevention (CDC). The national birth rate has been steadily declining for the last 17 years, with a particularly steep drop in births between 2007 and 2009 during the Great Recession. Between 2007 and 2022, the U.S. birth rate fell by nearly 23 percent, according to CDC data. There were 3,596,017 registered births in 2023, about 2 percent fewer than in 2022, when there were 3,667,758 registered births, according to CDC data.\n \nThe general fertility rate fell by nearly 3 percent last year to 54.5 births per 1,000 women between the ages of 15 and 44. That's down from the 2022 rate of 56 births per 1,000 women, CDC data shows. Teen births have declined almost every year since the 1990s and are continuing to fall. The teenage birth rate dropped by 4 percent between 2022 and 2023, from 13.6 to 13.1 births per 1,00", "id": 1034412, "language": "en-us", "link": "https://news.slashdot.org/story/24/08/21/0038231/us-birthrate-hits-new-low-cdc-data-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Birthrate Hits New Low, CDC Data Shows", "user": null, "vote": 0}]