[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T06:45:00+00:00", "description": "Black Myth: Wukong on the PS5, just like its PC counterpart, is a fantastic experience. But what about performance? Are there any graphical modes? How is the image quality? How stable is the game?\n\nThe PS5 version comes packed with three different graphical settings: Quality, Balance and Performance. Each of those modes perform well and although there is scope for improvement and further optimization, the minor issues aren't a deal breaker by any means.\n\nBlack Myth: Wukong excels in engaging combat, intriguing boss fights, exploration and solid progression system. Although the lack of an in-game map hurts the experience, its negatives don't ever eclipse the many positives the game has.\n\nBlack Myth: Wukong is a must play for fans of the action role playing genre, and is one of the best games available on the PS5.", "id": 1035432, "language": null, "link": "https://www.youtube.com/watch?v=HciVFGP5Rw0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/HciVFGP5Rw0/hqdefault.jpg", "title": "Black Myth: Wukong PS5 Review - Your Biggest Questions Answered", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-21T02:00:15+00:00", "description": "Games set after a devastating cataclysm certainly aren’t scarce to come by these days. In 2024 alone, we’ve seen numerous such games across various styles such as Once Human. Well, surprise, surprise, there’s even more post- apocalyptic games to forage and fight through at the tail-end of 2024. \n\nJoin us as we examine 15 upcoming post-apocalyptic games in 2024 and beyond. Thankfully, players don’t have to wait too long to experience some of the games on this list. Frostpunk 2 releases on September 20th followed by two licensed post- apocalyptic games that you may recognize by their film counterparts. \n\nAnd then, there’s a handful of titles on this list that are still fairly early in development such as Gears of War E-Day. One of the most common trends among this list of post-apocalyptic games is their open-world format. With the advent of lossless rendering and automated processes, large, complex open worlds are more accessible to make than ever for indie developers.\n\nIntro 0:00\nNumbe", "id": 1034685, "language": null, "link": "https://www.youtube.com/watch?v=XN8vW_s8bRo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/XN8vW_s8bRo/hqdefault.jpg", "title": "15 UPCOMING Post-Apocalyptic Games of 2024 And Beyond That Are Going To Be All The Rage", "user": null, "vote": 0}]