[{"thumbnail": "https://i2.ytimg.com/vi/mvB_-Y4PyXI/hqdefault.jpg", "language": null, "comments": [], "vote": 0, "page_rating": 0, "title": "Sons of the Forest Review - The Final Verdict", "tags": [], "artist": "GamingBolt", "description": "Sons of the Forest builds on its predecessor with several new items and means of traversal while deepening its depiction of the isle to encompass an entire ecosystem. The narrative may not be as solid and creates more questions, but the freedom to pursue it or focus entirely on sandbox building is great.\n\nLeveraging the sandbox can make for some fun moments, whether running over enemies with a golf cart, carving totems to scare them off or frantically running through mutant-filled caverns. Of course, it also doesn't hurt that the game's presentation features stellar attention to detail with its environmental effects, foliage, wildlife and lighting.\n\nThough the first game may be more of a trailblazer with its combination of narrative and survival crafting, Sons of the Forest still offers a compelling experience with enough scares.", "link": "https://www.youtube.com/watch?v=mvB_-Y4PyXI", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "bookmarked": false, "permanent": false, "page_rating_votes": 0, "page_rating_visits": 0, "user": null, "album": "", "dead": false, "age": null, "source_obj__id": 129, "date_published": "2024-03-07T21:00:21+00:00"}, {"thumbnail": "https://i2.ytimg.com/vi/QNES3iWVtqs/hqdefault.jpg", "language": null, "comments": [], "vote": 0, "page_rating": 0, "title": "Final Fantasy 7 Rebirth vs Original - 10 BIGGEST STORY CHANGES", "tags": [], "artist": "GamingBolt", "description": "There was little doubt in anyone’s mind that Final Fantasy 7 Rebirth would be diverging from the story of the original Final Fantasy 7 in significant ways, given how the remake trilogy’s first game panned out, and sure enough, now that the game is out, we can say that that turned out to be exactly right. \n\nThe key story beats you remember from the original are still here (for the most part), but on top of that, there are several changes as well, from additive additions to flesh things out to radical changes that completely recontextualize the larger story to smart remixing that manages to retain the original’s events but in ways that are just different enough to keep returning fans on their toes. Here, we’re going to talk about a few such narrative changes in Final Fantasy 7 Rebirth.", "link": "https://www.youtube.com/watch?v=QNES3iWVtqs", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "bookmarked": false, "permanent": false, "page_rating_votes": 0, "page_rating_visits": 0, "user": null, "album": "", "dead": false, "age": null, "source_obj__id": 129, "date_published": "2024-03-07T17:00:19+00:00"}, {"thumbnail": "https://i2.ytimg.com/vi/mbpGcYGs1yw/hqdefault.jpg", "language": null, "comments": [], "vote": 0, "page_rating": 0, "title": "15 Single Player Games You Hated In Your First Playthrough And Then Loved It Later", "tags": [], "artist": "GamingBolt", "description": "Some games really don’t resonate on the first playthrough. Perhaps the challenge is too steep to begin with; maybe it’s a sequel that’s a step down from its predecessor; maybe the campaign’s duration is such a slog, and levelling up takes too long, that a new game plus isn’t just an option but a necessity. \n\nEither way, hate might be too strong a word to use here. You can hate games, sure, but a lot of what you deem as unfavourable might just be first impressions, and first impressions can be wrong. The games in this video aim to highlight such games that might seem hateworthy on first impression, but after revisiting could be more enjoyable and rewarding on subsequent playthroughs.", "link": "https://www.youtube.com/watch?v=mbpGcYGs1yw", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "bookmarked": false, "permanent": false, "page_rating_votes": 0, "page_rating_visits": 0, "user": null, "album": "", "dead": false, "age": null, "source_obj__id": 129, "date_published": "2024-03-07T09:30:18+00:00"}]