[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Top 12 Best RPGs of 2023 YOU NEED TO EXPERIENCE", "description": "Role-playing games have always stood as one of the more encompassing genres in gaming. It could be creating a character from scratch and customizing their skills, discovering powerful weapons or embarking on a journey where every choice is meaningful. Even the basic mechanics of leveling and increasing stats have roots in RPGs.\n\nThere may be a game with an inconceivable range of permutations for your decisions, with unforgettable companions. Others may let you explore the farthest reaches of space and create your own fun. Then there are those built on the drive to min-max and take on more challenging enemies.\n\nEvery year sees new RPGs delivering some of gaming's most unforgettable moments. 2023 is no different, so let's look at some of the best role-playing games released this year.", "link": "https://www.youtube.com/watch?v=8DiNFJnYgqM", "date_published": "2023-12-28T15:30:04+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/8DiNFJnYgqM/hqdefault.jpg", "age": null, "page_rating_contents": 52, "page_rating_votes": 0, "page_rating_visits": 1, "page_rating": 52, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Top 21 AMAZING Xbox Series X | S Games of 2023 You Are NOT PLAYING", "description": "The Xbox Series X/S hasn't always been the best with exclusives, especially first-party titles. After all the acquisitions made over the years, it still faltered behind the PlayStation 5. However, things have slowly improved, as best exemplified by this year in gaming.\n\nIt began with Tango Gameworks' Hi-Fi Rush stealth-launching out of nowhere in January and immediately becoming a favorite for many players. Though the release of Arkane's Redfall was a downer, exclusives like Starfield and Forza Motorsport garnered strong reviews, with the former also setting new records for Game Pass subscribers.\n\nFortunately, even if you wanted to indulge in some third-party titles, the Xbox Series X/S offered plenty of those. Let's look at the best Xbox game of 2023 and all the others that provided hundreds of hours of gaming.", "link": "https://www.youtube.com/watch?v=RE-BKapYpkk", "date_published": "2023-12-28T09:30:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/RE-BKapYpkk/hqdefault.jpg", "age": null, "page_rating_contents": 52, "page_rating_votes": 0, "page_rating_visits": 1, "page_rating": 52, "tags": [], "comments": [], "vote": 0}]