[{"permanent": false, "thumbnail": "https://i4.ytimg.com/vi/7T7leZUHpU8/hqdefault.jpg", "description": "The Thaumaturge is a supernatural look at 1905’s Warsaw. As the world hovers on the brink of a war in less than a decade, protagonist Wiktor Szulski is roaming around Warsaw, using his strange pet demons to solve mysteries and figure out just what is happening.\n\nWhen it comes to gameplay, The Thaumaturge is primarily a conversation-driven investigative game, where players will get to make plenty of choices along the way. If the player does manage to find themself in a fight, the game throws up one of the more fun combat systems out there, which manages to be incredibly tactical without getting bogged down in having to deal with the minutiae of character stats or weapon upgrades.", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-03-04T21:00:07+00:00", "language": null, "album": "", "user": null, "page_rating_visits": 0, "bookmarked": false, "source_obj__id": 129, "comments": [], "title": "The Thaumaturge Review - The Final Verdict", "age": null, "link": "https://www.youtube.com/watch?v=7T7leZUHpU8", "page_rating": 0, "tags": [], "page_rating_votes": 0, "dead": false, "vote": 0, "artist": "GamingBolt"}, {"permanent": false, "thumbnail": "https://i1.ytimg.com/vi/dM-QmHDut6Y/hqdefault.jpg", "description": "The medium of games has come a long way from its humble beginnings, as modern games are capable of rendering realistic looking worlds at a grand scale and telling massive epics that require dozens upon dozens of hours to roll the credits. \n\nWhile it's great to see the medium progressing at a rapid pace, there is definitely more than a couple of issues with the current direction of modern AAA industry and its obsession with scale. With this feature, I try to make a case for why I need those 10 to 12 hours games back in my life while trying to make a broader point of why the concept of bigger is better doesn't always fly in the realm of video games.", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-03-04T17:00:26+00:00", "language": null, "album": "", "user": null, "page_rating_visits": 0, "bookmarked": false, "source_obj__id": 129, "comments": [], "title": "Why I Need Those 10 To 12 Hour Long Games Back In My Life", "age": null, "link": "https://www.youtube.com/watch?v=dM-QmHDut6Y", "page_rating": 0, "tags": [], "page_rating_votes": 0, "dead": false, "vote": 0, "artist": "GamingBolt"}, {"permanent": false, "thumbnail": "https://i2.ytimg.com/vi/e0Ewt8uw3jY/hqdefault.jpg", "description": "For those who have watched WWE, week-in, week-out, for years, monotony can occasionally set in. Visual Concepts' WWE 2K23 seemed like it was going down the same path last year, but fortunately, the upcoming WWE 2K24 brings more content and new features than its predecessor.\n\nThere are four new match types - Ambulance, Casket, Special Guest Referee and Gauntlet; two new MyRise stories with wildly different plotlines and even more replay value than last year; the 2K Showcase covering Forty Years of Wrestlemania with historic matches; and of course, several new gameplay elements, like expanded Backstage Brawls and Trading Blows.\n\nWWE 2K24 is out on March 8th for Xbox One, Xbox Series X/S, PS4, PS5 and PC. Check out 15 differences between it and WWE 2K23 before buying.", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-03-04T10:00:23+00:00", "language": null, "album": "", "user": null, "page_rating_visits": 0, "bookmarked": false, "source_obj__id": 129, "comments": [], "title": "WWE 2K24 vs WWE 2K23 - 15 BIGGEST DIFFERENCES You Need To Know", "age": null, "link": "https://www.youtube.com/watch?v=e0Ewt8uw3jY", "page_rating": 0, "tags": [], "page_rating_votes": 0, "dead": false, "vote": 0, "artist": "GamingBolt"}]