[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-25T15:30:15+00:00", "description": "After years of anticipation, Sony has finally announced Sucker Punch Productions' next title - Ghost of Yōtei, a follow-up to Ghost of Tsushima. It's out in 2025 for PS5 with more details and gameplay to come, but for now, there's a new region in Japan to explore and a new protagonist donning the Ghost mask.\n\nPlayers control Atsu, who ventures through Ezo (which would become known as Hokkaido) for unknown purposes. Ronin are aware of her, and alongside a trusted horse, she also has a wolf, even if they're not quite best friends. For now, we know that she dual-wields katana, operates flintlock firearms, and can even play the Shamizen.\n\nWhat is the significance of Mount Yōteiand Ezo? Why is the story set over 300 years after Ghost of Tsushima, and why did Sucker Punch move on from Jin Sakai? What could players possibly expect? Find out more here.", "id": 1210653, "language": null, "link": "https://www.youtube.com/watch?v=ja0xRytfOME", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/ja0xRytfOME/hqdefault.jpg", "title": "Ghost of Yotei - HIDDEN Details You Likely Missed", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-25T13:30:02+00:00", "description": "While it’s been years since the videogame industry’s big names such as Sony and Microsoft released their next generation of home gaming consoles, the seven-year-old Nintendo Switch remains the last frontier for the brand’s fans.\n\nThis handheld wonder is not only pretty innovative when it comes to its dual- purpose convertible design, but also with the potential it has in running stunningly beautiful games. It’s hard to believe that many open-world games with their physics-based gameplay can be experienced on a device that is more than eight times weaker than Xbox Series S when it comes to raw computational power. \n\nBut the semantics haven’t stopped game developers from working their magic and creating gorgeous entertaining experiences on Nintendo Switch and this video aims to cover some of them.", "id": 1209688, "language": null, "link": "https://www.youtube.com/watch?v=22Beh72lBtU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/22Beh72lBtU/hqdefault.jpg", "title": "15 Switch Games With INSANE GRAPHICS That Go Beyond Expectations", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-25T06:00:06+00:00", "description": "Sony PlayStation’s latest State of Play has come and gone, and to be fair, it was a pretty good show overall. \n\nThere were a ton of new announcements and in this video, we are going to cover the 15 of the biggest ones. So, let’s get started.", "id": 1207342, "language": null, "link": "https://www.youtube.com/watch?v=C_-dJ7FrBHs", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/C_-dJ7FrBHs/hqdefault.jpg", "title": "15 BIGGEST PS5 State of Play Announcements You Likely Missed", "vote": 0}]