[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-04T20:30:05+00:00", "description": "Stormgate is a new real-time strategy game designed by some of the developers that have previously worked on seminal titles like StarCraft and Warcraft. The game features three playable factions, each with wildly different gameplay styles and aesthetics, as well as an emphasis on online multiplayer and co-op. For newer players, the game also features a “Buddy AI” that can help them out by taking care of some of the upkeep often required in longer multiplayer matches. \n\nWhile its campaign is quite short owing to its early access launch, Stormgate still has plenty of content for fans of the genre. The multiplayer mode has plenty of modes, and most interestingly of all, each of the factions is different enough where it might sometimes feel like you’re playing an entirely new game.", "id": 973454, "language": null, "link": "https://www.youtube.com/watch?v=W4K_ItpjCsk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/W4K_ItpjCsk/hqdefault.jpg", "title": "Is This the StarCraft 3 You've Been Waiting For? (Well, Almost)", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-04T16:00:18+00:00", "description": "Open world Ubisoft games have been following a specific bland, blueprint for decades now – collect-a- thons across icon-heavy maps are what we expect but this time around Massive have been hinting at something more elaborate. \n\nStar Wars Outlaws though, sadly, doesn’t appear to be a reinvention of the wheel. Now, to be clear there are some positives observables in the game’s trailers and footage shared thus far, however more in-depth videos are unsurprisingly demonstrating unimaginative fetch quests, just set in a Star Wars universe. \n\nWorse still are the underbaked gameplay mechanics, unpolished animations and graphics, poorly implemented enemy AI, and an uncharismatic lead character. Things may improve, of course, but so far, the prognosis isn’t good for Star Wars Outlaws.", "id": 973153, "language": null, "link": "https://www.youtube.com/watch?v=DLGW_pm6sqE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/DLGW_pm6sqE/hqdefault.jpg", "title": "Can Star Wars Outlaws Defy GAMER EXPECTATIONS?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-04T10:45:00+00:00", "description": "Once a staple of video games back in the halcyon days of 1990s gaming, couch co-op – or local multiplayer – has been steadily declining. Perhaps due to the negative effects on performance with numerous players splitting the screen, or maybe the preference for online multi-player, whatever the reason couch co-op is seen as a bonus rather than the norm. \n\nThere’s something special in playing alongside your friends, relatives, whoever, so gracefully we are seeing somewhat of a rejuvenation in couch co-op either via the mode being added after release via updates or DLC, or games being designed specifically with teamwork and communication at the heart of its gameplay. This is the second such feature we’ve ran on couch co-op, and some of the best of all time have released in the time since.\n\nPart 1: https://www.youtube.com/watch?v=SL4Y6u2ig9w", "id": 972321, "language": null, "link": "https://www.youtube.com/watch?v=0brJtftaKFA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/0brJtftaKFA/hqdefault.jpg", "title": "15 BEST Couch Co-Op Games of ALL TIME [2024 Edition]", "user": null, "vote": 0}]