[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-04T04:25:27+00:00", "description": "<p>House of the Dragon 2&#215;05 &#8220;Regent&#8221; is the fifth episode of the second season of House of the Dragon. It follows up the incredible episode, &#8220;The Red Dragon and the Gold.&#8221; That episode was, justifiably, viewed as one of the best episodes of the series and was the highest rated one of the season. Unfortunately, House of the Dragon has slipped this episode as the incredible escalation in scale and spectacle is followed by a bunch of meaningless naval gazing. Basically, not much happens in this episode and what does happen is of questionable storytelling merit. If that sounds like I&#8217;m being extra harsh on this episode, I am. It&#8217;s slow and reminds me that we could have used some of this time to expand on the previous season&#8217;s hefty-duty politics that were rushed through. House of the Dragon is still one of my favorite shows on television but is something that still deserves the occasional bit of criticism. This episode primarily deals with Rh", "id": 971435, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-house-of-the-dragon-season-2-episode-5", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: House of the Dragon Season 2 Episode 5", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-04T04:19:36+00:00", "description": "<p>Stop me if you’ve heard this one before: a great character, warrior, god or demigod, is nigh impervious to all forms of harm. Except…well, okay, ­almost all forms of harm. Almost impervious. User terms and conditions apply. And, well, wouldn’t ya know it, the hero has succumbed to the most unlikely of deaths due to an injury somewhere they probably weren’t as impervious as everywhere else. Or they were missing their impenetrable macguffin. So let’s break apart the history and myths of the unbreakable heroes as it were and see what’s what! HERO 1: ACHILLES You’ve probably heard of him, famous for his mommy dipping him in the river Styx (record scratch). Except…that’s a myth on top of the myth that’s been around for a long time and constantly retold until it’s been believed. In the original Iliad, Achilles bleeds. And, if it bleeds, you can kill it! Wait, wrong franchise. But anyways, in the earliest version of the Iliad, his mother, the witch Thetis, wants to try to drown Achilles i", "id": 971436, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/mythologys-impenetrable-heroes-a-good-defense-is-the-best-offense", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mythology’s Impenetrable Heroes: A Good Defense is the Best Offense?", "user": null, "vote": 0}]