[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-06T15:30:13+00:00", "description": "We all probably remember all too well just how things went down when Assassin’s Creed Unity launched in 2014. It was, after all, a memorable launch, and for all the wrong reasons. \n\nTouted originally as the genre’s big next-gen step forward, the game failed to do that in its initial form, attracting widespread criticism from critics and players alike not only for its severe technical issues and the plain and simple fact that at the time Unity came out, the formula had worn incredibly thin for more than a few people. \n\nLooking back, however, does Assassin’s Creed Unity merit a re- examination? With its technical issues long fixed and the demand for old Assassin’s Creed once again on the rise, are Unity’s strengths able to shine brighter than they could back in 2014?", "language": null, "link": "https://www.youtube.com/watch?v=YQuO2AMSZto", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/YQuO2AMSZto/hqdefault.jpg", "title": "10 Years Later, IS ASSASSIN’S CREED UNITY FINALLY FIXED?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-06T09:30:10+00:00", "description": "Heading into 2024’s summer season, we’ve got a number of major events to look forward to, from Summer Game Fest to Xbox Games Showcase to what have you, and though we have spoken plenty about the games that are likely to show up and be announced at all of these showcases, what we haven’t spoken about are the games that have a much lower chance of being showcased in the near future- and yet, we just can’t hoping that they do show up. \n\nWhether it’s gameplay reveals for highly anticipated, previously announced titles we’re talking about, or new announcements of games we all want to finally be turned into realities, here, we’re going to talk about pie-in-the-sky announcements that are almost definitely not going to happen anytime soon, but would generate a mountain of hype if they did.", "language": null, "link": "https://www.youtube.com/watch?v=LsmE1njREb0", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/LsmE1njREb0/hqdefault.jpg", "title": "15 UNEXPECTED Game Reveals That Will Make Us Go INSANE", "user": null, "vote": 0}]