[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T23:23:47.321860+00:00", "description": "The Internet Archive is \"currently in its third day of warding off an intermittent DDoS cyber-attack,\" writes Chris Freeland, Director of Library Services at Internet Archive, in a blog post. While library staff stress that the archives are safe, access to its services are affected, including the Wayback Machine. From the post: Since the attacks began on Sunday, the DDoS intrusion has been launching tens of thousands of fake information requests per second. The source of the attack is unknown. \"Thankfully the collections are safe, but we are sorry that the denial-of-service attack has knocked us offline intermittently during these last three days,\" explained Brewster Kahle, founder and digital librarian of the Internet Archive. \"With the support from others and the hard work of staff we are hardening our defenses to provide more reliable access to our library. What is new is this attack has been sustained, impactful, targeted, adaptive, and importantly, mean.\" Cyber-attacks are increa", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/28/2226221/internet-archive-and-the-wayback-machine-under-ddos-cyberattack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Internet Archive and the Wayback Machine Under DDoS Cyberattack", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T22:19:24.282882+00:00", "description": "An anonymous reader quotes a report from Wired: Two years ago when \"Michael,\" an owner of cryptocurrency, contacted Joe Grand to help recover access to about $2 million worth of bitcoin he stored in encrypted format on his computer, Grand turned him down. Michael, who is based in Europe and asked to remain anonymous, stored the cryptocurrency in a password-protected digital wallet. He generated a password using the RoboForm password manager and stored that password in a file encrypted with a tool called TrueCrypt. At some point, that file got corrupted and Michael lost access to the 20-character password he had generated to secure his 43.6 BTC (worth a total of about [...] $5,300, in 2013). Michael used the RoboForm password manager to generate the password but did not store it in his manager. He worried that someone would hack his computer and obtain the password. \"At [that] time, I was really paranoid with my security,\" he laughs.\n \nGrand is a famed hardware hacker who in 2022 helpe", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/28/2128235/researchers-cracked-an-11-year-old-password-to-a-3-million-software-based-crypto-wallet?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Researchers Cracked an 11-Year-Old Password To a $3 Million Software-Based Crypto Wallet", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T22:19:22.779619+00:00", "description": "Jan Leike, one of OpenAI's \"superalignment\" leaders, who resigned last week due to AI safety concerns, has joined Anthropic to continue the mission. According to Leike, the new team \"will work on scalable oversight, weak-to-strong generalization, and automated alignment research.\" TechCrunch reports: A source familiar with the matter tells TechCrunch that Leike will report directly to Jared Kaplan, Anthropic's chief science officer, and that Anthropic researchers currently working on scalable oversight -- techniques to control large-scale AI's behavior in predictable and desirable ways -- will move to report to Leike as Leike's team spins up. In many ways, Leike's team sounds similar in mission to OpenAI's recently-dissolved Superalignment team. The Superalignment team, which Leike co-led, had the ambitious goal of solving the core technical challenges of controlling superintelligent AI in the next four years, but often found itself hamstrung by OpenAI's leadership. Anthropic has ofte", "language": "en-us", "link": "https://slashdot.org/story/24/05/28/2138230/anthropic-hires-former-openai-safety-lead-to-head-up-new-team?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Anthropic Hires Former OpenAI Safety Lead To Head Up New Team", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T21:13:41.752771+00:00", "description": "BrianFagioli writes: Canonical has officially released the optimized Ubuntu 24.04 image for the Milk-V Mars, a credit-card-sized RISC-V single board computer (SBC) developed by Shenzhen MilkV Technology Co., Ltd. \n\nThe Milk-V Mars is the world's first high-performance RISC-V SBC of its size. Powered by the StarFive JH7110 quad-core processor, the board is equipped with up to 8GB of LPDDR4 memory and supports various modern interfaces, including USB 3.0, HDMI 2.0 for 4K output, and Ethernet with PoE capabilities. It also offers comprehensive expansion options with M.2 E-Key and extensive MIPI CSI channels, making it an ideal choice for developers and tech enthusiasts.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ubuntu+Linux+24.04+Now+Optimized+For+Milk-V+Mars+RISC-V+Single+Board+Computer%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F05%2F28%2F1919255%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twit", "language": "en-us", "link": "https://linux.slashdot.org/story/24/05/28/1919255/ubuntu-linux-2404-now-optimized-for-milk-v-mars-risc-v-single-board-computer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ubuntu Linux 24.04 Now Optimized For Milk-V Mars RISC-V Single Board Computer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T20:08:31.621740+00:00", "description": "Tokyo Electric Power Company Holdings (TEPCO) showcased a remote-controlled robot on Tuesday that will retrieve small pieces of melted fuel debris from the damaged Fukushima Daiichi nuclear power plant later this year. The robot, developed by Mitsubishi Heavy Industries, features an extendable pipe and tongs capable of picking up granule-sized debris. TEPCO plans to remove less than 3 grams of debris during the test at the No. 2 reactor, marking the first such operation since the 2011 meltdown caused by a magnitude 9.0 earthquake and tsunami. The removal of the estimated 880 tons of highly radioactive melted fuel from the three damaged reactors is crucial for the plant's decommissioning, which critics say may take longer than the government's 30-40 year target.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+Robot+Will+Soon+Try+To+Remove+Melted+Nuclear+Fuel+From+Japan's+Destroyed+Fukushima+Reactor%3A+https%3A%2F%2Fhardware.slashdot.org%2Fsto", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/28/1856253/a-robot-will-soon-try-to-remove-melted-nuclear-fuel-from-japans-destroyed-fukushima-reactor?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "A Robot Will Soon Try To Remove Melted Nuclear Fuel From Japan's Destroyed Fukushima Reactor", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T20:08:30.070437+00:00", "description": "Russia may charge domestic companies to use foreign software, the TASS news agency quoted Digital Development Minister Maksut Shadaev as saying on Tuesday, as Moscow seeks to cut dependency on foreign technology and bolster its own. From a report: President Vladimir Putin has made achieving technological independence a key goal, as Western sanctions over the war in Ukraine seek to hamstring Moscow's ability to acquire technology and equipment from abroad that could help it on the battlefield. As part of that push, Putin signed a decree in early May which stated that at least 80% of Russian companies in key economic sectors should transition to using Russian-made software by 2030. Many Russian companies still use foreign software in their daily operations, although an EU sanctions package passed last December prohibits companies from supplying enterprise and design-related software to Russia. Shadaev said that introducing a levy on Russian firms would \"equalise\" foreign and Russian sof", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/28/199237/russia-mulling-charging-companies-to-use-foreign-software?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Russia Mulling Charging Companies To Use Foreign Software", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T19:03:42.246919+00:00", "description": "An anonymous reader shares a report: Commercial dot-matrix printing was yet another arena in which the needs of Chinese character I/O were not accounted for. This is witnessed most clearly in the then-dominant configuration of printer heads -- specifically the 9-pin printer heads found in mass-manufactured dot-matrix printers during the 1970s. Using nine pins, these early dot-matrix printers were able to produce low-resolution Latin alphabet bitmaps with just one pass of the printer head. The choice of nine pins, in other words, was \"tuned\" to the needs of Latin alphabetic script. \n\nThese same printer heads were incapable of printing low-resolution Chinese character bitmaps using anything less than two full passes of the printer head, one below the other. Two-pass printing dramatically increased the time needed to print Chinese as compared to English, however, and introduced graphical inaccuracies, whether due to inconsistencies in the advancement of the platen or uneven ink registrat", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/28/1759211/how-chinas-1980s-pc-industry-hacked-dot-matrix-printers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How China's 1980s PC Industry Hacked Dot-Matrix Printers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T19:03:39.913000+00:00", "description": "Fintech firm Klarna, one of the early adopters of generative AI said on Tuesday it is using AI for purposes such as running marketing campaigns and generating images, saving about $10 million in costs annually. From a report: The company has cut its sales and marketing budget by 11% in the first quarter, with AI responsible for 37% of the cost savings, while increasing the number of campaigns, the company said. Using GenAI tools like Midjourney, DALL-E, and Firefly for image generation, Klarna said it has reduced image production costs by $6 million.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Klarna+Using+GenAI+To+Cut+Marketing+Costs+By+%2410+Million+Annually%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F05%2F28%2F1835218%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F05%", "language": "en-us", "link": "https://slashdot.org/story/24/05/28/1835218/klarna-using-genai-to-cut-marketing-costs-by-10-million-annually?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Klarna Using GenAI To Cut Marketing Costs By $10 Million Annually", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T17:58:56.922236+00:00", "description": "An anonymous reader shares a report: Just before Microsoft closed its acquisition of Activision Blizzard, it said that it would take some time to bring the publisher's titles to Game Pass. We've only seen one such addition so far in the form of Diablo IV, but the company has announced another, somewhat notable one. Call of Duty: Black Ops 6 will be available on Game Pass on its release day later this year. \n\nMicrosoft is banking on the debut of a new Call of Duty title on its subscription service leading to a significant bump in the number of Game Pass members. It's a bit of a gamble, as for nearly every year in recent memory, the latest Call of Duty release has been the best-selling game. Microsoft is likely to see lower direct sales of Black Ops 6 on Xbox and PC, though it will still generate revenue from Game Pass and the PlayStation version (and perhaps even a Nintendo Switch release), as well as through microtransactions.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/28/1648233/call-of-duty-black-ops-6-is-coming-to-xbox-game-pass-on-its-release-day?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Call of Duty: Black Ops 6 is Coming To Xbox Game Pass On Its Release Day", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T17:58:55.382744+00:00", "description": "The WeWork founder Adam Neumann has shelved his bid to acquire the bankrupt shared office space provider. From a report: It emerged earlier this year that Neumann, who was ousted from the business in 2019 following a botched attempt to take it public on the stock market, was seeking to buy the business. His new real estate venture, Flow Global, submitted a bid of more than $500m to take over WeWork and its assets. On Tuesday morning, however, Neumann confirmed that Flow was walking away from his dream to take back control of the firm. \n\n\"For several months, we tried to work constructively with WeWork to create a strategy that would allow it to thrive,\" he told DealBook. \"Instead, the company looks to be emerging from bankruptcy with a plan that appears unrealistic and unlikely to succeed.\" WeWork, with over $13bn in long-term leases, filed for Chapter 11 bankruptcy protection last November in order to renegotiate these agreements. At its peak, the company had been valued at $47bn as i", "language": "en-us", "link": "https://slashdot.org/story/24/05/28/1720230/adam-neumann-drops-bid-to-acquire-bankrupt-wework?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Adam Neumann Drops Bid To Acquire Bankrupt WeWork", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T16:35:02.269896+00:00", "description": "The US stock market is finally as fast as it was about a hundred years ago. Bloomberg News: That was the last time share trades in New York settled in a single day, as they will from Tuesday under new Securities and Exchange Commission rules. The change, halving the time it takes to complete every transaction, also occurred in jurisdictions including Canada and Mexico on Monday. The switch to the system known as T+1 -- abandoned in the earlier era as volumes became unwieldy -- is ultimately intended to reduce risk in the financial system. Yet there are worries about potential teething issues, including that international investors may struggle to source dollars on time, global funds will move at different speeds to their assets, and everyone will have less time to fix errors. \n\nThe hope is that everything will run smoothly, but even the SEC said last week the transition may lead to a \"short-term uptick in settlement fails and challenges to a small segment of market participants.\" The ", "language": "en-us", "link": "https://slashdot.org/story/24/05/28/1352255/wall-street-moves-to-fastest-settlement-of-trades-in-a-century?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Wall Street Moves To Fastest Settlement of Trades in a Century", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T16:35:00.746210+00:00", "description": "Sales of SUVs hit a new record in 2023, making up half of all new cars sold globally, data has revealed. Experts warned that the rising sales of the large, heavy vehicles is pushing up the carbon emissions that drive global heating. From a report: The analysis, by the International Energy Agency, found that the rising emissions from SUVs in 2023 made up 20% of the global increase in CO2, making the vehicles a major cause of the intensifying climate crisis. If SUVs were a country, the IEA said, they would be the world's fifth-largest emitter of CO2, ahead of the national emissions of both Japan and Germany. Climate-fuelled extreme weather is increasing, with urgent cuts in emissions needed. But emissions from the global transport sector have risen fast in recent years, outside of the Covid pandemic. SUV sales rose 15% in 2023, compared with a 3% rise for conventional cars. \n\nThere were more than 360m SUVs on the roads worldwide in 2023, producing 1bn tonnes of CO2 emissions, up about 1", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/28/1428249/global-sales-of-polluting-suvs-hit-record-high-in-2023-data-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Global Sales of Polluting SUVs Hit Record High in 2023, Data Shows", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T16:34:59.221195+00:00", "description": "The Biden administration on Tuesday laid out for the first time [PDF] a set of broad government guidelines around the use of carbon offsets in an attempt to shore up confidence in a method for tackling global warming that has faced growing criticism. From a report: Companies and individuals spent $1.7 billion last year voluntarily buying carbon offsets, which are intended to cancel out the climate effects of activities like air travel by funding projects elsewhere, such as the planting of trees, that remove carbon dioxide from the atmosphere, but that wouldn't have happened without the extra money. \n\nYet a growing number of studies and reports have found that many carbon offsets simply don't work. Some offsets help fund wind or solar projects that likely would have been built anyway. And it's often extremely difficult to measure the effectiveness of offsets intended to protect forests. As a result, some scientists and researchers have argued that carbon offsets are irredeemably flawed", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/28/165253/carbon-offsets-a-much-criticized-climate-tool-get-federal-guidelines?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Carbon Offsets, a Much-Criticized Climate Tool, Get Federal Guidelines", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T14:33:43.123872+00:00", "description": "PayPal hopes to boost its growth by starting an ad network [non-paywalled link] juiced with something it already owns: data on its millions of users. From a report: The digital payments company plans to build an ad sales business around the reams of data it generates from tracking the purchases as well as the broader spending behaviors of millions of consumers who use its services, which include the more socially-enabled Venmo app. PayPal has hired Mark Grether, who formerly led Uber's advertising business, to lead the effort as senior vice president and general manager of its newly-created PayPal Ads division. In his new role, he will be responsible for developing new ad formats, overseeing sales and hiring staff to fill out the division, he said. \n\nPayPal in January introduced Advanced Offers, its first ad product, which uses AI and the company's data to help merchants target PayPal users with discounts and other personalized promotions. Advanced Offers only charges advertisers when", "language": "en-us", "link": "https://slashdot.org/story/24/05/28/1344249/paypal-is-planning-an-ad-business-using-data-on-its-millions-of-shoppers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "PayPal Is Planning an Ad Business Using Data on Its Millions of Shoppers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T12:23:11.824041+00:00", "description": "T-Mobile said Tuesday that it plans to acquire most of U.S. Cellular, including stores, some of the wireless operator's spectrum and its customers, in a deal worth $4.4 billion. The deal includes cash and up to $2 billion of debt. From a report: T-Mobile said it will use U.S. Cellular wireless spectrum to improve coverage in rural areas while offering better connectivity to U.S. Cellular customers around the United States. The company said it will allow U.S. Cellular customers to keep their current plans or switch to a T-Mobile plan. U.S. Cellular will retain some of its wireless spectrum and towers and will lease space on at least 2,100 additional towers to T-Mobile. The companies expect the deal to close in mid-2025.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=T-Mobile+To+Acquire+Most+of+US+Cellular+in+%244.4+Billion+Deal%3A+https%3A%2F%2Fmobile.slashdot.org%2Fstory%2F24%2F05%2F28%2F1158241%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitte", "language": "en-us", "link": "https://mobile.slashdot.org/story/24/05/28/1158241/t-mobile-to-acquire-most-of-us-cellular-in-44-billion-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "T-Mobile To Acquire Most of US Cellular in $4.4 Billion Deal", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T11:18:03.274369+00:00", "description": "OpenAI said on Tuesday that it has begun training a new flagship AI model that would succeed the GPT-4 technology that drives its popular online chatbot, ChatGPT. From a report: The San Francisco start-up, which is one of the world's leading A.I. companies, said in a blog post that it expects the new model to bring \"the next level of capabilities\" as it strives to build \"artificial general intelligence,\" or A.G.I., a machine that can do anything the human brain can do. The new model would be an engine for A.I. products including chatbots, digital assistants akin to Apple's Siri, search engines and image generators. \n\nOpenAI also said it was creating a new Safety and Security Committee to explore how it should handle the risks posed by the new model and future technologies. \"While we are proud to build and release models that are industry-leading on both capabilities and safety, we welcome a robust debate at this important moment,\" the company said. OpenAI is aiming to move A.I. techno", "language": "en-us", "link": "https://slashdot.org/story/24/05/28/112238/openai-says-it-has-begun-training-a-new-flagship-ai-model?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Says It Has Begun Training a New Flagship AI Model", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T09:07:25.517292+00:00", "description": "YouTube's latest move against ad blockers involves skipping videos straight to the end or muting audio for users with ad blockers enabled, according to user reports. This follows previous tests by the Google-owned platform, including blocking playback after three videos and slowing down load times for ad-blocker users.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=YouTube+Begins+Skipping+Videos+for+Ad-Blocker+Users%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F05%2F28%2F0824200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F05%2F28%2F0824200%2Fyoutube-begins-skipping-videos-for-ad-blocker-users%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://news.slashdot.org/story/24/", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/28/0824200/youtube-begins-skipping-videos-for-ad-blocker-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "YouTube Begins Skipping Videos for Ad-Blocker Users", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T05:52:05.320462+00:00", "description": "A hacker group called RansomHub said it was behind the cyberattack that hit the Christie's website just days before its marquee spring sales began, forcing the auction house to resort to alternatives to online bidding. From a report: In a post on the dark web on Monday, the group claimed that it had gained access to sensitive information about the world's wealthiest art collectors, posting only a few examples of names and birthdays. It was not immediately possible to verify RansomHub's claims, but several cybersecurity experts said they were a known ransomware operation and that the claim was plausible. Nor was it clear if the hackers had gained access to more sensitive information, including financial data and client addresses. The group said it would release the data, posting a countdown timer that would reach zero by the end of May. \n\nAt Christie's, a spokesman said in a statement, \"Our investigations determined there was unauthorized access by a third party to parts of Christie's ", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/28/0518240/ransomware-group-claims-responsibility-for-christies-hack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ransomware Group Claims Responsibility for Christie's Hack", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T02:38:37.165598+00:00", "description": "An anonymous reader shares a report: Similar to the GCC compiler dropping support for the Xeon Phi Knights Mill and Knights Landing accelerators a few days ago, Intel has also gone ahead and seen to the removal of Xeon Phi support for the LLVM/Clang 19 compiler. Since earlier this year in LLVM/Clang 18 the Xeon Phi Knights Mill and Knights Landing support was treated as deprecated. Now for the LLVM 19 release due out around September, the support is removed entirely. This aligns with GCC 14 having deprecated Xeon Phi support too and now in GCC 15 Git having the code removed.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Intel+Removes+Knights+Mill+and+Knights+Landing+Xeon+Phi+Support+In+LLVM+19%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F05%2F27%2F1943239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/27/1943239/intel-removes-knights-mill-and-knights-landing-xeon-phi-support-in-llvm-19?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Removes Knights Mill and Knights Landing Xeon Phi Support In LLVM 19", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T01:33:34.875102+00:00", "description": "Witnessing the blood-red fires of a volcanic eruption on Earth is memorable. But to see molten rock bleed out of a volcano on a different planet would be extraordinary. That is close to what scientists have spotted on Venus: two vast, sinuous lava flows oozing from two different corners of Earth's planetary neighbor. From a report: \"After you see something like this, the first reaction is 'wow,'\" said Davide Sulcanese, a doctoral student at the Universita d'Annunzio in Pescara, Italy, and an author of a study reporting the discovery in the journal Nature Astronomy, published on Monday. Earth and Venus were forged at the same time. Both are made of the same primeval matter, and both are the same age and size. So why is Earth a paradise overflowing with water and life, while Venus is a scorched hellscape with acidic skies? \n\nVolcanic eruptions tinker with planetary atmospheres. One theory holds that, eons ago, several apocalyptic eruptions set off a runaway greenhouse effect on Venus, t", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/27/1948243/rivers-of-lava-on-venus-reveal-a-more-volcanically-active-planet?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Rivers of Lava on Venus Reveal a More Volcanically Active Planet", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-28T00:28:33.419759+00:00", "description": "Retailers are being urged to stop making everyday products such as drinks bottles, outdoor furniture and toys out of brightly coloured plastic after researchers found it degrades into microplastics faster than plainer colours. From a report: Red, blue and green plastic became \"very brittle and fragmented,\" while black, white and silver samples were \"largely unaffected\" over a three-year period, according to the findings of the University of Leicester-led project. The scale of environmental pollution caused by plastic waste means that microplastics, or tiny plastic particles, are everywhere. Indeed, they were recently found in human testicles, with scientists suggesting a possible link to declining sperm counts in men. \n\nIn this case, scientists from the UK and the University of Cape Town in South Africa used complementary studies to show that plastics of the same composition degrade at different rates depending on the colour. The UK researchers put bottle lids of various colours on th", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/27/1952209/ditch-brightly-colored-plastic-anti-waste-researchers-tell-firms?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ditch Brightly Colored Plastic, Anti-Waste Researchers Tell Firms", "user": null, "vote": 0}]