[{"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "On Wednesday Boeing \"removed executive Ed Clark, the head of its 737 Max passenger jet program,\" reports CNN, \"after a dramatic &mdash; and terrifying &mdash; midair blowout in January underscored ongoing problems with the jet.\"\n\n\n A preliminary report by the National Transportation Safety Board found that the four bolts that should have held the door plug in place were missing when the plane left Boeing's factory. The NTSB report did not assess blame for the missing bolts and the accident but in a statement to investors before the findings were released, Boeing CEO Dave Calhoun assumed responsibility for the incident. \"We caused the problem, and we understand that,\" he told investors during a call after reporting the latest quarterly loss at the company. \"Whatever conclusions are reached, Boeing is accountable for what happened.\" \n\n Clark, who had been at Boeing for 18 years, had only been in charge of the Max program since March of 2021, assuming that title after the jets h", "title": "Boeing Removes Head of Its 737 Max Program After January's 'Door Bolts' Incident", "language": "en-us", "link": "https://tech.slashdot.org/story/24/02/24/0553215/boeing-removes-head-of-its-737-max-program-after-januarys-door-bolts-incident?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T23:11:30.622514+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "The Guardian reports:\nThe Covid death toll in the U.S. is likely at least 16% higher than the official tally, according to a new study, and researchers believe the cause of the undercounting goes beyond overloaded health systems to a lack of awareness of Covid and low levels of testing. \n\nThe second year of the pandemic also had nearly as many uncounted excess deaths as the first, the study found. \n\nMore than 1.1 million Americans have died from Covid, according to official records. But the actual number is assuredly higher, given the high rates of excess deaths. Demographers wanted to know how many could be attributed to Covid, and they drilled down to data at the county level to discover patterns in geography and time. There were 1.2 million excess deaths from natural causes &mdash; excluding deaths from accidents, firearms, suicide and overdoses &mdash; between March 2020 and August 2022, the researchers estimated, and about 163,000 of those deaths were not attributed to C", "title": "Covid Death Toll in US Likely 16% Higher Than Official Tally, Study Says", "language": "en-us", "link": "https://science.slashdot.org/story/24/02/24/072227/covid-death-toll-in-us-likely-16-higher-than-official-tally-study-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T22:05:16.638186+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "Long-time Slashdot reader theodp writes: In 2012, Microsoft President Brad Smith unveiled Microsoft's National Talent Strategy, which called for K-12 Computer Science education for U.S. schoolchildren to address a \"talent crisis [that] endangers long-term growth and prosperity\". The following year, tech-backed nonprofit Code.org burst onto the scene to deliver that education to schoolchildren, with Smith and execs from tech giants Google and Amazon on its Board of Directors (and Code.org donors Bill Gates and Mark Zuckerberg as lead K-12 CS instructors). \n\nUsing a mix of paid individuals, universities and other organizations that it helped to fund, along with online self-paced courses, Code.org boasts it quickly \"prepared more than 106,000 new teachers to teach CS across grades K-12\" through its professional learning programs. \"No computer science experience required,\" Code.org teases prospective K-12 teachers (as does Code.org partner Amazon Future Engineer). Code.org organi", "title": "New York Will Start Requiring Credentials for All CS Teachers", "language": "en-us", "link": "https://news.slashdot.org/story/24/02/24/1633203/new-york-will-start-requiring-credentials-for-all-cs-teachers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T22:05:15.146988+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "TechTarget notes it was Linkerd's original developers who coined the term \"service mesh\" &mdash; describing their infrastructure layer for communication between microservices. \n\nBut \"There has to be some way of connecting the businesses that are being built on top of Linkerd back to funding the project,\" argues Buoyant CEO William Morgan. \"If we don't do that, then there's no way for us to evolve this project and to grow it in the way that I think we all want.\" \nAnd so, TechTarget reports...\nBeginning May 21, 2024, any company with more than 50 employees running Linkerd in production must pay Buoyant $2,000 per Kubernetes cluster per month to access stable releases of the project... \n\nThe project's overall source code will remain available in GitHub, and edge, or experimental early releases of code, will continue to be committed to open source. But the additional work done by Buoyant developers to backport minimal changes so that they're compatible with existing versions of L", "title": "Service Mesh Linkerd Moves Its Stable Releases Behind a Paywall", "language": "en-us", "link": "https://news.slashdot.org/story/24/02/24/0450229/service-mesh-linkerd-moves-its-stable-releases-behind-a-paywall?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T20:18:59.109105+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "\"Crypto mines will have to start reporting their energy use in the U.S.,\" wrote the Verge in January, saying America's Energy department would \"begin collecting data on crypto mines' electricity use, following criticism from environmental advocates over how energy-hungry those operations are.\" \n\nBut then \"constitutional freedoms\" group New Civil Liberties Alliance (founded with seed money from the Charles Koch Foundation) objected. And \"on behalf of its clients\" &mdash; the Texas Blockchain Council and Colorado bitcoin mining company Riot Platforms &mdash; the group said it \"looks forward to derailing the Department of Energy's unlawful data collection effort once and for all.\" \n\nWhile America's Energy department said the survey would take 30 minutes to complete, the complaint argued it would take 40 hours. According to the judge, the complaint \"alleged three main sources of irreparable injury...\" \n\n- Nonrecoverable costs of compliance with the Survey\n- A credible threat of p", "title": "US Court Stalls Energy Dept Demand For Cryptocurrency Mining Data", "language": "en-us", "link": "https://news.slashdot.org/story/24/02/24/1747208/us-court-stalls-energy-dept-demand-for-cryptocurrency-mining-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T18:55:37.784390+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "An anonymous reader shared this report from CNN:\n\n\nDynabook Americas, the company formerly known as Toshiba, has recalled 15.5 million Toshiba laptop AC adapters over potential burn and fire hazards. \n\nThe company said it received 679 reports of the recalled AC adapters overheating or catching on fire, melting and burning, including 43 reports of minor burn injuries. Consumers should stop using the adapters immediately and contact them for a free replacement, Dynabook Americas said. \n\nThe recall applies to AC adapters sold both alongside Toshiba personal laptop computers and sold separately, with date codes ranging between April 2008 through December 2012. The adapters were manufactured in China. More than 60 models are part of the recall. The company published a webpage listing the impacted model numbers and serial numbers for the adapters. \nGatner points out the adapters are for \"very old models,\" so \"it's only a very small percentage of the population that is still using t", "title": "15 Million Toshiba Laptop Adapters Recalled Over Burn and Fire Risks", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/02/24/0541201/15-million-toshiba-laptop-adapters-recalled-over-burn-and-fire-risks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T17:51:21.155996+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "Stack Overflow's blog reports on a new programming language called Mariposa. \n\nThey call it a \"toy\" programming language, \"created as a way to play around with a novel or odd feature, like variable assignment outside of the normal order of execution &mdash; more colloquially, time travel.\"\n\n\nComputer science has long sought to reason about time in electronic systems, thanks to a consistent interest in concurrency and real-time messaging... Mariposa allows you to manipulate the order of execution by assigning an instant to a variable, then setting the context of that instance. Here's a basic example, taken from the Mariposa readme: \n\nx = 1\nt = now()\nprint(x)\nat t:\n x = 2\n \n\nAccording to the normal order of operations, this code should print \"1\". But because t is assigned to the instance in the second line, any modifications specified within an at t: block are applied immediately, and this code prints \"2\"... \n\nWhile Mariposa caught a fair amount of attention recently, it's not ", "title": "'Can a Programming Language Implement Time Travel?'", "language": "en-us", "link": "https://developers.slashdot.org/story/24/02/24/0521230/can-a-programming-language-implement-time-travel?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T16:46:03.813894+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "On Wednesday afternoon \"a European Space Agency satellite reentered Earth's atmosphere over the North Pacific Ocean...\" reports CNN, \"and there have been no reports of damage, according to the agency.\"\n\nThe agency's Space Debris Office, along with an international surveillance network, monitored and tracked the Earth-observing ERS-2 satellite throughout February to make predictions about the reentry, which occurred at 12:17 p.m. ET Wednesday. The ESA provided continuous live updates on its website. At around 50 miles (80 kilometers) above Earth's surface, the satellite broke apart due to atmospheric drag, and the majority of the fragments were expected to burn up in the atmosphere. \n\nThe agency said it was possible that some fragments could reach the planet's surface, but the pieces didn't contain any harmful substances and likely fell into the ocean... The ERS-2 satellite had an estimated mass of 5,057 pounds (2,294 kilograms) after depleting its fuel, according to the agenc", "title": "5,000-Pound Satellite Successfully 'Deorbited' Wednesday", "language": "en-us", "link": "https://science.slashdot.org/story/24/02/24/0615242/5000-pound-satellite-successfully-deorbited-wednesday?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T15:40:15.990432+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "An anonymous reader quotes a report from TechCrunch: In a press release written with help from ChatGPT, Match Group announced an enterprise agreement with the AI chatbot's maker, OpenAI. The new agreement includes over 1,000 enterprise licenses for the dating app giant and home to Tinder, Match, OkCupid, Hinge and others. The AI tech will be used to help Match Group employees with work-related tasks, the company says, and come as part of Match's $20 million-plus bet on AI in 2024. [...] As for the news itself, Match Group says it will begin using the AI tech, and specifically ChatGPT-4, to aid with coding, design, analysis, build templates, and other daily tasks, including, as you can tell, communications. To keep its corporate data protected, only trained and licensed Match Group employees will have access to OpenAI's tools, it noted.\n \nBefore being able to use these tools, Match Group employees will also have to undergo mandatory training that focuses on responsible use, th", "title": "Tinder Owner Inks Deal With OpenAI", "language": "en-us", "link": "https://slashdot.org/story/24/02/24/0020232/tinder-owner-inks-deal-with-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T13:26:53.533573+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "Ashley Belanger reports via Ars Technica: Canada-based University of Waterloo is racing to remove M&amp;M-branded smart vending machines from campus after outraged students discovered the machines were covertly collecting facial-recognition data without their consent. The scandal started when a student using the alias SquidKid47 posted an image on Reddit showing a campus vending machine error message, \"Invenda.Vending.FacialRecognitionApp.exe,\" displayed after the machine failed to launch a facial recognition application that nobody expected to be part of the process of using a vending machine. \"Hey, so why do the stupid M&amp;M machines have facial recognition?\" SquidKid47 pondered. The Reddit post sparked an investigation from a fourth-year student named River Stanley, who was writing for a university publication called MathNEWS. [...]\n \nMathNEWS' investigation tracked down responses from companies responsible for smart vending machines on the University of Waterloo's campu", "title": "Vending Machine Error Reveals Secret Face Image Database of College Students", "language": "en-us", "link": "https://yro.slashdot.org/story/24/02/24/0012232/vending-machine-error-reveals-secret-face-image-database-of-college-students?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T10:04:50.470006+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "On Thursday, the Odysseus Moon lander made history by becoming the first ever privately built and operated robot to complete a soft lunar touchdown. While the lander is \"alive and well,\" the CEO of Houston-based Intuitive Machines, which built and flew the lander, said it tipped over during its final descent, coming up to rest propped up sideways on a rock. The BBC reports: Its owner, Texan firm Intuitive Machines, says Odysseus has plenty of power and is communicating with Earth. Controllers are trying to retrieve pictures from the robot. Steve Altemus, the CEO and co-founder of IM, said it wasn't totally clear what happened but the data suggested the robot caught a foot on the surface and then fell because it still had some lateral motion at the moment of landing. All the scientific instruments that planned to take observations on the Moon are on the side of Odysseus that should still allow them to do some work. The only payload likely on the \"wrong side\" of the lander, poi", "title": "Odysseus Moon Lander 'Tipped Over On Touchdown'", "language": "en-us", "link": "https://science.slashdot.org/story/24/02/24/007214/odysseus-moon-lander-tipped-over-on-touchdown?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T07:55:34.582871+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "An anonymous reader quotes a report from Ars Technica: India's plan to let a moratorium on imposing customs duties on cross-border digital e-commerce transactions expire may end up hurting India's more ambitious plans to become a global chip leader in the next five years, Reuters reported. It could also worsen the global chip shortage by spiking semiconductor industry costs at a time when many governments worldwide are investing heavily in expanding domestic chip supplies in efforts to keep up with rapidly advancing technologies.\n \nEarly next week, world leaders will convene at a World Trade Organization (WTO) meeting, just before the deadline to extend the moratorium hits in March. In place since 1998, the moratorium has been renewed every two years since -- but India has grown concerned that it's losing significant revenues from not imposing taxes as demand rises for its digital goods, like movies, e-books, or games. Hoping to change India's mind, a global consortium of sem", "title": "India's Plan To Let 1998 Digital Trade Deal Expire May Worsen Chip Shortage", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/02/23/211209/indias-plan-to-let-1998-digital-trade-deal-expire-may-worsen-chip-shortage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T03:33:18.892796+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "Tom McKay successfully masqueraded as a \"Slackbot\" on Slack after leaving Gizmodo in 2022, going unnoticed by the site's management for several months. The Verge reports: If you're not glued to Slack for most of the day like I am, then you might not know that Slackbot is the friendly robot that lives in the messaging service. It helps you do things like set reminders, find out your office's Wi-Fi password, or let you know when you've been mentioned in a channel that you're not a part of. When it was his time to leave, McKay swapped out his existing profile picture for one that resembled an angrier version of Slackbot's actual icon. He also changed his name to \"Slackbot.\" You can't just change your name on Slack to \"Slackbot,\" by the way, as the service will tell you that name's already been taken. It does work if you use a special character that resembles one of the letters inside Slackbot, though, such as replacing \"o\" with the Unicode character \"o.\"\n \nThe move camouflaged M", "title": "Former Gizmodo Writer Changed Name To 'Slackbot,' Stayed Undetected For Months", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/02/23/2328227/former-gizmodo-writer-changed-name-to-slackbot-stayed-undetected-for-months?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T03:33:16.131674+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "Florida lawmakers passed a bill on Thursday that forces social media companies to keep most minors off their platforms. The Hill reports: The legislation, which passed the state House Thursday after earlier being approved by the Senate, now heads to Gov. Ron DeSantis's (R) desk, though he says he's not quite ready to sign on. DeSantis told reporters Friday that he thinks there needs to be a \"proper balance\" between government regulations and parental input on the social media issue. \"We'll be wrestling with that,\" he said. The governor said he'll be assessing the final version of the legislation likely through the weekend. \"Federal law says 13 and under can't have social media accounts. That's not really enforced,\" he said.\n \nThe lawmakers who championed the proposed social media ban, which would require platforms check the ages of users through a third-party source, argue it will make the online landscape safer for youths. The legislation passed 108-7 in the state House and ", "title": "Florida Lawmakers Pass Ban On Social Media For Kids", "language": "en-us", "link": "https://yro.slashdot.org/story/24/02/23/2338235/florida-lawmakers-pass-ban-on-social-media-for-kids?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T03:33:13.007624+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "Microplastics have been found in sediment layers that date back as early as the first half of the 1700s, \"showing microplastics' pernicious ability to infiltrate even environments untouched by modern humans,\" reports Futurism. From the report: A team of European researchers made this alarming discovery after studying the sediment layers at three lakes in Latvia, as detailed in a study published in the journal Science Advances. The scientists were studying lake sediment to test if the presence of microplastics in geological layers would be a reliable indicator for the beginning of the Anthropocene Epoch, defined in the study as starting in 1950 and meant to delineate when humans started having a large impact on our environment.\n \nScientists have long used layers of ash or ice to study past events on Earth, leading to the question of whether microplastics can serve as a reliable chronological marker for the Anthropocene. Clearly not, according to this new research, which found ", "title": "Microplastics Found In Sediment Layers Untouched By Modern Humans", "language": "en-us", "link": "https://news.slashdot.org/story/24/02/23/2343252/microplastics-found-in-sediment-layers-untouched-by-modern-humans?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T03:33:10.583288+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}, {"age": null, "comments": [], "dead": false, "page_rating_visits": 0, "bookmarked": false, "description": "An anonymous reader quotes a report from The Guardian: Air pollution from traffic is linked to some of the more severe forms of dementia, and could be a significant cause of the condition among those who are not already genetically predisposed to it, research suggests. Research carried out in Atlanta, Georgia, found that people with higher exposure to traffic-related fine particulate matter air pollution were more likely to have high amounts of the amyloid plaques in their brains that are associated with Alzheimer's. The findings, which will alarm anyone living in a town or city, but particularly those living near busy roads, add to the harms already known to be caused by road traffic pollution, ranging from climate change to respiratory diseases.\n \nA team of researchers from Atlanta's Emory University set out to specifically investigate the effects on people's brains of exposure the type of fine particulate matter known as PM2.5. This consists of particles of less than 2.5 m", "title": "Air Pollution Could Be Significant Cause of Dementia", "language": "en-us", "link": "https://science.slashdot.org/story/24/02/23/2354247/air-pollution-could-be-significant-cause-of-dementia?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "source_obj__id": 607, "page_rating_votes": 0, "album": "", "date_published": "2024-02-24T03:33:08.479622+00:00", "user": null, "page_rating_contents": 0, "artist": "help@slashdot.org", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "tags": [], "thumbnail": null, "vote": 0, "page_rating": 0}]