[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T23:04:25.757670+00:00", "description": "\"6.9 is now out,\" Linus Torvalds posted on the Linux kernel mailing list, \"and last week has looked quite stable (and the whole release has felt pretty normal).\" \n\nPhoronix writes that Linux 6.9 \"has a number of exciting features and improvements for those habitually updating to the newest version.\" And Slashdot reader prisoninmate shared this report from 9to5Linux:\n\n\nHighlights of Linux kernel 6.9 include Rust support on AArch64 (ARM64) architectures, support for the Intel FRED (Flexible Return and Event Delivery) mechanism for improved low-level event delivery, support for AMD SNP (Secure Nested Paging) guests, and a new dm-vdo (virtual data optimizer) target in device mapper for inline deduplication, compression, zero-block elimination, and thin provisioning. \n\nLinux kernel 6.9 also supports the Named Address Spaces feature in GCC (GNU Compiler Collection) that allows the compiler to better optimize per-CPU data access, adds initial support for FUSE passthrough to allow the kernel ", "language": "en-us", "link": "https://linux.slashdot.org/story/24/05/12/2212235/linux-kernel-69-officially-released?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Linux Kernel 6.9 Officially Released", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T21:59:46.701513+00:00", "description": "Reddit reported its first results since going public in late March. Yahoo Finance reports:\n\nDaily active users increased 37% year over year to 82.7 million. Weekly active unique users rose 40% from the prior year. Total revenue improved 48% to $243 million, nearly doubling the growth rate from the prior quarter, due to strength in advertising. The company delivered adjusted operating profits of $10 million, versus a $50.2 million loss a year ago. [Reddit CEO Steve] Huffman declined to say when the company would be profitable on a net income basis, noting it's a focus for the management team. Other areas of focus include rolling out a new user interface this year, introducing shopping capabilities, and searching for another artificial intelligence content licensing deal like the one with Google. \n\nBloomberg notes that already Reddit \"has signed licensing agreements worth $203 million in total, with terms ranging from two to three years. The company generated about $20 million from AI c", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/12/2128209/reddit-grows-seeks-more-ai-deals-plans-award-shops-and-gets-sued?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Reddit Grows, Seeks More AI Deals, Plans 'Award' Shops, and Gets Sued", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T20:54:36.046696+00:00", "description": "OpenAI CEO Sam Altman gave an hour-long interview to the \"All-In\" podcast (hosted by Chamath Palihapitiya, Jason Calacanis, David Sacks and David Friedberg). And speaking on technology's advance, Altman said \"Phones are unbelievably good.... I personally think the iPhone is like the greatest piece of technology humanity has ever made. It's really a wonderful product.\" \n\nQ: What comes after it? \nAltman: I don't know. I mean, that was what I was saying. It's so good, that to get beyond it, I think the bar is quite high. \nQ: You've been working with Jony Ive on something, right? \nAltman: We've been discussing ideas, but I don't &mdash; like, if I knew... \nAltman said later he thought voice interaction \"feels like a different way to use a computer.\" \nBut the conversation turned to Apple in another way. It happened in a larger conversation where Altman said OpenAI has \"currently made the decision not to do music, and partly because exactly these questions of where you draw the lines...\" \n\n", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/12/203231/openais-sam-altman-on-iphones-music-training-data-and-apples-controversial-ipad-ad?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI's Sam Altman on iPhones, Music, Training Data, and Apple's Controversial iPad Ad", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T19:49:26.540243+00:00", "description": "An anonymous reader shared this report from the Associated Press:\n\n\nA thick atmosphere has been detected around a planet that's twice as big as Earth in a nearby solar system, researchers reported Wednesday. \n\nThe so-called super Earth &mdash; known as 55 Cancri e &mdash; is among the few rocky planets outside our solar system with a significant atmosphere, wrapped in a blanket of carbon dioxide and carbon monoxide. The exact amounts are unclear. Earth's atmosphere is a blend of nitrogen, oxygen, argon and other gases. \"It's probably the firmest evidence yet that this planet has an atmosphere,\" said Ian Crossfield, an astronomer at the University of Kansas who studies exoplanets and was not involved with the research.\n\n The research was published in the journal Nature.\n \n\"The boiling temperatures on this planet &mdash; which can reach as hot as 4,200 degrees Fahrenheit (2,300 degrees Celsius) &mdash; mean that it is unlikely to host life,\" the article points out. \n\n\"Instead, scientist", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/12/161202/webb-telescope-finds-a-hot-earth-sized-planet-with-an-atmosphere?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Webb Telescope Finds a (Hot) Earth-Sized Planet With an Atmosphere", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T18:44:35.863063+00:00", "description": "Researchers believe they've discovered a new material structure that can improve the energy storage of capacitors.\n The structure allows for storage while improving the efficiency of ultrafast charging and discharging.\n The new find needs optimization but has the potential to help power electric vehicles.\n\n*\nAn anonymous reader shared this report from Popular Mechanics:\n\nIn a study published in Science, lead author Sang-Hoon Bae, an assistant professor of mechanical engineering and materials science, demonstrates a novel heterostructure that curbs energy loss, enabling capacitors to store more energy and charge rapidly without sacrificing durability... Within capacitors, ferroelectric materials offer high maximum polarization. That's useful for ultra-fast charging and discharging, but it can limit the effectiveness of energy storage or the \"relaxation time\" of a conductor. \"This precise control over relaxation time holds promise for a wide array of applications and has the potential t", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/12/1647232/could-atomically-thin-layers-bring-a-19x-energy-jump-in-battery-capacitors?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Could Atomically Thin Layers Bring A 19x Energy Jump In Battery Capacitors?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T17:39:36.472259+00:00", "description": "\"One of the biggest mysteries in astrophysics today is that the forces in galaxies do not seem to add up,\" write two U.K. researchers in the Conversation:\n\n Galaxies rotate much faster than predicted by applying Newton's law of gravity to their visible matter, despite those laws working well everywhere in the Solar System. To prevent galaxies from flying apart, some additional gravity is needed. This is why the idea of an invisible substance called dark matter was first proposed. But nobody has ever seen the stuff. And there are no particles in the hugely successful Standard Model of particle physics that could be the dark matter &mdash; it must be something quite exotic. \n\nThis has led to the rival idea that the galactic discrepancies are caused instead by a breakdown of Newton's laws. The most successful such idea is known as Milgromian dynamics or Mond [also known as modified Newtonian dynamics], proposed by Israeli physicist Mordehai Milgrom in 1982. But our recent research shows ", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/11/2311207/is-dark-matters-main-rival-theory-dead?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is Dark Matter's Main Rival Theory Dead?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T17:39:33.983890+00:00", "description": "An anonymous reader shared this report from PetaPixel:\n\n\nA photographer and content creator has set the world record for the fastest drone flight after his custom-made aircraft achieved a staggering 298.47 miles per hour (480.2 kilometers per hour). Guinness confirmed the record noting that Luke Maximo Bell and his father Mike achieved the \"fastest ground speed by a battery-powered remote-controlled (RC) quadcopter.\" \n\n\nLuke, who has previously turned his GoPro into a tennis ball, describes it as the most \"frustrating and difficult project\" he has ever worked on after months of working on prototypes that frequently caught fire. From the very first battery tests for the drone that Luke calls Peregrine 2, there were small fires as it struggled to cope with the massive amount of current which caused it to heat up to over 266 degrees Fahrenheit (130 degrees Celsius). The motor wires also burst into flames during full load testing causing Luke and Mike to use thicker ones so they didn't fa", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/12/1513234/photographer-sets-world-record-for-fastest-drone-flight-at-298-mph?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Photographer Sets World Record for Fastest Drone Flight at 298 MPH", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T16:34:25.296231+00:00", "description": "An anonymous reader shared this report from the Register:\n\n\nThe co-author of SQL, the standardized query language for relational databases, has come out in support of the NoSQL database movement that seeks to escape the tabular confines of the RDBMS. Speaking to The Register as SQL marks its 50th birthday, Donald Chamberlin, who first proposed the language with IBM colleague Raymond Boyce in a 1974 paper [PDF], explains that NoSQL databases and their query languages could help perform the tasks relational systems were never designed for. \"The world doesn't stay the same thing, especially in computer science,\" he says. \"It's a very fast, evolving, industry. New requirements are coming along and technology has to change to meet them, I think that's what's happening. The NoSQL movement is motivated by new kinds of applications, particularly web applications, that need massive scalability and high performance. Relational databases were developed in an earlier generation when scalability a", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/12/035214/father-of-sql-says-yes-to-nosql?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Father of SQL Says Yes to NoSQL", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T15:29:14.570647+00:00", "description": "An anonymous reader shared this report from Phoronix:\nFor the past several months AMD Linux engineers have been working on AMD Core Performance Boost support for their P-State CPU frequency scaling driver. The ninth iteration of these patches were posted on Monday and besides the global enabling/disabling support for Core Performance Boost, it's now possible to selectively toggle the feature on a per-CPU core basis... \n\nThe new interface is under /sys/devices/system/cpu/cpuX/cpufreq/amd_pstate_boost_cpb for each CPU core. Thus users can tune whether particular CPU cores are boosted above the base frequency.\n<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AMD+Core+Performance+Boost+For+Linux+Getting+Per-CPU+Core+Controls%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%2F24%2F05%2F11%2F229219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook", "language": "en-us", "link": "https://linux.slashdot.org/story/24/05/11/229219/amd-core-performance-boost-for-linux-getting-per-cpu-core-controls?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AMD Core Performance Boost For Linux Getting Per-CPU Core Controls", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T12:14:31.197553+00:00", "description": "The Royal Institution of Australia is a national non-profit hub for science communication, publishing the science magazine Cosmos four times a year. \n\nThis month they argued that small modular nuclear reactors \"don't add up as a viable energy source.\"\n\nProponents assert that SMRs would cost less to build and thus be more affordable. However, when evaluated on the basis of cost per unit of power capacity, SMRs will actually be more expensive than large reactors. This 'diseconomy of scale' was demonstrated by the now-terminated proposal to build six NuScale Power SMRs (77 megawatts each) in Idaho in the United States. The final cost estimate of the project per megawatt was around 250 percent more than the initial per megawatt cost for the 2,200 megawatts Vogtle nuclear power plant being built in Georgia, US. Previous small reactors built in various parts of America also shut down because they were uneconomical. \nThe cost was four to six times the cost of the same electricity from wind a", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/11/1619200/are-small-modular-nuclear-reactors-costly-and-unviable?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Are Small Modular Nuclear Reactors Costly and Unviable?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T07:54:15.404192+00:00", "description": "Thursday the BBC reported:\n\nPlane bodies made by Boeing's largest supplier regularly left the factory with serious defects, according to a former quality inspector at the firm. Santiago Paredes who worked for Spirit AeroSystems in Kansas, told the BBC he often found up to 200 defects on parts being readied for shipping to Boeing. He was nicknamed \"showstopper\" for slowing down production when he tried to tackle his concerns, he claimed. \n\nSpirit said it \"strongly disagree[d]\" with the allegations. \"We are vigorously defending against his claims,\" said a spokesperson for Spirit, which remains Boeing's largest supplier. \n\nMr Paredes made the allegations against Spirit in an exclusive interview with the BBC and the American network CBS, in which he described what he said he experienced while working at the firm between 2010 and 2022... \"I was finding a lot of missing fasteners, a lot of bent parts, sometimes even missing parts....\" Mr Paredes told the BBC that some of the defects he iden", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/12/0223207/former-boeing-quality-inspector-turns-whistleblower-says-plane-parts-had-serious-defects?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Former Boeing Quality Inspector Turns Whistleblower, Says Plane Parts Had Serious Defects", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T04:39:54.392957+00:00", "description": "An anonymous reader shared this report from CNN:\n\n\nThe \"world's largest\" plant designed to suck planet-heating pollution out of the atmosphere like a giant vacuum began operating in Iceland on Wednesday. \"Mammoth\" is the second commercial direct air capture plant opened by Swiss company Climeworks in the country, and is 10 times bigger than its predecessor, Orca, which started running in 2021... Climeworks plans to transport the carbon underground where it will be naturally transformed into stone, locking up the carbon permanently... The whole operation will be powered by Iceland's abundant, clean geothermal energy.... \n\nClimeworks started building Mammoth in June 2022, and the company says it is the world's largest such plant. It has a modular design with space for 72 \"collector containers\" &mdash; the vacuum parts of the machine that capture carbon from the air &mdash; which can be stacked on top of each other and moved around easily. There are currently 12 of these in place with mo", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/10/1836259/the-worlds-largest-vaccuum-to-suck-climate-pollution-from-the-air-just-began-operating?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The World's Largest Vaccuum to Suck Climate Pollution From the Air Just Began Operating", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T02:29:18.039063+00:00", "description": "\"Google's business is growing at its fastest rate in two years,\" reports CNBC, \"and a blowout earnings report in April sparked the biggest rally in Alphabet shares since 2015, pushing the company's market cap past $2 trillion. \n\n\"But at an all-hands meeting last week with CEO Sundar Pichai and CFO Ruth Porat, employees were more focused on why that performance isn't translating into higher pay, and how long the company's cost-cutting measures are going to be in place.\"\n\n\n\n\"We've noticed a significant decline in morale, increased distrust and a disconnect between leadership and the workforce,\" a comment posted on an internal forum ahead of the meeting read. \"How does leadership plan to address these concerns and regain the trust, morale and cohesion that have been foundational to our company's success?\" \n\nGoogle is using artificial intelligence to summarize employee comments and questions for the forum. \nAlphabet's top leadership has been on the defensive for the past few years, as voc", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/12/010247/google-employees-question-execs-over-decline-in-morale-after-blowout-earnings?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Employees Question Execs Over 'Decline in Morale' After Blowout Earnings", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T00:21:17.370207+00:00", "description": "This week, The Register reported:\nIf you are still running RHEL 7, which is now approaching a decade old, there's good news. Red Hat is offering four more years of support for RHEL 7.9, which it terms Extended Life Cycle Support or ELS. \nIf you are running the free version, CentOS Linux 7, that hits its end-of-life on the same date: June 30, 2024. CIQ, which offers CentOS Linux rebuild Rocky Linux, has a life cycle extension for that too, which it calls CIQ Bridge. The company told The Reg:\n\n\"CIQ Bridge, essentially a long-term support service tailored for CentOS 7 users on the migration path to Rocky Linux, is offered under an annual, fixed-rate subscription. CIQ Bridge includes access to CentOS 7 extended life package updates for an additional three years and security updates for CVSS 7 issues and above. Security updates for CVSS 5 and 6 are available at an elevated subscription tier. CIQ Bridge is designed to support CentOS 7 users until they are ready for CIQ guidance and support ", "language": "en-us", "link": "https://linux.slashdot.org/story/24/05/10/2256230/red-hat-and-ciq-offer-extend-support-for-rhel-7-and-centos-7?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Red Hat (and CIQ) Offer Extend Support for RHEL 7 (and CentOS 7)", "user": null, "vote": 0}]