[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T17:30:00+00:00", "description": "The Resident Evil franchise has delivered a number of bangers in the form of Resident Evil 7 and Resident Evil 2 Remake, and even in that mighty company, Resident Evil Village holds a special place. Launching in 2021, the survival horror title was met with widespread acclaim from critics and audiences alike, and has since gone on to sell impressive numbers, and looking back, it’s hard not to say that all of that success has been well deserved. \n\nBest described as a theme park of horrors, not only did Resident Evil Village boast an impressive variety in both styles of horror and types of gameplay experiences, but it also captured the genre’s many different flavors quite effectively- and it did all of that without feeling like it was lacking cohesion. Here, with Resident Evil Village now three years old, we’re going to talk about all of that and more.", "language": null, "link": "https://www.youtube.com/watch?v=BS3NBSImO2A", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/BS3NBSImO2A/hqdefault.jpg", "title": "THREE YEARS LATER, What Made Resident Evil 8: Village One Hell of a Game?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T13:30:01+00:00", "description": "The one style of game design that never seems to go out of style is one that puts players in a hub-and-spoke world. You’re dropped into a central location, from where you head out into different places throughout the length of your journey, each time coming back to that central hub, with your base of operations, so to speak, growing and changing with time. \n\nThere’s inherent appeal to that design, whether that’s because of the familiarity you gain with that central hub, or because of how that hub can keep finding ways to show you new things, either from gameplay or storytelling perspectives. \n\nIn past video, we shone the spotlight on several of these hubs that stand out in memory, and here, we’re going to keep that going and speak about several more that we haven’t yet recognized for their greatness. \n\nLink to original video: https://www.youtube.com/watch?v=W9H250-UmzM", "language": null, "link": "https://www.youtube.com/watch?v=1_rxb5zzGJE", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/1_rxb5zzGJE/hqdefault.jpg", "title": "10 More EXCELLENT HUBS We've Seen in Games In Recent Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-12T08:15:00+00:00", "description": "Arguably the most derided of any horror game ever, Resident Evil 6’s failings are numerous: it’s departure from creeping survival horror to gun-happy action adventure, it’s convoluted plot supplanted by complex, interwoven campaigns, it’s finicky cover system and mediocre gunplay, and it’s annoying overreliance on quick time events (a video game trope that was already falling out of favor by the time the game released in 2012). \n\nWhat this video aims to point out though is that Resident Evil 6 does possess a handful of redeeming features and discusses whether these aspects are enough to craft a remake, or whether Resident Evil 6 should be left on the cutting room floor.", "language": null, "link": "https://www.youtube.com/watch?v=5rjtsvjnDak", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/5rjtsvjnDak/hqdefault.jpg", "title": "THE BIG QUESTION: Should Resident Evil 6 Be Remade?", "user": null, "vote": 0}]