[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T21:54:50.363412+00:00", "description": "The Federal Communications Commission chair decided not to impose Universal Service fees on Internet service, rejecting arguments for new assessments to shore up an FCC fund that subsidizes broadband network expansions and provides discounts to low-income consumers. From a report: The $8 billion-a-year Universal Service Fund (USF) pays for FCC programs such as Lifeline discounts and Rural Digital Opportunity Fund deployment grants for ISPs. Phone companies must pay a percentage of their revenue into the fund, and telcos generally pass those fees on to consumers with a \"Universal Service\" line item on telephone bills. \n\nImposing similar assessments on broadband could increase the Universal Service Fund's size and/or reduce the charges on phone service, spreading the burden more evenly across different types of telecommunications services. Some consumer advocates want the FCC to increase the fund in order to replace the Affordable Connectivity Program (ACP), a different government progr", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/08/2052220/fcc-chair-rejects-call-to-impose-universal-service-fees-on-broadband?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FCC Chair Rejects Call To Impose Universal Service Fees on Broadband", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T21:54:48.468982+00:00", "description": "The capability of new AI models will surpass human intelligence by the end of next year [non-paywalled link], so long as the supply of electricity and hardware can satisfy the demands of the increasingly powerful technology, according to Elon Musk. From a report: \"My guess is that we'll have AI that is smarter than any one human probably around the end of next year,\" said the billionaire entrepreneur, who runs Tesla, X and SpaceX. Within the next five years, the capabilities of AI will probably exceed that of all humans, Musk predicted on Monday during an interview on X with Nicolai Tangen, the chief executive of Norges Bank Investment Management. \n\nMusk has been consistently bullish on the development of so-called artificial general intelligence, AI tools so powerful they can beat the most capable individuals in any domain. But Monday's prediction is ahead of schedules he and others have previously forecast. Last year, he predicted \"full\" AGI would be achieved by 2029. Some of Musk's", "language": "en-us", "link": "https://slashdot.org/story/24/04/08/211227/musk-predicts-ai-will-overtake-human-intelligence-next-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Musk Predicts AI Will Overtake Human Intelligence Next Year", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T19:43:55.634817+00:00", "description": "An anonymous reader shares a report: Microsoft is getting ready to fully unveil its vision for \"AI PCs\" next month at an event in Seattle. Sources familiar with Microsoft's plans tell The Verge that Microsoft is confident that a round of new Arm-powered Windows laptops will beat Apple's M3-powered MacBook Air both in CPU performance and AI-accelerated tasks. After years of failed promises from Qualcomm, Microsoft believes the upcoming Snapdragon X Elite processors will finally offer the performance it has been looking for to push Windows on Arm much more aggressively. Microsoft is now betting big on Qualcomm's upcoming Snapdragon X Elite processors, which will ship in a variety of Windows laptops this year and Microsoft's latest consumer-focused Surface hardware. \n\nMicrosoft is so confident in these new Qualcomm chips that it's planning a number of demos that will show how these processors will be faster than an M3 MacBook Air for CPU tasks, AI acceleration, and even app emulation. Mi", "language": "en-us", "link": "https://slashdot.org/story/24/04/08/1850249/microsoft-is-confident-windows-on-arm-could-finally-beat-apple-silicon-powered-macs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft is Confident Windows on Arm Could Finally Beat Apple Silicon-Powered Macs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T16:29:20.778766+00:00", "description": "A jailed trader accused of stealing $110 million on the Mango Markets exchange faces a criminal trial this week that will test the reach of a US crackdown on cryptocurrencies. From a report: Prosecutors charged Avraham Eisenberg with manipulating Mango Markets futures contracts on Oct. 11, 2022, to boost the price of swaps by 1,300% in 20 minutes. He then \"borrowed\" from the exchange against the inflated value of those contracts, a move the government claims was a theft. Jury selection begins Monday in New York federal court, where groundbreaking crypto cases have played out. FTX co-founder Sam Bankman-Fried was sentenced there last month to 25 years in prison for orchestrating a multibillion-dollar scheme, while Terraform Labs Pte. and co-founder Do Kwon were found liable Friday for fraud in civil trial over the firm's 2022 collapse, which wiped out $40 billion in investor assets. \n\nEisenberg, a self-described \"applied game theorist,\" claims his actions weren't theft at all. Rather, ", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/08/1512219/crypto-scam-criminal-trial-tests-code-is-law-claim-by-trader?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Crypto Scam Criminal Trial Tests 'Code Is Law' Claim by Trader", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T15:24:36.955828+00:00", "description": "Microsoft is moving \"full speed ahead\" on its next generation console, an internal email from Xbox president Sarah Bond has revealed. From a report: The email, obtained by Windows Central and verified to be genuine by Microsoft, also announced the formation of a game preservation team at Xbox. \"We are moving full speed ahead on our next generation hardware, focused on delivering the biggest technological leap ever in a generation,\" Bond said, reiterating comments made in February when the console's existence was officially announced. No further information was shared regarding the hardware itself, nor when fans might be able to buy it, but documents leaked in 2023 suggested Microsoft plans to release the next Xbox in 2028. Regardless, with Microsoft seemingly making its development a priority, it will likely be available sooner rather than later. \n\nAlongside it looking to the future, Xbox also appears committed to the past and present. \"We have formed a new team dedicated to game pres", "language": "en-us", "link": "https://games.slashdot.org/story/24/04/08/153243/xbox-moving-full-speed-ahead-on-next-gen-console?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Xbox Moving 'Full Speed Ahead' on Next Gen Console", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T12:08:46.936925+00:00", "description": "The Seattle Times has a Pulitzer Prize-winning aerospace journalist named Dominic Gates. Sunday he published an expose on \"a yearslong decline of safety standards\" at Boeing. \n\nAfter a 1997 merger, its new executive leaders \"treated experienced engineers and machinists as expendable, ignoring the potential damage to Boeing's essential mission of designing and building high-quality airplanes....\"\n\n\nThe arc of Boeing's fall can be traced back a quarter century, to when its leaders elevated the interests of shareholders above all others, said Richard Aboulafia, industry analyst with AeroDynamic Advisory. \"Crush the workers. Share price. Share price. Share price. Financial moves and metrics come first,\" was Boeing's philosophy, he said. It was, he said, \"a ruthless effort to cut costs without any realization of what it could do to capabilities....\" Its leaders outsourced work, sold off whole divisions and discarded key capabilities such as developing avionics, machining parts and building", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/07/1958253/report-boeing-put-wall-street-first-safety-second-creating-yearslong-decline-of-safety-standards?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Report: Boeing 'Put Wall Street First, Safety Second', Creating 'Yearslong Decline of Safety Standards'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T11:04:15.063472+00:00", "description": "The U.S. Commerce Department said on Monday it would award Taiwan Semiconductor Manufacturing Co's unit a $6.6 billion subsidy for advanced semiconductor production in Phoenix, Arizona and up to $5 billion in low-cost government loans. From a report: TSMC agreed to expand its planned investment by $25 billion to $65 billion and to add a third Arizona fab by 2030, Commerce said in announcing the preliminary award. The Taiwanese company will produce the world's most advanced 2 nanometer technology at its second Arizona fab expected to begin production in 2028, the department said. \n\n\"These are the chips that underpin all artificial intelligence, and they are the chips that are necessary components for the technologies that we need to underpin our economy, but frankly, a 21st century military and national security apparatus,\" Commerce Secretary Gina Raimondo said in a statement.\nTSMC, the world's largest contract chipmaker and a major supplier to Apple and Nvidia had previously announced", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/08/1058232/tsmc-wins-66-billion-us-subsidy-for-arizona-chip-production?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "TSMC Wins $6.6 Billion US Subsidy for Arizona Chip Production", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T08:54:15.290179+00:00", "description": "When Disneyland opened in 1955, its car-themed attraction Autopia \"represented the future of what would become America's multilane limited-access highways,\" according to Wikipedia, \" which were still being developed. President Eisenhower had yet to sign the Interstate Highway legislation...\" \n\nWikipedia adds that the cars \"generate a moderate level of exhaust from the Honda GX gasoline engines that propel the cars.\" But that may change, according to a climate-oriented newsletter from the Los Angeles Times:\nIf anyone could get away with defending the toxic odor, it might be Bob Gurr. He designed the original Autopia cars in the mid-1950s, working closely with Walt himself. He's proud of what they built together. But today the 92-year-old Disney legend says the polluting motors need to go. \"Get rid of those God-awful gasoline fumes,\" he told me. \n\nDisney is finally preparing to do just that. In news shared exclusively with The Times ahead of this column's publication &mdash; after sever", "language": "en-us", "link": "https://idle.slashdot.org/story/24/04/06/0438257/one-of-disneylands-longest-running-attractions-is-ditching-fossil-fuels?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "One of Disneyland's Longest-Running Attractions is Ditching Fossil Fuels", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T06:44:14.523551+00:00", "description": "It's the world's most widely used vulnerability database, reports SC Magazine, offering standards-based data on CVSS severity scores, impacted software and platforms, contributing weaknesses, and links to patches and additional resources. \n\nBut \"there is a growing backlog of vulnerabilities\" submitted to America's National Vulnerability Database and \"requiring analysis\", according to a new announcement from the U.S. Commerce Department's National Institute of Standards. \"This is based on a variety of factors, including an increase in software and, therefore, vulnerabilities, as well as a change in interagency support.\" From SC Magazine:\n\n\n According to NIST's website, the institute analyzed only 199 of 3370 CVEs it received last month. [And this month another 677 came in &mdash; of which 24 have been analyzed.]\n\n \n\nOther than a short notice advising it was working to establish a new consortium to improve the NVD, NIST had not provided a public explanation for the problems prior to a s", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/08/0213203/nist-blames-growing-backlog-of-vulnerabilities-requiring-analysis-on-lack-of-support?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NIST Blames 'Growing Backlog of Vulnerabilities' Requiring Analysis on Lack of Support", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T04:33:58.223381+00:00", "description": "\"Varda Space Industries has closed a massive tranche of funding,\" reports TechCrunch, \"just weeks after its first drug manufacturing capsule returned from orbit.\" \n\nVarda has now raised $145 million to date, the article points out, and the $90 million in new Series B funding \"marks an inflection point for the company, which is now gearing up to scale from the initial demonstration mission to a regular set of missions carrying customer payloads, Varda founder Delian Asparouhov told TechCrunch.\"\n\nEl Segundo-based Varda was founded in 2021 by Asparouhov, who is also a partner at Founders Fund, and Will Bruey, a spacecraft engineer who cut his teeth at SpaceX. The pair had an audacious goal to commercialize what until very recently was promising but ultimately small-scale research into the effects of microgravity on pharmaceutical crystals... Astronauts have been conducting protein crystallization experiments in space for decades on the International Space Station and before that, the Spa", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/08/0113221/vcs-invest-90m-in-varda-space-industries-microgravity-drug-manufacturing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "VCs Invest $90M in Varda Space Industries' Microgravity Drug Manufacturing", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T01:19:13.859703+00:00", "description": "This week America's Department of Energy announced \"a comprehensive plan to reduce greenhouse-gas emissions from buildings by 65% by 2035 and 90% by 2050.\"\n\nThe U.S. Department of Energy (DOE) led the Blueprint's development in collaboration with the Department of Housing and Urban Development, the Environmental Protection Agency, and other federal agencies. The Blueprint is the first sector-wide strategy for building decarbonization developed by the federal government... \"America's building sector accounts for more than a third of the harmful emissions jeopardizing our air and health...\" said U.S. Secretary of Energy Jennifer M. Granholm. \"As part of a whole-of-government approach, the Department of Energy is outlining for the first time ever a comprehensive federal plan to reduce energy in our homes, schools, and workplaces &mdash; lowering utility bills and creating healthier communities while combating the climate crisis.\" \n\nBuildings account for more than one third of domestic cl", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/08/0019201/us-energy-department-announces-blueprint-for-slashing-emissions-from-buildings-and-reducing-energy-use?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Energy Department Announces 'Blueprint' for Slashing Emissions From Buildings and Reducing Energy Use", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T01:19:11.847325+00:00", "description": "CNN revisits 2003's disastrous landing of the Space Shuttle Columbia tonight with two \"immersive\" specials co-produced by BBC and Mindhouse Productions \"featuring exclusive interviews and revealing never-before-broadcast footage,\" according to an announcement &mdash; with two more specials airing next week. \n\nYou can watch a trailer here.\n\n\nAcross four episodes, the story of the ticking-clock of Columbia's final mission is told in dramatic detail, beginning months before the troubled launch, unfolding across the sixteen days in orbit, and concluding with the investigation into the tragic loss of the seven astronauts' lives. Weaving together intimate footage shot by the astronauts themselves inside the orbiter, exclusive first-hand testimony from family members of the Shuttle's crew, key players at NASA &mdash; some of whom have never spoken before &mdash; and journalists who covered the story on the ground, the series paints an intimate portrait of the women and men onboard and uncove", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/07/2238205/cnn-investigates-space-shuttle-columbia-the-final-flight?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "CNN Investigates 'Space Shuttle Columbia: The Final Flight'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-08T00:16:16.807427+00:00", "description": "\"It appears the live-service shooter Suicide Squad: Kill The Justice League is, once again, suffering from a hacker problem,\" reports Kotaku:\n\n\n Instead of doing absolutely absurd amounts of damage, this time hackers have figured out how to gain access to unreleased characters and skins. And publisher WB Games is reportedly issuing DMCA takedown notices against any assets that have found their way online. \n\nAs reported by IGN, one hacker discovered how to play as Deathstroke, one of the four characters developer Rocksteady Studios teased for an upcoming Suicide Squad season... There were also unreleased skins for The Joker and King Shark that folks have somehow accessed, all of which began circulating on Reddit and X/Twitter on April 4. \n\nNot long after, the assets were removed, with folks believing WB Games was behind the strikes. YouTuber TrixRidiculous, who primarily covers DC- and Marvel-related RPGs, had their posts on X/Twitter swiftly taken down by a DMCA strike.\"I posted three", "language": "en-us", "link": "https://games.slashdot.org/story/24/04/07/232257/warner-bros-issues-dmcas-after-suicide-squad-game-cracked-to-allow-playing-as-unreleased-characters?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Warner Bros. Issues DMCA's After 'Suicide Squad' Game Cracked to Allow Playing as Unreleased Characters", "user": null, "vote": 0}]