[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T20:50:53.721047+00:00", "description": "New York Governor Kathy Hochul (D) signed two bills into law on Thursday that aim to protect kids and teens from social media harms, making it the latest state to take action as federal proposals still await votes. From a report: One of the bills, the Stop Addictive Feeds Exploitation (SAFE) for Kids Act, will require parental consent for social media companies to use \"addictive feeds\" powered by recommendation algorithms on kids and teens under 18. The other, the New York Child Data Protection Act, would limit data collection on minors without consent and restrict the sale of such information but does not require age verification. That law will take effect in a year. \n\nStates across the country have taken the lead on enacting legislation to protect kids on the internet -- and it's one area where both Republicans and Democrats seem to agree. While the approaches differ somewhat by party, policymakers on both sides have signaled urgent interest in similar regulations to protect kids on", "id": 748431, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/20/1949212/new-york-bans-addictive-feeds-for-teens?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New York Bans 'Addictive Feeds' For Teens", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T19:47:26.353446+00:00", "description": "An anonymous reader shares a report: CDK Global, the company that provides management software for nearly 15,000 car dealerships in North America, is down for a second day following a cyberattack, according to a report from Automotive News. The outage has left car dealerships across North America unable to access the internal systems used to track car sales, view customer information, schedule maintenance, and more. \n\nOn Wednesday, CDK Global told dealerships that it's \"investigating a cyber incident\" and \"proactively shut all systems down\" while addressing the issue. However, as reported by Automotive News, CDK Global restored its systems shortly after, only to shut them down hours later due to \"an additional cyber incident.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Car+Dealerships+Hit+With+Massive+Computer+System+Outage%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F06%2F20%2F1851235%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\">", "id": 747982, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/20/1851235/car-dealerships-hit-with-massive-computer-system-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Car Dealerships Hit With Massive Computer System Outage", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T18:41:39.961575+00:00", "description": "Facebook and Instagram users are increasingly turning to small claims courts to regain access to their accounts or seek damages from Meta, amid frustrations with the company's customer support. In several cases across multiple states, Engadget reports, plaintiffs have successfully restored account access or won financial compensation. Meta often responds by contacting litigants before court dates, attempting to resolve issues out of court. \n\nThe trend, popularized on social media forums, highlights ongoing customer service issues at the tech giant. Some users report significant financial losses due to inaccessible business-related accounts. While small claims court offers a more accessible legal avenue, Meta typically deploys legal resources to respond to these claims.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta's+Customer+Service+is+So+Bad%2C+Users+Are+Suing+in+Small+Claims+Court+To+Resolve+Issues%3A+https%3A%2F%2Ftech.slashdot.org%2", "id": 747481, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/20/1733244/metas-customer-service-is-so-bad-users-are-suing-in-small-claims-court-to-resolve-issues?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta's Customer Service is So Bad, Users Are Suing in Small Claims Court To Resolve Issues", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T18:41:38.393536+00:00", "description": "TikTok and Chinese parent ByteDance on Thursday urged a U.S. court to strike down a law they say will ban the popular short app in the United States on Jan. 19, saying the U.S. government refused to engage in any serious settlement talks after 2022. From a report: Legislation signed in April by President Joe Biden gives ByteDance until Jan. 19 of next year to divest TikTok's U.S. assets or face a ban on the app used by 170 million Americans. ByteDance says a divestiture is \"not possible technologically, commercially, or legally.\" \n\nThe U.S. Court of Appeals for the District of Columbia will hold oral arguments on lawsuits filed by TikTok and ByteDance along with TikTok users on Sept. 16. TikTok's future in the United States may rest on the outcome of the case which could impact how the U.S. government uses its new authority to clamp down on foreign-owned apps. \"This law is a radical departure from this country's tradition of championing an open Internet, and sets a dangerous precedent", "id": 747480, "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/20/1756248/tiktok-says-us-ban-inevitable-without-a-court-order-blocking-law?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "TikTok Says US Ban Inevitable Without a Court Order Blocking Law", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T17:30:51.699043+00:00", "description": "A cinema in London has cancelled the world premiere of a film with a script generated by AI after a backlash. From a report: The Prince Charles cinema, located in London's West End and which traditionally screens cult and art films, was due to host a showing of a new production called The Last Screenwriter on Sunday. However the cinema announced on social media that the screening would not go ahead. In its statement the Prince Charles said: \"The feedback we received over the last 24hrs once we advertised the film has highlighted the strong concern held by many of our audience on the use of AI in place of a writer which speaks to a wider issue within the industry.\" \n\nDirected by Peter Luisi and starring Nicholas Pople, The Last Screenwriter is a Swiss production that describes itself as the story of \"a celebrated screenwriter\" who \"finds his world shaken when he encounters a cutting edge AI scriptwriting system ... he soon realises AI not only matches his skills but even surpasses him ", "id": 747113, "language": "en-us", "link": "https://slashdot.org/story/24/06/20/171227/london-premiere-of-movie-with-ai-generated-script-cancelled-after-backlash?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "London Premiere of Movie With AI-Generated Script Cancelled After Backlash", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T16:26:21.502084+00:00", "description": "European Union officials have delayed talks over proposed legislation that could lead to messaging services having to scan photos and links to detect possible child sexual abuse material (CSAM). From a report: Were the proposal to become law, it may require the likes of WhatsApp, Messenger and Signal to scan all images that users upload -- which would essentially force them to break encryption. For the measure to pass, it would need to have the backing of at least 15 of the member states representing at least 65 percent of the bloc's entire population. However, countries including Germany, Austria, Poland, the Netherlands and the Czech Republic were expected to abstain from the vote or oppose the plan due to cybersecurity and privacy concerns, Politico reports. If EU members come to an agreement on a joint position, they'll have to hash out a final version of the law with the European Commission and European Parliament.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http:/", "id": 746598, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/20/1530210/eu-delays-decision-over-scanning-encrypted-messages-for-csam?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EU Delays Decision Over Scanning Encrypted Messages For CSAM", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T16:26:18.961790+00:00", "description": "Universal Music Group has partnered with AI startup SoundLabs to offer voice modeling technology to its artists. The MicDrop feature, launching this summer, will allow UMG artists to create and control their own AI voice models. The tool includes voice-to-instrument functionality and language transposition capabilities. RollingStone adds: AI voice clones have become perhaps the most well-known -- and often the most controversial -- use of artificial intelligence in the music business. Viral tracks with AI vocals have spurred legislation to protect artists' virtual likenesses and rights of publicity. \n\nLast year, an anonymous songwriter named Ghostwriter went viral with his song \"Heart On My Sleeve,\" which featured AI-generated vocals of UMG artists Drake and The Weeknd. The song was pulled from streaming services days later following mounting pressure from the record company. Ironically, Drake got caught in a voice cloning controversy of his own a year later when he used a Tupac voice", "id": 746597, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/06/20/160216/worlds-largest-music-company-is-helping-musicians-make-their-own-ai-voice-clones?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "World's Largest Music Company Is Helping Musicians Make Their Own AI Voice Clones", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T15:19:59.523954+00:00", "description": "Anthropic launched Claude 3.5 Sonnet on Thursday, claiming it outperforms previous models and OpenAI's GPT-4 Omni. The AI startup also introduced Artifacts, a workspace for users to edit AI-generated projects. This release, part of the Claude 3.5 family, follows three months after Claude 3. Claude 3.5 Sonnet is available for free on Claude.ai and the Claude iOS app, while Claude Pro and Team plan subscribers can access it with significantly higher rate limits. \n\nAnthropic plans to launch 3.5 versions of Haiku and Opus later this year, exploring features like web search and memory for future releases. \n\nAnthropic also introduced Artifacts on Claude.ai, a new feature that expands how users can interact with Claude. When a user asks Claude to generate content like code snippets, text documents, or website designs, these Artifacts appear in a dedicated window alongside their conversation. This creates a dynamic workspace where they can see, edit, and build upon Claude's creations in real-", "id": 746073, "language": "en-us", "link": "https://slashdot.org/story/24/06/20/1449220/anthropic-launches-claude-35-sonnet-says-new-model-outperforms-gpt-4-omni?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Anthropic Launches Claude 3.5 Sonnet, Says New Model Outperforms GPT-4 Omni", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T14:13:39.540590+00:00", "description": "The Biden administration on Thursday will announce plans to bar the sale of Kaspersky Lab's antivirus software in the United States, citing the firm's large U.S. customers including critical infrastructure providers and state and local governments, according to Reuters. From the report: The company's close ties to the Russian government were found to pose a critical risk, the person said, adding that the software's privileged access to a computer's systems could allow it to steal sensitive information from American computers, install malware or withhold critical updates. The sweeping new rule, using broad powers created by the Trump administration, will be coupled with another move to add the company to a trade restriction list, according to two other people familiar with the matter, dealing a blow to the firm's reputation that could hammer its overseas sales. \n\nThe plan to add the cybersecurity company to the entity list, which effectively bars a company's U.S. suppliers from selling", "id": 745718, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/20/1322221/biden-to-ban-us-sales-of-kaspersky-software-over-ties-to-russia?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Biden To Ban US Sales of Kaspersky Software Over Ties To Russia", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T14:13:37.467395+00:00", "description": "An anonymous reader shares a report: YouTube Premium subscribers who use VPNs are reporting that their plans are being automatically canceled by the Google-owned company, according to multiple subscribers who have posted screenshots and descriptions of the issue on Reddit. \n\nA Google support representative confirmed to PCMag that YouTube has started a crackdown. \"YouTube has initiated the cancellation of premium memberships for accounts identified as having falsified signup country information,\" the Google support agent said via chat message. \"Due to violating YouTube's Paid Terms of Service, these users will receive an email and an in-app notification informing them of the cancellation.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=YouTube+Is+Cracking+Down+on+Cheap+Premium+Plans+Bought+With+a+VPN%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F06%2F20%2F141221%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com", "id": 745717, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/20/141221/youtube-is-cracking-down-on-cheap-premium-plans-bought-with-a-vpn?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "YouTube Is Cracking Down on Cheap Premium Plans Bought With a VPN", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T13:08:36.949886+00:00", "description": "Perplexity AI, a billion-dollar \"AI\" search startup, has come under scrutiny for its data collection practices and accuracy of its chatbot responses. Despite claiming to respect website operators' wishes, Perplexity appears to scrape content from sites that have blocked its crawler, using an undisclosed IP address, a Wired investigation found. The chatbot also generates summaries that closely paraphrase original reporting with minimal attribution. Furthermore, its AI often \"hallucinates,\" inventing false information when unable to access articles directly. Perplexity's CEO, Aravind Srinivas, maintains the company is not acting unethically.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Perplexity+AI+Faces+Scrutiny+Over+Web+Scraping+and+Chatbot+Accuracy%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F06%2F20%2F1224254%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpo", "id": 745224, "language": "en-us", "link": "https://slashdot.org/story/24/06/20/1224254/perplexity-ai-faces-scrutiny-over-web-scraping-and-chatbot-accuracy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Perplexity AI Faces Scrutiny Over Web Scraping and Chatbot Accuracy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T08:20:44.302568+00:00", "description": "An anonymous reader shares a report: Punishing heat waves gripped three continents on Tuesday, breaking records in cities around the Northern Hemisphere less than two weeks after the Earth recorded what scientists said were likely its hottest days in modern history. Firefighters in Greece scrambled to put out wildfires, as parched conditions raised the risk of more blazes throughout Europe. Beijing logged another day of 95-degree heat, and people in Hangzhou, another Chinese city, compared the choking conditions to a sauna. From the Middle East to the American Southwest, delivery drivers, airport workers and construction crews labored under blistering skies. Those who could stay indoors did. \n\nThe temperatures, afflicting so much of the world all at once, were a withering reminder that climate change is a global crisis, driven by human-made forces: the emissions of heat-trapping gases, mainly caused by the burning of fossil fuels. John Kerry, the U.S. special envoy for climate change,", "id": 743720, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/20/086251/heat-waves-grip-3-continents-as-climate-change-warms-earth?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Heat Waves Grip 3 Continents as Climate Change Warms Earth", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T03:40:12.578875+00:00", "description": "An anonymous reader writes: Scientists have found microplastics in human penises for the first time, as concerns over the tiny particles' proliferation and potential health effects mount. Seven different kinds of microplastics were found in four out of five samples of penis tissue taken from five different men as part of a study published in IJIR: Your Sexual Medicine Journal on Wednesday. Microplastics are polymer fragments that can range from less than 0.2 inch (5 millimeters) down to 1/25,000th of an inch (1 micrometer). Anything smaller is a nanoplastic that must be measured in billionths of a meter. They form when larger plastics break down, either by chemically degrading or physically wearing down into smaller pieces. \n\nSome minuscule particles can invade individual cells and tissues in major organs, experts say, and evidence is mounting that they are increasingly present in our bodies. Study lead author Ranjith Ramasamy, an expert in reproductive urology who conducted the resea", "id": 742883, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/20/0314238/microplastics-discovered-in-human-penises-for-the-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microplastics Discovered In Human Penises For the First Time", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T00:25:24.280455+00:00", "description": "Twenty years ago, FedEx established its own police force. Now it's working with local police to build out an AI car surveillance network. From a report: Forbes has learned the shipping and business services company is using AI tools made by Flock Safety, a $4 billion car surveillance startup, to monitor its distribution and cargo facilities across the United States. As part of the deal, FedEx is providing its Flock video surveillance feeds to law enforcement, an arrangement that Flock has with at least five multi-billion dollar private companies. But publicly available documents reveal that some local police departments are also sharing their Flock feeds with FedEx -- a rare instance of a private company availing itself of a police surveillance apparatus. \n\nTo civil rights activists, such close collaboration has the potential to dramatically expand Flock's car surveillance network, which already spans 4,000 cities across over 40 states and some 40,000 cameras that track vehicles by li", "id": 742372, "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/19/230236/fedexs-secretive-police-force-is-helping-cops-build-an-ai-car-surveillance-network?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FedEx's Secretive Police Force Is Helping Cops Build An AI Car Surveillance Network", "user": null, "vote": 0}]