[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T22:00:11+00:00", "description": "With how massive the Realm of Shadow is in Elden Ring: Shadow of the Erdtree - some reviews estimate 25 hours to finish the critical path - it can pose a challenge. Fortunately, there is a method to the madness, whether you're looking for upgrade materials or trying to unearth new weapons.\n\nHow do you take down the new Furnace Golems? What's the reward for doing so (and how will it help make your life easier)? Why aren't Spiritsprings working like in The Lands Between? What should you beware of when tackling the new Legacy Dungeons? The new Scadutree Fragments sound pretty great in theory, but where do you go about finding more?\n\nWe dive into all this and more while leaving plenty up to you to discover. Here are ten tips and tricks for Elden Ring: Shadow of the Erdtree to get you going.", "id": 748964, "language": null, "link": "https://www.youtube.com/watch?v=LD_svrVHuGw", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/LD_svrVHuGw/hqdefault.jpg", "title": "Elden Ring: Shadow of the Erdtree - 10 Essential Starter Tips And Tricks It Doesn't Tell You", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T22:00:05+00:00", "description": "ASKA is a survival crafting game that takes strong inspirations from its modern counterparts. The game throws players into a strange world inhabited by magical creatures where they must survive by crafting and building up a brand-new settlement for themselves from scratch. \n\nWhere the game sets itself apart from other titles in the genre is in its village system. Players can build entire towns populated by villagers, who can then be tasked with automating some of the more tedious aspects of the game, like gathering wood and stone, and refining them into more useful materials. Unfortunately, while its foundations are strong, ASKA is still lacking when it comes to offering more gameplay depth from some of its more unique aspects.", "id": 748965, "language": null, "link": "https://www.youtube.com/watch?v=A5abAfE6Sv0", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/A5abAfE6Sv0/hqdefault.jpg", "title": "What The Hell Is ASKA?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T14:00:25+00:00", "description": "Slowly but surely, Konami is pulling back the curtain on Metal Gear Solid Delta: Snake Eater, and each time we see more of the upcoming remake, it continues to look more and more promising. \n\nFrom a gameplay, design, and story perspective, it’s clear that Konami isn’t looking to make many (or any) changes to the experience, but though the vast majority of the content will remain unchanged, there are still some finer improvements further down in the weeds that fans of the original are hoping to see- us included. \n\nFrom lost minigames to narrative tweaks to even UI changes, here, we are going to discuss a few such changes and improvements we’re hoping to see in the upcoming Metal Gear Solid 3 remake.", "id": 745667, "language": null, "link": "https://www.youtube.com/watch?v=YdQMfoz4qC8", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/YdQMfoz4qC8/hqdefault.jpg", "title": "Metal Gear Solid Delta: Snake Eater - 10 Features Every Hardcore Fan Wants", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-20T10:30:21+00:00", "description": "The First Descendant is a free co-op looter shooter arriving on July 2nd . The Korean team over at Nexon has been iterating on a vast number of gameplay elements as a response to beta feedback, and it’s looking better than ever. \n\nGrappling has undergone a complete redesign and features four-way movement and direct enemy attachment. Movement in general also just feels and looks much better, with ledge vaulting parkour and numerous additional animations to running and jumping. I’m particularly interested in trying out the new side activities dotting the densely designed fields and finding out more about the history and lore of Albion through journal entries. \n\nHardcore players will be happy to know that the July 2 release includes new endgame Instance Dungeons allowing for solo play and difficulty parameters giving unique rewards.", "id": 744450, "language": null, "link": "https://www.youtube.com/watch?v=xOIxWO6vyZk", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/xOIxWO6vyZk/hqdefault.jpg", "title": "The First Descendant - 15 Things You ABSOLUTELY NEED To Know Before You Play", "user": null, "vote": 0}]