[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-25T22:30:04+00:00", "description": "Despite being a direct sequel to the EDF 5, Earth Defense Force 6 exists as a standout entry in the series in its own right. EDF 6 has by far the longest campaign in the series to date, with over 130 missions across five difficulties and a plethora of equipment to play with. \n\nThis also marks EDF’s first step into the current generation of consoles with 4K visuals. Thankfully, EDF 6 carries that same campy tone that we’ve come to know and love. Though, this game picks off directly from the somber ending of the last, it quickly breaks the fourth wall and maintains the series’ hallmark humor, unintentional or not. \n\nEarth Defense Force 6 provides a boisterously fun time in short spurts. Its mission structure gets repetitive, and the lack of mid-mission checkpoints is a bummer, but the moment-to-moment action is good, mindless fun. \n\nThe destructible environments and giant bug swarms have never been captured this well in the series before, and it can all be experienced with a friend thro", "id": 931290, "language": null, "link": "https://www.youtube.com/watch?v=HRPxNgoHugw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/HRPxNgoHugw/hqdefault.jpg", "title": "Earth Defense Force 6 Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-25T17:30:04+00:00", "description": "Fractured Mind is a psychological horror first-person bodycam game inspired by P.T. It’s made by a single person, so it’s an indie game, yet its photo- realistic graphics make it look like a triple-A budget title. \n\nDespite its clear walking sim influence, Fractured Mind features some gameplay ranging from first-person shooting to puzzles. The game demo takes place inside a train subway that loops upon opening the door to the next cabin. \n\nEach loop introduces differences in the environment similar to PT, with things getting supernatural toward the later half. Fractured Mind currently has a demo on Steam if you want to play a single chapter for yourself. The full game is projected to launch in September of this year and will include multiple endings and chapters set at an unspecified price point.", "id": 929800, "language": null, "link": "https://www.youtube.com/watch?v=e7c_1d6YV9Y", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/e7c_1d6YV9Y/hqdefault.jpg", "title": "This New Game is DEEPLY UNSETTLING", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-25T10:45:00+00:00", "description": "Among the many unexpected successes this year is Starry Studio's Once Human. A post-apocalyptic survival sandbox title, it launched for PC and player numbers have been strong for over two weeks.\n\nIt's interesting, because, for the most part, Once Human's fate was seemingly decided after mixed impressions and user reviews at launch, primarily owing to its Terms of Service. The fact that it was a free-to-play title with looter shooter elements and a survival sandbox also didn't generate the most enthusiasm.\n\nNevertheless, more and more people began diving into the title and discovering its bizarre mix of mechanics, unique monster designs and solid shooting. Why have they continued to return? What is it about Once Human that's resulted in such consistently high player numbers, even when there are still issues to sort out? Find out more here.", "id": 926920, "language": null, "link": "https://www.youtube.com/watch?v=7054ogdxOzc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/7054ogdxOzc/hqdefault.jpg", "title": "Why Is Once Human Such A HUGE HIT?", "user": null, "vote": 0}]