[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-19T15:30:05+00:00", "description": "Rumours of a Days Gone remaster have fizzled out given the game was absent from Sony’s September State of Play. With Bend Studio reportedly committed to a AAA live service game the chances of another joyride atop Deacon's motorcycle have all but evaporated too. \n\nHowever, despite Sony and numerous past and present Bend Studio staff outlining a distance to the franchise there’s the undeniable fact Days Gone sold well and has a large-scale following anxious for more. \n\nA PS5 Pro version isn’t out of the question but an enhanced version sitting between a remaster and a remake akin to Horizon Zero Dawn would certainly go down well. This video outlines what shape that enhanced edition might take, and how it could pave the way for a sequel.", "id": 1353773, "language": null, "link": "https://www.youtube.com/watch?v=GR2gIjNn1J4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/GR2gIjNn1J4/hqdefault.jpg", "title": "Why A Potential Days Gone Remaster Could Pave The Way For Days Gone 2", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-19T13:30:35+00:00", "description": "Nintendo came bursting out the gates with the Switch, coupling innovative hardware features along with a stellar library of games. It’s also safe to say that Nintendo has never looked back since, and a constant influx of quality titles over the years have kept the hybrid console riding upon the waves of success. \n\nThere’s obviously no shortage of great games to experience on the platform, but some definitely outshine others in terms of sheer quality. With this video, we will be taking a look back at 15 of the best games that you can experience right now. \n\nPlease note that this list is in an unranked format, so no game is better than the other in this rundown.", "id": 1353314, "language": null, "link": "https://www.youtube.com/watch?v=sssIff-Bkrc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/sssIff-Bkrc/hqdefault.jpg", "title": "15 Best Nintendo Switch Games of All Time YOU NEED TO PLAY", "vote": 0}]