[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T23:09:01.326081+00:00", "description": "Apple has withdrawn from discussions to invest in OpenAI's $6.5 billion funding round, though reasons for the decision remain unclear. The company still plans to proceed with integrating ChatGPT into Siri. MacRumors reports: The development comes just a month after WSJ reported that Apple was considering an investment in OpenAI as part of a fundraising effort that could value the AI company at over $100 billion. The high valuation reflects the intense competition in the artificial intelligence sector that OpenAI helped ignite with ChatGPT's launch in late 2022. While Apple has stepped away, other major tech companies remain involved. Microsoft, which has already invested $13 billion in OpenAI, is expected to contribute about $1 billion to this latest round. Nvidia is also reportedly in talks to participate. OpenAI's transition into a for-profit structure may have factored into Apple's decision. Last week, Reuters reported on OpenAI's plan to restructure its core business into a for-pr", "id": 1242664, "language": null, "link": "https://apple.slashdot.org/story/24/09/30/2040238/apple-no-longer-in-talks-to-invest-in-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple No Longer In Talks To Invest In OpenAI", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T23:09:01.240420+00:00", "description": "The National Highway Traffic Safety Administration (NHTSA) said it has fined Cruise $1.5 million for failing to disclose that a pedestrian was seriously injured by one of its driverless vehicles in San Francisco last year. The Verge reports: Last October, a Cruise vehicle hit a pedestrian and then dragged her 20 feet after she was initially struck by a human driver in a hit-and-run incident. In the aftermath, Cruise disclosed that its vehicle had struck a pedestrian but omitted details about the victim being dragged. As a result, the California Department of Motor Vehicles pulled the GM-backed company's permit to operate self-driving cars in the state, and the National Highway Traffic Safety Administration launched an investigation into the incident.\n \nToday, NHTSA announced the $1.5 million penalty as part of a broader consent order with Cruise that includes additional requirements around safety and disclosure. The company submitted several \"incomplete reports\" under the agency's Sta", "id": 1242663, "language": null, "link": "https://tech.slashdot.org/story/24/09/30/223247/cruise-fined-15-million-for-failing-to-report-robotaxi-crash-involving-pedestrian?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Cruise Fined $1.5 Million For Failing To Report Robotaxi Crash Involving Pedestrian", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T22:04:39.067313+00:00", "description": "An anonymous reader quotes a report from Politico: It will soon be illegal for public and private universities in California to consider an applicant's relationship to alumni or donors when deciding whether to admit them. Gov. Gavin Newsom on Monday signed a ban on the practice known as legacy admissions, a change that will affect prestigious institutions including Stanford University and the University of Southern California. California's law, which will take effect Sept. 1, 2025, is the nation's fifth legacy admissions ban, but only the second that will apply to private colleges. \"In California, everyone should be able to get ahead through merit, skill, and hard work,\" Newsom said in a statement. \"The California Dream shouldn't be accessible to just a lucky few, which is why we're opening the door to higher education wide enough for everyone, fairly.\"\n \nLike other states, California won't financially penalize violators, but it will post the names of violators on the state Department", "id": 1242474, "language": null, "link": "https://news.slashdot.org/story/24/09/30/2035213/california-bans-legacy-admissions-at-private-nonprofit-universities?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "California Bans Legacy Admissions At Private, Nonprofit Universities", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T21:00:08.583890+00:00", "description": "More American workers are seeing their compensation tied to performance metrics, a shift from traditional fixed salaries. A 2024 survey by Alexander Group found 28% of over 300 companies are incorporating incentive pay into new roles, extending a practice once limited to sales and executive positions. Employers argue this model boosts productivity, while some workers report earning less than expected, WSJ reported Monday.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Big+Shift+From+Salaries+To+Bonus-Based+Pay%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F09%2F30%2F1957234%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F09%2F30%2F1957234%2Fthe-big-shift-from-salaries-to-bonus-based-pay%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img", "id": 1242071, "language": null, "link": "https://news.slashdot.org/story/24/09/30/1957234/the-big-shift-from-salaries-to-bonus-based-pay?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Big Shift From Salaries To Bonus-Based Pay", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T21:00:08.500072+00:00", "description": "An anonymous reader shares a report: Mazda recently surprised customers by requiring them to sign up for a subscription in order to keep certain services. Now, notable right-to-repair advocate Louis Rossmann is calling out the brand. He points to several moves by Mazda as reasons for his anger toward them. However, it turns out that customers might still have a workaround. Previously, the Japanese carmaker offered connected services, that included several features such as remote start, without the need for a subscription. At the time, the company informed customers that these services would eventually transition to a paid model. \n\nIt's important to clarify that there are two very different types of remote start we're talking about here. The first type is the one many people are familiar with where you use the key fob to start the vehicle. The second method involves using another device like a smartphone to start the car. In the latter, connected services do the heavy lifting. What is ", "id": 1242070, "language": null, "link": "https://slashdot.org/story/24/09/30/202227/mazdas-10-subscription-for-remote-start-sparks-backlash-after-killing-open-source-option?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Mazda's $10 Subscription For Remote Start Sparks Backlash After Killing Open Source Option", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T19:56:01.520947+00:00", "description": "An anonymous reader shares a report: Udemy, an e-learning platform with more than 250,000 online classes, recently announced that it would train generative AI on the classes that its users contribute to the site. Not only were class teachers automatically opted in to having their classes used as training, Udemy said teachers would have only a three-week \"window\" to opt-out of training. That window has now passed. \"We want to officially announce that the opt-out period for our Generative AI Program (GenAI Program) begins today, August 21st, and goes through September 12th. The choice to participate in the GenAI program is yours. If you want to participate, no action is needed!,\" Udemy said in a post on its community forums August 21. In an \"Instructor Generative AI Policy\" document, it says it plans to offer \"Annual Periods designated by us\" during which instructors can opt-out of having their classes trained on, and said that when people opt-out of training, it will remove the instruc", "id": 1241695, "language": null, "link": "https://slashdot.org/story/24/09/30/198215/massive-e-learning-platform-udemy-gave-teachers-a-gen-ai-opt-out-window-its-already-over?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Massive E-Learning Platform Udemy Gave Teachers a Gen AI 'Opt-Out Window'. It's Already Over.", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T18:50:14.061660+00:00", "description": "Reddit has implemented new restrictions on moderators' ability to alter community visibility settings, the social media platform announced Monday. Moderators must now obtain admin approval before switching subreddits between public, private, or NSFW status. \n\nThe move comes in response to last year's widespread protests against API pricing changes, during which thousands of subreddits went private, disrupting platform accessibility. Reddit VP Laura Nestler stated the policy aims to prevent actions that \"deliberately cause harm\" and protect the site's long-term health.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Reddit+is+Making+Sitewide+Protests+Basically+Impossible%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F09%2F30%2F1753257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%", "id": 1241393, "language": null, "link": "https://tech.slashdot.org/story/24/09/30/1753257/reddit-is-making-sitewide-protests-basically-impossible?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Reddit is Making Sitewide Protests Basically Impossible", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T18:50:13.756659+00:00", "description": "DirecTV has agreed to acquire struggling rival Dish Network, creating a satellite TV behemoth with nearly 20 million subscribers. The complex transaction, announced Monday, involves private equity firm TPG acquiring a majority stake in DirecTV from AT&amp;T for $7.6 billion. DirecTV will then purchase Dish for $1 and assume its debt. \n\nThe deal provides a lifeline for Dish, which faces $2 billion in debt due November with only $500 million in available cash. EchoStar, Dish's parent company, will retain its wireless spectrum investments and operate independently. Subject to regulatory approval and creditor agreement, the merger is expected to close in late 2025. DirecTV and TPG will provide $2.5 billion to cover Dish's immediate financial needs. The deal's fate remains uncertain, as a similar 2002 merger attempt was blocked on antitrust grounds.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=DirecTV+To+Buy+Rival+Dish", "id": 1241392, "language": null, "link": "https://news.slashdot.org/story/24/09/30/1836228/directv-to-buy-rival-dish-network?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "DirecTV To Buy Rival Dish Network", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T17:42:58.140762+00:00", "description": "AmiMoJo writes: The UK is about to stop producing any electricity from burning coal -- ending its 142-year reliance on the fossil fuel. The country's last coal power station, at Ratcliffe-on-Soar, finishes operations on Monday after running since 1967. This marks a major milestone in the country's ambitions to reduce its contribution to climate change. Coal is the dirtiest fossil fuel producing the most greenhouse gases when burnt. \n\nThe UK was the birthplace of coal power, and from tomorrow it becomes the first major economy to give it up. The first coal-fired power station in the world, the Holborn Viaduct power station, was built in 1882 in London by the inventor Thomas Edison -- bringing light to the streets of the capital. In the early 1990s, coal began to be forced out of the electricity mix by gas, but coal still remained a crucial component of the UK grid for the next two decades. In 2012, it still generated 39% of the UK's power. \n\nIn 2010, renewables generated just 7% of the", "id": 1240918, "language": null, "link": "https://news.slashdot.org/story/24/09/30/1557210/uk-ends-142-year-coal-power-era-in-industrys-birthplace?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "UK Ends 142-Year Coal Power Era in Industry's Birthplace", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T17:42:57.846164+00:00", "description": "The Energy Department said on Monday that it had finalized a $1.52 billion loan guarantee to help a company restart a shuttered nuclear plant in Michigan -- the latest sign of rising government support for nuclear power. From a report: Two rural electricity providers that planned to buy power from the reactor would also receive $1.3 billion in federal grants [Editor's note: the link is likely paywalled; alternative source] under a program approved by Congress to help rural communities tackle climate change. The moves will help Holtec International reopen the Palisades nuclear plant in Covert Township, Mich., which ceased operating in 2022. The company plans to inspect and refurbish the plant's reactor and seek regulatory approval to restart the plant by October 2025. \n\nAfter years of stagnation, America's nuclear industry is seeing a resurgence of interest. Both Congress and the Biden administration have offered billions of dollars in subsidies to prevent older nuclear plants from clo", "id": 1240917, "language": null, "link": "https://news.slashdot.org/story/24/09/30/177218/us-approves-billions-in-aid-to-restart-michigan-nuclear-plant?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Approves Billions in Aid To Restart Michigan Nuclear Plant", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T16:38:32.472676+00:00", "description": "Thousands of Verizon users across the United States reported having little or no cellphone service on Monday morning in major cities, including in Atlanta, Chicago, Denver, New York and Phoenix. From a report: According to the website Downdetector, which tracks user reports of internet disruptions, more than 104,000 cases of Verizon outages were reported across the country as of 11:20 a.m. Eastern, more than an hour after the first issues were reported. \n\nA map posted on the site showed cities with the most reports. On the site, many users said their cellphones were intermittently displaying SOS mode and that they could not place calls or send or receive text messages. \"We're aware of the issue affecting service for some customers,\" a spokesman for Verizon, Ilya Hemlin, said in a telephone interview at 11:30 a.m. \"Our engineers are engaged and we are working quickly to solve the issue,\" he added.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"htt", "id": 1240416, "language": null, "link": "https://news.slashdot.org/story/24/09/30/164215/verizon-cellphone-users-report-outages-across-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Verizon Cellphone Users Report Outages Across the US", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T15:33:00.115739+00:00", "description": "AMD has released BIOS updates to boost performance and reduce latency for its Ryzen 9600X and 9700X processors. The updates come a month after disappointing Zen 5 desktop CPU reviews and coincide with Windows 11 optimizations for AMD chips. The new AGESA PI 1.2.0.2 firmware addresses high core-to-core latency issues and introduces a 105-watt cTDP option, promising up to 10% performance gains for multithreaded workloads.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AMD+Improves+Zen+5+CPU+Latency+and+Performance+With+BIOS+Updates%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F09%2F30%2F1410204%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F09%2F30%2F1410204%2Famd-improves-zen-5-cpu-latency-and-performance-with-bios-updates%3Futm_source%3Dslashdot", "id": 1239986, "language": null, "link": "https://it.slashdot.org/story/24/09/30/1410204/amd-improves-zen-5-cpu-latency-and-performance-with-bios-updates?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AMD Improves Zen 5 CPU Latency and Performance With BIOS Updates", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T15:33:00.002553+00:00", "description": "An anonymous reader shares a report: Songs by Adele, Bob Dylan, Green Day, R.E.M., Burna Boy, Rush and many others are currently unplayable on YouTube in the U.S. due to a legal dispute between the platform and the performing rights organization SESAC. Attempts to play many, but not all, songs by those artists on Saturday met with the following message: \"This video contains content from SESAC. It is not available in your country.\" \n\nA similar dispute between Universal Music Group and TikTok raged on for several months earlier this year before being resolved. In a statement to Variety, a YouTube rep said: \"We have held good faith negotiations with SESAC to renew our existing deal. Unfortunately, despite our best efforts, we were unable to reach an equitable agreement before its expiration. We take copyright very seriously and as a result, content represented by SESAC is no longer available on YouTube in the US. We are in active conversations with SESAC and are hoping to reach a new dea", "id": 1239985, "language": null, "link": "https://news.slashdot.org/story/24/09/30/1414227/songs-by-adele-bob-dylan-green-day-many-more-blocked-by-youtube-in-legal-dispute?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Songs by Adele, Bob Dylan, Green Day, Many More Blocked by YouTube in Legal Dispute", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T14:20:25.548710+00:00", "description": "Epic Games filed a new antitrust lawsuit against Google and Samsung, alleging they conspired to undermine third-party app stores. The suit focuses on Samsung's \"Auto Blocker\" feature, now enabled by default on new phones, which restricts app installations to \"authorized sources\" - primarily Google and Samsung's stores. \n\nEpic claims Auto Blocker creates significant barriers for rival stores, requiring users to navigate a complex process to install third-party apps. The company argues this feature does not actually assess app safety, but is designed to stifle competition. Epic CEO Tim Sweeney stated the lawsuit aims to benefit all developers, not secure special privileges for Epic. The company seeks either default deactivation of Auto Blocker or creation of a fair whitelisting process for legitimate apps. This legal action follows Epic's December victory against Google in a separate antitrust case. Epic recently launched its own mobile app store, which it claims faces unfair obstacles ", "id": 1239464, "language": null, "link": "https://tech.slashdot.org/story/24/09/30/1345259/epic-games-sues-google-and-samsung-over-app-store-restrictions?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Epic Games Sues Google and Samsung Over App Store Restrictions", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T11:52:32.643703+00:00", "description": " Newsweek writes that the missing atmosphere of Mars \"may be locked up in the planet's clay-rich surface, a new study by MIT geologists has suggested.\"\nAccording to the researchers, ancient water trickling through Mars' rocks could have triggered a series of chemical reactions, converting CO2 into methane and trapping the carbon in clay minerals for billions of years... \nThe dominant explanation relies on an interaction between the sun's rays and gases in the atmosphere. Mars lost its protective magnetic field billions of years ago, likely allowing high-energy solar particles to strike the upper atmosphere, kicking molecules off into space, according to NASA... But this might not be the whole story. The researchers focused on a type of clay mineral called smectite, known for its ability to trap carbon. These minerals, abundant on Mars, contain tiny folds that can store carbon molecules for aeons. The study was published in the journal Science Advances. \n\"There is plenty of evidence fo", "id": 1238501, "language": null, "link": "https://science.slashdot.org/story/24/09/30/0435244/mars-long-lost-atmosphere-might-be-hiding-in-plain-sight?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Mars' Long-Lost Atmosphere Might Be Hiding in Plain Sight", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T08:20:57.418010+00:00", "description": "An anonymous reader shared this report from the Los Angeles Times:\n\n\nIn recent years &mdash; as longstanding efforts to recycle plastics have faltered &mdash; Exxon Mobil has touted advanced recycling as a groundbreaking technology that will turn the tide on the plastic crisis. But despite its seemingly eco-friendly name, the attorney general's lawsuit denounced advanced recycling as a \"public relations stunt\" that largely involves superheating plastics to convert them into fuel. \n\nAt Exxon Mobil's only \"advanced recycling\" facility in Baytown, Texas, only 8% of plastic is remade into new material, while the remaining 92% is processed into fuel that is later burned. [California attorney general Rob] Bonta's lawsuit seeks a court order to prohibit the company from describing the practice as \"advanced recycling,\" arguing the vast majority of plastic is destroyed. Many environmental advocates and policy experts lauded the legal action as a major step toward ending greenwashing by Exxon M", "id": 1237455, "language": null, "link": "https://news.slashdot.org/story/24/09/30/0050246/exxon-mobils-advanced-technique-for-recycling-plastic-burning-it?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Exxon Mobil's 'Advanced' Technique for Recycling Plastic?  Burning It", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T04:01:02.125778+00:00", "description": " Scientific American has surprising news about the possibility of black holes the size of an atom but containing the mass of an asteroid &mdash; the so-called \"primordial black holes\" formed after the birth of the universe which could solve the ongoing mystery of the missing dark matter. \n\nThese atom-sized black holes \"may fly through the inner solar system about once a decade, scientists say... And if they sneak by the moon or Mars, scientists should be able to detect them, a new study shows.\"\n\n\nIf one of these black holes comes near a planet or large moon, it should push the body off course enough to be measurable by current instruments. \"As it passes by, the planet starts to wobble,\" says Sarah R. Geller, a theoretical physicist now at the University of California, Santa Cruz, and co-author of the study, which was published on September 17 in Physical Review D. \"The wobble will grow over a few years but eventually it will damp out and go back to zero.\" \n\nStudy team member Tung X. T", "id": 1236634, "language": null, "link": "https://science.slashdot.org/story/24/09/30/0254210/could-atom-sized-black-holes-be-detected-in-our-solar-system?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Could Atom-Sized Black Holes Be Detected in Our Solar System?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T02:56:31.147605+00:00", "description": "As the Vice President of the United States travelled in a motorcade Saturday to a San Francisco hotel, they ended up stopped behind \"a Waymo vehicle that had to be driven away from the motorcade route by police,\" according to a local newscast (which called it an \"only in San Francisco moment\"). \n\nAnd that's not all. One local reporter following the vice president's motorcade said \"we saw not one but two driverless cars get stuck.\" \n\nThe San Francisco Standard adds that on Friday, California's governor \"signed a bill that allows law enforcement to cite driverless car companies for traffic violations.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=America's+Vice+President+Gets+Stuck+Behind+a+Stalled+Driverless+Robotaxi%3A+https%3A%2F%2Fidle.slashdot.org%2Fstory%2F24%2F09%2F30%2F0154239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" hr", "id": 1236520, "language": null, "link": "https://idle.slashdot.org/story/24/09/30/0154239/americas-vice-president-gets-stuck-behind-a-stalled-driverless-robotaxi?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "America's Vice President Gets Stuck Behind a Stalled Driverless Robotaxi", "vote": 0}]