[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T17:30:04+00:00", "description": "NHL 25 feels a lot like the past five games in the series, but at least it’s got a renewed visual flair thanks to its current-gen exclusivity this time around. The game’s Franchise and Be A Pro modes feel particularly stale, with very little changes since NHL 20. \n\nThe gameplay gets the most improvement, with a revamped AI system that enhances reaction times and intelligence in positioning. The host of gameplay settings allows you to tune the AI any way you want, allowing for a more arcade experience where passes are automated or the more sim-like direction the series has been trending. \n\nWhile the modes feel the same as past entries, NHL 25 still supplies a fun time in the rink. The improved character animations and subtle incremental sim elements add up to a deep and rewarding hockey game, even if they’re packed in a five-year old skin. \n\nI’d recommend picking NHL 25 up when it releases on October 4th if you’ve skipped out on the last few entries, but if you’ve played the last coupl", "id": 1240934, "language": null, "link": "https://www.youtube.com/watch?v=QlKMUqWv_GY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/QlKMUqWv_GY/hqdefault.jpg", "title": "NHL 25 Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T15:30:11+00:00", "description": "Next year is starting to heat up in PlayStation 5 exclusives, and Kojima Productions' Death Stranding 2: On the Beach is one of the biggest. Starring Norman Reedus as Sam Porter Bridges again, it sees him joining Drawbridge and venturing to a new continent to establish its Chiral Network.\n\nThe developer recently held a Special Stage Event at Tokyo Game Show 2024, revealing new details and scenes of characters, old and new. We learned more about Tarman, the captain of the DHV Magellan; Dollman, the mysterious puppet who sticks with Sam; and others, like Rainy and Tomorrow. There's even the return of a beloved character from the previous game.\n\nDeath Stranding 2: On the Beach will be released next year for the PS5. Check out all the new information from Tokyo Game Show and a few hints towards what may come.", "id": 1240123, "language": null, "link": "https://www.youtube.com/watch?v=bTr3qb2rut4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/bTr3qb2rut4/hqdefault.jpg", "title": "Death Stranding 2 - 10 CRAZY NEW Details You Don't Know", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-30T13:30:29+00:00", "description": "With so many first-person single-player games out there, it may be hard to decide what to play. This list highlights some of the best titles that gamers should consider trying.\n\nSome are narrative-heavy titles like Before Your Eyes, What Remains of Edith Finch, and Reaching for Petals whereas others are action-packed titles such as Mirror’s Edge, Titanfall 2, and Dishonored. \n\nFor horror fans, there’s Outlast by Red Barrels to try out, and for players who are looking for puzzle games, The Witness is discussed. Classic titles like Far Cry 3: Blood Dragon, Wolfenstein: The Old Blood, and Stalker: Clear Sky make the list, and there are also unique titles like DEATHLOOP and Subnautica that are genre-defying.", "id": 1239040, "language": null, "link": "https://www.youtube.com/watch?v=zgrvan-g-cY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/zgrvan-g-cY/hqdefault.jpg", "title": "15 MORE Amazing First-Person Single Player Games You May Have Missed [2024 Edition]", "vote": 0}]