[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-10T15:30:08+00:00", "description": "The world is abuzz with Bandai Namco's Dragon Ball: Sparking! ZERO, even though it's still in advanced access. Fans are having fun with the Edit Mode and the potential for interesting Custom Battles.\n\nFor those who have never heard of the series or only played Dragon Ball: Budokai Tenkaichi 3, the question remains: Is it worth picking up? Sure, there are new modes, playable characters, mechanics, and improved visuals, but how does it compare to its predecessor? What are some more significant differences that make it a superior experience?\n\nDragon Ball: Sparking! ZERO launches worldwide on October 11th for Xbox Series X/S, PS5, and PC. Join us as we compare the two games and outline what makes Spike Chunsoft's latest worth checking out over Budokai Tenkaichi 3.", "id": 1302993, "language": null, "link": "https://www.youtube.com/watch?v=NyKH8akUlkw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NyKH8akUlkw/hqdefault.jpg", "title": "Dragon Ball: Sparking! ZERO - 12 Things It Does Better Than Budokai Tenkaichi 3", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-10T13:30:22+00:00", "description": "Given Bloober Team's spotty track record up until now and Konami's recent history, it wasn't surprising that Silent Hill 2's remake had been met with the level of skepticism it had been, but credit where credit is due- the survival horror title has very thoroughly proven its many doubters wrong, including ourselves here at GamingBolt. \n\nFrom how faithfully it recreates the best aspects of the legendary 2001 original to how it expands on it with its gameplay and design tweaks and additions, there's a lot to love about Bloober Team and Konami's remake of Silent Hill 2.\n\nOf course, any time a new survival horror remake of this kind comes out, it's unavoidably going to be compared to Resident Evil 2's seminal 2019 remake, which has had a huge role to play in the resurgence of horror games and remakes in general, with Silent Hill 2 itself having clearly taken heavy inspiration from this modern classic. Pitting the two games against each other, however, which one actually comes out on top? ", "id": 1301327, "language": null, "link": "https://www.youtube.com/watch?v=d4IVy5bR1uM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/d4IVy5bR1uM/hqdefault.jpg", "title": "Resident Evil 2 vs Silent Hill 2 Remakes – Which Horror Game Comes Out On Top?", "vote": 0}]