[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T23:17:06.426117+00:00", "description": "wiredmikey shares a report from SecurityWeek: Microsoft on Tuesday raised an alarm for in-the-wild exploitation of a critical flaw in Windows Update, warning that attackers are rolling back security fixes on certain versions of its flagship operating system. The Windows flaw, tagged as CVE-2024-43491 and marked as actively exploited, is rated critical and carries a CVSS severity score of 9.8/10. Redmond's documentation of the bug suggests a downgrade-type attack similar to the 'Windows Downdate' issue discussed at this year's Black Hat conference. Microsoft's bulletin reads: \"Microsoft is aware of a vulnerability in Servicing Stack that has rolled back the fixes for some vulnerabilities affecting Optional Components on Windows 10, version 1507 (initial version released July 2015). This means that an attacker could exploit these previously mitigated vulnerabilities on Windows 10, version 1507 (Windows 10 Enterprise 2015 LTSB and Windows 10 IoT Enterprise 2015 LTSB) systems that have in", "id": 1121503, "language": null, "link": "https://tech.slashdot.org/story/24/09/10/229252/windows-update-zero-day-being-exploited-to-undo-security-fixes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Windows Update Zero-Day Being Exploited To Undo Security Fixes", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T22:12:21.264817+00:00", "description": "An anonymous reader quotes a report from the Associated Press: A daredevil billionaire rocketed back into orbit Tuesday, aiming to perform the first private spacewalk and venture farther than anyone since NASA's Apollo moonshots. Unlike his previous chartered flight, tech entrepreneur Jared Isaacman shared the cost with SpaceX this time around, which included developing and testing brand new spacesuits to see how they'll hold up in the harsh vacuum. If all goes as planned, it will be the first time private citizens conduct a spacewalk, but they won't venture away from the capsule. Considered one of the riskiest parts of spaceflight, spacewalks have been the sole realm of professional astronauts since the former Soviet Union popped open the hatch in 1965, closely followed by the U.S. Today, they are routinely done at the International Space Station.\n \nIsaacman, along with a pair of SpaceX engineers and a former Air Force Thunderbirds pilot, launched before dawn aboard a SpaceX Falcon 9", "id": 1121150, "language": null, "link": "https://science.slashdot.org/story/24/09/10/217207/spacex-launches-a-billionaire-to-conduct-the-first-private-spacewalk?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "SpaceX Launches a Billionaire To Conduct the First Private Spacewalk", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T22:12:21.147058+00:00", "description": "Earlier today, Sony unveiled the $699.99 PlayStation 5 Pro -- a mid-generation upgrade model for the PlayStation 5 that requires a separate $79.99 disc drive if you want to play your physical games. As The Verge's Jay Peters writes, the announcement \"may have marked the beginning of the end for game console disc drives.\" From the report: Microsoft is clearly eyeing the discless direction with Xbox as well. The more affordable Xbox Series S can't play discs, and there's a discless Series X in white that's set to launch later this year. Last year's giant Xbox leak revealed a cylindrical, \"adorably all digital\" Xbox Series X redesign too. That hasn't been announced as an official product, but it shows a disc-free future is on Microsoft's mind. It seems likely that Sony and Microsoft are testing the waters for going all-digital for the PlayStation 6 and the next generation Xbox -- or at least offering disc drives separately. It's like Apple removing the disc drive all over again.\n \nBut th", "id": 1121149, "language": null, "link": "https://games.slashdot.org/story/24/09/10/2119225/sonys-new-ps5-heralds-the-end-of-disc-drives?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Sony's New PS5 Heralds the End of Disc Drives", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T21:07:38.480037+00:00", "description": "An anonymous reader shares a report: Over successive administrations, the U.S. government has used stiff trade restrictions to try to stifle the Chinese telecom giant Huawei. In turn, the company never misses an opportunity to show that it is still standing. Last year, at the tail end of a visit to China by Gina Raimondo, the U.S. commerce secretary, Huawei unveiled a smartphone that was powered by an advanced semiconductor made in China. The chip was exactly the kind of technology that the United States, in an effort led by Ms. Raimondo, had tried to prevent China from developing. \n\nThe Huawei phone, called the Mate 60 Pro, was heralded in China as the triumph of a national champion over American constraints. It sold out within minutes on Chinese e-commerce platforms. Many shoppers chose to pair their purchase with a phone case emblazoned with a photo of Ms. Raimondo's face. In the Chinese tech hub of Shenzhen on Tuesday, Huawei again made a bid for the spotlight with the announcemen", "id": 1120782, "language": null, "link": "https://slashdot.org/story/24/09/10/1910221/chinas-huawei-shows-the-world-its-2800-trifold-phone?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China's Huawei Shows the World Its $2,800 'Trifold' Phone", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T21:07:38.386539+00:00", "description": "It's hard to get 42 states to agree on much. But a bipartisan group of attorneys general on Tuesday demanded that Congress require Surgeon General warning labels on social media apps to help curtail addiction and a mental health crisis among young adults. From a report: \"As state Attorneys General, we sometimes disagree about important issues, but all of us share an abiding concern for the safety of the kids in our jurisdictions -- and algorithm-driven social media platforms threaten that safety,\" the 42 attorneys general said in a letter to Congress. States have taken legal action against a number of social media companies, including Meta and TikTok. But they argue more needs to be done in Washington to alert people to the dangers social media platforms present. \n\n\"In addition to the states' historic efforts, this ubiquitous problem requires federal action -- and a surgeon general's warning on social media platforms, though not sufficient to address the full scope of the problem, wou", "id": 1120781, "language": null, "link": "https://news.slashdot.org/story/24/09/10/1915208/a-surgeon-general-warning-label-must-appear-on-social-media-apps-42-state-attorneys-general-demand?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "A Surgeon General Warning Label Must Appear on Social Media Apps, 42 State Attorneys General Demand", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T20:05:18.578797+00:00", "description": "Malaysia's telecom regulator has abandoned a plan to block overseas DNS services a day after announcing it, following a sharp backlash and accusations of government overreach. From a report: Last Friday, the Malaysian Communications and Multimedia Commission (MCMC) published an FAQ that stated it had instructed all ISPs to redirect traffic headed for offshore DNS servers to services operated by Malaysian ISPs -- a move it claimed would prevent access to malicious and harmful websites such as those concerning gambling, pornography, copyright infringement or scams. \"No, the DNS redirection will not affect your connection speed or browsing experience for legitimate websites,\" the Commission promised in its FAQ. \n\nBut opposition to the plan quickly emerged, on grounds that it could amount to censorship and therefore represented government overreach. Musician turned state legislator Syed Ahmad Syed Abdul Rahman Alhadad labelled the decision \"draconian\" and a negative for Malaysia's digital", "id": 1120505, "language": null, "link": "https://yro.slashdot.org/story/24/09/10/1837252/malaysias-plan-to-block-overseas-dns-dies-after-a-day?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Malaysia's Plan To Block Overseas DNS Dies After a Day", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T19:00:12.555916+00:00", "description": "Microsoft today announced significant strides in its Azure Quantum Cloud service, including the demonstration of logical operations using the largest number of error-corrected qubits ever achieved. This progress brings the industry closer to building reliable quantum computers capable of solving complex problems beyond the reach of classical systems, the company said. \n\nIn a significant partnership, Microsoft is collaborating with Atom Computing to integrate their neutral-atom hardware into Azure Quantum. Atom Computing has already shown promise with hardware exceeding 1,000 qubits. Key to Microsoft's advancements is the implementation of the \"tesseract code\" error correction scheme on Quantinuum's trapped-ion quantum hardware. This led to a 22-fold reduction in error rates, a critical step towards reliable quantum computations. Microsoft is also committed to simplifying quantum programming. Azure's Q# language will now automatically handle complex error correction, making quantum dev", "id": 1120091, "language": null, "link": "https://tech.slashdot.org/story/24/09/10/183208/microsoft-performs-operations-with-multiple-error-corrected-qubits?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Performs Operations With Multiple Error-Corrected Qubits", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T19:00:12.473775+00:00", "description": "An anonymous reader shares a report: Russia's communications watchdog Roskomnadzor plans to spend 59 billion rubles ($644 million) over the next five years to upgrade its internet traffic-filtering capabilities, the Russian edition of Forbes reported on Tuesday. The money will be used to upgrade hardware used to filter internet traffic, as well as block or slow down certain resources, Forbes reported, citing documents. \n\nRussia passed a law in 2019 to enable the country to cut itself off entirely from the internet, in what it calls a campaign to maintain its digital sovereignty. Following the full-scale invasion of Ukraine, the Kremlin forced out several foreign social media and internet companies, although many services remain accessible via virtual private networks, or VPNs. The system upgrades will allow Russian authorities to better restrict access to VPNs, according to the document. New equipment has been purchased yearly since 2020 as traffic volumes grow, Roskomnadzor's press s", "id": 1120090, "language": null, "link": "https://tech.slashdot.org/story/24/09/10/170205/russia-to-spend-646-million-to-block-vpns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Russia To Spend $646 Million To Block VPNs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T17:56:12.872225+00:00", "description": "Sony has officially revealed the long-rumored mid-generation upgrade model for the PlayStation 5, the PlayStation 5 Pro. Set for release on November 7 at a price point of $699.99, the upgraded model, styled like the \"slim\" PS5 but with a triple groove design, will be available only in an all-digital version compatible with Sony's existing add-on optical drive. The console boasts a larger GPU and faster memory, delivering 45% faster rendering than the base PS5. It also features advanced ray tracing at double or triple the speed and an AI-driven upscaler for improved resolution and clarity. \n\nSeveral games, including \"The Last of Us Part 2 Remastered\" and \"Horizon Forbidden West,\" will receive enhanced versions for the PS5 Pro. A new Game Boost feature aims to improve performance across the entire PS5 and backward-compatible PS4 libraries.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Sony+Unveils+%24700+PlayStation+", "id": 1119575, "language": null, "link": "https://games.slashdot.org/story/24/09/10/1655248/sony-unveils-700-playstation-5-pro?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Sony Unveils $700 PlayStation 5 Pro", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T16:50:47.827928+00:00", "description": "Bruce66423 shares a report: The European Union's top court ruled against Apple Tuesday in the tech company's protracted legal battle over contested back taxes in Ireland. The ruling means Apple will be forced to pay Ireland up to $14.4 billion in back taxes and represents the latest setback in Europe for the tech giant. Earlier this year, Apple became the first company to be accused of violating the EU's new major tech competition law. The tax case stretches back to 2016, when the European Commission (EC) ordered Apple repay Ireland roughly $14.4 billion of unpaid taxes. \n\nThe commission argued that the tech giant had received \"illegal\" tax benefits from Ireland over the course of two decades. Apple had housed its European headquarters in Ireland and paid a corporate tax rate of less than 1% in some years, which the EC argued gave Apple an unfair advantage over other companies. Apple and Ireland appealed the decision in 2019. The European Court of Justice on Tuesday overturned the low", "id": 1119113, "language": null, "link": "https://apple.slashdot.org/story/24/09/10/1559251/apple-must-pay-14-billion-tax-bill-to-ireland-eu-court-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Must Pay $14 Billion Tax Bill To Ireland, EU Court Rules", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T16:50:47.543225+00:00", "description": "A robot entered a damaged reactor at Japan's Fukushima nuclear power plant on Tuesday, beginning a two-week mission to retrieve melted fuel debris for the first time since the 2011 disaster. The operation marks a crucial step in the decades-long process to decommission the plant and address the highly radioactive material inside three damaged reactors. \n\nThe robot, maneuvered remotely due to lethal radiation levels, will collect less than 3 grams of debris using tongs. This sample will provide vital data on the status of the reactor cores and inform future cleanup strategies. An estimated 880 tons of molten fuel remains in the three reactors, posing potential safety risks as the structures age. AP adds: Removal of the melted fuel was initially planned to start in late 2021 but has been delayed by technical issues, underscoring the difficulty of the process. The government says decommissioning is expected to take 30-40 years, while some experts say it could take as long as 100 years. \n", "id": 1119112, "language": null, "link": "https://slashdot.org/story/24/09/10/1456251/a-robot-begins-removal-of-melted-fuel-from-the-fukushima-nuclear-plant-it-could-take-a-century?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "A Robot Begins Removal of Melted Fuel From the Fukushima Nuclear Plant. It Could Take a Century", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T15:45:24.324318+00:00", "description": "Sea ice surrounding Antarctica is on the cusp of reaching a record winter low for a second year running, continuing an \"outrageous\" fall in the amount of Southern Ocean that is freezing over. From a report: The Antarctic region underwent an abrupt transformation in 2023 as the sea ice cover surrounding the continent crashed for six months straight. In winter, it covered about 1.6m sq km less than the long-term average -- an area roughly the size of Britain, France, Germany and Spain combined. Scientists at the Australian Antarctic Program Partnership said the latest data showed this had been repeated in 2024. On 7 September the amount of frozen ocean was less than on the same date last year. While the winter record is not yet complete, and it is therefore not clear if the extent of sea ice for the season will be less than last year, the scientists said it was part of a body of evidence that the Antarctic system had moved to a \"new state.\" \n\n\"What we're really talking about are two inc", "id": 1118552, "language": null, "link": "https://news.slashdot.org/story/24/09/10/1437259/antarctic-sea-ice-on-cusp-of-record-winter-low-for-second-year-running?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Antarctic Sea Ice on Cusp of Record Winter Low For Second Year Running", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T15:45:24.073984+00:00", "description": "Oracle missed the tech industry's move to cloud computing last decade and ended up an also-ran. Now the AI boom has given it another shot. WSJ: The 47-year-old company that made its name on relational database software has emerged as an attractive cloud-computing provider for AI developers such as OpenAI, sending its long-stagnant stock to new heights.\nOracle shares are up 34% since January, well outpacing the Nasdaq's 14% rise and those of bigger competitors Microsoft, Amazon.com and Google. \n\nIt is a surprising revitalization for a company many in the tech industry had dismissed as a dinosaur of a bygone, precloud era. Oracle appears to be successfully making a case to investors that it has become a strong fourth-place player in a cloud market surging thanks to AI. Its lateness to the game may have played to its advantage, as a number of its 162 data centers were built in recent years and are designed for the development of AI models, known as training. \n\nIn addition, Oracle isn't d", "id": 1118551, "language": null, "link": "https://developers.slashdot.org/story/24/09/10/1443235/oracles-missteps-in-cloud-computing-are-paying-dividends-in-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Oracle's Missteps in Cloud Computing Are Paying Dividends in AI'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T14:40:04.421667+00:00", "description": "Europe's top court on Tuesday upheld a 2.4 billion euro ($2.65 billion) fine imposed on Google for abusing its dominant position by favoring its own shopping comparison service. From a report: The fine stems from an antitrust investigation by the European Commission, the executive arm of the European Union, which concluded in 2017. The commission said at the time that Google had favored its own shopping comparison service over those of its rivals. Google appealed the decision with the General Court, the EU's second-highest court, which also upheld the fine. Google then brought the case before the European Court of Justice, the EU's top court. \n\nThe ECJ on Tuesday dismissed the appeal and upheld the commission's fine. \"We are disappointed with the decision of the Court,\" a Google spokesperson told CNBC on Tuesday. \"This judgment relates to a very specific set of facts. We made changes back in 2017 to comply with the European Commission's decision. Our approach has worked successfully f", "id": 1118017, "language": null, "link": "https://tech.slashdot.org/story/24/09/10/143212/googles-24-billion-euro-fine-upheld-by-europes-top-court-in-eu-antitrust-probe?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's 2.4 Billion Euro Fine Upheld By Europe's Top Court in EU Antitrust Probe", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T13:25:25.072438+00:00", "description": "An anonymous reader quotes a report from Agence France-Presse: Australia will ban children from using social media with a minimum age limit as high as 16, the prime minister said Tuesday, vowing to get kids off their devices and \"onto the footy fields.\" Federal legislation to keep children off social media will be introduced this year, Anthony Albanese said, describing the impact of the sites on young people as a \"scourge.\" The minimum age for children to log into sites such as Facebook, Instagram, and TikTok has not been decided but is expected to be between 14 and 16 years, Albanese said. The prime minister said his own preference would be a block on users aged below 16. An age verification trial to test various approaches is being conducted over the coming months, the centre-left leader said. [...]\n \nIt is not even clear that the technology exists to reliably enforce such bans, said the University of Melbourne's associate professor in computing and information technology, Toby Murr", "id": 1117525, "language": null, "link": "https://tech.slashdot.org/story/24/09/10/027237/australia-plans-age-limit-to-ban-children-from-social-media?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Australia Plans Age Limit To Ban Children From Social Media", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T10:10:55.234731+00:00", "description": "Americans lost over $5.6 billion to cryptocurrency fraud schemes in 2023, with investment fraud accounting for the majority of losses, according to the FBI (PDF). The Associated Press reports: The FBI received nearly 70,000 complaints in 2023 by victims of financial fraud involving bitcoin, ether and other cryptocurrencies, according to the FBI. The most rampant scheme was investment fraud, which accounted for $3.96 billion of the losses. \"The decentralized nature of cryptocurrency, the speed of irreversible transactions, and the ability to transfer value around the world make cryptocurrency an attractive vehicle for criminals, while creating challenges to recover stolen funds,\" wrote Michael Nordwall, assistant director of the FBI's criminal investigative division.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Americans+Lost+%245.6+Billion+Last+Year+In+Crypto+Fraud+Scams%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%", "id": 1116154, "language": null, "link": "https://news.slashdot.org/story/24/09/10/0211253/americans-lost-56-billion-last-year-in-crypto-fraud-scams?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Americans Lost $5.6 Billion Last Year In Crypto Fraud Scams", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T07:58:56.840099+00:00", "description": "Most kitchen products use plastics that are practically unrecyclable, yet a trade group representing major brands is pressuring regulators to allow companies to label such items as \"recyclable,\" even though they are likely to end up in landfills. Experts warn this could worsen the plastic crisis and misleading labels could further deceive consumers about the true recyclability of these products. ProPublica reports: The Consumer Brands Association believes companies should be able to stamp \"recyclable\" on products that are technically \"capable\" of being recycled, even if they're all but guaranteed to end up in a landfill. As ProPublica previously reported, the group argued for a looser definition of \"recyclable\" in written comments to the Federal Trade Commission as the agency revises the Green Guides -- guidelines for advertising products with sustainable attributes. [...] ProPublica contacted the 51 companies on the association's board of directors to ask if they agreed with the trad", "id": 1115509, "language": null, "link": "https://news.slashdot.org/story/24/09/10/0157248/household-brands-want-to-redefine-recyclable-to-include-products-virtually-impossible-to-recycle?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Household Brands Want To Redefine 'Recyclable' To Include Products Virtually Impossible To Recycle", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T03:35:48.045574+00:00", "description": "An anonymous reader quotes a report from Wired: A 41-year-old man in New Hampshire died last week after contracting a rare mosquito-borne illness called eastern equine encephalitis virus, also known as EEE or \"triple E.\" It was New Hampshire's first human case of the disease in a decade. Four other human EEE infections have been reported this year, in Wisconsin, New Jersey, Massachusetts, and Vermont. Though this outbreak is small, and triple E does not pose a risk to most people living in the United States, public health officials and researchers are concerned about the threat the deadly virus poses to the public, both this year and in future summers. There is no known cure for the disease, which can cause severe flu-like symptoms and seizures in humans four to 10 days after exposure and kills between 30 and 40 percent of the people it infects (Warning: source paywalled; alternative source). Half of the people who survive a triple E infection are left with permanent neurological dama", "id": 1114728, "language": null, "link": "https://science.slashdot.org/story/24/09/09/2324216/the-mosquito-borne-disease-triple-e-is-spreading-in-the-us-as-temperatures-rise?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Mosquito-Borne Disease 'Triple E' Is Spreading In the US As Temperatures Rise", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T02:31:16.472722+00:00", "description": "Vanuatu, Fiji, and Samoa have proposed a change to the International Criminal Court (ICC) to recognize ecocide as a crime, allowing for the prosecution of individuals responsible for significant environmental harm. If successful, the change would recognize ecocide as a crime alongside genocide and war crimes. The Guardian reports: Vanuatu, Fiji and Samoa have proposed a formal recognition by the court of the crime of ecocide, defined as \"unlawful or wanton acts committed with knowledge that there is a substantial likelihood of severe and either widespread or long-term damage to the environment being caused by those acts.\" The proposal was tabled before the ICC in New York on Monday afternoon, and will have to be discussed in full at a later date. Holding full discussions on the proposal is a process likely to take some years, and will face fierce opposition, though much of it will be behind the scenes as most countries will not wish to openly speak out against it.\n \nPhilippe Sands KC,", "id": 1114553, "language": null, "link": "https://yro.slashdot.org/story/24/09/09/239227/pacific-islands-submit-court-proposal-for-recognition-of-ecocide-as-a-crime?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Pacific Islands Submit Court Proposal For Recognition of Ecocide As a Crime", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T01:26:32.208516+00:00", "description": "Apple announced today that it's adding sleep apnea detection to the Apple Watch, including the Apple Watch Series 9, Series 10, and Apple Watch Ultra 2. The Verge reports: Sleep apnea is a disorder that causes you to stop breathing as you sleep. Sleep apnea is a feature that wearables makers have been working on for some time, with Samsung getting cleared by the FDA for sleep apnea tracking with the Galaxy Watch earlier this year. Apple says it's using the accelerometer on its watches to monitor a new metric that it calls \"breathing disturbances.\" You'll be able to see your nightly breathing disturbance values in the Health app.\n \nThe company expects to get FDA clearance for its sleep apnea detection feature soon, and it plans to launch the feature in more than 150 countries and regions. The company says its sleep detection was validated in a study that was \"unprecedented\" in size for sleep apnea technology.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpo", "id": 1114227, "language": null, "link": "https://science.slashdot.org/story/24/09/09/2117214/sleep-apnea-detection-is-coming-to-the-apple-watch?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Sleep Apnea Detection Is Coming To the Apple Watch", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T01:26:31.299132+00:00", "description": "An anonymous reader quotes a report from Reuters: The U.S. Commerce Department said Monday it is proposing to require detailed reporting requirements for advanced artificial intelligence developers and cloud computing providers to ensure the technologies are safe and can withstand cyberattacks. The proposal from the department's Bureau of Industry and Security would set mandatory reporting to the federal government about development activities of \"frontier\" AI models and computing clusters. It would also require reporting on cybersecurity measures as well as outcomes from so-called red-teaming efforts like testing for dangerous capabilities including the ability to assist in cyberattacks or lowering barriers to entry for non-experts to develop chemical, biological, radiological, or nuclear weapons. External red-teaming has been used for years in cybersecurity to identify new risks, with the term referring to U.S. Cold War simulations where the enemy was termed the \"red team.\" [...] Co", "id": 1114226, "language": null, "link": "https://yro.slashdot.org/story/24/09/09/2133210/us-proposes-requiring-reporting-for-advanced-ai-cloud-providers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Proposes Requiring Reporting For Advanced AI, Cloud Providers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T01:26:30.494763+00:00", "description": "Scott J Mulligan writes for MIT Technology Review: Roblox plans to roll out a generative AI tool that will let creators make whole 3D scenes just using text prompts, it announced today. Once it's up and running, developers on the hugely popular online game platform will be able to simply write \"Generate a race track in the desert,\" for example, and the AI will spin one up. Users will also be able to modify scenes or expand their scope -- say, to change a daytime scene to night or switch the desert for a forest. Although developers can already create similar scenes like this manually in the platform's creator studio, Roblox claims its new generative AI model will make the changes happen in a fraction of the time. It also claims that it will give developers with minimal 3D art skills the ability to craft more compelling environments. The firm didn't give a specific date for when the tool will be live.\n \n[...] The new tool is part of Roblox's push to integrate AI into all its processes. ", "id": 1114225, "language": null, "link": "https://games.slashdot.org/story/24/09/09/231200/roblox-announces-open-source-ai-tool-that-builds-3d-environments-from-text?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Roblox Announces Open Source AI Tool That Builds 3D Environments From Text", "user": null, "vote": 0}]