[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T19:00:19+00:00", "description": "We’re four years into the PS5’s lifecycle, and we’re only just now getting to the point where it feels like developers are beginning to properly leverage the console. \n\nAs it is, a more powerful version of the PS5 at this point in the generation seems completely unnecessary- but not only is Sony releasing the PS5 Pro, it has also made the mind-boggling decision of selling the console at a whopping $700. \n\nThat is a ridiculous price to pay for most any devices, but to set that price for a mid-gen refresh that is clearly offering incremental upgrades at best, on top of a console that itself has barely got off the ground so far, is a spectacularly terrible decision. Here, we talk about all of that and more.", "id": 1120242, "language": null, "link": "https://www.youtube.com/watch?v=bUL2PZ17Q5Y", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/bUL2PZ17Q5Y/hqdefault.jpg", "title": "PS5 PRO Is $700...WHAT THE HELL SONY?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-10T06:30:04+00:00", "description": "Annual franchises – especially annual sports franchises – are known for the marginal improvements and incremental tweaks they make to their established formula year over year, and unsurprisingly, that’s exactly what EA Sports FC did last year, even if it did change its entire branding from the many, many previous years of being called FIFA. \n\nNow, EA Sports FC 25 is right around the corner, and it, too, is promising incremental upgrades- along with some noticeable, more significant changes here and there as well. With the game set to launch not long from now, here, we’re going to go over some key details that you should know about it.", "id": 1115289, "language": null, "link": "https://www.youtube.com/watch?v=50S8TbG22JA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/50S8TbG22JA/hqdefault.jpg", "title": "EA Sports FC 25 - 15 Things You Need To Know Before You Buy", "user": null, "vote": 0}]