[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-02T17:30:01+00:00", "description": "Undead Inc. Is a fun and engaging management sim that provides a roguelike loop rife with future potential. The core gameplay shines when you feel on top of things running the well-oiled medical business with profits eclipsing costs. \n\nThis feeling of accomplishment never lasts very long, however, since the game is structured around entropy, forcing the player to engage in in-game illegal dealings. Excavating bioweapon facilities underground while fighting off gangs and cops is fun, but some gripes with the interface and occasional bugs hamper the experience. \n\nUndead Inc. only has a single save file per mode, which limits player experimentation. Player creativity is stifled as well, since there’s no customization whatsoever within Undead Inc.’s systems. You can’t name NPCs or color facilities, and the amount of stuff to build is pretty limited to begin with. Overall, Undead Inc. Is fun while it lasts, but the single save file and a lack of content keeps it from reaching its full pote", "language": null, "link": "https://www.youtube.com/watch?v=8oPqgC3K3b0", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/8oPqgC3K3b0/hqdefault.jpg", "title": "Undead Inc. Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-02T15:30:06+00:00", "description": "Madfinger Games' Gray Zone Warfare has entered Steam Early Access, presenting an intriguing tactical FPS with a massive sandbox. Set on Lamong Island, where three PMCs jostle to find out more about a \"mysterious event\" that's effectively left the region abandoned, players explore an environment teeming with AI combatants and other players.\n\nWith over 150 quests and eight weapons with over 400 parts to customize them with, Gray Zone Warfare is standing out for its tense atmosphere, realistic ballistics and injury system. Though there are extraction elements, much of the experience is rooted in realism, as you need to take bullet penetration, recoil, stamina and much more into account during combat.\n\nHowever, Gray Zone Warfare has issues, especially regarding performance, Supporter Edition players not getting their items, team killing in PvP, and more. Let's delve into everything you should know about it, warts and all.", "language": null, "link": "https://www.youtube.com/watch?v=NiYIQ3fk_ks", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NiYIQ3fk_ks/hqdefault.jpg", "title": "Gray Zone Warfare - 15 Things You NEED TO KNOW Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-02T12:30:28+00:00", "description": "Like Bethesda Game Studios' past titles, Starfield has the potential to become something much bigger in the coming years. Whether you enjoyed it or not at launch, the developer has made significant strides to improve the experience. On May 15th, its biggest update yet goes live, offering some truly game-changing features.\n\nThere are now proper Surface Maps, with major cities having markers to fast travel to. Gameplay options let you adjust everything from enemy damage to carrying capacity and even where you can access the ship's cargo from. Extreme difficulty should provide a more challenging experience for experienced players, while ship designers will appreciate the expanded interior decorating options.\n\nThose are some of the big changes in this update, but there's even more in store. Join us as we dissect the May Update and its various other improvements.", "language": null, "link": "https://www.youtube.com/watch?v=jaNBv4UnD9g", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/jaNBv4UnD9g/hqdefault.jpg", "title": "Starfield - 9 NEW BIGGEST UPDATES That Completely Change It", "user": null, "vote": 0}]