[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Dungeons 4 Review - The Final Verdict", "description": "The latest entry in the Dungeons series continues to pay homage to Dungeon Keeper, from the dungeon management gameplay to the Narrator. Dungeons 4 promises a better-looking experience with improved visuals and more threats, like the Dwarves, but it's for those who want more of this gameplay loop.\n\nInterested in defending your dungeon from interlopers while smacking minions to speed up their tasks? How about placing traps and building an army of Undead, Demons and the Horde to assail do-gooders, twisting the landscape? That's all here, backed by horrific humor and odd performance issues.\n\nNevertheless, even if it doesn't demand too much strategy, Dungeons 4 is fun and somewhat addictive. Just ignore the story as best as possible and try not to be too put off by the poor jokes.", "link": "https://www.youtube.com/watch?v=LwRfEHAaOZQ", "date_published": "2023-11-09T19:30:02+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/LwRfEHAaOZQ/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 1, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Avatar Frontiers of Pandora - 15 Things To Know Before You Buy", "description": "Sure, its reminiscent of Far Cry, with hunter-gathering, harvesting, outpost raiding, crafting, all set within a wide-ranging wilderness set to provide an air of familiarity to anyone who’s played an open world game before. However, developer Massive looks to have nailed the feeling of jungle parkour along with the dense, vibrant jungles filled with all manner of flora and wildlife.", "link": "https://www.youtube.com/watch?v=xsYFQEN4Gi4", "date_published": "2023-11-09T17:00:59+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/xsYFQEN4Gi4/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Can GRAND THEFT AUTO 6 Release In 2024?", "description": "For over a decade, Grand Theft Auto fans have been waiting for the series to take a step forward, but the unprecedented, enduring success of Grand Theft Auto 5 has been both a blessing and a curse for the franchise. But though Rockstar has surely taken its sweet time to get to this point, we are, at long last, finally getting to the stage where the series’ next mainline instalment is, at the very least, on the horizon. \n\nGrand Theft Auto 6 is set to be unveiled next month, and with excitement surrounding its official unveiling mounting by the second, here, we’re tackling the all too important question of when it will actually launch. Will it be out on shelves before April 2025 as reports have suggested, or will we have to wait longer than that to get our hands on the long-anticipated title?", "link": "https://www.youtube.com/watch?v=VDc7Km68-6A", "date_published": "2023-11-09T10:45:01+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/VDc7Km68-6A/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]