[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "10 WEIRDEST Games of 2023 You Need To Try Out", "description": "It’s safe to say that 2023 has been an absolute rollercoaster of a ride when it comes to video games. Not only did we get some amazing highly anticipated releases like Starfield and Dead Space, but the year was also packed with weird but surprise hits that came out of nowhere and kept us entertained for hours and hours upon end. \n\nWe are talking about games like Dredge, Pikmin 4 or games that forgo traditional convention and bravely embrace their originality, be it in the story or the gameplay or even a combination of both. With this feature, we will be talking about 10 of the weirdest games of 2023 that fans should definitely try out.", "link": "https://www.youtube.com/watch?v=E7IQkiyl_uw", "date_published": "2023-12-31T15:30:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/E7IQkiyl_uw/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "21 AMAZING Open World And Semi-Open World Games of 2023", "description": "The inherent appeal of games that literally expand their horizons by giving players greater freedom of exploration is undeniable, and thankfully, there never seems to be any shortage of games that do just that. \n\nTo no one’s surprising, 2023, from beginning to end, delivered a steady stream of games that adopted either a semi-open world design or a fully open one, putting players in larger and more expansive spaces that encourage and reward exploration in a variety of ways, and as is always the case, there were some who did it better than others. \n\nTo that end, here, we are going to talk about the fifteen open world and semi-open world games of the year that made the strongest impression on us.", "link": "https://www.youtube.com/watch?v=Gq5VQ1GxjhA", "date_published": "2023-12-31T09:30:07+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/Gq5VQ1GxjhA/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]