[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-22T15:30:20+00:00",
        "description": "What makes a great single-player game besides needing to facilitate full solo play (hence the name)? The answer can change depending on who you ask. Some favor an excellent story with memorable characters and where the decisions matter. Others prefer one with incredible visuals, top-tier cinematics and set pieces that make for hype moments.\n\nFor others, it boils down to the gameplay loop. Whether it's the console, feedback loop or the sheer brilliance of the design, the gameplay compels them to pick up and play the title at any time, perhaps even years later. Then you have some players who want a combination of all the above, complete with dozens, if not a hundred, hours of compelling content.\n\nPicking out the best single-player games based on these factors and countless others can be challenging. Nevertheless, there are at least 30 such games which fit that bill. Check them out here.",
        "id": 1762316,
        "language": null,
        "link": "https://www.youtube.com/watch?v=knPyKlEVRKA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/knPyKlEVRKA/hqdefault.jpg",
        "title": "Top 30 Best Single Player Games of All Time You Need To Play At Least Once (2024 Edition)",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-22T06:30:20+00:00",
        "description": "When you consider all the major releases set for the coming years, there are a few names that truly stand out. Grand Theft Auto 6, Ghost of Yotei, Monster Hunter Wilds, Assassin's Creed Shadows - at this point, the list looks pretty stacked. However, Pearl Abyss's Crimson Desert has also emerged as a strong contender.\n\nFrom a promising trailer that inspired skepticism years ago to the latest from The Game Awards that showcased the sheer fidelity of the world and some responsive combat, Crimson Desert has grown significantly over time. If it's not the range of mechanics and activities that impressed us, it's the attention to detail and environmental scale.\n\nCrimson Desert launches in late 2025 for PS5, Xbox Series X/S, and PC. Even with so many other games to look forward to, find out why it may be one of the more noteworthy launches of the coming years.",
        "id": 1760187,
        "language": null,
        "link": "https://www.youtube.com/watch?v=om4n8_DA1Z4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/om4n8_DA1Z4/hqdefault.jpg",
        "title": "Crimson Desert Is The Unexpected Game That’s About to BLOW OUR MINDS IN 2025",
        "vote": 0
    }
]