[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "What Made Max Payne 1 One Hell of A Game?", "description": "With each new game that Remedy Entertainment has put out, its stock has risen higher and higher, to the point that it’s now considered to be among the most highly talented studios in the games industry. And amongst all of its many accomplishments, one that continues to stand out even now, more than two decades after it first came out, is the original Max Payne. \n\nThough parts of the experience have certainly aged – as is inevitable for a game this old – its biggest strengths continue to shine to this day, from its hardboiled detective story to its slick neo-noir aesthetic, from how convincingly it brought its unique vision to life to, of course, the incredible bullet time mechanic. Here, we talk about all of that and more.", "link": "https://www.youtube.com/watch?v=bIo399lzcdA", "date_published": "2024-01-08T15:30:08+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en", "thumbnail": "https://i3.ytimg.com/vi/bIo399lzcdA/hqdefault.jpg", "age": null, "page_rating_contents": 52, "page_rating_votes": 0, "page_rating_visits": 1, "page_rating": 52, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 Graphically Stunning SINGLE PLAYER Games That DROPPED OUR JAWS [4K]", "description": "The games industry as a collective has been in something of a technological arms race for pretty much as long as it has existed, with developers striking to push the medium’s technical boundaries and deliver increasingly more impressive visuals every chance they got. \n\nObviously, this is an area where there’s no shortage of games that have made an indelible mark, and the frequency with which such games release has only increased as time has gone on. To that end, then, in this feature, we are going to take a look at fifteen single player games that delivered the king of stunning graphics that we still can’t help but be thoroughly impressed by. This isn’t an exhaustive list by any means, so if any games pop into your head that we haven’t mentioned here, make sure to sound off in the comments section below.", "link": "https://www.youtube.com/watch?v=GRbbEJes5f4", "date_published": "2024-01-08T09:30:04+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i4.ytimg.com/vi/GRbbEJes5f4/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]