[{"tags": [], "vote": 0, "age": null, "language": null, "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-01-25T17:45:00+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.youtube.com/watch?v=9t2JxvwtzZ4", "page_rating_votes": 0, "title": "Tekken Full Story - EVERYTHING You Need To Know Before You Play Tekken 8", "page_rating_visits": 0, "description": "When you think of long, epic storylines in any medium, from video games to movies and books, Tekken probably isn't the first game to come to mind. It's a fighting game. You have match-ups, things get destroyed, Mishima family, yada yada, right? Well, sort of.\n\nThe truth is that Tekken holds the record for having the longest-running video game storyline. No reboots and no gaps in development – just one story that's been going on since the first game debuted in 1994, which is crazy considering the changes and evolutions we've seen in major franchises like Street Fighter and Mortal Kombat. It's a record that will likely remain with the franchise upon the launch of Tekken 8.", "artist": "GamingBolt", "source_obj__id": 208, "thumbnail": "https://i2.ytimg.com/vi/9t2JxvwtzZ4/hqdefault.jpg", "album": "", "dead": false}, {"tags": [], "vote": 0, "age": null, "language": null, "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-01-25T11:00:02+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.youtube.com/watch?v=1XKU_wVtl04", "page_rating_votes": 0, "title": "What The Hell Is Going With PALWORLD?", "page_rating_visits": 0, "description": "We might only be less than a month into 2024, but Palworld has already somehow turned out to be one of the games industry’s biggest news stories of the year. Pocketpair’s survival game has attracted riotous success since its recent early access launch, selling at an astonishing rate that can put even the biggest AAA megatons to shame, and attracting a massive player base that’s engaging with the game on a scale that no one could have anticipated. \n\nAlso, part of the Palworld story, however, are allegations of plagiarism, with many bringing up the strong resemblances the game’s monster designs have to those of the Pokemon franchise. Whether Pocketpair has actually based its work off of stolen assets or if it falls more in the territory of “blatant yet legal ripoff” is up in the air right now, and here, that’s what we’re going to talk about.", "artist": "GamingBolt", "source_obj__id": 208, "thumbnail": "https://i2.ytimg.com/vi/1XKU_wVtl04/hqdefault.jpg", "album": "", "dead": false}]