[{"tags": [], "vote": 0, "age": null, "language": "en", "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.bookbrowse.com/rss/book_news.rss", "date_published": "2024-01-25T21:09:34+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.bookbrowse.com/news/detail/index.cfm?news_item_number=3158", "page_rating_votes": 0, "title": "2024 National Book Critics Circle Awards Finalists Announced", "page_rating_visits": 0, "description": "The National Book Critics Circle has announced 30 finalists in six categories&#8212;autobiography, biography, criticism, fiction, general nonfiction, and poetry&#8212;for the 2024 National Book Critics Circle Awards, which recognizes books from the publishing year 2023.\n<br /><br />\nIn addition, finalists for the John Leonard Prize for Best First Book and Gregg Barrios Book in Translation Prize have been announced, along with the winners of the Nona Balakian Citation for a working book critic, the Toni Morrison award for an institution, the NBCC Service Award, and the Ivan Sandrof lifetime achievement award.", "artist": null, "source_obj__id": 600, "thumbnail": null, "album": "", "dead": false}, {"tags": [], "vote": 0, "age": null, "language": "en", "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.bookbrowse.com/rss/book_news.rss", "date_published": "2024-01-25T12:00:00+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.bookbrowse.com/news/detail/index.cfm?news_item_number=3157", "page_rating_votes": 0, "title": "How many books will you read before you die?", "page_rating_visits": 0, "description": "From <i>The Economist</i>:\n\n\"Our back-of-the-envelope calculations show how many books you can still hope to read&#8212;and how to make time for the best ones.\n<br /><br />\nWe started by asking 1,500 Americans about their reading habits with help from YouGov, a pollster. Only 54% of respondents said they read or listened to a book in 2023. Of those who did, the average was 11 books. By that count, if a seven-year-old began reading in 2023, they would get through roughly 770 books in their lifetime, according to actuarial tables. A 30-year-old might have around 500 left to read. And someone in their 70s might be down to their last 100.\"", "artist": null, "source_obj__id": 600, "thumbnail": null, "album": "", "dead": false}]