[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-29T16:30:06+00:00",
        "description": "Despite some praise from critics and players, GSC Game World's S.T.A.L.K.E.R. 2: Heart of Chornobyl has its fair share of problems. However, one of the more notable bugs is those affecting A-Life 2.0. Though built up as an evolution of a beloved feature from previous titles, its impact has been negligible since its launch.\n\nThe extent is pretty significant, whether it's the limited radius by which players witness the persistent AI or its complete lack of running in the background. The development team has confirmed that it isn't working as intended and that fixes are on the way, but those will take some time and multiple updates.\n\nThere's something about buggy releases or major games with core features missing, but it's an even stickier subject with S.T.A.L.K.E.R. 2. Join us as we discuss A-Life, the sequel's supposed improvements, and where things may have gone wrong.",
        "id": 1611638,
        "language": null,
        "link": "https://www.youtube.com/watch?v=KSj8kZusCBs",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/KSj8kZusCBs/hqdefault.jpg",
        "title": "STALKER 2 - What The Hell Is Going On With A-LIFE 2.0?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-29T13:30:05+00:00",
        "description": "It has been four years since the release of the PS5, and throughout this time, Sony has continued its strong position in the console market by offering compelling single-player experiences. We decided it would be a great idea to celebrate the fifth year of the console’s life cycle by taking a look at some of the best single-player games of this generation, all of which can be played on the PS5, and some even being exclusive to the platform. \n\nWithout further ado, ranging from side-scrolling platformers to grand fantasy adventures, and even some intense horror, here are 60 of the best single-player games you can play on the PlayStation 5.",
        "id": 1610298,
        "language": null,
        "link": "https://www.youtube.com/watch?v=ATnf2UDvujU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/ATnf2UDvujU/hqdefault.jpg",
        "title": "60 Best Single Player Games On PS5 You Need To Experience [2024 Edition]",
        "vote": 0
    }
]