[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-23T03:33:32+00:00", "description": "\n<p>Joanna Stern, writing for The Wall Street Journal (<a href=\"https://apple.news/AS2neWfQDQ12ppZ6H0ix-kw\">News+</a>):</p>\n\n<blockquote>\n  <p>If you’re expecting AI fireworks, prepare for AI … sparklers. Back\nin June, at the company’s annual developers conference, executives\nshowed off do-it-yourself emojis, ChatGPT integration and a Siri\nthat can recall the name of a person you met months ago. Apple has\neven been <a href=\"https://www.youtube.com/watch?v=TPe8revsg3k\">running ads</a> for some features. None are in this\nrelease.</p>\n\n<p>“This is a big lift,” Craig Federighi, Apple’s senior vice\npresident of software engineering, told me at the company’s\nheadquarters. “You could put something out there and have it be\nsort of a mess. Apple’s point of view is more like, ‘Let’s try to\nget each piece right and release it when it’s ready.’”</p>\n\n<p>Yes, while other companies rush out generative-AI tools,\n<a href=\"https://www.wsj.com/tech/ai/google-restricts-ai-images-amid-outcry-over-chatbot", "id": 1372682, "language": null, "link": "https://www.wsj.com/tech/personal-tech/apple-intelligence-3833c320", "manual_status_code": 0, "page_rating": 29, "page_rating_contents": 90, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 489, "source_url": "https://daringfireball.com/feeds/main", "status_code": 0, "tags": [], "thumbnail": null, "title": "On the Cusp of Apple Intelligence’s Launch, Joanna Stern Interviews Craig Federighi", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-23T02:54:01+00:00", "description": "\n<p>Jeffrey Goldberg, in a must-read, must-share piece for The Atlantic (this is a gift link, which should get you through The Atlantic’s subscriber paywall, and which link I encourage you to share with every potential voter you know):</p>\n\n<blockquote>\n  <p>In their book, <em>The Divider: Trump in the White House</em>, Peter\nBaker and Susan Glasser reported that Trump asked John Kelly, his\nchief of staff at the time, “Why can’t you be like the German\ngenerals?” Trump, at various points, had grown frustrated with\nmilitary officials he deemed disloyal and disobedient. (Throughout\nthe course of his presidency, Trump referred to flag officers as\n“my generals.”) According to Baker and Glasser, Kelly explained to\nTrump that German generals “tried to kill Hitler three times and\nalmost pulled it off.” This correction did not move Trump to\nreconsider his view: “No, no, no, they were totally loyal to him,”\nthe president responded.</p>\n\n<p>This week, I asked Kelly about their exchange. He told ", "id": 1372509, "language": null, "link": "https://www.theatlantic.com/politics/archive/2024/10/trump-military-generals-hitler/680327/?gift=aQyUJR7AIw1mJWdQ6Ed6yBO6wQP9bPO_W2YbOcCk1hs&utm_source=copy-link&utm_medium=social&utm_campaign=share", "manual_status_code": 0, "page_rating": 29, "page_rating_contents": 90, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 489, "source_url": "https://daringfireball.com/feeds/main", "status_code": 0, "tags": [], "thumbnail": null, "title": "Trump: ‘I Need the Kind of Generals That Hitler Had’", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-23T02:12:22+00:00", "description": "\n<p>Michael S. Schmidt for The New York Times:</p>\n\n<blockquote>\n  <p>He said that, in his opinion, Mr. Trump met the definition of a\nfascist, would govern like a dictator if allowed, and had no\nunderstanding of the Constitution or the concept of rule of\nlaw. [...]</p>\n\n<p>When Mr. Kelly left the White House in 2019, he decided he would\nspeak out on the record only if Mr. Trump said something that he\nfound deeply troubling or involved him and was wildly inaccurate.\nMr. Trump’s recent comments about using the military against what\nhe called the “enemy within” were so dangerous, he said, that he\nfelt he had to speak out.</p>\n\n<p>“And I think this issue of using the military on — to go after — American citizens is one of those things I think is a very, very\nbad thing — even to say it for political purposes to get elected — I think it’s a very, very bad thing, let alone actually doing\nit,” Mr. Kelly said.</p>\n\n<p>Mr. Kelly said that Mr. Trump was repeatedly told dating back to\nhis first y", "id": 1372510, "language": null, "link": "https://www.nytimes.com/2024/10/22/us/politics/john-kelly-trump-fitness-character.html?unlocked_article_code=1.UU4.DPJs.yFJntiKSquew&smid=url-share", "manual_status_code": 0, "page_rating": 29, "page_rating_contents": 90, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 489, "source_url": "https://daringfireball.com/feeds/main", "status_code": 0, "tags": [], "thumbnail": null, "title": "Former Trump Chief of Staff John Kelly Warns Trump Would Rule Like a Dictator", "vote": 0}]