[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Cyberpunk 2077: Ultimate Edition - 15 Things You NEED TO KNOW Before You Buy", "description": "With support for Cyberpunk 2077 over, CD Projekt RED is moving on to Project Orion, the sequel, which will showcase the \"full power and potential of the universe.\" Many players may have already moved on from the game, especially after the launch of Phantom Liberty, but for newcomers, there's the Ultimate Edition.\n\nLaunching on December 5th for Xbox Series X/S, PS5 and PC, digitally and physically, it includes the base game and the expansion. It costs $59.99 and is the best way for someone to play everything related to Cyberpunk 2077. Of course, those who prefer physical copies of their games may also want to look into it.\n\nHere's everything you should know about the Ultimate Edition and details on the base game and its expansion.", "link": "https://www.youtube.com/watch?v=0dFLM0hTg_U", "date_published": "2023-12-01T21:15:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/0dFLM0hTg_U/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "GTA 6 WORLD SIZE - BIG OR SMALL?", "description": "With Grand Theft Auto 6’s reveal right around the corner, questions about the game are piling up, and one question in particular that many have asked is exactly what sort of open world experience it’s going to offer. \n\nThough traditionally Rockstar Games’ flagship titles have boasted expansive, meticulously crafted maps that invariably end up setting the standard for gaming as a whole, with reports having claimed that Grand Theft Auto 6 will instead release as a “moderately sized” title, it does seem like there is a chance that Rockstar ends up adopting a different approach this time. \n\nHere, we discuss that, and more importantly, why a relatively smaller Grand Theft Auto game might actually be the way to go for Rockstar’s beloved franchise.", "link": "https://www.youtube.com/watch?v=iOeguDQ1Bm4", "date_published": "2023-12-01T16:15:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/iOeguDQ1Bm4/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Baldur's Gate 3 Xbox Series X | S - 15 Things You Need To Know Before You Buy", "description": "After its launch in August for PC and in September for PS5, Baldur's Gate 3 is finally coming to Xbox Series X/S. It will be available in December, with the release date to be announced at The Game Awards, and the hype is palpable. \n\nWhat should those who have never played the game know regarding combat, quest structure, choices, and playtime? What quirks does the Xbox version have, and what will the next big patch offer? Check out everything you should know before playing Baldur's Gate 3 on Xbox Series X/S.", "link": "https://www.youtube.com/watch?v=RRIDO68RMW4", "date_published": "2023-12-01T09:30:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/RRIDO68RMW4/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]