[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 AMAZING Linear Games of 2023 You NEED TO PLAY", "description": "We all love a great open world game that gives us limitless opportunities to craft our own journey in a flexible sandbox, but there’s also a distinct kind of fun to be had in games that don’t quite feature that level of freedom. \n\nInstead, these linear games take us through immaculately choreographed experiences that twist and turn at set moments and take us through a thrilling ride like no other. The best linear games use a combination of intriguing storytelling, good pacing, and compelling mechanics to keep a player entertained for hours on end. \n\nWith this video, we will be taking a look back at the wonderful year that was 2023 and list down 15 of the best linear games that released this year.", "link": "https://www.youtube.com/watch?v=D41Dh94ycQs", "date_published": "2023-12-29T15:30:07+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/D41Dh94ycQs/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Top 23 Best PS5 Games of 2023 YOU NEED TO PLAY", "description": "Ordinarily, we expect any given year to be dotted with multiple major releases by first party PlayStation studios, but 2023 was a different year in that regard, with Marvel’s Spider-Man 2 being the only flagship coming from Sony’s first party lineup. In spite of that lighter pace, however, it has somehow turned out to be an incredible year for the console- perhaps even its best ever so far, in the early legs of its lifecycle. \n\nThird party developers from across the industry obviously had a big hand to play in that, but the end result is a lineup of games that, over the course of the year, has added a litany of gems to PS5’s already remarkable library. Here, we’re going to highlight what we felt were the best new games on PS5 in 2023.", "link": "https://www.youtube.com/watch?v=EcOLdBauAXo", "date_published": "2023-12-29T09:30:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/EcOLdBauAXo/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]