[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-09T16:15:04+00:00", "description": "Some things are best experienced in threes – be it movies, TV series, books, or – in this case – video games. The video game trilogies considered here, all have consistent threads running through them. In most cases, this is narrative. \n\nThe story continues across all three entries, characters develop, conflicts go on, etc. And whilst some of the games featured here can be considered standalone entries, playing all three parts means experiencing gameplay embellishments, fresh mechanics, new settings, or characters; they’re a part of an overarching, cohesive, consistent picture – one that should be played through in its entirety as the developers intended.", "language": null, "link": "https://www.youtube.com/watch?v=zC58HwYyAd4", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/zC58HwYyAd4/hqdefault.jpg", "title": "15 Amazing VIDEO GAME TRILOGIES You Need To Play", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-09T09:30:17+00:00", "description": "The Xbox Games Showcase is less than a week away and expectations are high. For many, this is Microsoft's chance to showcase its coveted games line-up. However, others anticipate a resurgence of Gears of War, at least according to rumors. \n\nWhile the company hasn't confirmed it, Gears 6 is long overdue. The last title in the series launched in 2019 with Gears 5, bringing more open settings, side quests and a story that revealed some surprising secrets about the Coalition of Ordered Governments. It also ended on a cliffhanger with many questions unanswered.\n\nNevertheless, there are a lot of directions the sequel can go in. Whether it's a dual protagonist set-up, placing a beloved hero back in the spotlight, a potential new threat to spice things up, or even a curveball that could change the course of the franchise, here are ten things we'd like to see.", "language": null, "link": "https://www.youtube.com/watch?v=wulUxyZ4GDg", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/wulUxyZ4GDg/hqdefault.jpg", "title": "Gears 6 - 10 Theories So CRAZY They Might Be True", "user": null, "vote": 0}]