[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T18:30:54+00:00", "description": "As has become almost customary for the series at this point, Dragon Age: The Veilguard has turned out to be quite a divisive experience, with just as many people bouncing off of it as there are those who have fallen in love with it. \n\nAnd one thing that's been made abundantly clear by the range of responses the game has seen is that there's plenty to like and plenty to dislike about it. Here, that's exactly what we'll be talking about, as we go over five things about Dragon Age: The Veilguard that have legitimately impressed us, and five that we've been let down by. Let's start with the positives.", "id": 1466181, "language": null, "link": "https://www.youtube.com/watch?v=vhuJRzyhfjA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/vhuJRzyhfjA/hqdefault.jpg", "title": "5 Things Gamers HATED About Dragon Age: The Veilguard And 5 That They LIKED", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T13:45:04+00:00", "description": "Every console generation has its mid-gen refresh, but sometimes, the \"mid\" is more pronounced than usual. Sony's PlayStation 5 Pro, launching on November 7th worldwide for $699.99, has generated no shortage of controversy in that regard, whether it's over the pricing, the lack of a vertical stand and disc drive, or similar CPU as the base version.\n\nSince its reveal, however, the console has offered some impressive technology for contemporary titles. Whether it's more control over ray tracing features in Marvel's Spider-Man 2 and Ratchet and Clank: Rift Apart, improvements to performance and resolution in Final Fantasy 7 Rebirth, or somehow making Horizon Forbidden West look even better, it's certainly putting in the work.\n\nBut is PlayStation Spectral Super Resolution and advanced ray tracing truly worth it? How future-proof is the console considering the relative age of the technology and the inevitably PlayStation 6? Find out more here.", "id": 1464508, "language": null, "link": "https://www.youtube.com/watch?v=uF2uizmDKkU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/uF2uizmDKkU/hqdefault.jpg", "title": "PS5 PRO - IS IT WORTH IT?", "vote": 0}]