[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T23:13:40.963957+00:00", "description": "A six-month German pilot of a four-day workweek across 45 companies demonstrated that most employees experienced reduced stress and maintained productivity, with some companies adopting optimized processes and digital tools to enhance efficiency. The report says 70% of the firms plan to continue the model. DW News reports: Earlier this year, some 45 German firms launched a 4-day workweek project to find out if such a fundamental change to how we work can achieve positive results for employers and employees. For six months, and closely watched by researchers from Munster University in Germany, the volunteer companies allowed their employees to work fewer hours without reducing their salaries. The pilot run was initiated by Berlin-based management consultancy, Intraprenor, in collaboration with the nonprofit organization 4 Day Week Global (4DWG). [...]\n \nJulia Backmann, the scientific lead of the pilot study, says employees generally felt better with fewer hours and remained just as pr", "id": 1467646, "language": null, "link": "https://slashdot.org/story/24/11/06/213205/german-firms-4-day-workweek-trial-slashes-stress-keeps-productivity-high?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "German Firms' 4-Day Workweek Trial Slashes Stress, Keeps Productivity High", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T23:13:40.811187+00:00", "description": "An anonymous reader quotes a report from Ars Technica: On Monday, Anthropic launched the latest version of its smallest AI model, Claude 3.5 Haiku, in a way that marks a departure from typical AI model pricing trends -- the new model costs four times more to run than its predecessor. The reason for the price increase is causing some pushback in the AI community: more smarts, according to Anthropic. \"During final testing, Haiku surpassed Claude 3 Opus, our previous flagship model, on many benchmarks -- at a fraction of the cost,\" Anthropic wrote in a post on X. \"As a result, we've increased pricing for Claude 3.5 Haiku to reflect its increase in intelligence.\"\n \n\"It's your budget model that's competing against other budget models, why would you make it less competitive,\" wrote one X user. \"People wanting a 'too cheap to meter' solution will now look elsewhere.\" On X, TakeOffAI developer Mckay Wrigley wrote, \"As someone who loves your models and happily uses them daily, that last sente", "id": 1467645, "language": null, "link": "https://news.slashdot.org/story/24/11/06/2159204/anthropics-haiku-35-surprises-experts-with-an-intelligence-price-increase?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Anthropic's Haiku 3.5 Surprises Experts With an 'Intelligence' Price Increase", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T22:07:14.974988+00:00", "description": "\"AMD's Ryzen 7 9800X3D debuts with impressive performance gains, powered by advanced 3D V-Cache technology and improved thermal efficiency,\" writes Slashdot reader jjslash. \"While the CPU shines as a top choice right out of the gate, AMD's history of quick price cuts suggests waiting could yield even better value for savvy buyers.\" TechSpot reports: Today we're finally able to show you how AMD's new Ryzen 7 9800X3D performs, and spoiler alert -- it's a real weapon that solves the issues we encountered with the non-3D Zen 5 chips before this. Without question, this is the best CPU released since the 7800X3D, making this launch particularly exciting. [...] For now, the 9800X3D is mighty impressive, the undisputed king of gaming, and it marks a historic milestone. We don't think AMD has ever been this dominant over Intel, certainly not in the last 15 years.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='A+New+Gaming+", "id": 1467254, "language": null, "link": "https://hardware.slashdot.org/story/24/11/06/2052244/a-new-gaming-cpu-king-amds-new-ryzen-7-9800x3d-reviewed?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'A New Gaming CPU King': AMD's New Ryzen 7 9800X3D Reviewed", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T21:02:52.628885+00:00", "description": "An anonymous reader quotes a report from The Guardian: The US supreme court grappled on Wednesday with a bid by Meta's Facebook to scuttle a federal securities fraud lawsuit brought by shareholders who accused the social media platform of misleading them about the misuse of user data. The justices heard arguments in Facebook's appeal of a lower court's decision allowing the 2018 class action suit led by Amalgamated Bank to proceed. The suit seeks unspecified monetary damages in part to recoup the lost value of the Facebook stock held by the investors. It is one of two cases coming before them this month -- the other one involving artificial intelligence chipmaker Nvidia on 13 November -- that could lead to rulings making it harder for private litigants to hold companies to account for alleged securities fraud.\n \nAt issue is whether Facebook broke the law when it failed to detail the prior data breach in subsequent business-risk disclosures, and instead portrayed the risk of such inci", "id": 1466919, "language": null, "link": "https://yro.slashdot.org/story/24/11/06/2046230/facebook-asks-us-supreme-court-to-dismiss-fraud-suit-over-cambridge-analytica-scandal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Facebook Asks US Supreme Court To Dismiss Fraud Suit Over Cambridge Analytica Scandal", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T18:52:54.273822+00:00", "description": "The UK will bring in legislation to safeguard against the risks of AI in the next year, technology secretary Peter Kyle has said, as he pledged to invest in the infrastructure that will underpin the sector's growth. From a report: Kyle told the Financial Times' Future of AI summit on Wednesday that Britain's voluntary agreement on AI testing was \"working, it's a good code\" but that the long-awaited AI bill would be focused on making such accords with leading developers legally binding. The legislation, which Kyle said would be presented to MPs in the current parliament, will also turn the UK's AI Safety Institute into an arms-length government body, giving it \"the independence to act fully in the interests of British citizens.\" \n\nAt present, the body is a directorate of the Department for Science, Innovation and Technology. At the UK-organised AI safety summit last November, companies including OpenAI, Google DeepMind and Anthropic signed a \"landmark\" but non-binding agreement allowi", "id": 1466096, "language": null, "link": "https://news.slashdot.org/story/24/11/06/182210/uk-will-legislate-against-ai-risks-in-next-year-pledges-kyle?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "UK Will Legislate Against AI Risks in Next Year, Pledges Kyle", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T17:48:14.618591+00:00", "description": "An anonymous reader shares a report: Curbside EV charging in Michigan should become easier in the coming months thanks to a new collaboration between telecom giant AT&amp;T and lamppost EV charging startup Voltpost. The two have joined forces to bring internet connectivity to EV charging posts across Michigan and the Metro-Detroit area-this way, the operator knows immediately if a stall has gone offline and can send a team to fix it faster. Better uptime benefits both the company and the EV drivers who choose to top up their cars' batteries while parked. \n\nVoltpost's lamppost charging solution essentially turns existing street lights into EV chargers. The startup claims the installation of a single stall takes anywhere from one to two hours and that the costs are much lower than a conventional EV charging station. However, the caveat here is that the charging speeds are limited to what one would experience with a home charger. The AC Level 2 lamppost chargers are powered by the stree", "id": 1465663, "language": null, "link": "https://tech.slashdot.org/story/24/11/06/1741253/detroit-is-turning-lampposts-into-internet-connected-ev-chargers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Detroit Is Turning Lampposts Into Internet-Connected EV Chargers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T16:43:29.001029+00:00", "description": "The European Commission has opened a formal investigation into Corning to determine whether it has broken antitrust rules with its dominant Gorilla Glass product. From a report: Corning's Alkali-aluminosilicate glass is used to protect most of the top phones and tablets, with both Samsung and Apple using it extensively across their range of devices. The EU is concerned that Corning has used a variety of exclusivity contracts to exclude rival glass makers from the phone market. \"It is very frustrating and costly experience to break a mobile phone screen. Therefore, strong competition in the production of the cover glass used to protect such devices is crucial to ensure low prices and high-quality glass,\" says outgoing EU competition chief Margrethe Vestager. \n\n\"We are investigating if Corning, a major producer of this special glass, may have tried to exclude rival glass producers, thereby depriving consumers from cheaper and more break-resistant glass.\" The Commission's concerns are c", "id": 1465248, "language": null, "link": "https://slashdot.org/story/24/11/06/1532254/cornings-gorilla-glass-under-eu-antitrust-investigation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Corning's Gorilla Glass Under EU Antitrust Investigation", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T15:37:56.266227+00:00", "description": "A federal judge in California has dismissed most claims in a class-action lawsuit against Google over its handling of gift card scams, ruling the tech giant is not liable for millions in consumer losses. U.S. District Judge Beth Freeman found Google bears no responsibility for scam victims' losses since third-party fraudsters, not Google, induced the purchases. \n\nThe ruling came in a suit filed by Judy May, who lost $1,000 to scammers demanding Google Play gift cards for a fake government grant. The lawsuit cited Federal Trade Commission data showing Google Play gift card scams comprised 20% of reported gift card fraud between 2018-2021, totaling over $17 million in losses. Google earns 15-30% commission on gift card purchases but denies refunds, citing industry-standard policies. Freeman ruled Google had no duty to investigate reported scams or refund victims.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+", "id": 1464809, "language": null, "link": "https://tech.slashdot.org/story/24/11/06/1445223/google-has-no-duty-to-refund-gift-card-scam-victims-judge-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Has No Duty To Refund Gift Card Scam Victims, Judge Finds", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T15:37:56.016082+00:00", "description": "Workers at AI companies want Congress to grant them specific whistleblower protection, arguing that advancements in the technology pose threats that they can't legally expose under current law. From a report: \"What people should be thinking about is the 100 ways in which these companies can lose control of these technologies,\" said Lawrence Lessig, a Harvard law professor who represented OpenAI employees and former employees raising issues about the company. Current dangers range from deepfake videos to algorithms that discriminate, and the technology is quickly becoming more sophisticated. Lessig called the argument that big tech companies and AI startups can police themselves naive. \"If there's a risk, which there is, they're not going to take care of it,\" he said. \"We need regulation.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Workers+Seek+Whistleblower+Cover+To+Expose+Emerging+Threats%3A+https%3A%2F%2Fs", "id": 1464808, "language": null, "link": "https://slashdot.org/story/24/11/06/1513225/ai-workers-seek-whistleblower-cover-to-expose-emerging-threats?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Workers Seek Whistleblower Cover To Expose Emerging Threats", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T14:32:45.273861+00:00", "description": "Surging AI demand could push major oil companies to reinvest in renewable energy [non-paywalled link], Abu Dhabi National Oil Company CEO Sultan al-Jaber said this week. Al-Jaber's comments came as oil executives from Shell, BP and TotalEnergies met with Microsoft and other tech leaders in Abu Dhabi to discuss AI's growing energy needs and its applications across the sector. \n\nADNOC announced plans to deploy autonomous AI agents across its operations through EnergyAI, developed with Microsoft and UAE's G42. The system will analyze seismic data and model underground carbon storage potential. The state oil giant committed $23 billion to low-carbon technology development using AI. Tech companies have pledged to power their AI data centers with renewable energy to meet climate targets. \"We need a model that integrates all forms of energy,\" said al-Jaber, citing needs for renewable power, battery storage, natural gas, and nuclear energy in some locations.<p><div class=\"share_submission\" s", "id": 1464430, "language": null, "link": "https://tech.slashdot.org/story/24/11/06/1352230/ais-huge-power-needs-give-oil-majors-incentive-to-invest-in-renewables-says-adnoc-boss?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AI's Huge Power Needs Give Oil Majors Incentive To Invest in Renewables, Says Adnoc Boss", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T10:06:19.511253+00:00", "description": "Ars Technica's Eric Berger reports: When Chinese space officials unveiled the design for the country's first super heavy lift rocket nearly a decade ago, it looked like a fairly conventional booster. The rocket was fully expendable, with three stages and solid motors strapped onto its sides. Since then, the Asian country has been revising the design of this rocket, named Long March 9, in response to the development of reusable rockets by SpaceX. As of two years ago, China had recalibrated the design to have a reusable first stage. Now, based on information released at a major airshow in Zhuhai, China, the design has morphed again. And this time, the plan for the Long March 9 rocket looks almost exactly like a clone of SpaceX's Starship rocket.\n \nBased on its latest specifications, the Long March 9 rocket will have a fully reusable first stage powered by 30 YF-215 engines, which are full-flow staged combustion engines fueled by methane and liquid oxygen, each with a thrust of approxim", "id": 1462887, "language": null, "link": "https://slashdot.org/story/24/11/06/0129252/china-reveals-a-new-heavy-lift-rocket-that-is-a-clone-of-spacexs-starship?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "China Reveals a New Heavy Lift Rocket That Is a Clone of SpaceX's Starship", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T07:55:00.554354+00:00", "description": "Major media outlets are beginning to declare former President Trump the winner of the 2024 presidential election, having secured 270 electoral votes. \"He becomes the first president in more than 120 years to lose the White House, and then to come back and win it again, after President Grover Cleveland in 1892,\" notes The Hill. As with previous election announcements on Slashdot, this is your chance to talk about it and what it means for the future of our nation.\n \nDeveloping...<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Trump+Wins+US+Presidency+For+Second+Time%3A+https%3A%2F%2Fpolitics.slashdot.org%2Fstory%2F24%2F11%2F06%2F0652209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fpolitics.slashdot.org%2Fstory%2F24%2F11%2F06%2F0652209%2Ftrump-wins-us-presidency-for-second-time", "id": 1462366, "language": null, "link": "https://politics.slashdot.org/story/24/11/06/0652209/trump-wins-us-presidency-for-second-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Trump Wins US Presidency For Second Time", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T04:41:07.521991+00:00", "description": "An anonymous reader quotes a report from Fortune: Google CEO Sundar Pichai has weighed in on the debate over the relative values of political expression and workplace coexistence by ordering employees to leave their political opinions at home. A day after firing 28 workers for participating in a sit-in protest of the tech giant's cloud contract with Israel, Pichai warned staff that the office is not a place \"to fight over disruptive issues or debate politics\" in a company blog post.\n \nAlthough Pichai didn't specifically mention the protests or the Israel-Hamas war, he concluded that the $1.92 trillion company \"is a business, and not a place to act in a way that disrupts coworkers or makes them feel unsafe, to attempt to use the company as a personal platform.\" \"We have a duty to be an objective and trusted provider of information that serves all of our users globally,\" Pichai continued. \"When we come to work, our goal is to organize the world's information and make it universally acc", "id": 1461552, "language": null, "link": "https://tech.slashdot.org/story/24/11/06/0120243/google-ceo-forbids-political-talk-after-firing-28-over-israeli-contract-protest?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google CEO Forbids Political Talk After Firing 28 Over Israeli Contract Protest", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T03:36:13.872097+00:00", "description": "An anonymous reader shares a report: When Parasite became the first non-English language film in Oscars history to win best picture in 2019, it marked a breakthrough moment for Korean cinema. But the surge of interest that followed the director Bong Joon-ho's international success has not translated into a thriving local film industry, according to another of its leading lights. \n\nThe director Jang Joon-hwan said K-cinema was struggling after the arrival of Netflix and other streaming platforms, with movies often rushed on to streaming platforms, and box office ticket sales suffering as a consequence. Jang, whose 2004 cult sci-fi comedy Save the Green Planet is being remade by the Poor Things director, Yorgos Lanthimos, said Korean cinema was going through a \"very precarious period\" because Korean viewers would increasingly prefer to wait for films to come out on streaming platforms than pay more to go to the cinema. \n\n\"I hope that such a day comes that Korean films are being introdu", "id": 1461209, "language": null, "link": "https://entertainment.slashdot.org/story/24/11/05/2246215/korean-cinema-in-precarious-period-due-to-netflix-says-director-jang-joon-hwan?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Korean Cinema in 'Precarious Period' Due To Netflix, Says Director Jang Joon-hwan", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T03:36:13.749670+00:00", "description": "Bitcoin surged over 9.2% to an all-time high of over $74,200 on Tuesday evening as early results showed favorable outcome for Republican candidate Donald Trump, who has promised crypto-friendly policies if he wins.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bitcoin+Hits+All-Time+High%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F06%2F0321239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F06%2F0321239%2Fbitcoin-hits-all-time-high%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/24/11/06/0321239/bitcoin-hits-all-time-high?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"ht", "id": 1461208, "language": null, "link": "https://slashdot.org/story/24/11/06/0321239/bitcoin-hits-all-time-high?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Bitcoin Hits All-Time High", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T02:31:25.238726+00:00", "description": "Schneider Electric confirmed that it is investigating a breach as a ransomware group Hellcat claims to have stolen more than 40 GB of compressed data -- and demanded the French multinational energy management company pay $125,000 in baguettes or else see its sensitive customer and operational information leaked. The Register: And yes, you read that right: payment in baguettes. As in bread. Schneider Electric declined to answer The Register's specific questions about the intrusion, including if the attackers really want $125,000 in baguettes or if they would settle for cryptocurrency. \n\nA spokesperson, however, emailed us the following statement: \"Schneider Electric is investigating a cybersecurity incident involving unauthorized access to one of our internal project execution tracking platforms which is hosted within an isolated environment. Our Global Incident Response team has been immediately mobilized to respond to the incident.&#226;Schneider Electric's products and services rem", "id": 1461045, "language": null, "link": "https://it.slashdot.org/story/24/11/05/2231244/schneider-electric-ransomware-crew-demands-125k-paid-in-baguettes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Schneider Electric Ransomware Crew Demands $125k Paid in Baguettes", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T02:31:25.143886+00:00", "description": "An anonymous reader quotes a report from TorrentFreak: Rightsholders have asked Google to remove more than 10 billion 'copyright infringing' URLs from its search results. The search engine doesn't celebrate the milestone in any way, but the takedown notices document intriguing shifts in volume over time, as well as shifting takedown interests. [...] The path to 10 billion was turbulent. When Google first made DMCA details public it was processing a few million DMCA takedown requests in a year. That number swiftly increased to hundreds of millions and eventually reached a billion DMCA requests in 2016.\n \nThe exponential growth curve eventually flattened out and around 2017, the takedown volume started to decline. The decrease was in part due to various anti-piracy algorithms making pirated content less visible in search results. By downranking pirate sites, infringing content became harder to find. As a result, Google processed fewer takedown notices, a welcome change for both rightsh", "id": 1461044, "language": null, "link": "https://yro.slashdot.org/story/24/11/05/2059252/google-asked-to-remove-10-billion-pirate-search-results?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Asked To Remove 10 Billion 'Pirate' Search Results", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T01:26:00.888833+00:00", "description": "Amazon CEO Andy Jassy said at an all-hands meeting on Tuesday that the plan to require employees to be in-office five days per week is not meant to force attrition or satisfy city leaders, as many employees have suggested. Reuters: The controversial plan mandating workers come to Amazon offices every day starting next year, up from three days now, has caused consternation among employees who say it is stricter than other tech companies and will hinder efficiency because of commuting times. Workers who are consistently not in compliance have been told they will be \"voluntarily resigning\" and locked out of company computers. \n\n\"A number of people I've seen theorized that the reason we were doing this is, it's a backdoor layoff, or we made some sort of deal with city or cities,\" said Jassy, according to a transcript of the meeting reviewed by Reuters. \"I can tell you both of those are not true. You know, this was not a cost play for us. This is very much about our culture and strengthen", "id": 1460863, "language": null, "link": "https://slashdot.org/story/24/11/05/2224228/amazon-ceo-denies-full-in-office-mandate-is-backdoor-layoff?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon CEO Denies Full In-Office Mandate is 'Backdoor Layoff'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T00:16:24.112404+00:00", "description": "During an operation across 95 countries from April to August 2024, Interpol arrested 41 individuals and dismantled over 1,000 servers and infrastructure running on 22,000 IP addresses facilitating cybercrime. BleepingComputer reports: Interpol said its enforcement action was backed by intelligence provided by private cybersecurity firms like Group-IB, Kaspersky, Trend Micro, and Team Cymru, leading to the identification of over 30,000 suspicious IP addresses. Eventually, roughly 76% of those were taken down, 59 servers were seized, and 43 electronic devices were confiscated, which will be examined to retrieve additional evidence. In addition to the 41 individuals who were arrested, the authorities are also investigating another 65 persons suspected of associating with illicit activities.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Interpol+Disrupts+Cybercrime+Activity+On+22%2C000+IP+Addresses%2C+Arrests+41%3A+ht", "id": 1460624, "language": null, "link": "https://yro.slashdot.org/story/24/11/05/2211252/interpol-disrupts-cybercrime-activity-on-22000-ip-addresses-arrests-41?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Interpol Disrupts Cybercrime Activity On 22,000 IP Addresses, Arrests 41", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-06T00:16:23.829314+00:00", "description": "Last December, Hyperloop One, the futuristic transportation company pursuing Elon Musk's dream of tube-based, airplane-speed travel, announced its shutdown. However, the concept itself has found a new lease on life in a scaled-down version overseas. According to The Verge's Andrew J. Hawkins, \"The hyperloop, in fact, lives on -- as a 1/12th scale model in Switzerland.\" From the report: Sure, this isn't exactly the full realization of Musk's 2013 white paper, in which he theorized that aerodynamic aluminum capsules filled with passengers or cargo could be propelled through a nearly airless tube at speeds of up to 760mph. These tubes, either raised on pylons or sunk beneath the earth, could be built either within or between cities. Musk called it a \"fifth mode of transportation\" and argued it could help change the way we live, work, trade, and travel. The idea is being put to the test in Lausanne, Switzerland, where a 120-meter circular test track is being operated by a team that inclu", "id": 1460623, "language": null, "link": "https://tech.slashdot.org/story/24/11/05/2217233/the-hyperloop-lives-on-as-a-112th-scale-model-in-switzerland?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Hyperloop Lives On As a 1/12th Scale Model In Switzerland", "vote": 0}]