[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T22:59:08.165451+00:00",
        "description": "An anonymous reader shares a report: Russia has reportedly cut some regions of the country off from the rest of the world's internet for a day, effectively siloing them, according to reports from European and Russian news outlets reshared by the US nonprofit Institute for the Study of War (ISW) and Western news outlets. \n\nRussia's communications authority, Roskomnadzor, blocked residents in Dagestan, Chechnya, and Ingushetia, which have majority-Muslim populations, ISW says. The three regions are in southwest Russia near its borders with Georgia and Azerbaijan. People in those areas couldn't access Google, YouTube, Telegram, WhatsApp, or other foreign websites or apps -- even if they used VPNs, according to a local Russian news site. \n\nRussian digital rights NGO Roskomsvoboda told TechRadar that most VPNs didn't work during the shutdown, but some apparently did. It's unclear which ones or how many actually worked, though. Russia has been increasingly blocking VPNs more broadly, and A",
        "id": 1692293,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/11/1725205/russia-tests-cutting-off-access-to-global-web-and-vpns-cant-get-around-it?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Russia Tests Cutting Off Access To Global Web, and VPNs Can't Get Around It",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T21:54:11.818404+00:00",
        "description": "Paul Knopp, KPMG US CEO, writing in an op-ed on WSJ: According to a United Nations estimate, 230 languages went extinct between 1950 and 2010. If my profession doesn't act, the language of business -- accounting -- could vanish too. The number of students who took the exam to become certified public accountants in 2022 hit a 17-year low. From 2020 to 2022, bachelor's degrees in accounting dropped 7.8% after steady declines since 2018. \n\nWhile the shortage isn't yet an issue for the country's largest firms, it's beginning to affect our economy and capital markets. In the first half of 2024, nearly 600 U.S.-listed companies reported material weaknesses related to personnel. S&amp;P Global analysts last year warned that many municipalities were at risk of having their credit ratings downgraded or withdrawn due to delayed financial disclosures. \n\nOur profession must remove hurdles to learning the accounting language while preserving quality. In October, KPMG became the first large accoun",
        "id": 1691841,
        "language": null,
        "link": "https://slashdot.org/story/24/12/11/1825252/the-dying-language-of-accounting?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'The Dying Language of Accounting'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T20:49:11.470373+00:00",
        "description": "Automattic CEO Matt Mullenweg abruptly left a key WordPress community platform after a federal court ordered his company to restore rival WP Engine's access to WordPress.org and remove a controversial login requirement. The preliminary injunction mandates Automattic eliminate a checkbox that forced users to declare they had no connection to WP Engine before accessing the platform. \n\nMullenweg departed the Post Status Slack forum following the ruling, writing he was \"sick and disgusted to be legally compelled to provide free labor\" to WP Engine, according to 404 Media. \"It's hard to imagine wanting to continue to working on WordPress after this,\" he added. The order gives Automattic 72 hours to comply, including reinstating WP Engine's employee credentials and plugin access. The ruling marks a significant development in an escalating dispute between the WordPress parent company and the web hosting provider.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop",
        "id": 1691008,
        "language": null,
        "link": "https://slashdot.org/story/24/12/11/1841225/wordpress-chief-quits-community-forum-after-court-loss?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "WordPress Chief Quits Community Forum After Court Loss",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T20:49:11.341763+00:00",
        "description": "Google has announced an experimental AI-powered code agent called \"Jules\" that can automatically fix coding errors for developers. From a report: Jules was introduced today alongside Gemini 2.0, and uses the updated Google AI model to create multi-step plans to address issues, modify multiple files, and prepare pull requests for Python and Javascript coding tasks in GitHub workflows. \n\nMicrosoft introduced a similar experience for GitHub Copilot last year that can recognize and explain code, alongside recommending changes and fixing bugs. Jules will compete against Microsoft's offering, and also against tools like Cursor and even Claude and ChatGPT's coding abilities. Google's launch of a coding-focused AI assistant is no surprise -- CEO Sundar Pichai said in October that more than a quarter of all new code at the company is now generated by AI. \n\n\"Jules handles bug fixes and other time-consuming tasks while you focus on what you actually want to build,\" Google says in its blog post.",
        "id": 1691007,
        "language": null,
        "link": "https://developers.slashdot.org/story/24/12/11/1734248/googles-new-jules-ai-agent-will-help-developers-fix-buggy-code?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's New Jules AI Agent Will Help Developers Fix Buggy Code",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T18:26:05.646813+00:00",
        "description": "An international research team has for the first time imaged and controlled a type of magnetic flow called altermagnetism, which physicists say could be used to develop faster and more reliable electronic devices. Financial Times: A groundbreaking experiment at a powerful X-ray microscope in Sweden provides direct proof of the existence of altermagnetism, according to a paper published in Nature on Wednesday. Altermagnetic materials can sustain magnetic activity without themselves being magnetic. \n\nThe team from the UK's Nottingham university that led the research said the discovery has revolutionary potential for the electronics industry. \"Altermagnets have the potential to lead to a thousand-fold increase in the speed of microelectronic components and digital memory, while being more robust and energy-efficient,\" said senior author Peter Wadley, Royal Society research fellow at Nottingham. \n\nHard disks and other components underpinning the modern computers industry process data in ",
        "id": 1690372,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/11/171236/new-magnetic-flow-has-potential-to-revolutionise-electronic-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Magnetic Flow Has Potential To Revolutionise Electronic Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T17:21:03.738824+00:00",
        "description": "Google today unveiled Project Mariner, its first AI agent capable of autonomously navigating web browsers, operating through a Chrome extension that controls cursor movements and form-filling to replicate human interactions online. \n\nThe Gemini-powered prototype, developed by Google's DeepMind division, is initially available to a select group of testers. During demos, the agent performed tasks like creating shopping carts on grocery websites, though with noticeable five-second delays between actions. The system captures browser screenshots and processes them through Gemini in the cloud to generate navigation commands. \n\nIt operates only in Chrome's active tab, requiring users to observe its actions rather than running in the background. Project Mariner achieved an 83.5% success rate on the WebVoyager benchmark for web-based tasks. The agent has built-in limitations, including inability to complete purchases, accept cookies, or agree to terms of service. Google Labs Director Jaclyn K",
        "id": 1689831,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/11/1648248/google-unveils-project-mariner-ai-agents-to-use-the-web-for-you?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Unveils Project Mariner: AI Agents To Use the Web For You",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T16:16:00.926188+00:00",
        "description": "Software has become essential for winning modern wars, a senior Palantir executive told a defense conference in Israel this week. \"Modern war cannot be won without software,\" said Noam Perski, executive vice president at the data analytics company. \n\n\"Seeing software as a defense system, as a weapon system, and the most malleable weapon system we have, is really important as we build the next generation's capabilities.\" Speaking at Tel Aviv University's first DefenseTech Summit, Perski said human factors still determine military success.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='Modern+War+Cannot+Be+Won+Without+Software%2C'+Palantir+Executive+Says%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F11%2F1534256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slash",
        "id": 1689251,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/11/1534256/modern-war-cannot-be-won-without-software-palantir-executive-says?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Modern War Cannot Be Won Without Software,' Palantir Executive Says",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T15:13:06.733445+00:00",
        "description": "Security researchers have uncovered a new surveillance tool that they say has been used by Chinese law enforcement to collect sensitive information from Android devices in China. From a report: The tool, named \"EagleMsgSpy,\" was discovered by researchers at U.S. cybersecurity firm Lookout. The company said at the Black Hat Europe conference on Wednesday that it had acquired several variants of the spyware, which it says has been operational since \"at least 2017.\" \n\nKristina Balaam, a senior intelligence researcher at Lookout, told TechCrunch the spyware has been used by \"many\" public security bureaus in mainland China to collect \"extensive\" information from mobile devices. This includes call logs, contacts, GPS coordinates, bookmarks, and messages from third-party apps including Telegram and WhatsApp. EagleMsgSpy is also capable of initiating screen recordings on smartphones, and can capture audio recordings of the device while in use, according to research Lookout shared with TechCr",
        "id": 1688731,
        "language": null,
        "link": "https://it.slashdot.org/story/24/12/11/156219/researchers-uncover-chinese-spyware-used-to-target-android-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Researchers Uncover Chinese Spyware Used To Target Android Devices",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T14:08:04.601457+00:00",
        "description": "Rising renewables, low demand and cheaper power imports all helped reduce fossil fuel use in the UK power system to record lows. From a report: For the first full year wind, solar, and hydropower will generate more electricity than all fossil fuels combined. Homegrown UK renewable power will cross a significant threshold in 2024, overtaking fossil fuel generation for the first full year. Wind, solar and hydropower are set to generate a combined 37% of UK electricity in 2024 (103 TWh), compared to 35% from fossil fuels (97 TWh). Just 3 years ago, in 2021, fossil fuels generated 46% of UK electricity, while low-carbon renewables generated 27%. \n\nIncluding biomass, renewables overtook fossil fuels in the UK in 2020, fell below fossil power the following year as biomass production fell, and again overtook in 2023. However, Ember's analysis raises concerns about biomass being categorised as clean power in the UK, given the significant emissions risks and lack of domestic pellet production",
        "id": 1688218,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/11/1334206/uk-low-carbon-renewable-power-set-to-overtake-fossil-fuels-for-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Low-Carbon Renewable Power Set To Overtake Fossil Fuels For First Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T13:03:08.464857+00:00",
        "description": "AI-powered apps have flooded Apple's App Store, with AI-branded tools dominating top rankings across multiple categories, particularly in graphics and design. An investigation by The Verge reveals significant quality concerns among these applications. \n\nTurkey-based developer HUBX controls three of the top 10 graphics apps, including DaVinci AI, which offers limited free features while charging up to $30 annually for full access. The app produces low-quality images and forces watermarks on paid users' downloads, The Verge writes. According to Sensor Tower data, four of the top 10 most downloaded iOS graphics apps in the U.S. this year include \"AI\" in their titles. \n\nWhile established photo editing apps like Photoshop Express saw downloads drop 21%, AI-focused app Photoroom's downloads surged 160% year-over-year. Professional creative apps continue to dominate iPad and paid iPhone categories, suggesting the AI app trend primarily targets casual users seeking free alternatives to paid ",
        "id": 1687751,
        "language": null,
        "link": "https://slashdot.org/story/24/12/11/1223213/ai-app-gold-rush-floods-apple-store-with-low-quality-offerings?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI App Gold Rush Floods Apple Store With Low-Quality Offerings",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T09:18:53.681069+00:00",
        "description": "An anonymous reader shares a report: The news came by Slack message. Cruise CEO Marc Whitten, who took the top post in June, posted a message Tuesday afternoon in the company's announcements channel along with a link to a press release entitled \"GM to refocus autonomous driving development on personal vehicles.\" \n\nGM, which acquired the self-driving car startup in 2016, would no longer fund the company, ending a mission that hundreds of Cruise engineers had worked on for years. Minutes later, during an all-hands meeting, Cruise employees learned a few more details. The self-driving car company would be absorbed into parent company GM and combined with the automaker's own efforts to develop driver assistance features -- and eventually fully autonomous personal vehicles. Whether their jobs would be safe or cut was, and still is, unclear. \n\nThat meeting was short and unsatisfactory, according to one source, who noted that the senior leadership team was also surprised by this turn of eve",
        "id": 1686696,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/11/0852242/cruise-employees-blindsided-by-gms-plan-to-end-robotaxi-program?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cruise Employees 'Blindsided' By GM's Plan To End Robotaxi Program",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T08:14:14.219882+00:00",
        "description": "WP Engine just won a preliminary injunction against WordPress.com parent company Automattic. On Tuesday, a California District Court judge ordered Automattic to stop blocking WP Engine's access to WordPress.org resources and interfering with its plugins. From a report: The preliminary injunction comes after WP Engine, a third-party WordPress hosting service, filed a lawsuit that accused Automattic and its CEO, Matt Mullenweg, of \"multiple forms of immediate irreparable harm.\" It later asked the court to stop Mullenweg from restricting WP Engine's access to WordPress.org. \n\nMullenweg waged a public campaign against WP Engine in September, accusing the service of misusing the WordPress trademark and not contributing enough to the WordPress community. After blocking WP Engine from WordPress.org's servers, Automattic took control of WP Engine's ACF Plugin.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=WordPress+Parent",
        "id": 1686459,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/11/0258231/wordpress-parent-company-must-stop-blocking-wp-engine-judge-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "WordPress Parent Company Must Stop Blocking WP Engine, Judge Rules",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T06:03:41.697760+00:00",
        "description": "An anonymous reader shares a report: Google recently asked the U.S. government to break up Microsoft's exclusive agreement to host OpenAI's technology on its cloud servers, according to a person who has been directly involved in the effort. The conversation took place after the Federal Trade Commission, one of the primary federal antitrust enforcement agencies, asked Google about Microsoft's business practices as part of a broader investigation, this person said. \n\nFirms that compete with Microsoft in renting out cloud servers, including Google and Amazon, want to host OpenAI's artificial intelligence themselves so their cloud customers don't need to also tap Microsoft servers to get access to the startup's technology, this person said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Asks+FTC+To+Kill+Microsoft's+Exclusive+Cloud+Deal+with+OpenAI%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F12%2F11%2F02542",
        "id": 1686037,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/11/0254257/google-asks-ftc-to-kill-microsofts-exclusive-cloud-deal-with-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Asks FTC To Kill Microsoft's Exclusive Cloud Deal with OpenAI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T03:54:25.768332+00:00",
        "description": "Amazon expanded Tuesday into online car sales with the launch of Amazon Autos, an e-commerce business that lets customers find, order, and buy new cars, trucks, and SUVs from dealerships. From a report: Amazon is kicking off the new endeavor with Hyundai in 48 U.S. cities, including Atlanta, Boston, Chicago, Los Angeles, and New York. The launch comes a little more than a year since the e-commerce giant announced plans to start selling vehicles on its website in the second half of 2024. Amazon said it will add more cities and additional auto manufacturers in 2025. \n\nAmazon Autos will function, in many ways, like the rest of the broader Amazon e-commerce ecosystem. Shoppers will be able to search for available vehicles from participating dealers by model, trim, color, and features. Notably, customers will also be able to secure financing and e-sign paperwork via the Amazon Autos site. Once the payment is finalized, customers can schedule when to pick up their vehicle from that dealers",
        "id": 1685640,
        "language": null,
        "link": "https://slashdot.org/story/24/12/11/0250222/amazon-is-officially-in-the-online-car-sales-business?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Amazon is Officially in the Online Car Sales Business",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T02:49:56.763063+00:00",
        "description": "An anonymous reader shares a report: Nearly 100 live samples of the deadly Hendra virus have been lost in a biosecurity bungle at a state-run Queensland laboratory. An investigation has been launched after it was revealed 323 virus samples went missing from Virology Laboratory in 2021 in a \"major breach\" of biosecurity protocol, Health Minister Tim Nicholls announced on Monday. \n\nThe material, which included samples of Hendra virus, lyssavirus and hantavirus, appears to have gone missing after a freezer storing the samples broke down. Mr Nicholls said the breach was uncovered in August 2023. The lab has been unable to say whether the materials were removed or destroyed. \"It's this part of the transfer of those materials that is causing concern,\" Mr Nicholls said.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Investigation+Launched+Into+Queensland+Lab+Breach%2C+With+Vials+of+Deadly+Viruses+Missing%3A+https%3A%2F%2F",
        "id": 1685457,
        "language": null,
        "link": "https://slashdot.org/story/24/12/11/0242221/investigation-launched-into-queensland-lab-breach-with-vials-of-deadly-viruses-missing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Investigation Launched Into Queensland Lab Breach, With Vials of Deadly Viruses Missing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T01:45:39.894653+00:00",
        "description": "An anonymous reader shares a report: Software vulnerability submissions generated by AI models have ushered in a \"new era of slop security reports for open source\" -- and the devs maintaining these projects wish bug hunters would rely less on results produced by machine learning assistants. Seth Larson, security developer-in-residence at the Python Software Foundation, raised the issue in a blog post last week, urging those reporting bugs not to use AI systems for bug hunting. \n\n\"Recently I've noticed an uptick in extremely low-quality, spammy, and LLM-hallucinated security reports to open source projects,\" he wrote, pointing to similar findings from the Curl project in January. \"These reports appear at first glance to be potentially legitimate and thus require time to refute.\" Larson argued that low-quality reports should be treated as if they're malicious. \n\nAs if to underscore the persistence of these concerns, a Curl project bug report posted on December 8 shows that nearly a yea",
        "id": 1685255,
        "language": null,
        "link": "https://developers.slashdot.org/story/24/12/10/2334221/open-source-maintainers-are-drowning-in-junk-bug-reports-written-by-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Open Source Maintainers Are Drowning in Junk Bug Reports Written By AI",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T00:37:36.120239+00:00",
        "description": "Global antibiotic use in livestock varies dramatically across regions, with some Asian countries using up to 80 times more antibiotics per kilogram of meat than European nations, according to new research published by Our World in Data. Thailand leads global antibiotic consumption in livestock, while Norway reports the lowest usage rates. \n\nThe study found that around 70% of global antibiotics are administered to farm animals rather than humans, raising concerns about antimicrobial resistance. Several European countries have successfully reduced veterinary antibiotic sales by more than half between 2011 and 2022 through stricter regulations, including requiring prescriptions and imposing taxes on sales. \n\nThe Netherlands saw a 54% decrease in pig farm antibiotic use between 2004 and 2016 without negative impacts on animal welfare or farm economics. Researchers suggest global livestock antibiotic use could fall by two-thirds if consumption were reduced to 50 milligrams per kilogram of",
        "id": 1685001,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/10/2330228/livestock-antibiotic-use-in-asia-dwarfs-european-levels-amid-resistance-fears?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Livestock Antibiotic Use in Asia Dwarfs European Levels Amid Resistance Fears",
        "vote": 0
    }
]