[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T17:30:11+00:00",
        "description": "Cyberpunk 2077 completed a major redemption arc with the one-two punch of the extensive Update 2.0 and the incredible expansion Phantom Liberty, both of which arrived on the back of years of updates and improvements. \n\nIn the aftermath, most would have assumed that CD Projekt RED would finally move on from the game and divert its attention to other, future projects, and on at least a couple of occasions, that’s exactly what CDPR itself suggested as well- but recently, we got yet another patch for Cyberpunk 2077 in the form of Update 2.2, bringing a host of new customization options and neat new gameplay features. \n\nThe update itself might not be too substantial, but yet again, it’s indicative of the excellent support the game has continued to receive long past the time most would have expected it to keep getting updates.",
        "id": 1689879,
        "language": null,
        "link": "https://www.youtube.com/watch?v=priU_AqDHBQ",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/priU_AqDHBQ/hqdefault.jpg",
        "title": "Cyberpunk 2077 Update 2.2 Shows How CPDR Has Truly Gone ABOVE AND BEYOND",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-11T13:30:20+00:00",
        "description": "2024 was admittedly a relatively slower year for gaming compared to the insanity of 2023, but looking back at the last 12 months, you'd have to be very, very jaded to not agree that there was a long and varied list of incredible new releases to check out, from the first month of the year to its very last. \n\nFrom multiplayer bangers to single-player odysseys, from new and experimental ideas to stellar adaptations of established IP, from AAA megatons to new indies that took our collective breath away, this year delivered an impressive collection of games- and as ever, with a new year on our doorstep, right now, we're pausing and looking back.",
        "id": 1688250,
        "language": null,
        "link": "https://www.youtube.com/watch?v=fEmFPSGVOMI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/fEmFPSGVOMI/hqdefault.jpg",
        "title": "So, Which Console Won 2024? PS5 Or Xbox Series X | S?",
        "vote": 0
    }
]