[{"source": "https://www.arabnews.com/rss.xml", "title": "More than 50 from same family killed in Israeli attacks on Gaza", "description": "LONDON/TULKARM/VATICAN: More than 50 members of the same family have been killed in the Jabalia refugee camp in northern Gaza during Israel’s military campaign there, the Palestinian foreign minister said on Wednesday.\n\n\t“Only this morning, from the Qadoura family in Jabalia, 52 people have been wiped out completely, killed,” Palestinian Foreign Minister Riyad Al-Maliki said on the sidelines of a briefing by Arab and Muslim foreign ministers in London.\n\n\t“I have the list of the names, 52 of them, they were wiped out completely from grandfather to grandchildren.”", "link": "https://www.arabnews.com/node/2413576/middle-east", "date_published": "2023-11-22T23:20:41.102953+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Iran says Gaza war scope will grow if truce doesn’t hold", "description": "BEIRUT: Iran’s Foreign Minister Hossein Amir-Abdollahian warned Wednesday that the scope of the Gaza war would expand unless a truce between Israel and Hamas lasts, in an interview as he visited Beirut.\n\t“If this cease-fire starts tomorrow, if it does not continue... the conditions in the region will not remain the same as before the cease-fire and the scope of the war will expand,” Amir-Abdollahian told the Beirut-based Al-Mayadeen television channel, according to Iran’s Fars news agency.", "link": "https://www.arabnews.com/node/2413581/middle-east", "date_published": "2023-11-22T23:20:41.102448+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "What We Are Reading Today: Ocean Life in the Time of Dinosaurs", "description": "Authors: Nathalie Bardet, Alexandra Houssaye, Stephane Jouve, &amp; Peggy Vincent\n\n\tDuring the Mesozoic era, 252 to 66 million years ago, dinosaurs ruled the land, but the ocean deeps were roiling with equally spectacular reptiles—including giant predators.\n\n\tThis richly illustrated, authoritative, and accessible book introduces readers to the world of these fascinating marine animals, whose predecessors returned to the seas a few million years after the first vertebrates emerged from the water.", "link": "https://www.arabnews.com/node/2413586/books", "date_published": "2023-11-22T23:20:41.101921+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Palestinian UN ambassador calls for pause to become ‘end’ to Israel-Hamas war", "description": "UNITED NATIONS: The Palestinian UN ambassador called Wednesday for a “definitive end” to Israel’s war with Hamas in Gaza, warning that a truce to release hostages “cannot be just a pause before the massacre starts all over again.”\n\tRiyad Mansour spoke after Israel and Hamas announced a deal on Wednesday allowing at least 50 hostages and scores of Palestinian prisoners to be freed, while offering besieged Gaza residents a four-day truce after weeks of all-out war.", "link": "https://www.arabnews.com/node/2413591/world", "date_published": "2023-11-22T23:20:41.101425+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Pro-Palestinian activists stage protest in UK Parliament to demand permanent Gaza ceasefire", "description": "LONDON: A UK-based pro-Palestinian activist organization on Wednesday organized a sit-in demonstration in Parliament to demand a permanent ceasefire in Gaza.\n\tThe Palestine Solidarity Campaign said that 25 activists timed the protest in Central Hall, Westminster, to coincide with Prime Minister’s Questions.", "link": "https://www.arabnews.com/node/2413596/world", "date_published": "2023-11-22T23:20:41.100905+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Wet and windy weather set to continue until Friday", "description": "RIYADH: People across the Kingdom are being urged to exercise caution as the wet and windy weather is set to continue through Friday, the Saudi Press Agency reported.\n\n\tCitizens are advised to avoid areas that might be susceptible to flooding and not swim in open waters, the General Directorate of Civil Defense said.\n\n\tThe Makkah region is forecast to see light to moderate rains as well as winds that could stir up dust storms in Taif, Adham, Al-Ardiyat, Maysan and Al-Kamil, it said.", "link": "https://www.arabnews.com/node/2413611/saudi-arabia", "date_published": "2023-11-22T22:11:50+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Hostage crisis in Gaza draws attention to scourge of kidnappings in Africa’s Sahel", "description": "TUNIS: The hostage situation in the Gaza Strip is receiving saturation media coverage, but attacks and kidnappings by extremist groups in the countries of the Sahel have been occurring for years with tragic regularity, garnering little attention.\n\n\tThe abduction of a group of mostly Christian girls in Chibok, Nigeria, by Boko Haram in 2014 was a particularly high-profile incident. But since then, extremist groups have continued to target civilians and military forces alike in Burkina Faso, Mali, Niger, Nigeria and Chad with increasing regularity.", "link": "https://www.arabnews.com/node/2413601/world", "date_published": "2023-11-22T22:11:44+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi, Algerian justice ministers meet in Algiers, sign executive program", "description": "RIYADH: Saudi Arabia’s Minister of Justice Walid Al-Samaani met his Algerian counterpart Abderrachid Tabi during an official visit to Algiers, the Saudi Press Agency reported on Wednesday.\n\n\tDuring the meeting, the two men discussed ways to enhance relations in the judicial and legal fields.\n\n\tAl-Samaani highlighted the legislative, technical and training developments in Saudi Arabia’s judicial sector, supported by King Salman and overseen by Crown Prince Mohammed bin Salman.", "link": "https://www.arabnews.com/node/2413626/saudi-arabia", "date_published": "2023-11-22T22:11:27+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi FM, Blinken discuss Gaza truce, relief efforts", "description": "RIYADH: Saudi Arabia’s Foreign Minister Prince Faisal bin Farhan on Wednesday received a phone call from US Secretary of State Antony Blinken, the Kingdom’s Foreign Ministry said.\n\tThe two discussed ways to stop the military escalation in Gaza and surrounding areas, and to adhere to any humanitarian truce and ceasefire agreement.\n\tThey also discussed efforts to bring in humanitarian, relief and medical aid.", "link": "https://www.arabnews.com/node/2413606/saudi-arabia", "date_published": "2023-11-22T22:11:14+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "In Gaza, dozens of unidentified bodies buried in ‘mass grave’", "description": "KHAN YUNIS, Palestinian Territories: The bodies of dozens of unidentified people were buried on Wednesday in a mass grave at a cemetery in Khan Yunis, in the southern Gaza Strip.\n\tWrapped in blue tarpaulin, the bodies were lowered on stretchers, some of them stained with blood, into a sandy pit that was gradually enlarged by a digger. Some were the size of children.\n\t“As these martyrs had no one to say goodbye to, we dug a mass grave to bury them. They are unknown martyrs,” Bassem Dababesh of the emergency committee at the religious affairs ministry told AFP.", "link": "https://www.arabnews.com/node/2413621/middle-east", "date_published": "2023-11-22T22:11:08+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Qatar’s economic growth stabilizes after FIFA World Cup boom: IMF", "description": "RIYADH: The economic growth of Qatar has normalized after the country’s strong fiscal performance in 2022, driven by the FIFA World Cup, according to the International Monetary Fund. \n\n\tIn its consultation report released on Nov. 21, the IMF disclosed that Qatar’s economic outlook in the medium term seems favorable, with output expected to expand by about 1.75 percent per annum during 2023–25. \n\n\tIt further revealed that the medium-term expansion would be fueled by the nonhydrocarbon sector, which is expected to grow at 2.75 percent, driven by domestic demand.", "link": "https://www.arabnews.com/node/2413166/business-economy", "date_published": "2023-11-22T09:11:29+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi-backed PFL set to shake up MMA scene in Middle East, beyond", "description": "Riyadh: The Professional Fighters League on Tuesday acquired rival combat sports brand, Bellator, in the latest strategic move to loosen the Ultimate Fighting Championship’s chokehold on the mixed martial arts industry.\n\n\tBacked by SRJ Sports Investments – the Saudi Public Investment Fund entity created to develop the Kingdom’s sports sector – the PFL will gain access to a roster of even more world-class fighters.", "link": "https://www.arabnews.com/node/2413171/sport", "date_published": "2023-11-22T09:11:18+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Record crowds attend DP World Tour Championship 2023 in Dubai", "description": "DUBAI: This year’s DP World Tour Championship in Dubai attracted in excess of 79,000 spectators over the course of the event — the most in the 15-year history of the tournament and a more than 14 percent increase on last year.\n\n\tRecord crowds were welcomed on each of the four days of the tournament, which marked the 15th edition of the event, held at Jumeirah Golf Estates in Dubai from Nov. 16-19.", "link": "https://www.arabnews.com/node/2413176/golf", "date_published": "2023-11-22T09:11:11+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Oil Updates – prices stall ahead of US stocks data, potential OPEC+ cuts", "description": "LONDON: Oil prices barely moved during Asian trade on Wednesday as the market awaited potentially mixed news on the supply front, with the Organization of the Petroleum Exporting Countries and its allies, known as OPEC+, expected to discuss output cuts and US crude stocks forecast to show a big build-up, according to Reuters.\n\n\tBrent crude futures fell 3 cents, or 0.04 percent, to $82.45 a barrel by 8:00 a.m. Saudi time. US West Texas Intermediate crude futures fell 1 cent, or 0.01 percent, to $77.76.", "link": "https://www.arabnews.com/node/2413141/business-economy", "date_published": "2023-11-22T08:11:17+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Turkiye extends LNG deal with Algeria for 3 years, says energy minister", "description": "ANKARA: Turkish state energy company Botas has signed a deal with Algerian state oil and gas company Sonatrach to extend their existing gas supply contract for three years, Turkiye’s energy minister said on Nov. 21, according to Reuters\n\n\tUnder the deal signed during an official visit to Algiers by Turkish President Tayyip Erdogan, Turkiye will continue to acquire 4.4 billion cubic meters of liquefied natural gas from Algeria annually, Alparslan Bayraktar said in a statement posted on social media platform X.", "link": "https://www.arabnews.com/node/2413156/business-economy", "date_published": "2023-11-22T08:11:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Coldplay concert in Malaysia can be stopped by organizers if the band misbehaves, government says", "description": "KUALA LUMPUR, Malaysia: Organizers of Wednesday’s Coldplay concert in Malaysia can stop the show if the British rock band misbehaves, a minister said as the government rejected Muslim conservatives’ calls to cancel the show.\n\tLed by the country’s opposition bloc, Muslim conservatives have protested the concert over Coldplay’s support for the LGBTQ+ community. Recently, they also pushed for the concert to be halted in solidarity with Palestinians killed in the Israel-Hamas war.", "link": "https://www.arabnews.com/node/2413136/world", "date_published": "2023-11-22T08:11:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "North Korea says received images of US Guam air base from spy satellite", "description": "SEOUL: North Korean leader Kim Jong Un has reviewed photographs of major US military bases in Guam, received from the country’s first spy satellite in orbit, state media said Wednesday.\n\tKim “watched the aerospace photos of Anderson Air Force Base, Apra Harbor and other major military bases of the US forces taken in the sky above Guam in the Pacific, which were received at 9:21 a.m. on Nov. 22,” state-run news agency KCNA said, having earlier announced the purportedly successful launch of the North’s “Malligyong-1” spy satellite.", "link": "https://www.arabnews.com/node/2413151/world", "date_published": "2023-11-22T08:11:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "History for LeBron James as Lakers advance in NBA in-season tournament", "description": "LOS ANGELES: LeBron James claimed another piece of NBA history on Tuesday, becoming the first player to break the 39,000-point barrier as the Los Angeles Lakers routed the Utah Jazz to reach the knockout stage of the league’s new in-season tournament.\n\n\tThe 38-year-old, needing just five points to reach the milestone heading into the game, etched his name into the record books with a three-pointer in the first quarter of a 131-99 Lakers win.", "link": "https://www.arabnews.com/node/2413121/sport", "date_published": "2023-11-22T06:11:32+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Iraqis displaced by climate change fall into poverty", "description": "NASIRIYAH: For the past decade, Nasser Jabbar and his children have lived in a rundown house built of grey concrete blocks at a shantytown in southern Iraq.\n\tDrought chased the father of 10 out of the countryside, where he had been a herder and farmer, and into a life of unemployment and urban poverty.\n\t“We lost the land, and we lost the water,” said the father in his 40s, wearing a traditional white robe.\n\tHe spoke to AFP in his home on the edges of Nasiriyah, capital of Dhi Qar province.", "link": "https://www.arabnews.com/node/2413061/middle-east", "date_published": "2023-11-22T05:11:13+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Lebanon border flare-up ahead of Gaza truce", "description": "BEIRUT: Hostilities on Lebanon’s southern border flared on Wednesday after Hezbollah militants launched Burkan missiles at Israeli army positions just hours before a truce was declared in the Gaza Strip between Israel and Hamas.\n\n\tIsraeli army forces also struck Hezbollah targets in Lebanon, while Israeli warplanes dropped phosphorous bombs, causing fires between the towns of Kafr Kila and Al-Adisa.\n\n\tHezbollah said that it attacked the Yiftah barracks, and also targeted a logistical support team carrying out maintenance work at the Bayad Blida site.", "link": "https://www.arabnews.com/node/2413411/middle-east", "date_published": "2023-11-22T04:11:52+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Oscar-winning actress Susan Sarandon dropped by talent agency for speaking at a pro-Palestine rally", "description": "LONDON: Hollywood talent agency UTA has dropped Oscar-winning actress Susan Sarandon after speaking at a pro-Palestine rally, a spokesperson for the agency confirmed to Deadline news site on Tuesday.\n\n\tA video taken at the rally on Nov. 17 showed Sarandon telling the crowd, “There are a lot of people that are afraid, that are afraid of being Jewish at this time, and are getting a taste of how it feels to be Muslim in this country.”\n\n\tSarandon encouraged others to continue speaking out in support of Palestinians during Israel’s war in Gaza.", "link": "https://www.arabnews.com/node/2413416/world", "date_published": "2023-11-22T04:11:51+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Spanish politician shot in Madrid points finger at Iran", "description": "MADRID: The Spanish politician shot in Madrid earlier this month accused Iran on Wednesday of being behind his attempted murder in a message delivered to a conference organized by Iranian opposition supporters.\n\tAlejo Vidal-Quadras, a founder of Spain’s far-right Vox party and former head of its center-right People’s Party in Catalonia, was shot in the face in broad daylight on a pavement in the wealthy Salamanca neighborhood of central Madrid on Nov. 9 by a motorbike pillion passenger.", "link": "https://www.arabnews.com/node/2413406/world", "date_published": "2023-11-22T04:11:49+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "What a year: How Saudi football has flourished since World Cup win over Argentina", "description": "On Nov. 22, 2022, Saudi Arabia’s footballers pulled off a sporting miracle.\n\n\tSaleh Al-Shehri and Salem Al-Dawsari scored two goals to give the Green Falcons a come-from-behind 2-1 win over Argentina at the World Cup in Qatar.\n\n\tIt was a stunning result that had the thousands of fans at the Lusail Stadium and millions more around the world celebrating.\n\n\tWhen the Saudi players walked off the pitch at halftime, trailing to Lionel Messi’s penalty strike, not even the most optimistic of supporters would have given them much chance of a comeback.", "link": "https://www.arabnews.com/node/2413401/sport", "date_published": "2023-11-22T04:11:49+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Hundreds of Rohingya come ashore in Indonesia, joining about 1,000 this week", "description": "JAKARTA 22 : More than 200 ethnic Rohingya came ashore in Indonesia’s Aceh province late on Tuesday, taking total arrivals of members of the Myanmar Muslim minority to more than 1,000 for the week, a leader of the province’s fishing community said.During November to April, when the seas are calmer, many members of the persecuted minority leave Myanmar on rickety boats for Thailand, Muslim-majority Bangladesh, Malaysia and Indonesia.", "link": "https://www.arabnews.com/node/2413056/world", "date_published": "2023-11-22T04:11:31+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "US fighter aircraft strike Hezbollah targets in Iraq after attacks on bases", "description": "WASHINGTON: US fighter aircraft struck two Hezbollah operations centers in Iraq in response to attacks on US bases that have escalated alongside Israel’s operations against Hamas in Gaza, two defense officials said.\n\tThey said attacks on US bases included the first use of a short-range ballistic missile against US troops, which happened Tuesday.", "link": "https://www.arabnews.com/node/2413051/middle-east", "date_published": "2023-11-22T04:11:18+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "UK’s Cameron meets Arab, Islamic country counterparts to discuss Israel-Hamas conflict", "description": "LONDON: British foreign minister David Cameron met his counterparts from Arab and Islamic countries in London on Wednesday to discuss the Israel-Hamas conflict after the two sides agreed to cease-fire in Gaza for at least four days.\n\t“We discussed how to use this step forward to think about the future and how we can build a peaceful future which provides security for Israel but also peace and stability for the Palestinian people,” Cameron said in a statement.", "link": "https://www.arabnews.com/node/2413391/middle-east", "date_published": "2023-11-22T03:11:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "English soccer club Barnsley removed from the FA Cup after fielding an ineligible player", "description": "LONDON: English soccer club Barnsley were kicked out of this season’s FA Cup on Wednesday for fielding an ineligible player.\n\tThe third-division team said an “administrative error” was to blame for fielding the unnamed player in their first round replay against Horsham on Nov. 14. Barnsley won the game 3-0.", "link": "https://www.arabnews.com/node/2413381/football", "date_published": "2023-11-22T03:11:36+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Portuguese hacker in Football Leaks scandal handed 6-month suspended sentence by French court", "description": "PARIS: A Portuguese hacker whose bombshell revelations on the “FootballLeaks” website rocked European soccer was convicted Wednesday by a Paris court and given a suspended prison sentence of six months.\n\tRui Pinto accepted the sentence proposed by the public prosecutor for hacking into Paris Saint-Germain executives, French media reported. He was also ordered to pay one euro in damages to PSG, which had sued as a civil party, as well as 4,000 euros ($4,360) in legal costs.", "link": "https://www.arabnews.com/node/2413371/football", "date_published": "2023-11-22T03:11:27+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi Real Estate Refinance Co. concludes $933m sukuk issuance", "description": "RIYADH: A fresh influx of liquidity is set to hit the Kingdom’s housing market with the Saudi Real Estate Refinance Co. completing an SR3.5 billion ($933 million) sukuk issuance.\n\n\tSRC, a subsidiary of the Public Investment Fund, stated that the offering forms the last two tranches of its SR20 billion government-guaranteed sukuk program, featuring dual tenors of five and seven years, according to a press note.", "link": "https://www.arabnews.com/node/2413361/business-economy", "date_published": "2023-11-22T03:11:22+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Ex-Obama adviser says killing 4,000 Palestinian children ‘wasn’t enough’ in viral racist rant", "description": "LONDON: A former adviser to Barack Obama said that killing 4,000 Palestinian children “wasn’t enough” in a viral racist rant directed at an Arab food vendor in New York.\n\n\tStuart Seldowitz served as acting director for the National Security Council South Asia Directorate under Obama and was deputy director in the US State Department’s Office of Israel and Palestinian Affairs from 1999 to 2003.\n\n\tSeveral social media videos show Seldowitz harassing the Arab man working inside a food vendor on multiple occasions.", "link": "https://www.arabnews.com/node/2413386/world", "date_published": "2023-11-22T03:11:11+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "17 Filipinos among Galaxy Leader crew held by Houthis in Yemen", "description": "AL-MUKALLA: The Philippine government said on Wednesday that 17 of its citizens are among the 25 sailors held hostage by the Houthis in Yemen, as international pressure mounts on the Iran-backed militia to return the captured ship and release its crew.\n\n\tOn Sunday, the Houthis raided the vehicle carrier Galaxy Leader, which was traveling under the flag of The Bahamas in the Red Sea, and diverted it to Yemen’s western port city of Hodeidah, which they control.", "link": "https://www.arabnews.com/node/2413376/middle-east", "date_published": "2023-11-22T03:11:10+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Finland stun defending champions Canada to reach semifinals of Davis Cup in Spain", "description": "MALAGA, Spain: Feeling at home, Finland upset defending champions Canada to reach the semifinals of the Davis Cup for the first time on Tuesday.\n\n\tOtto Virtanen and Harri Heliovaara defeated Alexis Galarneau and Vasek Pospisil 7-5, 6-3 in the decisive doubles match to give the 14th-ranked Finns the victory over No. 1 Canada in the first of the quarterfinals in southern Spain.\n\n\tVirtanen had kept Finland alive by defeating Gabriel Diallo 6-4, 7-5 in the second singles match after Milos Raonic had given Canada the first point with a 6-3, 7-5 win over Patrick Kaukovalta.", "link": "https://www.arabnews.com/node/2413037/sport", "date_published": "2023-11-22T02:11:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Croatia seal final automatic qualifying spot for Euro 2024 and Wales enter playoffs", "description": "LONDON: Croatia overcame some nerves and a stubborn Armenia team to win 1-0 and secure the last automatic qualifying spot for next year’s European Championship on Tuesday.\n\n\tThe Croats needed a win to guarantee qualification along with Group D winner Turkiye. But it was tense in Zagreb until midfielder Ante Budimir headed in Borna Sosa’s cross in the 43rd minute. The celebrations were tinged with relief for 38-year-old midfielder Luka Modric and a Croatia team that had 23 attempts on goal.", "link": "https://www.arabnews.com/node/2413032/football", "date_published": "2023-11-22T02:11:20+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "UN warns no more food aid cash for Sudan refugees in Chad", "description": "LIBREVILLE: The UN’s World Food Programme on Tuesday warned lack of funds threatened to halt food and nutrition assistance for more than a million people in Chad — including newly arrived Sudanese refugees.\n\tThe organization said funding constraints emanating from a range of other crises including the wars in Gaza and Ukraine meant its capacity to help was spread too thin.\n\tIt comes “as aid agencies scramble to respond to a fresh wave of refugees fleeing an unimaginable humanitarian crisis” in Sudan’s western region of Darfur, WFP said in a statement.", "link": "https://www.arabnews.com/node/2413027/world", "date_published": "2023-11-22T01:11:44+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "China expands crackdown on mosques to regions outside Xinjiang, Human Rights Watch says", "description": "BEIJING: The Chinese government has expanded its campaign of closing mosques to regions other than Xinjiang, where for years it has been blamed for persecuting Muslim minorities, according to a Human Rights Watch report released Wednesday.\n\tAuthorities have closed mosques in the northern Ningxia region as well as Gansu province, which are home to large populations of Hui Muslims, as part of a process known officially as “consolidation,” according to the report, which draws on public documents, satellite images and witness testimonies.", "link": "https://www.arabnews.com/node/2413022/world", "date_published": "2023-11-22T01:11:41+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Brazil-Argentina kick-off delayed amid crowd violence", "description": "The kick-off of Brazil’s World Cup qualifying clash with Argentina was delayed on Tuesday after clashes among rival supporters in the Maracana Stadium.\n\n\tThe much-anticipated blockbuster between South American football’s two superpowers was due to kick off at 9.30pm local time (0030 GMT Wednesday) but was held up after disturbances in the stands.\n\n\tArgentina’s players, led by captain Lionel Messi, left the field and returned to the players tunnel as police moved in to quell the crowd trouble.", "link": "https://www.arabnews.com/node/2413021/football", "date_published": "2023-11-22T00:11:55+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Pro-Palestinian protesters arrested at Australian port", "description": "SYDNEY: Australian police arrested 23 pro-Palestinian protesters for blocking roads near one of the country’s largest container ports in Sydney, authorities said on Wednesday, after they protested against a ship owned by Israeli carrier Zim.\n\tAbout 400 people had gathered near Port Botany on Tuesday evening for a planned unauthorized protest activity, New South Wales state police said. Protesters who did not comply with directions and occupied roads near the port were charged with offenses, including disrupting operations of a major facility.", "link": "https://www.arabnews.com/node/2413016/world", "date_published": "2023-11-22T00:11:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]