[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-06T20:30:02+00:00", "description": "Overall, Squirrel With A Gun is a wonderfully charming, hilarious, and engaging title with no short of variety in gameplay and plenty to do for how long it lasts, with the developers taking influence from past games and making those ideas come together to form a wonderfully cohesive concept.\n\nDespite its flaws, such as its short length, minimal control issues and complicated save system, it’s a great title and a strong start from the up-and- coming Dee Dee Creations. There is definitely room for expanding on these ideas perpetuated in this game, and it will be interesting to see how these are elaborated on, or what new ones they conceive in the future.", "id": 1098131, "language": null, "link": "https://www.youtube.com/watch?v=OEkf2TIgUdE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/OEkf2TIgUdE/hqdefault.jpg", "title": "Squirrel With A Gun Review - One of the Craziest Games of 2024 You Are Not Playing", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-06T16:00:44+00:00", "description": "Space Marine 2 is available for early access owners, with its worldwide launch set for September 9th on Xbox Series X/S, PS5, and PC. However, it's already garnered an impressive player count on Steam and positive reviews from critics.\n\nThere are plenty of reasons to dive into the third-person shooter, from its excellent visuals to the compelling campaign, but the combat is what sells it. Every action in the game, whether you're moving around, slicing up Tyranids with a Chainsword, or breaking out the Heavy Bolter to mow down swarms of enemies, feels fantastic. It also doesn't hurt that the enemies and combat scenarios are enjoyable to engage with.\n\nWith just how solid the combat feels, it's possible that Space Marine 2 may unseat the likes of Gears of War. Find out what makes it all so compelling.", "id": 1096422, "language": null, "link": "https://www.youtube.com/watch?v=g3_stZcxEHI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/g3_stZcxEHI/hqdefault.jpg", "title": "Warhammer 40,000: Space Marine 2's Combat Goes Above And Beyond Gears of War", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-06T12:00:34+00:00", "description": "The visual aesthetics of games are the subject of great discord in gaming communities. Some games like The Last of Us Part II are praised for their utmost realism and attention to the minute details. Some others like Elden Ring are famous for their art direction and using the game’s visuals to tell stories and advance the narrative. Some like Cyberpunk 2077 are pioneers in implementing new technologies such as NVIDIA RTX Path Tracing. \n\nBut people don’t usually remember their worst visual experiences in the gaming world at the end of the year. There are no awards in the videogame industry for the worst graphics of the year. However, here at Gaming Bolt, we don’t forget about the games with the most underwhelming graphics that we’ve played so far, and make sure you won’t either!\n\nIntro 0:00\nBLEAK FAITH FORSAKEN 0:40\nEARTH DEFENSE FORCE 6 1:19\nKINGDOM THE BLOOD 2:05\nFLOCK 2:47\nCROWN WARS THE BLACK PRINCE 3:24\nGIGANTIC THE RAMPAGE EDITION 4:03\nDIE BY THE BLADE 4:46\nRISE OF THE RONIN 5:26", "id": 1095064, "language": null, "link": "https://www.youtube.com/watch?v=QuBxLOwDp_I", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/QuBxLOwDp_I/hqdefault.jpg", "title": "10 TERRIBLE Video Game Graphics of 2024 So Far", "user": null, "vote": 0}]