[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T23:53:39.211015+00:00",
        "description": "\"The U.S. government on Friday ordered testing of the nation's milk supply for bird flu,\" reports the Associated Press, \"to better monitor the spread of the virus in dairy cows.\"\n\n\nRaw or unpasteurized milk from dairy farms and processors nationwide must be tested on request starting Dec. 16, the Agriculture Department said. Testing will begin in six states &mdash; California, Colorado, Michigan, Mississippi, Oregon and Pennsylvania. \nOfficials said the move is aimed at \"containing and ultimately eliminating the virus,\" known as Type A H5N1, which was detected for the first time in March in U.S. dairy cows. Since then, more than 700 herds have been confirmed to be infected in 15 states. \"This will give farms and farmworkers better confidence in the safety of their animals and ability to protect themselves, and it will put us on a path to quickly controlling and stopping the virus' spread nationwide,\" Agriculture Secretary Tom Vilsack said in a statement. \n\nThe risk to people from bir",
        "id": 1660629,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/06/2330232/us-government-orders-nationwide-testing-of-milk-for-bird-flu-to-stop-the-viruss-spread?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Government Orders Nationwide Testing of Milk for Bird Flu to Stop the Virus's Spread",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T22:48:30.352539+00:00",
        "description": "Nuclear rods are traditionally clad in metal. But a U.S. energy company wants to develop a better, safer alternative that instead uses silicon carbide composites. Working with America's Energy Department, General Atomics Electromagnetic Systems just completed a 120-day irradiation testing period simulating the intense radiation and extreme temperatures (3,452F) of a pressurized water reactor in a real-world nuclear power plant. \n\nAnd the tests \"showed no significant mass change, indicating promising performance,\" the company said in a statement. \"This indicates that the SiGA cladding is exceptionally resistant to the damaging effects of radiation.\"\n\nLong-time Slashdot reader fahrbot-bot shared this report from the Interesting Engineering blog:\n\n\"This success is a key milestone on SiGA cladding's development path to enhance the safety of the existing U.S. fleet of light water reactors,\" added Scott Forney, president of GA-EMS. \"It could also do the same for the future generation of ad",
        "id": 1660340,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/06/2233231/new-nuclear-fuel-rods-endure-3452f-for-120-day-test-raising-hopes-for-safer-reactors?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Nuclear Fuel Rods Endure 3,452F For 120-Day Test, Raising Hopes for Safer Reactors",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T21:43:53.698356+00:00",
        "description": "\"Elon Musk's AI chatbot Grok is now available to free users on X,\" reports the Verge:\n\n\nSeveral users noticed the change on Friday, which gives non-Premium subscribers the ability to send up to 10 messages to Grok every two hours. \n\nxAI launched Grok last year as a \"humorous AI assistant,\" but it was only available to Premium subscribers... Making Grok more widely available might help it compete with the already-free chatbots like OpenAI's ChatGPT, Google Gemini, Microsoft Copilot, and Anthropic's Claude.\n\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=ElonMusk's+AI+Chatbot+'Grok'+is+Now+Free+to+All+X+Users%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F06%2F2053214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F12%2F06%2F2053214%2Felonmusks-ai-",
        "id": 1659947,
        "language": null,
        "link": "https://slashdot.org/story/24/12/06/2053214/elonmusks-ai-chatbot-grok-is-now-free-to-all-x-users?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "ElonMusk's AI Chatbot 'Grok' is Now Free to All X Users",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T20:38:58.757799+00:00",
        "description": "\"TikTok has lost its bid to strike down a law that could result in the platform being banned in the United States,\" reports CNN. \n\nA U.S. federal appeals court just unanimously ruled in favor of the new U.S. law requiring TikTok's China-based owners to either sell the app next month or face an effective ban in the United States.\n\nDenying TikTok's argument that the law was unconstitutional, the judges found that the law does not \"contravene the First Amendment to the Constitution of the United States,\" nor does it \"violate the Fifth Amendment guarantee of equal protection of the laws\"... After the [January 25] deadline, U.S. app stores and internet services could face hefty fines for hosting TikTok if it is not sold. (Under the legislation, President Biden may issue a one-time extension of the deadline.) \n\n In a statement, TikTok indicated it would appeal the decision. \"The Supreme Court has an established historical record of protecting Americans' right to free speech, and we expect ",
        "id": 1659615,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/06/1857243/tiktok-is-one-step-closer-to-being-banned-in-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "TikTok is One Step Closer to Being Banned in the US",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T19:33:48.522336+00:00",
        "description": "An anonymous reader shared this report from Phoronix:\n\n\nNew Linux patches from Huawei engineers are preparing new driver support for controlling High Bandwidth Memory (HBM) with the ARM-based Kunpeng high performance SoC... \n\n[I]t would appear there is a new Kunpeng SoC coming that will feature integrated High Bandwidth Memory (HBM).Unless I missed something, this Kunpeng SoC with HBM memory hasn't been formally announced yet and I haven't been able to find any other references short of pointing to prior kernel patches working on this HBM integration... It will be interesting to see what comes of Huawei Kunpeng SoCs with HBM memory and ultimately how well they perform against other AArch64 server processors as well as the Intel Xeon and AMD EPYC competition.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=+Linux+Preps+for+Kunpeng+ARM+Server+SoC+With+High+Bandwidth+Memory%3A+https%3A%2F%2Flinux.slashdot.org%2Fstory%",
        "id": 1659212,
        "language": null,
        "link": "https://linux.slashdot.org/story/24/12/06/1812208/linux-preps-for-kunpeng-arm-server-soc-with-high-bandwidth-memory?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": " Linux Preps for Kunpeng ARM Server SoC With High Bandwidth Memory",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T18:28:22.858446+00:00",
        "description": "An anonymous reader shared this report from Defense News:\nFollowing a pattern of undersea cable damage across European waters in the last year, with the most recent disruptions happening just weeks ago, top NATO officials have begun envisioning a capability that would allow the alliance to have permanent eyes above and under the waterline. In an interview with Defense News, Admiral Pierre Vandier, the alliance's Norfolk, Virginia-based commander for concepts and transformation, likened the idea to police CCTV cameras installed on street lights in urban trouble spots for recording evidence of crimes. \"The technology is there to make this street-lighting with USVs,\" he said, using the military's shorthand for unmanned surface vessel. Vandier said his team is in the early stages of developing an unmanned surface vessel fleet so that \"NATO can see and monitor daily its environment.\" \n\nThe first step would be to achieve this at a surface level, and then later under water... According to V",
        "id": 1658736,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/05/0528240/nato-considers-watching-undersea-internet-cables-with-a-fleet-of-unmanned-boats?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NATO Considers Watching Undersea Internet Cables with a Fleet of Unmanned Boats",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T17:23:52.006690+00:00",
        "description": "Thursday OpenAI released a \"smarter, faster\" ChatGPT. But there's still competition, notes the tech site Tom's Guide (which is liveblogging December's AI news). \"Not to be outdone by OpenAI, this week has seen several big announcements by other AI companies.\"\n\nGoogle Deepmind unveiled Genie 2, a tool capable of creating limitless 3D environments. It could create playable games based on a single text input. \n\nElevenLabs announced a new Conversational AI system. It's a voice bot meant to feel like you're making a phone call. Tom's Guide AI editor Ryan Morrison used it to clone his voice to act as technical support for his dad. \n\nOpenAI will probably announce an upgraded Sora video model in the coming days, but we were impressed by the new Hunyuan Video model that released a demo this week. Sora has some serious competition and we're interested in seeing how it competes.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=",
        "id": 1658325,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/06/0145252/google-other-openai-rivals-make-their-own-big-announcements?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google, Other OpenAI Rivals Make Their Own Big Announcements",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T16:18:25.875670+00:00",
        "description": "Mozilla's developer blog is announcing \"JavaScriptmas\".\n\n [F]rom December 1st to December 24th, we will release a fun, daily coding challenge for you to solve on [code-learning platform] Scrimba. Each challenge comes with an introductory screencast called \"scrim\", some starter code, and then it's your turn to fill in the gaps. \n\nJavaScriptmas is about coding, learning, and the chance to win exciting prizes. Two lucky coders will be chosen as winners at the end of JavaScriptmas, and each will win a MacBook Air M3, swag from MDN and Scrimba, and a lifetime Scrimba Pro membership (worth ~$200 per year). The Scrimba membership will give you access to all courses, including the Frontend Developer Career Path based on the MDN curriculum. \nMost of the challenges will evolve around JavaScript algorithms. You will also practice subjects like DOM manipulation, UI design, CSS, accessibility, and even a bit of cyber security. The challenges are a collaborative effort from Scrimba teachers, mento",
        "id": 1657832,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/04/0138255/mozilla-announces-javascriptmas---daily-coding-challenges-with-a-chance-at-prizes?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Mozilla Announces 'JavaScriptmas' - Daily Coding Challenges with a Chance at Prizes",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T13:03:14.648194+00:00",
        "description": "The Verge is applauding Hyundai's electric SUV, the IONIQ 5 for \"Fake shifting, real fun.\" And others agree. \"The Ioniq 5 N is also special for how it simulates the 'feel' of gear shifting,\" writes the blog Inside EVs, \"including the jolt and brief interruption in power that happens and the mechanical resistance that's normal upon downshifting. \n\n\"The Ioniq 5 N also simulates engine sounds through the speakers, will let you rev the 'engine' while parked and has a 'redline' you'll hit before you need to shift again. It's all great fun.\"\n\n[E]very single person who drives the Hyundai Ioniq 5 N, whether they're a die-hard EV person or the most hardcore electro-skeptic, absolutely loves it. And they love the fake shifting most of all... Shut up and embrace the fake EV shifting, you nerds. Find some joy in your life for once. \n\nAnd joy will definitely be on order with the new 2025 Kia EV6 GT. The U.S.-spec version of Kia's updated crossover made its debut [November 21] at the L.A. Auto Sho",
        "id": 1656409,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/04/0527208/do-electric-cars-offer-fake-shifting-real-fun?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Do Electric Cars Offer 'Fake Shifting, Real Fun'?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T08:43:01.485571+00:00",
        "description": "The use of lead in gasoline \"might have harmed the mental health of a generation,\" reports USA Today.\n\n\nGen X bears an extra burden of conditions such as depression, anxiety, ADHD and neurotic behavior because of the leaded gasoline they were exposed to as children, according to a study published Wednesday in the peer-reviewed Journal of Child Psychology and Psychiatry. Leaded gas was banned in the United States in 1996, but the study said years of exposure during development made them particularly vulnerable. \n\nLead gas peaked from the mid-1960s through the mid-1970s, and children born during that era would later develop some of the highest rates of mental health symptoms, the study said. The study also linked leaded gas to \"disadvantageous\" traits, such as struggling to concentrate, stay on task or organizing thoughts. \"I tend to think of Generation X as 'generation lead,'\" said Aaron Reuben, a study co-author and assistant professor of clinical neuropsychology at the University of",
        "id": 1655119,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/05/2356209/75-years-of-lead-in-gasoline-caused-150-million-mental-health-disorders-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "75 Years of Lead in Gasoline Caused 150 Million Mental Health Disorders, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T05:27:54.619115+00:00",
        "description": "\"Okay, we're doing this,\" begins a new announcement at The Verge:\n\nToday we're launching a Verge subscription that lets you get rid of a bunch of ads, gets you unlimited access to our top-notch reporting and analysis across the site and our killer premium newsletters, and generally lets you support independent tech journalism in a world of sponsored influencer content. It'll cost $7 / month or $50 / year &mdash; and for a limited time, if you sign up for the annual plan, we'll send you an absolutely stunning print edition of our CONTENT GOBLINS series, with very fun new photography and design... A surprising number of you have asked us to launch something like this, and we're happy to deliver. If you don't want to pay, rest assured that big chunks of The Verge will remain free &mdash; we're thinking about subscriptions a lot differently than everyone else... \n\nIf you're a Verge reader, you know we've been covering massive, fundamental changes to how the internet works for years now. ",
        "id": 1654481,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/04/1959245/the-verge-explains-why-after-13-years-its-offering-a-subscription-option-for-its-supporters?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The Verge Explains Why, After 13 Years, It's Offering a 'Subscription' Option for Its Supporters",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T03:19:05.819257+00:00",
        "description": "Wednesday OpenAI CEO Sam Altman announced \"12 Days of OpenAI,\" promising that \"Each weekday, we will have a livestream with a launch or demo...\" And sure enough, today he announced the launch of two things: \n- \"o1, the smartest model in the world. Smarter, faster, and more features (e.g. multimodality) than o1-preview. Live in ChatGPT now, coming to API soon.\" \n\n- \"ChatGPT Pro. $200/month. Unlimited usage and even-smarter mode for using o1. More benefits to come!\" \n\nAltman added this update later:\nFor extra clarity: o1 is available in our plus tier, for $20/month. With the new pro tier ($200/month), it can think even harder for the hardest problems. Most users will be very happy with o1 in the plus tier! \n VentureBeat points out that subscribers \"also gain access to GPT-4o, known for its advanced natural language generation capabilities, and the Advanced Voice feature for speech-based interactions.\" \n\nAnd even for non-subscribers, ChatGPT can now also analyze images, points out Ventu",
        "id": 1654121,
        "language": null,
        "link": "https://slashdot.org/story/24/12/06/0121217/openai-releases-smarter-faster-chatgpt---plus-200-a-month-subscriptions-for-even-smarter-mode?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI Releases 'Smarter, Faster' ChatGPT - Plus $200-a-Month Subscriptions for 'Even-Smarter Mode'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T01:10:23.430391+00:00",
        "description": "Today a group of German scientists presented data suggesting Earth is absorbing more sunlight than in the past, reports Ars Technica, \"largely due to reduced cloud cover.\"\n\n\nWe can measure both the amount of energy the Earth receives from the Sun and how much energy it radiates back into space.... The new paper finds that the energy imbalance set a new high in 2023, with a record amount of energy being absorbed by the ocean/atmosphere system. This wasn't accompanied by a drop in infrared emissions from the Earth, suggesting it wasn't due to greenhouse gases, which trap heat by absorbing this radiation. Instead, it seems to be due to decreased reflection of incoming sunlight by the Earth.... \n\nUsing two different data sets, the teams identify the areas most effected by this, and they're not at the poles, indicating loss of snow and ice are unlikely to be the cause. Instead, the key contributor appears to be the loss of low-level clouds [particularly over the Atlantic ocean]... The dro",
        "id": 1653636,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/05/2324206/earth-began-absorbing-more-sunlight-in-2023-climate-researchers-find?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Earth Began Absorbing More Sunlight in 2023, Climate Researchers Find",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T00:02:59.847674+00:00",
        "description": "Wednesday Cuba's energy grid collapsed, \"leaving millions without power,\" CNN reported, calling it \"the latest in a series of failures on an island struggling from creaking infrastructure, natural disasters and economic turmoil.\" \n\nToday Reuters reports:\n\n Cuba said it had reconnected its national electrical grid on Thursday, though generation remained well below demand one day after a plant failure knocked out power to millions across the island... Around half of Cuba's power generation facilities are offline for maintenance or broken down. All are decades old and producing well under capacity. \n\nAs a result, a majority of Cuba's residents suffer hours-long, rolling blackouts on a daily basis even when the grid is functional. Cuba's electrical grid has been on the brink of collapse for years, as fuel shortages, a string of natural disasters and an economic crisis have left the island's government unable to maintain the system's decrepit infrastructure. Dwindling oil imports from Ven",
        "id": 1653394,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/05/220211/millions-of-cubans-had-another-power-outage-wednesday?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Millions of Cubans Had Another Power Outage Wednesday",
        "vote": 0
    }
]