[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T19:00:15+00:00",
        "description": "Path of Exile 2 is more than just a follow-up with a fun new campaign, numerous enemy types, and gorgeous visuals. It's also a straight-up feast of new options for character-building and customization. The different types of Skill Gems and the gargantuan Passive Tree, enable many different ways to play. \n\nAnd best of all, the chances of bricking your build are far lower with easier respeccing and the lack of linking and recoloring sockets. Path of Exile 2 isn't flawless - there are some bugs, ranging from the annoying to the gameplay-affecting. However, make no mistake - it's the new king of action RPGs, and early access is simply the road to claiming its rightful throne.",
        "id": 1659253,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Gi2oN-2aYtE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/Gi2oN-2aYtE/hqdefault.jpg",
        "title": "I've Played Over 50 HOURS of Path of Exile 2 - Early Access Review",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T15:30:01+00:00",
        "description": "With stealth gameplay, immersive sim elements, first person melee brawling, semi-open world exploration, and adventure game style puzzling and exploration all wrapped up together in a single experience, Indiana Jones and the Great Circle has a lot going on- though thankfully, MachineGames’ newly released title does a great job of cohesively tying all of its different elements together. \n\nEven so, as players dive into its offerings, there will be plenty to learn about, get to grips with, and master, so to help you ease into things in your early hours with the game, here, we have compiled a few basic tricks and tips. From exploration and combat to progression and more, these handy pointers will aid you in numerous ways.",
        "id": 1657874,
        "language": null,
        "link": "https://www.youtube.com/watch?v=2hWZKD-1im4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2hWZKD-1im4/hqdefault.jpg",
        "title": "15 Things I Wish I Knew Before Playing Indiana Jones And The Great Circle",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T13:30:37+00:00",
        "description": "MachineGames of Wolfenstein fame is back again with Indiana Jones and the Great Circle, a new action-adventure game that’s all about exploring dig sites and making your way through thrilling fights. \n\nThe game is built on the same id Tech engine that powered DOOM Eternal, which has been upgraded in some respects for a new generation of hardware. \n\nThe game also marks a sharp departure from what the developer is known for, so how does it all fare? How does the developer achieve this image quality on consoles and how does the 60fps claims stand? \n\nWith this video, we will be taking a look at just that as we break down individual aspects of the presentation along with graphical comparisons between Xbox Series X and PC.",
        "id": 1656900,
        "language": null,
        "link": "https://www.youtube.com/watch?v=rNZmOYsLK8E",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/rNZmOYsLK8E/hqdefault.jpg",
        "title": "Indiana Jones And The Great Circle Xbox Series X vs PC Graphics - An Almost Flawless Experience",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-06T00:00:24+00:00",
        "description": "Indiana Jones and the Great Circle is a triumph for MachineGames, Bethesda, and Xbox in every way possible, and easily the best thing this IP has produced in over three decades. \n\nThe Great Circle feels like the true successor to the original movie. Not only does it perfectly create an authentic Indiana Jones adventure, it’s also an accomplished game in its own right, boasting chaotic combat, engaging stealth, compelling exploration, satisfying puzzles, and excellent level design. \n\nWithout a doubt, it’s the best first-party Xbox game released in some time, while also probably being MachineGames’ best game yet- which, looking at the studio’s track record, is saying something.",
        "id": 1653415,
        "language": null,
        "link": "https://www.youtube.com/watch?v=NcKx82ZASsc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/NcKx82ZASsc/hqdefault.jpg",
        "title": "Indiana Jones And The Great Circle Review - Finally, A Huge Win For Xbox And Microsoft",
        "vote": 0
    }
]