[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T23:28:53.345724+00:00", "description": "Starting this week millions will see AI-generated answers in Google's search results by default. But the announcement Tuesday at Google's annual developer conference suggests a future that's \"not without its risks, both to users and to Google itself,\" argues the Washington Post:\n\n\nFor years, Google has been shielded for liability for linking users to bad, harmful or illegal information by Section 230 of the Communications Decency Act. But legal experts say that shield probably won't apply when its AI answers search questions directly. \"As we all know, generative AIs hallucinate,\" said James Grimmelmann, professor of digital and information law at Cornell Law School and Cornell Tech. \"So when Google uses a generative AI to summarize what webpages say, and the AI gets it wrong, Google is now the source of the harmful information,\" rather than just the distributor of it... \n\n Adam Thierer, senior fellow at the nonprofit free-market think tank R Street, worries that innovation could be th", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/18/053250/are-ai-generated-search-results-still-protected-by-section-230?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Are AI-Generated Search Results Still Protected by Section 230?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T22:23:52.287703+00:00", "description": "Ars Technica looks at what happened after Google's answer to Amazon's cloud service \"accidentally deleted a giant customer account for no reason...\" \n\n\"[A]ccording to UniSuper's incident log, downtime started May 2, and a full restoration of services didn't happen until May 15.\"\n\nUniSuper, an Australian pension fund that manages $135 billion worth of funds and has 647,000 members, had its entire account wiped out at Google Cloud, including all its backups that were stored on the service... UniSuper's website is now full of must-read admin nightmare fuel about how this all happened. First is a wild page posted on May 8 titled \"A joint statement from UniSuper CEO Peter Chun, and Google Cloud CEO, Thomas Kurian....\" Google Cloud is supposed to have safeguards that don't allow account deletion, but none of them worked apparently, and the only option was a restore from a separate cloud provider (shoutout to the hero at UniSuper who chose a multi-cloud solution)... The many stakeholders in ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/18/1842259/how-an-unprecedented-google-cloud-event-wiped-out-a-major-customers-account?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How an 'Unprecedented' Google Cloud Event Wiped Out a Major Customer's Account", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T21:21:27.356280+00:00", "description": "An anonymous reader shared this report from Automotive News:\n\n Automotive News recently reported that eight automakers sent vehicle location data to police without a court order or warrant. The eight companies told senators that they provide police with data when subpoenaed, getting a rise from several officials. \n\nBMW, Kia, Mazda, Mercedes-Benz, Nissan, Subaru, Toyota, and Volkswagen presented their responses to lawmakers. Senators Ron Wyden from Oregon and Ed Markey from Massachusetts penned a letter to the Federal Trade Commission, urging investigative action. \"Automakers have not only kept consumers in the dark regarding their actual practices, but multiple companies misled consumers for over a decade by failing to honor the industry's own voluntary privacy principles,\" they wrote. \n\nTen years ago, all of those companies agreed to the Consumer Privacy Protection Principles, a voluntary code that said automakers would only provide data with a warrant or order issued by a court. Sub", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/18/0414236/eight-automakers-grilled-by-us-lawmakers-over-sharing-of-connected-car-data-with-police?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Eight Automakers Grilled by US Lawmakers Over Sharing of Connected Car Data With Police", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T20:16:24.215972+00:00", "description": "\"Albert Einstein was right,\" reports CNN. \"There is an area at the edge of black holes where matter can no longer stay in orbit and instead falls in, as predicted by his theory of gravity.\" \n\nThe proof came by combining NASA's earth-orbiting NuSTAR telescope with the NICER telescope on the International Space Station to detect X-rays:\n\nA team of astronomers has for the first time observed this area &mdash; called the \"plunging region\" &mdash; in a black hole about 10,000 light-years from Earth. \"We've been ignoring this region, because we didn't have the data,\" said research scientist Andrew Mummery, lead author of the study published Thursday in the journal Monthly Notices of the Royal Astronomical Society. \"But now that we do, we couldn't explain it any other way.\" \n\nMummery &mdash; also a Fellow in Oxford's physics department &mdash; told CNN, \"We went out searching for this one specifically &mdash; that was always the plan. We've argued about whether we'd ever be able to find it f", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/18/1541243/study-confirms-einstein-prediction-black-holes-have-a-plunging-region?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Study Confirms Einstein Prediction:  Black Holes Have a 'Plunging Region'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T19:11:21.119142+00:00", "description": "\"We're migrating domains in batches...\" announced web-hosting company Squarespace earlier this month. \n\n\"Squarespace has entered into an agreement to become the new home for Google Domains customers. When your domain transitions from Google to Squarespace, you'll become a Squarespace customer and manage your domain through an account with us.\" \n\nSlashdot reader shortyadamk shares an email sent today to a Google Domains customer:\n\n\"Today your domain, xyz.com, migrated from Google Domains to Squarespace Domains. \n\n\"Your WHOIS contact details and billing information (if applicable) were migrated to Squarespace. Your DNS configuration remains unchanged. \n\n\"Your migrated domain will continue to work with Google Services such as Google Search Console. To support this, your account now has a domain verification record &mdash; one corresponding to each Google account that currently has access to the domain.\"\n<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?s", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/18/1758253/google-domains-starts-migrating-to-squarespace?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Google Domains' Starts Migrating to Squarespace", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T18:06:18.429359+00:00", "description": "America's Defense Department \"is rushing to expand its capacity to wage war in space,\" reports the New York Times, \"convinced that rapid advances by China and Russia in space-based operations pose a growing threat to U.S. troops and other military assets on the ground and U.S. satellites in orbit.\"\n\n[T]he Defense Department is looking to acquire a new generation of ground- and space-based tools that will allow it to defend its satellite network from attack and, if necessary, to disrupt or disable enemy spacecraft in orbit, Pentagon officials have said in a series of interviews, speeches and recent statements... [T]he move to enhance warfighting capacity in space is driven mostly by China's expanding fleet of military tools in space... [U.S. officials are] moving ahead with an effort they are calling \"responsible counterspace campaigning,\" an intentionally ambiguous term that avoids directly confirming that the United States intends to put its own weapons in space. But it also is meant", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/18/0559212/is-americas-defense-department-rushing-to-expand-its-space-war-capabilities?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is America's Defense Department 'Rushing to Expand' Its Space War Capabilities?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T17:01:16.444282+00:00", "description": "Bloomberg reports that self-driving car company Cruise \"reached an $8 million to $12 million settlement with a pedestrian who was dragged by one of its self-driving vehicles in San Francisco, according to a person familiar with the situation.\"\n\nThe settlement was struck earlier this year and the woman is out of the hospital, said the person, who declined to be identified discussing a private matter. In the October incident, the pedestrian crossing the road was struck by another vehicle before landing in front of one of GM's Cruise vehicles. The robotaxi braked hard but ran over the person. It then pulled over for safety, driving 20 feet at a speed of up to seven miles per hour with the pedestrian still under the car. \n\n\n The incident \"contributed to the company being blocked from operating in San Francisco and halting its operations around the country for months,\" reports the Washington Post:\n\nThe company initially told reporters that the car had stopped just after rolling over the pe", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/18/023251/cruise-reached-an-8m-settlement-with-the-person-dragged-under-its-robotaxi?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cruise Reached an $8M+ Settlement With the Person Dragged Under Its Robotaxi", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T15:56:15.881742+00:00", "description": "Security professional Bruce Schneier argues that large language models have the same vulnerability as phones in the 1970s exploited by John Draper. \n\n\"Data and control used the same channel,\" Schneier writes in Communications of the ACM. \"That is, the commands that told the phone switch what to do were sent along the same path as voices.\"\n\n\nOther forms of prompt injection involve the LLM receiving malicious instructions in its training data. Another example hides secret commands in Web pages. Any LLM application that processes emails or Web pages is vulnerable. Attackers can embed malicious commands in images and videos, so any system that processes those is vulnerable. Any LLM application that interacts with untrusted users &mdash; think of a chatbot embedded in a website &mdash; will be vulnerable to attack. It's hard to think of an LLM application that isn't vulnerable in some way. \n\nIndividual attacks are easy to prevent once discovered and publicized, but there are an infinite nu", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/18/0336219/bruce-schneier-reminds-llm-engineers-about-the-risks-of-prompt-injection-vulnerabilities?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Bruce Schneier Reminds LLM Engineers About the Risks of Prompt Injection Vulnerabilities", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T14:51:24.137641+00:00", "description": "A blind worker for the National Federation of the Blind said Sonos had a reputation for making products usable for people with disabilities, but that \"Overnight they broke that trust,\" according to the Washington Post. \nThey're not the only angry customers about the latest update to Sonos's wireless speaker system. The newspaper notes that nonprofit worker Charles Knight is \"among the Sonos die-hards who are furious at the new app that crippled their options to stream music, listen to an album all the way through or set a morning alarm clock.\"\n\n\nAfter Sonos updated its app last week, Knight could no longer set or change his wake-up music alarm. Timers to turn off music were also missing. \"Something as basic as an alarm is part of the feature set that users have had for 15 years,\" said Knight, who has spent thousands of dollars on six Sonos speakers for his bedroom, home office and kitchen. \"It was just really badly thought out from start to finish.\" Some people who are blind also comp", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/18/0125202/facing-angry-users-sonos-promises-to-fix-flaws-and-restore-removed-features?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Facing Angry Users, Sonos Promises to Fix Flaws and Restore Removed Features", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T13:46:09.586929+00:00", "description": "An anonymous reader quotes a report from The New York Times: There's a big debate in the tech world over whether artificial intelligence models should be \"open source.\" Elon Musk, who helped found OpenAI in 2015, sued the startup and its chief executive, Sam Altman, on claims that the company had diverged from its mission of openness. The Biden administration is investigating the risks and benefits of open source models. Proponents of open source A.I. models say they're more equitable and safer for society, while detractors say they are more likely to be abused for malicious intent. One big hiccup in the debate? There's no agreed-upon definition of what open source A.I. actually means. And some are accusing A.I. companies of \"openwashing\" -- using the \"open source\" term disingenuously to make themselves look good. (Accusations of openwashing have previously been aimed at coding projects that used the open source label too loosely.)\n \nIn a blog post on Open Future, a European think tan", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/18/0052228/openwashing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Openwashing'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T07:15:54.892700+00:00", "description": "After Adobe threatened legal action, the Delta Emulator said it'll abandon its current logo for a different, yet-to-be-revealed mark. The issue centers around Delta's stylized letter \"D\", which the digital media giant says is too similar to its stylized letter \"A\". The Verge reports: On May 7th, Adobe's lawyers reached out to Delta with a firm but kindly written request to go find a different icon, an email that didn't contain an explicit threat or even use the word infringement -- it merely suggested that Delta might \"not wish to confuse consumers or otherwise violate Adobe's rights or the law.\" But Adobe didn't wait for a reply. On May 8th, one day later, Testut got another email from Apple that suggested his app might be at risk because Adobe had reached out to allege Delta was infringing its intellectual property rights.\n \n\"We responded to both Apple and Adobe explaining our icon was a stylized Greek letter delta -- not an A -- but that we would update the Delta logo anyway to avo", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/18/0041202/the-delta-emulator-is-changing-its-logo-after-adobe-threatened-it?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Delta Emulator Is Changing Its Logo After Adobe Threatened It", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T04:00:48.677369+00:00", "description": "An anonymous reader quotes a report from The Guardian: Proteins in the blood could warn people of cancer more than seven years before it is diagnosed, according to research [published in the journal Nature Communications]. Scientists at the University of Oxford studied blood samples from more than 44,000 people in the UK Biobank, including over 4,900 people who subsequently had a cancer diagnosis. They compared the proteins of people who did and did not go on to be diagnosed with cancer and identified 618 proteins linked to 19 types of cancer, including colon, lung, non-Hodgkin lymphoma and liver.\n \nThe study, funded by Cancer Research UK and published in Nature Communications, also found 107 proteins associated with cancers diagnosed more than seven years after the patient's blood sample was collected and 182 proteins that were strongly associated with a cancer diagnosis within three years. The authors concluded that some of these proteins could be used to detect cancer much earlier ", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/17/2333246/proteins-in-blood-could-provide-early-cancer-warning-by-more-than-seven-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Proteins In Blood Could Provide Early Cancer Warning 'By More Than Seven Years'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T01:50:44.668121+00:00", "description": "Karl Bode writes via Techdirt: Tired of being underserved and overbilled by shitty regional broadband monopolies, back in 2002 a coalition of local Utah governments formed UTOPIA -- (the Utah Telecommunication Open Infrastructure Agency). The inter-local agency collaborative venture then set about building an \"open access\" fiber network that allows any ISP to then come and compete on the shared network. Two decades later and the coalition just announced that 18 different ISPs now compete for Utah resident attention over a network that now covers 21 different Utah cities. In many instances, ISPs on the network are offering symmetrical (uncapped) gigabit fiber for as little as $45 a month (plus $30 network connection fee, so $75). Some ISPs are even offering symmetrical 10 Gbps fiber for around $150 a month: \"Sumo Fiber, a veteran member of the UTOPIA Open Access Marketplace, is now offering 10 Gbps symmetrical for $119, plus a $30 UTOPIA Fiber infrastructure fee, bringing the total cos", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/17/2325202/utah-locals-are-getting-cheap-10-gbps-fiber-thanks-to-local-governments?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Utah Locals Are Getting Cheap 10 Gbps Fiber Thanks To Local Governments", "user": null, "vote": 0}]