[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T18:30:16+00:00", "description": "Ghost of Tsushima was originally released on the PS4 back in 2020, with a multiplayer mode following shortly afterwards. A year later, a Director’s Cut version was released, featuring new DLC, and enhanced visuals for the PS5. Almost three years later, Ghost of Tsushima Director’s Cut is out now on PC, complete with its DLC as well as multiplayer mode intact. \n\nContinuing Sony’s trend, Ghost of Tsushima Director’s Cut is an excellent PC port, with plenty of graphics options for players to tinker around with. The game also manages to scale well with lower-end hardware, and even the Steam Deck is able to play it well enough with some tweaking.", "language": null, "link": "https://www.youtube.com/watch?v=SGOP3JEdZ3M", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/SGOP3JEdZ3M/hqdefault.jpg", "title": "Ghost of Tsushima PC Review - One of the Best PlayStation Ports Yet", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T16:00:06+00:00", "description": "A few years ago, it would have been questionable for anything Destiny 2-related to be a big deal. That changed somewhat with the launch of The Witch Queen, but it's certainly the case for The Final Shape, the next expansion for Bungie's looter shooter.\n\nLaunching on June 4th for Xbox One, Xbox Series X/S, PS4, PS5 and PC, it marks the conclusion of the Light and Darkness saga - a story which haphazardly began in 2014 with the first game's launch. Players will finally venture inside the Traveller to fight The Witness, but that's not all. Wielding the power of Light and Darkness for the first time, customizing one's build with more freedom than ever - a lot is changing.\n\nPerhaps more than anything, Destiny 2: The Final Shape is a big deal because it could determine Bungie's future and whether it will remain the same under Sony or not.", "language": null, "link": "https://www.youtube.com/watch?v=7yXXNqmZH1A", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/7yXXNqmZH1A/hqdefault.jpg", "title": "Destiny 2: The Final Shape Is One of The Biggest Games of The Year - Here's Why", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-18T13:30:03+00:00", "description": "Red Dead Redemption 2 is Rockstar’s more immersive game to date, and its unfathomable level of minute detail bodes well for Grand Theft Auto 6. Arthur Morgan’s treks through the Old West though are replete with microscopic detail and world building elements that even now some five and a half years later is still up there as one of the most realistic games ever.\n\nMany of the details in this video you might have stumbled across yourself, but some are so missable it’s a wonder Rockstar included them at all. Presumably, they didn’t want to leave anything out that’d ruin the immersion. Whilst 18 are included in this feature, there’s so much detail to explore in Red Dead Redemption 2 we could easily run entries for this feature into the hundreds.", "language": null, "link": "https://www.youtube.com/watch?v=BXQ_W7cJrnU", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/BXQ_W7cJrnU/hqdefault.jpg", "title": "18 MIND-BLOWING Red Dead Redemption 2 Details You May Not Have Seen", "user": null, "vote": 0}]