[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T22:59:14.357783+00:00", "description": "An anonymous reader shared this report from the Associated Press:\n\nAn investigation into a ransomware attack earlier this month on London hospitals by the Russian group Qilin could take weeks to complete, the country's state-run National Health Service said Friday, as concerns grow over a reported data dump of patient records. Hundreds of operations and appointments are still being canceled more than two weeks after the June 3 attack on NHS provider Synnovis, which provides pathology services primarily in southeast London... \n\nNHS England said Friday that it has been \"made aware\" that data connected to the attack have been published online. According to the BBC, Qilin shared almost 400GB of data, including patient names, dates of birth and descriptions of blood tests, on their darknet site and Telegram channel... According to Saturday's edition of the Guardian newspaper, records covering 300 million patient interactions, including the results of blood tests for HIV and cancer, were st", "id": 759885, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/22/209244/data-dump-of-patient-records-possible-after-uk-hospital-breach?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Data Dump of Patient Records Possible After UK Hospital Breach", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T21:54:21.059785+00:00", "description": "In 2022, Red Hat announced plans to extend RHEL to the automotive industry through Red Hat In-Vehicle Operating System (providing automakers with an open and functionally-safe platform). And this week Red Hat announced it achieved ISO 26262 ASIL-B certification from exida for the Linux math library (libm.so glibc) &mdash; a fundamental component of that Red Hat In-Vehicle Operating System. \n\n\nFrom Red Hat's announcement:\nThis milestone underscores Red Hat's pioneering role in obtaining continuous and comprehensive Safety Element out of Context certification for Linux in automotive... This certification demonstrates that the engineering of the math library components individually and as a whole meet or exceed stringent functional safety standards, ensuring substantial reliability and performance for the automotive industry. The certification of the math library is a significant milestone that strengthens the confidence in Linux as a viable platform of choice for safety related automoti", "id": 759762, "language": "en-us", "link": "https://linux.slashdot.org/story/24/06/22/2135212/red-hats-rhel-based-in-vehicle-os-attains-milestone-safety-certification?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Red Hat's RHEL-Based In-Vehicle OS Attains Milestone Safety Certification", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T20:49:34.901361+00:00", "description": "The Linux Foundation's \"Open Source Security Foundation\" (or OpenSSF) is a cross-industry forum to \"secure the development, maintenance, and consumption of the open source software\". And now the OpenSSF has launched a new mailing list \"which aims to monitor the threat landscape of open-source project vulnerabilities,\" reports I Programmer, \"in order to provide real time alerts to anyone subscribed.\" \n\n The Record explains its origins:\n OpenSSF General Manager Omkhar Arasaratnam said that at a recent open source event, members of the community ran a tabletop exercise where they simulated a security incident involving the discovery of a zero-day vulnerability. They worked their way through the open source ecosystem &mdash; from cloud providers to maintainers to end users &mdash; clearly defining how the discovery of a vulnerability would be dealt with from top to bottom. But one of the places where they found a gap is in the dissemination of information widely. \n\n\"What we lack within th", "id": 759549, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/22/0357221/linux-foundations-open-source-security-foundation-launches-new-threat-intelligence-mailing-list?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Linux Foundation's 'Open Source Security Foundation' Launches New Threat Intelligence Mailing List", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T19:44:09.916125+00:00", "description": "An anonymous reader shared this report from Computer Weekly:\n\n\nMicrosoft has admitted to Scottish policing bodies that it cannot guarantee the sovereignty of UK policing data hosted on its hyperscale public cloud infrastructure, despite its systems being deployed throughout the criminal justice sector. \n\nAccording to correspondence released by the Scottish Police Authority (SPA) under freedom of information (FOI) rules, Microsoft is unable to guarantee that data uploaded to a key Police Scotland IT system &mdash; the Digital Evidence Sharing Capability (DESC) &mdash; will remain in the UK as required by law. While the correspondence has not been released in full, the disclosure reveals that data hosted in Microsoft's hyperscale public cloud infrastructure is regularly transferred and processed overseas; that the data processing agreement in place for the DESC did not cover UK-specific data protection requirements; and that while the company has the ability to make technical changes to", "id": 759384, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/22/1910243/microsoft-admits-no-guarantee-of-sovereignty-for-uk-policing-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Admits No Guarantee of Sovereignty For UK Policing Data", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T18:39:02.158429+00:00", "description": "\"A good portion of my home directory got deleted,\" complained a bug report for systemd filed last week. It requested an update to a flag for the systemd-tmpfiles tool which cleans up files and directories: \"a huge warning next to --purge. This option is dangerous, so it should be made clear that it's dangerous.\" \n\n The Register explains:\nAs long as five years ago, systemd-tmpfiles had moved on past managing only temporary files &mdash; as its name might suggest to the unwary. Now it manages all sorts of files created on the fly ... such as things like users' home directories. If you invoke the systemd-tmpfiles --purge command without specifying that very important config file which tells it which files to handle, version 256 will merrily purge your entire home directory. \n\nThe bug report first drew a cool response from systemd developer Luca Boccassi of Microsoft:\n\nSo an option that is literally documented as saying \"all files and directories created by a tmpfiles.d/ entry will be del", "id": 759217, "language": "en-us", "link": "https://linux.slashdot.org/story/24/06/22/0444257/systemd-2561-addresses-complaint-that-systemd-tmpfiles-could-unexpectedly-delete-your-home-directory?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Systemd 256.1 Addresses Complaint That 'systemd-tmpfiles' Could Unexpectedly Delete Your<nobr> <wbr></nobr>/home Directory", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T18:39:00.525352+00:00", "description": "The artificial intelligence revolution will demand more electricity, warns the Washington Post. \"Much more...\" \n\nThey warn that the \"voracious\" electricity consumption of AI is driving an expansion of fossil fuel use in America &mdash; \"including delaying the retirement of some coal-fired plants.\"\n\n\nAs the tech giants compete in a global AI arms race, a frenzy of data center construction is sweeping the country. Some computing campuses require as much energy as a modest-sized city, turning tech firms that promised to lead the way into a clean energy future into some of the world's most insatiable guzzlers of power. Their projected energy needs are so huge, some worry whether there will be enough electricity to meet them from any source... A ChatGPT-powered search, according to the International Energy Agency, consumes almost 10 times the amount of electricity as a search on Google. One large data center complex in Iowa owned by Meta burns the annual equivalent amount of power as 7 mil", "id": 759216, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/22/0616231/big-techs-ai-datacenters-demand-electricity-are-they-increasing-use-of-fossil-fuels?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Big Tech's AI Datacenters Demand Electricity. Are They Increasing Use of Fossil Fuels?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T17:34:04.860257+00:00", "description": "An anonymous reader shared this report from CNBC:\n\nGilead's experimental twice-yearly medicine to prevent HIV was 100% effective in a late-stage trial, the company said Thursday. None of the roughly 2,000 women in the trial who received the lenacapavir shot had contracted HIV by an interim analysis, prompting the independent data monitoring committee to recommend Gilead unblind the Phase 3 trial and offer the treatment to everyone in the study. Other participants had received standard daily pills. \n\nThe company expects to share more data by early next year, the article adds, and if its results are positive, the company could bring its drug to the market as soon as late 2025. (By Fridayt the company's stock price had risen nearly 12%.) \nThere's already other HIV-preventing options, the article points out, but they're taken by \"only a little more than one-third of people in the U.S. who could benefit...according to data from the Centers for Disease Control and Prevention.\" Part of the p", "id": 758990, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/22/054242/gileads-twice-yearly-shot-to-prevent-hiv-succeeds-in-late-stage-trial?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Gilead's Twice-Yearly Shot to Prevent HIV Succeeds in Late-Stage Trial", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T16:29:01.634534+00:00", "description": "Where is dark matter, the invisible masses which must exist to bind galaxies together? Stephen Hawking postulated they could be hiding in \"primordial\" black holes formed during the big bang, writes CNN. \n\n\"Now, a new study by researchers with the Massachusetts Institute of Technology has brought the theory back into the spotlight, revealing what these primordial black holes were made of and potentially discovering an entirely new type of exotic black hole in the process.\"\n\n Other recent studies have confirmed the validity of Hawking's hypothesis, but the work of [MIT graduate student Elba] Alonso-Monsalve and [study co-author David] Kaiser, a professor of physics and the Germeshausen Professor of the History of Science at MIT, goes one step further and looks into exactly what happened when primordial black holes first formed. The study, published June 6 in the journal Physical Review Letters, reveals that these black holes must have appeared in the first quintillionth of a second of t", "id": 758776, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/22/032249/dark-matter-found-new-study-furthers-stephen-hawkings-predictions-about-primordial-black-holes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Dark Matter Found? New Study Furthers Stephen Hawking's Predictions About 'Primordial' Black Holes", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T15:24:13.932117+00:00", "description": "Slashdot reader DevNull127 writes:\n\nA free and open source ChatGPT clone &mdash; named LibreChat &mdash; is also letting its users choose which AI model to use, \"to harness the capabilities of cutting-edge language models from multiple providers in a unified interface\". This means LibreChat includes OpenAI's models, but also others &mdash; both open-source and closed-source &mdash; and its website promises \"seamless integration\" with AI services from OpenAI, Azure, Anthropic, and Google &mdash; as well as GPT-4, Gemini Vision, and many others. (\"Every AI in one place,\" explains LibreChat's home page.) Plugins even let you make requests to DALL-E or Stable Diffusion for image generations. (LibreChat also offers a database that tracks \"conversation state\" &mdash; making it possible to switch to a different AI model in mid-conversation...) \n\nReleased under the MIT License, LibreChat has become \"an open source success story,\" according to this article, representing \"the passionate communi", "id": 758575, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/22/0219238/open-source-chatgpt-clone-librechat-lets-you-use-every-ai-service---while-owning-your-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Open Source ChatGPT Clone 'LibreChat' Lets You Use Every AI Service - While Owning Your Data", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T13:13:04.531420+00:00", "description": "An anonymous reader quotes a report from Cord Cutters News: Earlier this week, Chicken Soup For The Soul, the parent company behind Redbox, Crackel, and the streaming service by the same name, announced that the entire board of directors and board of managers of each subsidiary of the Company other than William J. Rouhana, Jr., have been fired. This comes as a holder of more than 75% of the voting power of the company used his stock holdings to lay off the Company's board of directors. Now, it has come out that the company missed a $4 million payment to NBCUniversal as a part of its settlement over unpaid royalties. Now it faces a possible order to pay all of $16.7 million it owes NBCUniversal as questions about the future of the company grows. This comes after NBCUniversal sued saying Redbox had not been paying royalties. It agreed to a payment plan but now has missed the first payment of the plan.\n \nRecently the company has been hit hard by the decline in ad revenue on its free stre", "id": 758094, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/22/0012206/redbox-fails-to-pay-4-million-to-nbcuniversal-as-it-fires-its-board?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Redbox Fails To Pay $4 Million To NBCUniversal As It Fires Its Board", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T11:03:00.266042+00:00", "description": "Jonathan O'Callaghan reports via Scientific American: Despite more than a century of efforts to show otherwise, it seems Albert Einstein can still do no wrong. Or at least that's the case for his special theory of relativity, which predicts that time ticks slower for objects moving at extremely high speeds. Called time dilation, this effect grows in intensity the closer to the speed of light that something travels, but it is strangely subjective: a passenger on an accelerating starship would experience time passing normally, but external observers would see the starship moving ever slower as its speed approached that of light. As counterintuitive as this effect may be, it has been checked and confirmed in the motions of everything from Earth-orbiting satellites far-distant galaxies. Now a group of scientists have taken such tests one step further by observing more than 1,500 supernovae across the universe to reveal time dilation's effects on a staggering cosmic scale. The researchers'", "id": 757655, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/22/005243/supernova-slowdowns-confirm-einsteins-predictions-of-time-dilation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Supernova Slowdowns Confirm Einstein's Predictions of Time Dilation", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T07:47:54.195989+00:00", "description": "Justine Calma writes via The Verge: A group of young plaintiffs reached a historic climate settlement with the state of Hawaii and Hawaii Department of Transportation in a deal that will push the state to clean up tailpipe pollution. The 13 youth plaintiffs filed suit in 2022 when they were all between the ages of 9 and 18. In the suit, Navahine F. v. Hawaii Department of Transportation (HDOT), they alleged that the state and HDOT had violated their right to \"a clean and healthful environment,\" which is enshrined in Hawaii's constitution.\n \nThe settlement (PDF), reached on Thursday, affirms that right and commits the DOT to creating a plan to reach zero greenhouse gas emissions from transportation by 2045. To hit that goal, the state will have to dedicate at least $40 million to building out its EV charging network by the end of the decade and complete new pedestrian, bicycle, and transit networks over the next five years. The settlement also creates a new unit within HDOT tasked with", "id": 757118, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/21/2345237/youth-plaintiffs-in-hawaii-reach-historic-climate-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Youth Plaintiffs In Hawaii Reach Historic Climate Deal", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T05:37:59.007336+00:00", "description": "Filipe Esposito reports via 9to5Mac: When Apple introduced AirPods in 2016, the company also unveiled a new, easy and intuitive way to pair wireless accessories to iPhone and iPad. Rather than having to go to Bluetooth settings and press buttons, the system identifies the accessory nearby and prompts the user to pair it. With iOS 18, this quick pairing process will be available for the first time to accessory makers.\n \nCalled AccessorySetupKit, the new API gives third-party accessories the same setup experience as Apple accessories such as AirPods and AirTag. As soon as the iPhone or iPad running iOS 18 with the right app detects a compatible accessory, it will show the user a popup to confirm pairing with that device. With just a tap, the system will automatically handle all the Bluetooth or Wi-Fi connectivity required by the accessory. This also means that users will no longer have to manually give Bluetooth and Wi-Fi permissions individually to that accessory's app.\n \nIf the access", "id": 756535, "language": "en-us", "link": "https://apple.slashdot.org/story/24/06/21/223219/ios-18-brings-airpods-setup-experience-to-third-party-accessories?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "iOS 18 Brings AirPods Setup Experience To Third-Party Accessories", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T05:37:56.702405+00:00", "description": "OpenAI CTO Mira Murati isn't worried about how AI could hurt some creative jobs, suggesting during a talk that some jobs were maybe always a bit replaceable anyway. From a report: \"I think it's really going to be a collaborative tool, especially in the creative spaces,\" Murati told Darmouth University Trustee Jeffrey Blackburn during a conversation about AI hosted at the university's engineering department. \"Some creative jobs maybe will go away, but maybe they shouldn't have been there in the first place,\" the CTO said of AI's role in the workplace. \"I really believe that using it as a tool for education, [and] creativity, will expand our intelligence.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+CTO%3A+AI+Could+Kill+Some+Creative+Jobs+That+Maybe+Shouldn't+Exist+Anyway%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F06%2F22%2F021232%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.pn", "id": 756534, "language": "en-us", "link": "https://slashdot.org/story/24/06/22/021232/openai-cto-ai-could-kill-some-creative-jobs-that-maybe-shouldnt-exist-anyway?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI CTO: AI Could Kill Some Creative Jobs That Maybe Shouldn't Exist Anyway", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T05:37:54.382871+00:00", "description": "An anonymous reader quotes a report from Fortune: Ellen Bagley was delighted when she made her first sale on a popular second-hand clothing app, but just a few minutes later, the thrill turned to shock as the 20-year-old from Linkoping in Sweden discovered she'd been robbed. Everything seemed normal when Bagley received a direct message on the platform, which asked her to verify personal details to complete the deal. She clicked the link, which fired up BankID -- the ubiquitous digital authorization system used by nearly all Swedish adults.After receiving a couple of error messages, she started thinking something was wrong, but it was already too late. Over 10,000 Swedish kronor ($1,000) had been siphoned from her account and the thieves disappeared into the digital shadows. \"The fraudsters are so skilled at making things look legitimate,\" said Bagley, who was born after BankID was created. \"It's not easy\" to identify scams. Although financial crime has garnered fewer headlines than a", "id": 756533, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/21/2155253/why-going-cashless-has-turned-sweden-into-a-high-crime-nation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Why Going Cashless Has Turned Sweden Into a High-Crime Nation", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T05:37:51.414284+00:00", "description": "Change Healthcare has confirmed a February ransomware attack on its systems, which brought widespread disruption to the U.S. healthcare system for weeks and resulted in the theft of medical records affecting a \"substantial proportion of people in America.\" TechCrunch: In a statement Thursday, Change Healthcare said it has begun the process of notifying affected individuals whose information was stolen during the cyberattack. The health tech giant, owned by U.S. insurance conglomerate UnitedHealth Group, processes patient insurance and billing for thousands of hospitals, pharmacies and medical practices across the U.S. healthcare sector. As such, the company has access to massive amounts of health information on about a third of all Americans.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Change+Healthcare+Confirms+Ransomware+Hackers+Stole+Medical+Records+on+a+'Substantial+Proportion'+of+Americans%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F2", "id": 756532, "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/22/0211236/change-healthcare-confirms-ransomware-hackers-stole-medical-records-on-a-substantial-proportion-of-americans?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Change Healthcare Confirms Ransomware Hackers Stole Medical Records on a 'Substantial Proportion' of Americans", "user": null, "vote": 0}]