[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T18:30:09+00:00", "description": "Open world games are so immensely popular that even studios renowned for linear experiences have been dabbling in the open world formula. FromSoftware’s Elden Ring is a principal example, but there’s been enough gold in open world games over recent years to forgo worry the genre is stagnating. \n\nHowever, the warning signs are there, and they’ve been there for a while: environments built without character mechanics in mind, unrewarding quest design, overabundance of “things to do”, over-numerous collectibles. Ubisoft are the biggest offenders for these unnecessary distractions, but even open world games famous for their story or combat have been bogged down by boring side-content. \n\nWhen firing on all cylinders, there’s no game genre more immersive, and more freedom granting than open world, but its inarguable there’re boring aspects to these games that need to be eradicated.", "id": 759296, "language": null, "link": "https://www.youtube.com/watch?v=6YQs01YZoN0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/6YQs01YZoN0/hqdefault.jpg", "title": "Why Are So Many OPEN WORLD GAMES BORING?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T10:30:20+00:00", "description": "Microsoft’s Xbox Series X might be behind Sony’s current-gen offerings in terms of the first-party library and sales units, but due credit needs to be awarded to Microsoft’s efforts towards crafting a powerful machine that’s capable of handling high-fidelity games at 4K resolution. \n\nIt’s always an interesting thought to see how crafting a similarly specced PC would cost, and that too with brand new PC parts. With this video, we try to resolve this scenario by calculating the price of owning a comparable PC to the Xbox Series X.", "id": 757562, "language": null, "link": "https://www.youtube.com/watch?v=YC_7s18pCyc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/YC_7s18pCyc/hqdefault.jpg", "title": "How Much Would It Cost To Build A PC As Powerful As The Xbox Series X?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-22T02:30:23+00:00", "description": "The history of Redfall is fascinating in retrospect. Launching last year for Xbox Series X/S and PC as Microsoft's first $70 title, it bombed critically and commercially. Long-time fans of Arkane wondered how the studio behind Prey could release such a disappointing mess, rife with technical issues and none of the gameplay charm that defined its earlier releases.\n\nDespite spending a year on the market before Microsoft pulled the plug on future support (barring one last update), Redfall had a purported development of around six years. It was reportedly caught between two worlds - satisfying a broader market while not fully embracing the live-service model, meaning no microtransactions or in-game store.\n\nThough its final update is available and adds some worthwhile features, Redfall's legacy is disappointing. The fact that Arkane Austin shut down before it could return to what it did best makes things even worse.\n\nNote: Sorry for the re-upload. The original video had some problems.", "id": 756505, "language": null, "link": "https://www.youtube.com/watch?v=p0KUqmBhT-U", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/p0KUqmBhT-U/hqdefault.jpg", "title": "One Year Later, Is Redfall Fixed?", "user": null, "vote": 0}]