[{"permanent": false, "tags": [], "language": null, "user": null, "page_rating_visits": 0, "link": "https://www.youtube.com/watch?v=LqIs5sl0bbw", "description": "From Luigi to Yoshi, important characters in the Mario universe have has plenty of time in the sun with their own, individual games, but Princess Peach hasn’t quite been allowed that sort of prominence, in spite of how much of a fan-favorite she is. \n\nBetter late than never though, because nearly twenty years on from the last time she got a solo game, she’s soon set to star in another one in the form of Princess Peach: Showtime!- and it’s actually looking quite promising so far. \n\nEverything that the developer has shown of the upcoming action-adventure game to this point has looked intriguing, and ahead of the game’s release later this month, here, we’re going to go over a few of its key details.", "source_obj__id": 129, "page_rating_votes": 0, "date_published": "2024-03-09T21:00:15+00:00", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "comments": [], "album": "", "thumbnail": "https://i1.ytimg.com/vi/LqIs5sl0bbw/hqdefault.jpg", "dead": false, "page_rating_contents": 0, "page_rating": 0, "age": null, "title": "Princess Peach Showtime! - 11 THINGS You Need To Know Before You Buy", "artist": "GamingBolt", "vote": 0, "bookmarked": false}, {"permanent": false, "tags": [], "language": null, "user": null, "page_rating_visits": 0, "link": "https://www.youtube.com/watch?v=LGCeunxkjPY", "description": "In the lead-up to Final Fantasy 7 Rebirth’s launch, it promised a massive 100 hour plus experience, and does the action RPG make good on that promise. Depending on how you can play, the main story itself can take you several dozen hours to see to completion, but as is traditional for this series (and really, this genre as a whole), there’s no shortage of things to do in the game even after the credits have rolled. \n\nIf you want to continue exploring the world, want to keep tackling optional activities, want to keep honing your skills, want to test yourself with harder challenges- Final Fantasy 7 Rebirth lets you do all of that in abundance (and then some) after you’ve finished the main campaign. Here, that’s exactly what we’ll be talking about.", "source_obj__id": 129, "page_rating_votes": 0, "date_published": "2024-03-09T17:00:15+00:00", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "comments": [], "album": "", "thumbnail": "https://i1.ytimg.com/vi/LGCeunxkjPY/hqdefault.jpg", "dead": false, "page_rating_contents": 0, "page_rating": 0, "age": null, "title": "Final Fantasy 7 Rebirth - WHAT TO DO AFTER FINISHING THE GAME?", "artist": "GamingBolt", "vote": 0, "bookmarked": false}, {"permanent": false, "tags": [], "language": null, "user": null, "page_rating_visits": 0, "link": "https://www.youtube.com/watch?v=pF8UD-H6wxk", "description": "WWE 2K24 follows in the footsteps of 2K22 and 2K23 in offering fast-paced arcade-style gameplay while still providing plenty of depth thanks to its vast movesets and large roster. This time around, the game is also celebrating four decades of WrestleMania with its new Showcase of the Immortals mode that takes players through important matches throughout the event’s 40-year history. \n\nUnfortunately, the Showcase mode falls flat since it’s poorly paced and is interrupted far too often to be any fun. On the other hand, the new storylines in MyRise, as well as the match types and additions to the roster more than make up for the shortcomings of the showcase mode. Thanks to this, WWE 2K24 feels like the most complete game in the franchise for almost an entire decade.", "source_obj__id": 129, "page_rating_votes": 0, "date_published": "2024-03-09T09:30:22+00:00", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "comments": [], "album": "", "thumbnail": "https://i1.ytimg.com/vi/pF8UD-H6wxk/hqdefault.jpg", "dead": false, "page_rating_contents": 0, "page_rating": 0, "age": null, "title": "WWE 2K24 Review - The Final Verdict", "artist": "GamingBolt", "vote": 0, "bookmarked": false}]