[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-07T13:18:26+00:00", "description": "<p>Last Updated on June 7, 2024 A good way to lead your comic reading life is to run, not walk, to the nearest comic book store when a new series or issue written by James Tynion IV is released.  The man is a writing fool (or whatever term the youngsters use for ‘genius’).  Series that captured my attention, and should capture yours, include The Department of Truth, The Closet, and Universal Monsters: Dracula.  Add a new series to that list &#8211; The Deviant. The Deviant #5 is one of those stories that creeps up on you at first, before grabbing you by the throat and throttling the heck out of you.  It starts in one place, then zigs and zags until you realise you’ve ended up in a place so devastating it’s hard to work out how to get back to wherever you started &#8211; assuming that’s even possible. Because The Deviant #5 opens up new vistas in this series about Michael Schmitz, a gay man attempting to uncover the truth fifty years after a series of killings that occurred in 1972.  T", "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-deviant-5-by-james-tynion-w-and-joshua-hixson-a", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: The Deviant #5 by James Tynion (W) and Joshua Hixson (A)", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-07T04:43:22+00:00", "description": "<p>The Tigress by Anna Mocikat is the sixth book of the Behind Blue Eyes series. The series is a successful indie cyberpunk drama that follows the tales of a murderous group of sexy antiheroes, specifically the morally conflicted Nephilim. She is a cyborg assassin working for the Olympias Corporation and presently in a relationship with the leader of the Guardian Angels, a death squad that secures the power of the Olympias Corporation over North and South America. The previous books established that Metatron, simultaneously villain and love interest of Nephilim, has been plotting to overthrow the Olympias Board of Directors for some time. Having successfully defeated the invasion of Europe&#8217;s Rosprom corporation, Olympias has never been more vulnerable while Metatron has never been more powerful. However, to successfully pull off his coup, he needs the other corporation to stand down. The leader of TogbuaXiang, the so-called Tigress, wants to meet with Nephilim and Metatron suspe", "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-the-tigress-by-anna-mocikat", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: The Tigress by Anna Mocikat", "user": null, "vote": 0}]