[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T18:30:29+00:00", "description": "Monster Hunter has quickly become one of the genre's biggest and more successful franchises, and though the Monster Hunter Stories spinoffs have obviously not contributed an awful lot to that success, as those who’ve played the two games will tell you, they do still have their undeniable charm and appeal that makes them easy recommendations for fans of the style of game they’re going for. \n\nSoon, the developer will be opening the gates for new players to dive into the turn-based Pokemon-inspired monster collecting and battling RPG duology with a remastered release of Monster Hunter Stories 1 on PS4, Switch, and PC, and a re-release of its sequel on PS4. Ahead of those imminent releases, here, we’re going to speak about all of the key details that you should know about the Stories games.", "language": null, "link": "https://www.youtube.com/watch?v=Pfl44VRR3Z4", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/Pfl44VRR3Z4/hqdefault.jpg", "title": "Monster Hunter Stories 1 + 2 - 15 Things You Need To Know BEFORE YOU BUY", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T15:30:12+00:00", "description": "After the disappointing launch of Street Fighter 5, fans of the series had hoped that the developer would ensure that its successor would get off to a much better start, and last year, that’s exactly what happened. \n\nStreet Fighter 6 launched in June of 2023 to widespread positivity and acclaim, with critics and players alike showering the game with praise for its core mechanical strength, the bevy of content it had on offer, the way it improved on the series’ formula, and more. \n\nBut with the game now roughly a year old, how exactly has it fared in its first post-launch year? From issues related to microtransactions to a solid stream of post-launch content and updates, Street Fighter 6’s post-launch life has got off to a start with ups and downs. Here, we talk about all of that and more.", "language": null, "link": "https://www.youtube.com/watch?v=r1RVVUpLCj4", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/r1RVVUpLCj4/hqdefault.jpg", "title": "The State of Street Fighter 6 - ONE YEAR LATER", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T13:30:16+00:00", "description": "The survival horror genre continues to grow at a rapid pace, with new kinds of experiences releasing left, right, and center. Survival horror games are dime a dozen these days, ranging from indie experiences to AAA blockbusters and everything in between. \n\nThe genre is brimming with great games to try, but naturally, some games simply outshine others by a significant margin. This could be due to many factors: innovation in certain aspects, meticulous horror design, or perhaps even a story that continues to haunt your dreams for weeks and months to come. \n\nIf you are looking for some of the best survival horror games to play, then you are in luck as we run down 15 of the best survival horror games of all time.", "language": null, "link": "https://www.youtube.com/watch?v=YCjqvj-8I6M", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/YCjqvj-8I6M/hqdefault.jpg", "title": "Top 15 MUST PLAY Survival Horror Games (2024 Edition)", "user": null, "vote": 0}]