[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T23:57:34.069936+00:00", "description": "Gizmodo reports there's been progress on a male birth-control gel \"being developed with the help of several organizations, including the U.S. government's National Institute of Child Health and Human Development, part of the larger NIH.\"\n\nIt's now being tested in a larger-scale Phase IIB trial, which involves around 400 couples. [Five milliliters of gel &mdash; about a teaspon &mdash; is applied to each shoulder blade once a day, reports NBC News.] That trial is still ongoing, but researchers have already begun to pore through some of the available data, which has provided encouraging results. In the summer of 2022, for instance, Diana Blithe, chief of the NICHD's Contraceptive Development Program, reported that the NES/T gel's efficacy rate so far appeared to be on par or even better than contraceptive hormonal options for women... \nThe findings are still preliminary, and it will take more time for the full Phase II data to be collected and analyzed. But Blithe and her team have been", "language": "en-us", "link": "https://science.slashdot.org/story/24/06/02/230205/male-birth-control-gel-continues-to-show-promise?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Male Birth Control Gel Continues to Show Promise", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T22:52:26.491673+00:00", "description": "\"Few computer keyboards are as iconic, as influential, or as beige as the IBM Model-M,\" writes the blog OMG Ubuntu adding that it's \"no surprise then that it's been given a modern reimagining by 8BitDo.\"\n\nFollowing on from their Nintendo NES and Famicom and Commodore 64 homages, 8BitDo has unveiled its latest retro-inspired mechanical keyboard. This one pays tribute to a true computing classic: the IBM Model-M keyboard. \n\nLest anyone familiar with the real thing get too excited I'll mention up front that 8BitDo's Keyboard-M is a mechanical keyboard, using Kailh Box V2 white switches (swappable, of course) and not the buckling spring mechanism synonymous with the original. On Linux you can enable a buckling spring sound effect for every key press though, should you buy this and want the clatter to accompany it...! \n\n\nLike 8BitDo's other retro keyboards you can use this over Bluetooth, 2.4G wireless (USB adapter sits underneath), or wired. It has a built-in rechargeable 2000mAh Li-on ba", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/02/2229217/8bitdos-reimagining-of-ibms-model-m-keyboard-draws-reactions-online?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "8BitDo's Reimagining of IBM's Model-M Keyboard Draws Reactions Online", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T21:47:58.313622+00:00", "description": "The Associated Press reports that U.S. federal regulators \"have given Amazon key permission that will allow it to expand its drone delivery program, the company announced Thursday.\"\n\n\nIn a blog post published on its website, Seattle-based Amazon said that the Federal Aviation Administration has given its Prime Air delivery service the OK to operate drones \"beyond visual line of sight,\" removing a barrier that has prevented its drones from traveling longer distances. With the approval, Amazon pilots can now operate drones remotely without seeing it with their own eyes. \n\nAn FAA spokesperson said the approval applies to College Station, Texas, where the company launched drone deliveries in late 2022. Amazon said its planning to immediately scale its operations in that city in an effort to reach customers in more densely populated areas. It says the approval from regulators also \"lays the foundation\" to scale its operations to more locations around the country... \n\nAmazon, which has soug", "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/02/2058222/amazons-drones-gets-key-approval-can-now-fly-farther-to-more-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon's Drones Gets Key Approval, Can Now Fly Farther to More Customers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T20:44:01.500005+00:00", "description": "Will appetite-suppressing drugs hurt the sugar industry? Executives from Walmart warned that Ozempic and Zepbound \"are impacting food sales,\" reports Bloomberg, \"and multiple analyst surveys have showed that less-hungry customers are spending fewer dollars at grocery stores and restaurants.\"\n\n\nThe drugs, which cut cravings, will result in a decline in calorie consumption in the US of 1.5% to 2.5% by 2035, with a drop of as much as 5% in the consumption of sweets such as baked goods, confectionery and soda, Morgan Stanley analysts including Pamela Kaufman said in a report last month. Morgan Stanley forecast about a 10th of the US population will be on the so-called GLP-1 medications &mdash; originally designed to treat diabetes but being used by many as a powerful weight-loss tool &mdash; by 2035... Even with tight supplies and sky-high prices limiting uptake of the medications, sales of GLP-1 drugs for both obesity and diabetes already exceeded $19 billion in 2023. The global obesity ", "language": "en-us", "link": "https://science.slashdot.org/story/24/06/02/208211/ozempic-like-drugs-could-lower-sales-of-junk-food?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ozempic-Like Drugs Could Lower Sales of Junk Food", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T19:18:46.486887+00:00", "description": "Slashdot reader storagedude shares a provocative post from the cybersecurity news blog of Cyble Inc. (a Ycombinator-backed company promising \"AI-powered actionable threat intelligence\"). \n\nThe post delves into concerns that the new \"Recall\" feature planned for Windows (on upcoming Copilot+ PCs) is \"a security and privacy nightmare.\"\n\nCopilot Recall will be enabled by default and will capture frequent screenshots, or \"snapshots,\" of a user's activity and store them in a local database tied to the user account. The potential for exposure of personal and sensitive data through the new feature has alarmed security and privacy advocates and even sparked a UK inquiry into the issue. In a long Mastodon thread on the new feature, Windows security researcher Kevin Beaumont wrote, \"I'm not being hyperbolic when I say this is the dumbest cybersecurity move in a decade. Good luck to my parents safely using their PC.\" \n\n\nIn a blog post on Recall security and privacy, Microsoft said that processing", "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/02/190205/is-the-new-recall-feature-in-windows-a-security-and-privacy-nightmare?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is the New 'Recall' Feature in Windows a Security and Privacy Nightmare?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T18:13:46.876472+00:00", "description": "Long-time Slashdot reader theodp writes: \"This is truly game-changing news!\" exclaims Minecraft Education's Laylah Bulman in a LinkedIn post targeting high school CS educators. \"We're thrilled to announce that the AP Computer Science Principles with Minecraft and MakeCode Curriculum has officially been approved by The College Board! And we are offering free professional learning for our inaugural cohort this summer...! \n\n\"Minecraft's highly engaging environment makes complex coding concepts relatable and fun, fostering a deeper understanding and encouraging broader participation. Ready to empower your students? Don't miss this opportunity!\"\n\n\n Recent Edsurge articles (sponsored by Minecraft Education) touted how Minecraft has found its way into computer science and other curricula in New York City and Broward County (Florida), two of the nation's largest school districts... Microsoft-backed nonprofit Code.org has also pushed Minecraft-themed CS tutorials into the nation's classrooms v", "language": "en-us", "link": "https://news.slashdot.org/story/24/06/02/1746216/college-level-minecraft-based-cs-courses-approved-for-us-high-school-students?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "College-Level Minecraft-Based CS Courses Approved for US High School Students", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T17:08:50.174999+00:00", "description": "\"There is one big thing holding the United States back from a pollution-free electricity grid running on wind, solar and battery power,\" writes the Washington Post. \"Not enough power lines... the nation's sagging, out-of-date power lines are being overwhelmed &mdash; slowing the transition to clean energy and the fight against climate change.\"\n But experts say that there is a remarkably simple fix: installing new wires on the high-voltage lines that already carry power hundreds of miles across the United States. Just upgrading those wires, new reports show, could double the amount of power that can flow through America's electricity grid... \n\nMost of America's lines are wired with a technology that has been around since the early 1900s &mdash; a core steel wire surrounded by strands of aluminum. When those old wires heat up &mdash; whether from power passing through them or warm outdoor temperatures &mdash; they sag. Too much sag in a transmission line can be dangerous, causing fires ", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/01/0517219/a-simple-fix-could-double-the-size-of-the-us-electricity-grid?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "A Simple Fix Could Double the Size of the U.S. Electricity Grid", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T16:03:56.281432+00:00", "description": "\"To save itself, TikTok in 2022 offered the U.S. government an extraordinary deal,\" reports the Washington Post.\n\n\nThe video app, owned by a Chinese company, said it would let federal officials pick its U.S. operation's board of directors, would give the government veto power over each new hire and would pay an American company that contracts with the Defense Department to monitor its source code, according to a copy of the company's proposal. It even offered to give federal officials a kill switch that would shut the app down in the United States if they felt it remained a threat. \n\nThe Biden administration, however, went its own way. Officials declined the proposal, forfeiting potential influence over one of the world's most popular apps in favor of a blunter option: a forced-sale law signed last month by President Biden that could lead to TikTok's nationwide ban. The government has never publicly explained why it rejected TikTok's proposal, opting instead for a potentially protract", "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/01/0539214/did-the-us-government-ignore-a-chance-to-make-tiktok-safer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Did the US Government Ignore a Chance to Make TikTok Safer?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T14:58:55.631197+00:00", "description": "The New York Times reports on a program to forgive U.S. student loans from private lenders &mdash; a kind of private parallel to a federal program which \"allows those who were seriously misled by their schools to have their federal student loans eliminated.\" \n\nThe problem? Eight U.S. senators complain the loan discharge process remains \"burdensome and confusing\" &mdash; and most students don't even know it exists.\n\nNavient, a large owner of private student loan debt, has created, but not publicized, a program that allows borrowers to apply to have their loans forgiven.... A nonprofit group of lawyers has stepped in ease the process: On Thursday, the Project on Predatory Student Lending, an advocacy group in Boston, published Navient's application form and an instruction guide for borrowers with private loans who are seeking relief on the grounds that their school lied to them... \n\nFor nearly a decade, in the early 2000s, Navient &mdash; then known as Sallie Mae &mdash; struck deals wi", "language": "en-us", "link": "https://news.slashdot.org/story/24/06/02/0123226/theres-a-program-to-cancel-some-private-us-student-loans-most-dont-know-about-it?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "There's a Program to Cancel Some Private US Student Loans. Most Don't Know About It.", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T11:44:02.253076+00:00", "description": "\"Chinese scientists develop cure for diabetes,\" reads the headline from the world's second-most widely read English-language newspaper. (\"Insulin patient becomes medicine-free in just 3 months.\") \n\nThe researchers' results were published earlier in May in Cell Discovery, and are now getting some serious scrutiny from the press. The Economic Times cites a University of British Columbia professor's assessment that the study \"represents an important advance in the field of cell therapy for diabetes,\" in an article calling it a \"breakthrough\" that \"marks a significant advancement in cell therapy for diabetes.\"\nChinese scientists have successfully cured a patient's diabetes using a groundbreaking cell therapy... According to a South China Morning Post report, the patient underwent the cell transplant in July 2021. Remarkably, within eleven weeks, he no longer required external insulin. Over the next year, he gradually reduced and ultimately stopped taking oral medication for blood sugar co", "language": "en-us", "link": "https://science.slashdot.org/story/24/06/01/167232/are-we-closer-to-a-cure-for-diabetes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Are We Closer to a Cure for Diabetes?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T08:28:34.591832+00:00", "description": "China's Chang'e-6 probe successfully lands on far side of the moon\n\n\nChina's moon probe has \"successfully touched down on the far side of the moon,\" CNN reports, in \"a significant step for the ambitious mission that could advance the country's aspirations of putting astronauts on the moon\" by 2030. \nThe mission's ultimate goal is to return to Earth the first samples from the moon's far side, CNN reports. And China's lunar lander \"is now expected to use a drill and a mechanical arm to gather up to 2 kilograms of moon dust and rocks from the basin, a crater formed some 4 billion years ago.\"\n\n To complete its mission, the lander will need to robotically stow those samples in an ascent vehicle that made the landing with it. The ascent vehicle will then return to lunar orbit, where it will dock with and transfer the samples to a re-entry capsule, according to mission information provided by the China National Space Administration.\nThe re-entry capsule and orbiter will then travel back to E", "language": "en-us", "link": "https://science.slashdot.org/story/24/06/02/0430224/china-successfully-lands-probe-on-the-moons-far-side-starts-collecting-samples?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China Successfully Lands Probe on the Moon's Far Side, Starts Collecting Samples", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T04:08:34.620974+00:00", "description": "'\"As AI programs shake up the office, potentially making millions of jobs obsolete, one group of perpetually stressed workers seems especially vulnerable...\" writes the New York Times. \n\n\"The chief executive is increasingly imperiled by A.I.\"\n\n\nThese employees analyze new markets and discern trends, both tasks a computer could do more efficiently. They spend much of their time communicating with colleagues, a laborious activity that is being automated with voice and image generators. Sometimes they must make difficult decisions &mdash; and who is better at being dispassionate than a machine? \n\nFinally, these jobs are very well paid, which means the cost savings of eliminating them is considerable... \n\nThis is not just a prediction. A few successful companies have begun to publicly experiment with the notion of an A.I. leader, even if at the moment it might largely be a branding exercise... [The article gives the example of the Chinese online game company NetDragon Websoft, which has 5", "language": "en-us", "link": "https://it.slashdot.org/story/24/06/02/0327205/could-ai-replace-ceos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Could AI Replace CEOs?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-02T01:58:20.775222+00:00", "description": "\"The seemingly star-cross Boeing Starliner &mdash; within minutes of its long-delayed blastoff on the spacecraft's first piloted test flight &mdash; was grounded again Saturday,\" writes CBS News, \"when one of three redundant computers managing the countdown from the base of the launch pad ran into a problem, triggering a last-minute scrub.\" \n\n\nMore details from NPR:\nWith 3:50 left in the countdown, the rocket's computer initiated a hold. The next launch attempt won't happen until at least Wednesday, NASA said. \n\nAn issue with one of the three redundant computer systems at the base of the launch pad that are responsible for initiating the launch sequence prompted the automatic halt, said Tory Bruno, the head of United Launch Alliance, the government contractor trying to launch the Starliner. \"We do require all three systems to be running &mdash; triple redundancy,\" ULA President and CEO Bruno said at a Saturday afternoon press briefing. \"Those three big computers do a health check. ...", "language": "en-us", "link": "https://science.slashdot.org/story/24/06/02/0030200/boeing-starliner-launched-scrubbed-until-at-least-wednesday-after-redundant-computer-issue?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Boeing Starliner Launched Scrubbed Until at Least Wednesday After Redundant Computer Issue", "user": null, "vote": 0}]