[{"manual_status_code": 0, "date_published": "2024-03-26T15:30:05+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null, "page_rating": 94, "user": null, "source_obj__id": 129, "page_rating_votes": 0, "status_code": 0, "link": "https://www.youtube.com/watch?v=IAa_qMvZ62c", "thumbnail": "https://i2.ytimg.com/vi/IAa_qMvZ62c/hqdefault.jpg", "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "What The Hell Is Going On With EA's Star Wars Titles?", "age": null, "permanent": false, "description": "As odd as things are on the Battlefield front for Electronic Arts, its Star Wars titles are almost as baffling. Leaving aside its troubles with the Star Wars Battlefront titles and the cancellation of Project Ragtag, the publisher seemed to be on the right track after the success of Star Wars Jedi: Fallen Order.\n\nStar Wars Jedi: Survivor had its share of issues but still performed well financially (though sales numbers have yet to be announced). Things seemingly spiralled downward after that with EA cancelling an upcoming Star Wars single-player FPS. \n\nBit Reactor's strategy title remains alive, and Star Wars Jedi 3 is in the works, but the overall mood is odd. What motivates the publisher's recent moves, especially in light of layoffs? Find out more here.", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T10:45:05+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "language": null, "page_rating": 94, "user": null, "source_obj__id": 129, "page_rating_votes": 0, "status_code": 0, "link": "https://www.youtube.com/watch?v=jXlSmjhZql0", "thumbnail": "https://i3.ytimg.com/vi/jXlSmjhZql0/hqdefault.jpg", "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Dragon’s Dogma 2 Feels Like The Perfect Cross Between Elden Ring And The Elder Scrolls", "age": null, "permanent": false, "description": "There’s no shortage of things to love in Dragon’s Dogma 2, from its spectacular combat to how densely it packs its world full of engaging content to how reactive its world is. \n\nIt’s hard not to notice the similarities that Dragon’s Dogma 2 has to other beloved open world experiences. Specifically, it feels like a perfect cross between Elden Ring and The Elder Scrolls, capturing the former’s aversion to guide or handhold the player in any way, and the latter’s reliance on AI-driven systemic, emergent gameplay. \n\nCombining both styles and throwing in its own ideas, it ends up delivering something entirely unique. Here, we talk about all of that and more.", "vote": 0, "artist": null}]