[{"manual_status_code": 0, "date_published": "2024-03-26T23:12:44.202744+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://games.slashdot.org/story/24/03/26/2043222/xbox-cloud-gaming-now-has-mouse-and-keyboard-support-in-select-games?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Xbox Cloud Gaming Now Has Mouse and Keyboard Support In Select Games", "age": null, "permanent": false, "description": "Tom Warren reports via The Verge: Microsoft is starting to preview mouse and keyboard support for Xbox Cloud Gaming today. Xbox Insiders will be able to start playing with their mouse and keyboard in Edge, Chrome, or the Xbox app on Windows PCs, nearly two years after Microsoft announced it was preparing to add mouse and keyboard support to its Xbox Cloud Gaming (xCloud) service. Not every game will be supported during the preview, but there's a large selection, including Fortnite, Sea of Thieves, and Halo Infinite. Microsoft warns that some games will display controller UI elements briefly before adapting to mouse and keyboard input after you start interacting with the game.\n \nIf you're interested in trying games with mouse and keyboard in the browser version of Xbox Cloud Gaming, then you'll need to be in full-screen mode, according to Microsoft. This is so the game can correctly capture your pointer as input. If you want to exit out of mouse and keyboard mode and use an Xb", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T22:08:56.334258+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://tech.slashdot.org/story/24/03/26/2013227/canva-acquires-affinity-to-fill-the-adobe-sized-holes-in-its-design-suite?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Canva Acquires Affinity To Fill the Adobe-Sized Holes In Its Design Suite", "age": null, "permanent": false, "description": "Web-based design platform Canva has acquired the Affinity creative software suite for an undisclosed sum, though Bloomberg reports that it's valued at \"several hundred million [British] pounds.\" The Verge reports that the acquisition helps the company \"[position] itself as a challenger to Adobe's grip over the digital design industry.\" From the report: Canva announced the deal on Tuesday, which gives the company ownership over Affinity Designer, Photo, and Publisher -- three popular creative applications for Windows, Mac, and iPad that provide similar features to Adobe's Illustrator, Photoshop, and InDesign software, respectively. [T]he acquisition makes sense as the Australian-based company tries to attract more creative professionals. As of January this year, Canva's design platform attracted around 170 million monthly global users. That's a lot of people who probably aren't using equivalent Adobe software like Express, but unlike Adobe, Canva doesn't have its own design ap", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T22:08:54.596118+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://news.slashdot.org/story/24/03/26/2031206/us-sanctions-spree-continues-with-15-more-for-russian-entities?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "US Sanctions Spree Continues With 15 More For Russian Entities", "age": null, "permanent": false, "description": "An anonymous reader quotes a report from The Register: It's sanctions central at the US Treasury this week as a further 15 are slapped on organizations and individuals in Russia. The Treasury's Office of Foreign Assets Control (OFAC) designated 13 organizations and two individuals -- all concerning financial services organizations, including cryptocurrency exchanges that offered services to already-sanctioned dark web marketplaces in Russia, and those who helped run them. Five of the 13 freshly designated entities were also controlled by individuals who were already sanctioned. The latest round of trade restrictions were placed on those who are believed to have helped evade existing US sanctions.\n \n\"Many of the individuals and entities designated today facilitated transactions or offered other services that helped OFAC-designated entities evade sanctions,\" an OFAC statement read. \"These designations build upon OFAC's February 23, 2024 action to target companies servicing Russ", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T21:04:26.613666+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://yro.slashdot.org/story/24/03/26/186217/facebook-accused-of-using-your-phone-to-wiretap-snapchat?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Facebook Accused of Using Your Phone To Wiretap Snapchat", "age": null, "permanent": false, "description": "Court filings unsealed last week allege Meta created an internal effort to spy on Snapchat in a secret initiative called \"Project Ghostbusters.\" Gizmodo: Meta did so through Onavo, a Virtual Private Network (VPN) service the company offered between 2016 and 2019 that, ultimately, wasn't private at all. \"Whenever someone asks a question about Snapchat, the answer is usually that because their traffic is encrypted we have no analytics about them,\" said Mark Zuckerberg in an email to three Facebook executives in 2016, unsealed in Meta's antitrust case on Saturday. \"It seems important to figure out a new way to get reliable analytics about them... You should figure out how to do this.\" \n\nThus, Project Ghostbusters was born. It's Meta's in-house wiretapping tool to spy on data analytics from Snapchat starting in 2016, later used on YouTube and Amazon. This involved creating \"kits\" that can be installed on iOS and Android devices, to intercept traffic for certain apps, according to", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T21:04:25.086880+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://entertainment.slashdot.org/story/24/03/26/1814248/star-trek-prodigy-season-2-releases-early-in-france?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Star Trek: Prodigy Season 2 Releases Early In France", "age": null, "permanent": false, "description": "AmiMoJo writes: In a major surprise, all twenty episodes of the second season of the animated series 'Star Trek: Prodigy' have suddenly been made available in France thanks to broadcaster France Televisions. According to TrekCentral it seems France.TV, the online streaming service for the national public broadcaster, has released the entirety of the second season all at once and without any prior warning or announcement. \n\nThis has led to questions online as to how this happened. Paramount+ unexpectedly canceled the series in June last year -- even as a second season had almost finished production and was completed shortly after. It took numerous fan campaigns and social media protests but ultimately Netflix picked up both completed seasons in October 2023. The streamer has confirmed the twenty episode second season will arrive this year but hasn't set a specific date as yet. \n\nToday's unexpected release in France has many wondering if this a mistake, or is this the result of", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T21:04:23.513078+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://entertainment.slashdot.org/story/24/03/26/196210/vinyl-records-outsell-cds-for-the-second-year-running?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Vinyl Records Outsell CDs For the Second Year Running", "age": null, "permanent": false, "description": "People bought 43 million vinyl records last year, according to the Recording Industry Association of America (RIAA). From a report: That's 6 million more than the number of CDs sold in 2023, marking the second time since 1987 that's happened and reflecting the steady 17-year-running growth of vinyl sales. Vinyl, which tends to be pricier than the newer format, also far outstripped CDs in actual money made, raking in $1.4 billion compared to $537 million from CDs. The RIAA's report shows that CD revenue was up, too, but in terms of physical products sold, people actually bought about 700,000 fewer CDs in 2023 than the year before. (If you're curious, nearly half a million cassettes sold last year, too, according to Billboard.)<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Vinyl+Records+Outsell+CDs+For+the+Second+Year+Running%3A+https%3A%2F%2Fentertainment.slashdot.org%2Fstory%2F24%2F03%2F26%2F196210%2F%3Futm_source%3Dtwitter%26utm_me", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T21:04:21.588185+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://yro.slashdot.org/story/24/03/26/1956249/florida-braces-for-lawsuits-over-law-banning-kids-from-social-media?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Florida Braces For Lawsuits Over Law Banning Kids From Social Media", "age": null, "permanent": false, "description": "An anonymous reader quotes a report from Ars Technica: On Monday, Florida became the first state to ban kids under 14 from social media without parental permission. It appears likely that the law -- considered one of the most restrictive in the US -- will face significant legal challenges, however, before taking effect on January 1. Under HB 3, apps like Instagram, Snapchat, or TikTok would need to verify the ages of users, then delete any accounts for users under 14 when parental consent is not granted. Companies that \"knowingly or recklessly\" fail to block underage users risk fines of up to $10,000 in damages to anyone suing on behalf of child users. They could also be liable for up to $50,000 per violation in civil penalties. [...]\n \nDeSantis' statement noted that \"in addition to protecting children from the dangers of social media, HB 3 requires pornographic or sexually explicit websites to use age verification to prevent minors from accessing sites that are inappropriate", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T21:04:19.476419+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://apple.slashdot.org/story/24/03/26/2023205/apple-announces-wwdc-2024-event-for-june-10?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Apple Announces WWDC 2024 Event For June 10", "age": null, "permanent": false, "description": "Apple today announced that its 35th annual Worldwide Developers Conference (WWDC) is set to take place June 10 through 14, 2024. It'll be an online event open to all developers at no cost. MacRumors reports: Apple will hold a WWDC 2024 keynote event on Monday, June 10 to show off iOS 18, iPadOS 18, tvOS 18, macOS 15, watchOS 11, and visionOS 2. The keynote event will be available on the Apple Developer app, the Apple website, and YouTube, with Apple also planning to share videos and information all week long.\n \nThough WWDC 2024 is an online event, Apple is once again planning a special event for select developers and students, which is set to take place on June 10 at the Apple Park campus in Cupertino, California. Attendees will be able to watch the keynote and State of the Union presentations at Apple Park, as well as meet Apple employees and attend the Apple Design Awards. Apple will provide developers with additional information about WWDC 2024 through email, the Apple Dev", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T21:04:17.257515+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://slashdot.org/story/24/03/26/202221/adam-neumann-makes-a-500-million-bid-for-wework?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Adam Neumann Makes a $500 Million Bid For WeWork", "age": null, "permanent": false, "description": "Adam Neumann has submitted a $500 million bid to acquire WeWork out of bankruptcy. According to CNBC, it \"could go up to $900 million pending due diligence.\" From the report: Neumann's financing was not immediately clear, although people familiar with the matter told CNBC that Dan Loeb's Third Point was not involved in the offer. Neumann's counsel had previously said that Loeb's investment firm was backing the WeWork founder's offer, but Third Point disputed that assertion in a prior statement. The uncertainty over Neumann's financing, coupled with his track record at the company, could dampen WeWork's receptiveness to his offer. Neumann, his family office Nazare, and his Andreessen Horowitz-backed real estate venture Flow filed a notice of appearance in WeWork's bankruptcy docket on Monday.\n \n\"Two weeks ago, a coalition of half a dozen financing partners -- whose identities are known to WeWork and its advisors -- submitted a potential bid for substantially more\" than the ini", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T17:48:59.079998+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://slashdot.org/story/24/03/26/1653228/dell-reduces-workforce-as-part-of-broader-cost-cuts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Dell Reduces Workforce as Part of Broader Cost Cuts", "age": null, "permanent": false, "description": "Dell reduced its workforcereduced its workforce as part of a broader initiative to cut costs that included limiting external hiring and employee reorganizations, it said in a filing on Monday. From a report: As of Feb. 2, 2024, it had nearly 120,000 employees, down from about 126,000 a year earlier. The layoffs come after sluggish demand for its personal computers for nearly two years partly contributed to a 11% drop in revenue in fourth-quarter earnings posted last month. Dell expects net revenue in its client solutions group (CSG) - home to PCs - to grow for the entire year, it said on Monday. The segment's revenue had fallen 12% in the fourth quarter.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Dell+Reduces+Workforce+as+Part+of+Broader+Cost+Cuts%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F03%2F26%2F1653228%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T17:48:56.840968+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://it.slashdot.org/story/24/03/26/1740214/a-native-version-of-chrome-arrives-for-arm-based-windows-pc?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "A Native Version of Chrome Arrives for Arm-based Windows PC", "age": null, "permanent": false, "description": "Google is releasing an optimized version of its Chrome browser for Windows on Arm this week, the search giant has announced alongside chipmaker Qualcomm. From a report: The official release comes two months after an early version of the browser was spotted in Chrome's Canary channel. Qualcomm says the release \"will roll out starting today.\" \n\nThe release will be a big deal for any Chrome users with Windows machines powered by Arm-based processors, who'll now have access to a much faster native browser. That's in contrast to the x64 version of Chrome they've previously had to run in an emulated state with slow performance. Arm-based users have previously been able to turn to Microsoft's Edge, which is already available for Windows on Arm devices.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+Native+Version+of+Chrome+Arrives+for+Arm-based+Windows+PC%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F03%2F26%2F1740214%2F%3Futm_source%3D", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T16:44:26.514244+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://yro.slashdot.org/story/24/03/26/1253213/portugal-orders-altmans-worldcoin-to-halt-data-collection?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Portugal Orders Altman's Worldcoin To Halt Data Collection", "age": null, "permanent": false, "description": "Portugal's data regulator has ordered Sam Altman's iris-scanning project Worldcoin to stop collecting biometric data for 90 days, it said on Tuesday, in the latest regulatory blow to a venture that has raised privacy concerns in multiple countries. From a report: Worldcoin encourages people to have their faces scanned by its \"orb\" devices, in exchange for a digital ID and free cryptocurrency. More than 4.5 million people in 120 countries have signed up, according to Worldcoin's website. Portugal's data regulator, the CNPD, said there was a high risk to citizens' data protection rights, which justified urgent intervention to prevent serious harm. More than 300,000 people in Portugal have provided Worldcoin with their biometric data, the CNPD said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Portugal+Orders+Altman's+Worldcoin+To+Halt+Data+Collection%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F03%2F26%2F1253213%2F%3Futm_source%3", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T15:38:36.632513+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://yro.slashdot.org/story/24/03/26/1232205/telegrams-peer-to-peer-login-system-is-a-risky-way-to-save-5-a-month?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Telegram's Peer-to-Peer Login System is a Risky Way To Save $5 a Month", "age": null, "permanent": false, "description": "Telegram is offering a new way to earn a premium subscription free of charge: all you have to do is volunteer your phone number to relay one-time passwords (OTP) to other users. This, in fact, sounds like an awful idea -- particularly for a messaging service based around privacy. From a report: X user @AssembleDebug spotted details about the new program on the English-language version of a popular Russian-language Telegram information channel. Sure enough, there's a section in Telegram's terms of service outlining the new \"Peer-to-Peer Login\" or P2PL program, which is currently only offered on Android and in certain (unspecified) locations. By opting in to the program, you agree to let Telegram use your phone number to send up to 150 texts with OTPs to other users logging in to their accounts. Every month your number is used to send a minimum number of OTPs, you'll get a gift code for a one-month premium subscription. Boy does this sound like a bad idea, starting with the mai", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T15:38:35.078856+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://it.slashdot.org/story/24/03/26/1241218/cloudflare-says-its-automated-empathy-to-avoid-fixing-flaky-hardware-too-often?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Cloudflare Says It's Automated Empathy To Avoid Fixing Flaky Hardware Too Often", "age": null, "permanent": false, "description": "The Register: Cloudflare has revealed a little about how it maintains the millions of boxes it operates around the world -- including the concept of an \"error budget\" that enacts \"empathy embedded in automation.\" In a Tuesday post titled \"Autonomous hardware diagnostics and recovery at scale,\" the internet-taming biz explains that it built fault-tolerant infrastructure that can continue operating with \"little to no impact\" on its services. But as explained by infrastructure engineering tech lead Jet Marsical and systems engineers Aakash Shah and Yilin Xiong, when servers did break the Data Center Operations team relied on manual processes to identify dead boxes. And those processes could take \"hours for a single server alone, and [could] easily consume an engineer's entire day.\" \n\nWhich does not work at hyperscale. Worse, dead servers would sometimes remain powered on, costing Cloudflare money without producing anything of value. Enter Phoenix -- a tool Cloudflare created to ", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T14:34:06.088478+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://slashdot.org/story/24/03/26/1228256/ai-will-suck-up-500-more-power-in-uk-in-10-years-grid-ceo-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "AI Will Suck Up 500% More Power in UK in 10 Years, Grid CEO Says", "age": null, "permanent": false, "description": "Electricity demand from UK data centers will jump sixfold over the next 10 years as a boom in AI requires increased computing power, according to the head of National Grid. From a report: That will ramp up pressure on the country's electricity network, which must move vast quantities of renewable energy from as far away as Scottish wind farms to data centers around London. And it's a grid already under strain from the accelerating electrification of home heating, transportation and industries. \n\n\"Future growth in foundational technologies like artificial intelligence and quantum computing will mean larger-scale, energy-intensive computing infrastructure,\" National Grid Chief Executive Officer John Pettigrew said Tuesday at a conference in Oxford. It's an outlook replicated in many other countries, which are grappling with how to fund the massive spending required to expand capacity. Global electricity demand from data centers, AI and cryptocurrencies may more than double over", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T13:28:50.699128+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://tech.slashdot.org/story/24/03/26/0349216/reddit-may-need-to-ramp-up-spending-on-content-moderation-analysts-say?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Reddit May Need To Ramp Up Spending On Content Moderation, Analysts Say", "age": null, "permanent": false, "description": "An anonymous reader quotes a report from Reuters: Reddit will need to spend heavily on content moderation as it may face greater scrutiny as a public company, analysts said, threatening its longstanding policy of relying on an army of volunteers to maintain order on its platform. The newly listed company warned in its initial public offering (IPO) paperwork that its unique approach to content moderation can sometimes subject it to disruptions like in 2023, when several moderators protested against its decision to charge third-party app developers for access to its data.\n \nDepending on volunteers is not sustainable, given the regulatory scrutiny that the company will now face, said Julian Klymochko, CEO of alternative investment solutions firm Accelerate Financial Technologies. \"It's like relying on unpaid labor when the company has nearly a billion dollars in revenue,\" he added. Reddit reported revenue of $804 million in 2023, according to an earlier filing. Reddit will need ", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T10:13:51.244009+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://tech.slashdot.org/story/24/03/26/0333225/microsoft-has-a-new-windows-and-surface-chief?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Microsoft Has a New Windows and Surface Chief", "age": null, "permanent": false, "description": "Tom Warren reports via The Verge: Microsoft is naming Pavan Davuluri as its new Windows and Surface chief today. After Panos Panay's surprise departure to Amazon last year, Microsoft split up the Windows and Surface groups under two different leaders. Davuluri took over the Surface silicon and devices work, with Mikhail Parakhin leading a new team focused on Windows and web experiences. Now both Windows and Surface will be Davuluri's responsibility, as Parakhin has \"decided to explore new roles.\"\n \nThe Verge has obtained an internal memo from Rajesh Jha, Microsoft's head of experiences and devices, outlining the new Windows organization. Microsoft is now bringing together its Windows and devices teams once more. \"This will enable us to take a holistic approach to building silicon, systems, experiences, and devices that span Windows client and cloud for this AI era,\" explains Jha. Pavan Davuluri is now the leader of Microsoft's Windows and Surface team, reporting directly to R", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T08:03:22.956298+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://slashdot.org/story/24/03/26/0117200/bbc-will-stop-using-ai-for-doctor-who-promotion-after-receiving-complaints?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "BBC Will Stop Using AI For 'Doctor Who' Promotion After Receiving Complaints", "age": null, "permanent": false, "description": "The BBC says it has stopped using AI to promote Doctor Who after receiving complaints from viewers. Deadline reports: The BBC's marketing teams used the tech \"as part of a small trial\" to help draft some text for two promotional emails and mobile notifications, according to its complaints website, which was intended to highlight Doctor Who programming on the BBC. But the corporation received complaints over the reports that it was using generative AI, it added. \"We followed all BBC editorial compliance processes and the final text was verified and signed-off by a member of the marketing team before it was sent,\" the BBC said. \"We have no plans to do this again to promote Doctor Who.\"\n \nThe decision to stop promoting via generative AI represents a u-turn from the BBC, who said at the time of announcement that \"generative AI offers a great opportunity to speed up making the extra assets to get more experiments live for more content that we are trying to promote.\" At the time, t", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T03:42:25.007046+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://news.slashdot.org/story/24/03/26/018254/ubuntu-linux-lts-releases-get-up-to-12-years-of-support?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Ubuntu Linux LTS Releases Get Up To 12 Years of Support", "age": null, "permanent": false, "description": "BrianFagioli shares a report from BetaNews: Canonical, the company behind the popular Ubuntu operating system, has announced a significant extension to the support lifecycle of its long-term support (LTS) releases. The new paid Legacy Support add-on for Ubuntu Pro subscribers will now provide security maintenance and support for an impressive 12 years, extending the previous 10-year commitment. This enhancement is available starting with Ubuntu 14.04 LTS and will benefit both enterprises and individual users who rely on the stability and security of Ubuntu for their critical systems. By default, Ubuntu LTS releases receive five years of standard security maintenance. However, with Ubuntu Pro, this is expanded to 10 years for both the main and universe repositories, offering access to a broader range of secure open-source software.\n \nThe Legacy Support add-on further extends this period by an additional two years, ensuring that organizations can maintain their systems with the", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T02:38:04.391077+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://hardware.slashdot.org/story/24/03/26/013252/as-ai-booms-land-near-nuclear-power-plants-becomes-hot-real-estate?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "As AI Booms, Land Near Nuclear Power Plants Becomes Hot Real Estate", "age": null, "permanent": false, "description": "Tobias Mann reports via The Register: The land surrounding a nuclear power plant might not sound like prime real estate, but as more bit barns seek to trim costs, it's poised to become a rather hot commodity. All datacenters are energy-hungry but with more watt-greedy AI workloads on the horizon, nuclear power has fresh appeal, especially for hyperscalers. Such a shift in power also does wonders for greenwashing narratives around net-zero operations. While not technically renewable, nuclear power does have the benefit of being carbon-free, not to mention historically reliable -- with a few notable exceptions of course. All of these are purported benefits cited by startup NE Edge, which has been fighting for more than a year to be able to build a pair of AI datacenters adjacent to a 2GW Millstone nuclear power plant in Waterford, Connecticut.\n \nAccording to the Hartford Courant, NE Energy has secured $1.6 billion to construct the switching station and bit barns, which will spa", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T01:32:36.162335+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://yro.slashdot.org/story/24/03/25/2125211/us-uk-announce-sanctions-over-china-linked-election-hacks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "US, UK Announce Sanctions Over China-Linked Election Hacks", "age": null, "permanent": false, "description": "Earlier today, the U.S. and U.K. accused hackers linked to the Chinese state of being behind \"malicious\" cyber campaigns targeting political figures. The U.K. government also blamed China for a 2021 cyberattack that compromised the personal information of millions of U.K. voters. In response, PBS reports that the U.S. and British government announced sanctions against a company and two people linked to the Chinese government. From the report: Officials said those sanctioned are responsible for a hack that may have gained access to information on tens of millions of U.K. voters held by the Electoral Commission, as well as for cyberespionage targeting lawmakers who have been outspoken about the China threat. The Foreign Office said the hack of the election registers \"has not had an impact on electoral processes, has not affected the rights or access to the democratic process of any individual, nor has it affected electoral registration.\" The Electoral Commission said in August ", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T01:32:34.649930+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://yro.slashdot.org/story/24/03/25/2135232/binance-executive-detained-in-nigeria-escapes-custody?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "Binance Executive Detained In Nigeria Escapes Custody", "age": null, "permanent": false, "description": "A top executive from the crypto exchange Binance has escaped custody in Nigeria after being arrested for allegedly destabilizing the country's national currency. The Associated Press reports: Nadeem Anjarwalla, the regional manager for Binance in Africa, \"fled Nigeria using a smuggled passport,\" the office of Nigeria's National Security Adviser said in a statement, calling for \"whatever information that can assist law enforcement agencies to apprehend the suspect.\" Anjarwalla, who holds dual British and Kenyan citizenship, had been detained in Nigeria along with another colleague since Feb. 26 when they arrived in the country following a crackdown on the crypto platform. Tigran Gambaryan, the colleague who is an American citizen, remains in captivity.\n \nNigeria is Africa's largest crypto economy in terms of trade volume with many citizens using crypto to hedge their finances against surging inflation and the declining local currency. Binance stopped all trading with the Niger", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T00:27:17.506769+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://yro.slashdot.org/story/24/03/25/2037241/swat-team-raids-innocent-family-over-stolen-airpods-inaccurate-findmy-app-tracking?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "SWAT Team Raids Innocent Family Over Stolen AirPods, Inaccurate 'FindMy' App Tracking", "age": null, "permanent": false, "description": "A SWAT team in St. Louis County mistakenly raided the home of Brittany Shamily and her family, based on the inaccurate tracking of stolen AirPods by the \"FindMy\" app. The family is suing for damages stemming from embarrassment, unreasonable use of force, loss of liberty, and other factors. The Riverfront Times reports: Around 6:30 p.m. on May 26, Brittany Shamily was at home with her children, including an infant, when police used a battering ram to bust in her front door. \"What the hell is going on?\" she screamed, terrified for herself and her family. \"I got a three-month-old baby!\" Body camera footage from the scene shows Shamily come to the front door, her hands up, her face a mix of fright and utter confusion at the heavily armed folly making its way from her front porch into her foyer. \"Oh my god,\" she says. The SWAT team was looking for guns and other material related to a carjacking that had occurred that morning. Their search didn't turn up any of that -- though it ha", "vote": 0, "artist": null}, {"manual_status_code": 0, "date_published": "2024-03-26T00:27:15.954943+00:00", "album": "", "page_rating_contents": 94, "comments": [], "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "language": "en-us", "page_rating": 94, "user": null, "source_obj__id": 306, "page_rating_votes": 0, "status_code": 0, "link": "https://tech.slashdot.org/story/24/03/25/2052244/federation-is-the-future-of-social-media?utm_source=rss1.0mainlinkanon&utm_medium=feed", "thumbnail": null, "page_rating_visits": 0, "tags": [], "bookmarked": false, "title": "'Federation Is the Future of Social Media'", "age": null, "permanent": false, "description": "An anonymous reader quotes a report from The Verge, written by Nilay Patel: Today, I'm talking to Jay Graber, the CEO of Bluesky Social, which is a decentralized competitor to Twitter, er, X. Bluesky actually started inside of what was then known as Twitter &mdash; it was a project from then-CEO Jack Dorsey, who spent his days wandering the earth and saying things like Twitter should be a protocol and not a company. Bluesky was supposed to be that protocol, but Jack spun it out of Twitter in 2021, just before Elon Musk bought the company and renamed it X. Bluesky is now an independent company with a few dozen employees, and it finds itself in the middle of one of the most chaotic moments in the history of social media. There are a lot of companies and ideas competing for space on the post-Twitter internet, and Jay makes a convincing argument that decentralization -- the idea that you should be able to take your username and following to different servers as you wish -- is the", "vote": 0, "artist": null}]