[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T23:40:38.931231+00:00", "description": "U.S. real estate developers \"are having a hard time keeping up with demand,\" reports the Los Angeles Times, \"as businesses in search of secure spots for their servers rent nearly every square foot that becomes available...\"\n\n\nConstruction of new data centers is at \"extraordinary levels\" driven by \"insatiable demand,\" a recent report on the industry by real estate brokerage JLL found. \"Never in my career of 25 years in real estate have I seen demand like this on a global scale,\" said JLL real estate broker Darren Eades, who specializes in data centers... \n\nThe biggest drivers are AI and cloud service providers that include some of the biggest names in tech, such as Amazon, Microsoft, Google and Oracle. With occupancy in conventional office buildings still down sharply following the impact of the COVID-19 pandemic and property values falling, data centers represent a rare ripe opportunity for real estate developers, who are pursuing opportunities in major markets like Los Angeles and le", "id": 1236030, "language": null, "link": "https://hardware.slashdot.org/story/24/09/29/2322229/the-hot-new-trend-in-commercial-real-estate-renting-to-data-centers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Hot New Trend in Commercial Real Estate?  Renting to Data Centers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T22:35:52.624899+00:00", "description": "\"California Governor Gavin Newsom has vetoed SB 1047, a high-profile bill that would have regulated the development of AI,\" reports TechCrunch.\n\nThe bill \"would have made companies that develop AI models liable for implementing safety protocols to prevent 'critical harms'.\"\n\nThe rules would only have applied to models that cost at least $100 million and use 10^26 FLOPS (floating point operations, a measure of computation) during training. \n\nSB 1047 was opposed by many in Silicon Valley, including companies like OpenAI, high-profile technologists like Meta's chief AI scientist Yann LeCun, and even Democratic politicians such as U.S. Congressman Ro Khanna. That said, the bill had also been amended based on suggestions by AI company Anthropic and other opponents. \n\nIn a statement about today's veto, Newsom said, \"While well-intentioned, SB 1047 does not take into account whether an AI system is deployed in high-risk environments, involves critical decision-making or the use of sensitive ", "id": 1235856, "language": null, "link": "https://yro.slashdot.org/story/24/09/29/2150202/californias-governor-just-vetoed-its-controversial-ai-bill?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "California's Governor Just Vetoed Its Controversial AI Bill", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T20:25:59.467590+00:00", "description": "\"For the first time, scientists have created a flexible programmable chip that is not made of silicon...\" reports IEEE Spectrum &mdash; opening new possibilities for implantable devices, on-skin computers, brain-machine interfaces, and soft robotics. \n\nU.K.-based Pragmatic Semiconductor produced an \"ultralow-power\" 32-bit microprocessor, according to the article, and \"The microchip's open-source RISC-V architecture suggests it might cost less than a dollar...\" This shows potential for inexpensive applications like wearable healthcare electronics and smart package labels, according to the chip's inventors:\n\nFor example, \"we can develop an ECG patch that has flexible electrodes attached to the chest and a flexible microprocessor connected to flexible electrodes to classify arrhythmia conditions by processing the ECG data from a patient,\" says Emre Ozer, senior director of processor development at Pragmatic, a flexible chip manufacturer in Cambridge, England. Detecting normal heart rhyth", "id": 1235490, "language": null, "link": "https://news.slashdot.org/story/24/09/29/1931249/new-flexible-risc-v-semiconductor-has-great-potential?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "New Flexible RISC-V Semiconductor Has Great Potential", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T19:19:32.093692+00:00", "description": "\"SpaceX has temporarily grounded its Falcon 9 rocket,\" reports Space.com, \"after the vehicle experienced an issue on the Crew-9 astronaut launch for NASA.\"\n\n\nCrew-9 lifted off on Saturday (Sept. 28) from Florida's Cape Canaveral Space Force Station, sending NASA astronaut Nick Hague and Russian cosmonaut Aleksandr Gorbunov aloft aboard the Crew Dragon capsule \"Freedom\" [for a 5-month stay, returning in February with Starliner's two astronauts]. Everything appeared to go well. The Falcon 9's first stage aced its landing shortly after liftoff, and the rocket's upper stage deployed Freedom into its proper orbit; the capsule is on track to arrive at the International Space Station (ISS) on Sunday afternoon (Sept. 29) as planned. But the upper stage experienced an issue after completing that job, SpaceX announced early Sunday morning. \n\n\"After today's successful launch of Crew-9, Falcon 9's second stage was disposed in the ocean as planned, but experienced an off-nominal deorbit burn. As a", "id": 1235216, "language": null, "link": "https://science.slashdot.org/story/24/09/29/1837227/spacex-pausing-launches-to-study-falcon-9-issue-on-crew-9-astronaut-mission?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "SpaceX Pausing Launches to Study Falcon 9 Issue on Crew-9 Astronaut Mission", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T18:15:26.739555+00:00", "description": "Long-time Slashdot reader AsylumWraith writes: Visual Capitalist has posted an article and graph showing that, on average, 67% of US tech workers would be interested in joining a union. The percentage is highest at companies like Intuit, with 94% or respondents indicating they'd be interested in joining a union. On the other end of the scale, fewer than half of the employees at Apple, Tesla, and Google, who were surveyed were interested in such a move.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=67%25+of+American+Tech+Workers+Interested+In+Joining+a+Union%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F09%2F29%2F176258%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F09%2F29%2F176258%2F67-of-american-tech-workers-interested-in-joining-a-union%3Fu", "id": 1234988, "language": null, "link": "https://it.slashdot.org/story/24/09/29/176258/67-of-american-tech-workers-interested-in-joining-a-union?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "67% of American Tech Workers Interested In Joining a Union", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T17:10:33.081526+00:00", "description": "An anonymous reader shared this report from the Washington Post:\n\nLook at the top right corner of your phone. You might see an icon with \"5G\" and another with vertical bars showing the strength of your internet connection. Those symbols don't mean what you think they do. \n\nIf your phone shows \"5G,\" you're not necessarily connected to the latest and zippiest cellphone network technology. It might just mean that 5G connections are available nearby. And the bars are a cellular version of a shrug. There is no standard measure of how much signal strength each bar represents. \"The connection icon is a lie,\" said Avi Greengart, president of the technology analysis firm Techsponential... \n\nThe good news is you might not need 5G, anyway. Most of the time, your phone calls, texting and web surfing are perfectly fine on the prior generation of wireless technology called 4G or sometimes \"LTE.\" Many phone networks will funnel you over 5G service when it makes a real difference, like if you're on a", "id": 1234776, "language": null, "link": "https://mobile.slashdot.org/story/24/09/28/0519250/are-your-phones-5g-icon-and-signal-bars-lying-to-you?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Are Your Phone's 5G Icon and Signal Bars Lying to You?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T16:05:27.101716+00:00", "description": "Thursday America's Food and Drug Administration approved Cobenfy, \"the first new drug to treat people with schizophrenia in more than 30 years,\" reports ABC News:\n\nMost schizophrenia medications, broadly known as antipsychotics, work by changing dopamine levels, a brain chemical that affects mood, motivation, and thinking [according to Jelena Kunovac, MD, a board-certified psychiatrist and adjunct assistant professor at the University of Nevada, Las Vegas, in the Department of Psychiatry]. Cobenfy takes a different approach by adjusting acetylcholine, another brain chemical that aids memory, learning and attention, she said. By focusing on acetylcholine instead of dopamine, Cobenfy may reduce schizophrenia symptoms while avoiding common side effects like weight gain, drowsiness and movement disorders, clinical trials suggest. These side effects often become so severe and unpleasant that, in some studies mirroring real-world challenges, many patients stopped treatment within 18 months ", "id": 1234515, "language": null, "link": "https://science.slashdot.org/story/24/09/29/0614206/americas-fda-approves-first-new-drug-for-schizophrenia-in-over-30-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "America's FDA Approves First New Drug for Schizophrenia in Over 30 Years", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T15:00:21.521140+00:00", "description": "J. Doyne Farmer is the director of the complexity economics program at the Institute for New Economic Thinking in Oxford's research and policy unit. And he reminds us that solar and wind energy \"are very likely to get even less expensive and grow quickly,\" pointing out that \"the rate at which a given kind of technology improves is remarkably predictable.\"\n\nThe best-known example is Moore's Law... Like computer chips, many other technologies also get exponentially more affordable, though at different rates. Some of the best examples are renewable energy technologies such as solar panels, lithium batteries and wind turbines. The cost of solar panels has dropped an average of 10% a year, making them about 10,000 times cheaper than they were in 1958, the year of their pioneering use to power the Vanguard 1 satellite. Lithium batteries have cheapened at a comparable pace, and the cost of wind turbines has dropped steadily too, albeit at a slower rate. \n\nNot all technologies follow this cou", "id": 1234229, "language": null, "link": "https://news.slashdot.org/story/24/09/29/0456250/clean-energy-should-get-cheaper-and-grow-even-faster?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Clean Energy Should Get Cheaper and Grow Even Faster", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T11:45:14.217366+00:00", "description": "Uplevel provides insights from coding and collaboration data, according to a recent report from CIO magazine &mdash; and recently they measured \"the time to merge code into a repository [and] the number of pull requests merged\" for about 800 developers over a three-month period (comparing the statistics to the previous three months). \n\nTheir study \"found no significant improvements for developers\" using Microsoft's AI-powered coding assistant tool Copilot, according to the article (shared by Slashdot reader snydeq):\n\nUse of GitHub Copilot also introduced 41% more bugs, according to the study... \nIn addition to measuring productivity, the Uplevel study looked at factors in developer burnout, and it found that GitHub Copilot hasn't helped there, either. The amount of working time spent outside of standard hours decreased for both the control group and the test group using the coding tool, but it decreased more when the developers weren't using Copilot.\n \nAn Uplevel product manager/data ", "id": 1233490, "language": null, "link": "https://developers.slashdot.org/story/24/09/28/2132232/are-ai-coding-assistants-really-saving-developers-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Are AI Coding Assistants Really Saving Developers Time?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T08:29:33.771037+00:00", "description": "California governor Gavin Newsom \"vetoed a bill Saturday that would have required new cars to beep at drivers if they exceed the speed limit,\" reports the Associated Press:\n\n\nIn explaining his veto, Newsom said federal law already dictates vehicle safety standards and adding California-specific requirements would create a patchwork of regulations. The National Highway Traffic Safety \"is also actively evaluating intelligent speed assistance systems, and imposing state-level mandates at this time risks disrupting these ongoing federal assessments,\" the Democratic governor said... The legislation would have likely impacted all new car sales in the U.S., since the California market is so large that car manufacturers would likely just make all of their vehicles comply... \n\nStarting in July, the European Union will require all new cars to have the technology, although drivers would be able to turn it off. At least 18 manufacturers including Ford, BMW, Mercedes-Benz and Nissan, have already ", "id": 1232890, "language": null, "link": "https://tech.slashdot.org/story/24/09/29/0242241/californias-governor-vetoes-bill-requiring-speeding-alerts-in-new-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "California's Governor Vetoes Bill Requiring Speeding Alerts in New Cars", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T04:09:08.263959+00:00", "description": "Bryan Choi, an associate professor of law and computer science focusing on software safety, proposes shifting AI liability onto the builders of the systems:\nTo date, most popular approaches to AI safety and accountability have focused on the technological characteristics and risks of AI systems, while averting attention from the workers behind the curtain responsible for designing, implementing, testing, and maintaining such systems... \n\nI have previously argued that a negligence-based approach is needed because it directs legal scrutiny on the actual persons responsible for creating and managing AI systems. A step in that direction is found in California's AI safety bill, which specifies that AI developers shall articulate and implement protocols that embody the \"developer's duty to take reasonable care to avoid producing a covered model or covered model derivative that poses an unreasonable risk of causing or materially enabling a critical harm\" (emphasis added). Although tech leade", "id": 1232401, "language": null, "link": "https://yro.slashdot.org/story/24/09/29/0122212/can-ai-developers-be-held-liable-for-negligence?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Can AI Developers Be Held Liable for Negligence?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T03:04:16.197534+00:00", "description": "America's National Transportation Safety Board \"is issuing 'urgent safety recommendations' for some Boeing 737s...\" reports CNN, \"warning that critical flight controls could jam.\"\n\nThe independent investigative agency is issuing the warning that an actuator attached to the rudder on some 737 NG and 737 MAX airplanes could fail... \"Boeing's 737 flight manual instructs pilots confronted with a jammed or restricted rudder to 'overpower the jammed or restricted system (using) maximum force, including a combined effort of both pilots,'\" the NTSB said in a news release. \"The NTSB expressed concern that this amount of force applied during landing or rollout could result in a large input to the rudder pedals and a sudden, large, and undesired rudder deflection that could unintentionally cause loss of control or departure from a runway,\" the statement said. \n\"The FAA said United was the only U.S. airline flying planes with the manufacturing defect in the rudder control system,\" notes the Seatt", "id": 1232299, "language": null, "link": "https://tech.slashdot.org/story/24/09/28/2344251/us-transportation-safety-board-issues-urgent-alert-about-boeing-737-rudders?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Transportation Safety Board Issues Urgent Alert About Boeing 737 Rudders", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-29T01:59:54.233571+00:00", "description": "Last weekend Boeing announced that its CEO of Defense, Space, and Security \"had left the company,\" according to Barrons. \"Parting ways like this, for upper management, is the equivalent to firing,\" they write &mdash; though they add that setbacks on Starliner's first crewed test flight is \"far too simple an explanation.\"\n\n\n\nStarliner might, however, have been the straw that broke the camel's back. [New CEO Kelly] Ortberg took over in early August, so his first material interaction with the Boeing Defense and Space business was the spaceship's failed test flight... Starliner has cost Boeing $1.6 billion and counting. That's lot of money, but not all that much in the context of the Defense business, which generates sales of roughly $25 billion a year.... [T]he overall Defense business has performed poorly of late, burdened by fixed price contracts that have become unprofitable amid years of higher than expected inflation. Profitability in the defense business has been declining since 20", "id": 1232199, "language": null, "link": "https://tech.slashdot.org/story/24/09/28/2344234/why-boeing-is-dismissing-a-top-executive?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Why Boeing is Dismissing a Top Executive ", "vote": 0}]