[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T22:46:02.277412+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Angry T-Mobile customers have filed a class action lawsuit over the carrier's decision to raise prices on plans that were advertised as having a lifetime price guarantee. \"Based upon T-Mobile's representations that the rates offered with respect to certain plans were guaranteed to last for life or as long as the customer wanted to remain with that plan, each Plaintiff and the Class Members agreed to these plans for wireless cellphone service from T-Mobile,\" said the complaint (PDF) filed in US District Court for the District of New Jersey. \"However, in May 2024, T-Mobile unilaterally did away with these legacy phone plans and switched Plaintiffs and the Class to more expensive plans without their consent.\"\n \nThe complaint, filed on July 12, has four named plaintiffs who live in New Jersey, Georgia, Nevada, and Pennsylvania. They are seeking to represent a class of all US residents \"who entered into a T-Mobile One Plan, Simple Choi", "id": 924578, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/24/2028213/lawsuit-t-mobile-must-pay-for-breaking-lifetime-price-guarantee?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Lawsuit: T-Mobile Must Pay For Breaking Lifetime Price Guarantee", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T22:46:00.217332+00:00", "description": "Investigative journalist and cybersecurity expert Brian Krebs writes: The Chinese company in charge of handing out domain names ending in \".top\" has been given until mid-August 2024 to show that it has put in place systems for managing phishing reports and suspending abusive domains, or else forfeit its license to sell domains. The warning comes amid the release of new findings that .top was the most common suffix in phishing websites over the past year, second only to domains ending in \".com.\" On July 16, the Internet Corporation for Assigned Names and Numbers (ICANN) sent a letter to the owners of the .top domain registry. ICANN has filed hundreds of enforcement actions against domain registrars over the years, but in this case ICANN singled out a domain registry responsible for maintaining an entire top-level domain (TLD). Among other reasons, the missive chided the registry for failing to respond to reports about phishing attacks involving .top domains.\n \n\"Based on the information", "id": 924577, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/24/2033235/phish-friendly-domain-registry-top-put-on-notice?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Phish-Friendly Domain Registry '.top' Put On Notice", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T21:25:16.492267+00:00", "description": "Researchers at Check Point have uncovered a clandestine network of approximately 3,000 \"ghost\" accounts on GitHub, manipulating the platform to promote malicious content. Since June 2023, a cybercriminal dubbed \"Stargazer Goblin\" has been exploiting GitHub's community features to boost malicious repositories, making them appear legitimate and popular. \n\nAntonis Terefos, a malware reverse engineer at Check Point, discovered the network's activities, which include \"starring,\" \"forking,\" and \"watching\" malicious pages to increase their visibility and credibility. The network, named \"Stargazers Ghost Network,\" primarily targets Windows users, offering downloads of seemingly legitimate software tools while spreading various types of ransomware and info-stealer malware.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=A+Hacker+'Ghost'+Network+Is+Quietly+Spreading+Malware+on+GitHub%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F07%2F24%2F1952223%2F%3", "id": 924095, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/24/1952223/a-hacker-ghost-network-is-quietly-spreading-malware-on-github?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "A Hacker 'Ghost' Network Is Quietly Spreading Malware on GitHub", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T21:25:14.368561+00:00", "description": "Meta CEO Mark Zuckerberg has advocated for open-source AI development, asserting it as a strategic advantage for the United States against China. In a blog post, Zuckerberg argued that closing off AI models would not effectively prevent Chinese access, given their espionage capabilities, and would instead disadvantage U.S. allies and smaller entities. He writes: Our adversaries are great at espionage, stealing models that fit on a thumb drive is relatively easy, and most tech companies are far from operating in a way that would make this more difficult. It seems most likely that a world of only closed models results in a small number of big companies plus our geopolitical adversaries having access to leading models, while startups, universities, and small businesses miss out on opportunities. Plus, constraining American innovation to closed development increases the chance that we don't lead at all. Instead, I think our best strategy is to build a robust open ecosystem and have our le", "id": 924094, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/24/1919227/open-source-ai-better-for-us-as-china-will-steal-tech-anyway-zuckerberg-argues?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Open Source AI Better for US as China Will Steal Tech Anyway, Zuckerberg Argues", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T21:25:12.435474+00:00", "description": "Malaysia's digital minister said today he has asked global tech firms Microsoft and CrowdStrike to consider compensating companies that suffered losses during last week's global tech outage. From a report: Five government agencies and nine companies operating in aviation, banking and healthcare were among those affected in Malaysia, minister Gobind Singh Deo told reporters. \"If there are any damages or losses, where there have been any parties that have made such claims, I've asked them to consider those claims and see to what extent they are able to help resolve the issue,\" Gobind said, adding that the government would also assist on the claims where possible. The total amount of losses incurred has not yet been determined, he said. The outage will cost Fortune 500 companies $5.4 billion, according to estimates from insurers. The projected financial losses exclude Microsoft.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Malaysia+Asks+Micros", "id": 924093, "language": "en-us", "link": "https://slashdot.org/story/24/07/24/1959229/malaysia-asks-microsoft-crowdstrike-to-consider-covering-losses-from-global-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Malaysia Asks Microsoft, CrowdStrike To Consider Covering Losses From Global Outage", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T19:36:37.443940+00:00", "description": "Google is now the only search engine that can surface results from Reddit, making one of the web's most valuable repositories of user generated content exclusive to the internet's already dominant search engine. 404 Media: If you use Bing, DuckDuckGo, Mojeek, Qwant or any other alternative search engine that doesn't rely on Google's indexing and search Reddit by using \"site:reddit.com,\" you will not see any results from the last week. \n\nDuckDuckGo is currently turning up seven links when searching Reddit, but provides no data on where the links go or why, instead only saying that \"We would like to show you a description here but the site won't allow us.\" Older results will still show up, but these search engines are no longer able to \"crawl\" Reddit, meaning that Google is the only search engine that will turn up results from Reddit going forward. Searching for Reddit still works on Kagi, an independent, paid search engine that buys part of its search index from Google. The news shows ", "id": 923569, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/24/1832237/googles-exclusive-reddit-access?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's Exclusive Reddit Access", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T19:36:35.105263+00:00", "description": "AI is increasingly being employed in job interviews across China and India, marking a significant shift in recruitment practices in the region. This follows a similar practice making inroads in the U.S. Rest of World adds: A 2023 survey of 1,000 human-resources workers by the U.S. firm ResumeBuilder found that 10% of companies were already using AI in the hiring process, and another 30% planned to start the following year. The research firm Gartner listed natural-language chatbots as one of 2023's key innovations for the recruiting industry, designating the technology as experimental but promising. Companies like Meituan, Siemens, and Estee Lauder are using AI-powered interviews, with platforms such as MoSeeker, Talently.ai, and Instahyre leading the charge in AI recruitment solutions.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+AI+Job+Interviewer+Will+See+You+Now%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F24%2F1858222%2F%3", "id": 923568, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/24/1858222/the-ai-job-interviewer-will-see-you-now?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The AI Job Interviewer Will See You Now", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T18:19:55.741396+00:00", "description": "OpenAI has built one of the fastest-growing businesses in history. It may also be one of the costliest to run. The Information: The ChatGPT maker could lose as much as $5 billion this year [non-paywalled source], according to an analysis by The Information, based on previously undisclosed internal financial data and people involved in the business. [...] On the cost side, OpenAI as of March was on track to spend nearly $4 billion this year on renting Microsoft's servers to power ChatGPT and its underlying LLMs (otherwise known as inference costs), said a person with direct knowledge of the spending. In addition to running ChatGPT, OpenAI's training costs -- including paying for data -- could balloon to as much as $3 billion this year. Last year, OpenAI ramped up the training of new AI faster than it had originally planned, said a person with direct knowledge of the decision. So while the company earlier planned to spend about $800 million on such costs, it ended up spending considerab", "id": 923042, "language": "en-us", "link": "https://slashdot.org/story/24/07/24/1722226/openai-could-lose-5-billion-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Could Lose $5 Billion This Year", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T18:19:53.370799+00:00", "description": "In a response to the UK's Competition and Markets Authority's investigation into cloud services and licensing, Microsoft has defended its practices, asserting that its terms \"do not meaningfully raise cloud rivals' costs.\" The Windows-maker emphasized Amazon's continued dominance in the UK hyperscale market and noted Google's quarter-on-quarter growth, while also highlighting the declining share of Windows Server relative to Linux in cloud operating systems and SQL Server's second-place position behind Oracle. \n\n[...] The CMA's inquiry primarily focuses on the pricing disparity between using Microsoft products on Azure versus rival cloud platforms, with most surveyed customers perceiving Azure as the more cost-effective option for Microsoft software deployment. The Register adds: Microsoft's bullish take on this is that AWS and Google should be grateful that they even get to run its software. In its response, the company said: \"This dispute on pricing terms only arises because Microso", "id": 923041, "language": "en-us", "link": "https://slashdot.org/story/24/07/24/186204/microsoft-our-licensing-terms-do-not-meaningfully-raise-cloud-rivals-costs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft: Our Licensing Terms Do Not Meaningfully Raise Cloud Rivals' Costs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T17:14:10.744932+00:00", "description": "Lorenzo Franceschi-Bicchierai, reporting for TechCrunch: CrowdStrike, the cybersecurity firm that crashed millions of computers with a botched update all over the world last week, is offering its partners a $10 Uber Eats gift card as an apology, according to several people who say they received the gift card, as well as a source who also received one. On Tuesday, a source told TechCrunch that they received an email from CrowdStrike offering them the gift card because the company recognizes \"the additional work that the July 19 incident has caused.\" \n\n\"And for that, we send our heartfelt thanks and apologies for the inconvenience,\" the email read, according to a screenshot shared by the source. The same email was also posted on X by someone else. \"To express our gratitude, your next cup of coffee or late night snack is on us!\" The report adds that some people are having trouble redeeming the card. Some are seeing the error that says the gift card \"has been canceled by the issuing party", "id": 922528, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/24/162223/crowdstrike-offers-a-10-apology-gift-card-to-say-sorry-for-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "CrowdStrike Offers a $10 Apology Gift Card To Say Sorry For Outage", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T17:14:08.836942+00:00", "description": "T-Mobile and investment firm KKR have formed a joint venture (JV) to acquire fiber service provider Metronet. From a report: The fiber provider reaches over 300 communities and more than 2 million homes in 17 states. Metronet is both a pure-play fiber company and independent FTTH operator. In some markets, Metronet delivers residential speeds up to 5 Gbit/s. The acquisition includes Metronet's broadband infrastructure, residential fiber business operations and existing customers. The JV will acquire Oak Hill Capital's existing stake; Oak Hill Capital will re-invest for a minority position and Metronet CEO John Cinelli will retain a minority position after the deal closes. \n\nT-Mobile said it plans to invest nearly $4.9 billion to acquire a 50% equity stake in the JV and 100% of Metronet's residential fiber retail operations and customers, as well as funding of the JV. After the close of the deal, Metronet, based in Evansville, Indiana, will transition to a wholesale service provider fo", "id": 922527, "language": "en-us", "link": "https://slashdot.org/story/24/07/24/1617258/t-mobile-expands-fiber-footprint-with-metronet-acquisition?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "T-Mobile Expands Fiber Footprint With Metronet Acquisition", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T16:01:56.649761+00:00", "description": "An anonymous reader quotes a report from TechCrunch: Content creators are busy people. Most spend more than 20 hours a week creating new content for their respective corners of the web. That doesn't leave much time for audience engagement. But Mark Zuckerberg, Meta's CEO, thinks that AI could solve this problem. In an interview with internet personality Rowan Cheung, Zuckerberg laid out his vision for a future in which creators have their own bots, of sorts, that capture their personalities and \"business objectives.\" Creators will offload some community outreach to these bots to free up time for other, presumably more important tasks, Zuckerberg says.\n \n\"I think there's going to be a huge unlock where basically every creator can pull in all their information from social media and train these systems to reflect their values and their objectives and what they're trying to do, and then people can can interact with that,\" Zuckerberg said. \"It'll be almost like this artistic artifact that ", "id": 921916, "language": "en-us", "link": "https://slashdot.org/story/24/07/24/0520252/mark-zuckerberg-imagines-content-creators-making-ai-clones-of-themselves?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mark Zuckerberg Imagines Content Creators Making AI Clones of Themselves", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T16:01:54.285046+00:00", "description": "Global enterprises are grappling with the complexities of AI adoption, according to hundreds of top industry executives at a recent private software conference hosted by UBS. UBS adds: We heard:\n1. The data points from a private GPU cloud infrastructure provider were a very bullish readthrough to GPU demand, Microsoft's AI infra capabilities and the ramp of enterprise/software demand for training and inference compute.\n2. One F500 customer was at 1% Office Copilot roll-out, moving to perhaps 2% in a year as they a) fine-tune internal best practices and b) negotiate to get Microsoft much lower on price.\n3. One private flagged \"copilot chaos,\" with customers having to choose between AI copilots from seemingly every tech firm (we wonder if this creates pricing pressure and/or an evaluation slowdown).\n4. Popular use cases are AI apps for internal, domain-specific tasks (simple workflow automation).\n5. Little evidence of AI resulting in customer headcount cuts, but headcount reduction with", "id": 921915, "language": "en-us", "link": "https://slashdot.org/story/24/07/24/1345229/ai-adoption-creeps-as-enterprises-wrestle-with-costs-and-use-cases?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Adoption Creeps as Enterprises Wrestle With Costs and Use Cases", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T16:01:51.595994+00:00", "description": "A surge in new oil and gas production in 2024 threatens to unleash nearly 12 billion tonnes of planet-heating emissions, with the world's wealthiest countries -- such as the US and the UK -- leading a stampede of fossil fuel expansion in spite of their climate commitments, new data reveals. From a report: The new oil and gas field licences forecast to be awarded across the world this year are on track to generate the highest level of emissions since those issued in 2018, as heatwaves, wildfires, drought and floods cause death and destruction globally, according to analysis of industry data by the International Institute for Sustainable Development (IISD). The 11.9bn tonnes of greenhouse gas emissions -- which is roughly the same as China's annual carbon pollution -- resulting over their lifetime from all current and upcoming oil and gas fields forecast to be licensed by the end of 2024 would be greater than the past four years combined. The projection includes licences awarded as of J", "id": 921914, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/24/1354224/wealthy-western-countries-lead-in-global-oil-and-gas-expansion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Wealthy Western Countries Lead in Global Oil and Gas Expansion", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T16:01:49.730675+00:00", "description": "The US is warning homegrown tech startups and venture capital firms that some foreign investments may be fronts for hostile nations seeking data and technology for their governments or to undermine American businesses. From a report: Several US intelligence agencies are spotlighting the concern in a joint bulletin Wednesday to small businesses, trade associations and others associated with the venture capital community, according to the National Counterintelligence and Security Center. \"Unfortunately our adversaries continue to exploit early-stage investments in US startups to take their sensitive data,\" said Michael Casey, director of the NCSC. \"These actions threaten US economic and national security and can directly lead to the failure of these companies.\" \n\nWashington has ramped up scrutiny of investments related to countries it considers adversaries, most notably China, as advanced technologies with breakthrough commercial potential, such as artificial intelligence, can also be u", "id": 921913, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/24/1528251/us-urges-vigilance-by-tech-startups-vc-firms-on-foreign-funds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Urges Vigilance By Tech Startups, VC Firms on Foreign Funds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T10:02:31.739697+00:00", "description": "Negotiations on a global tax deal have extended beyond the June 30 deadline, with countries now looking to the G20 finance leaders meeting for progress. \"The stakes in the negotiations are high,\" reports Reuters. \"A failure to reach agreement on final terms could prompt several countries to reinstate their taxes on U.S. tech giants and risk punitive duties on billions of dollars in exports to the U.S.\" Some countries, like Canada, have already implemented their own digital services tax. Reuters reports: The so-called \"Pillar 1\" arrangement, part of a 2021 global two-part tax deal, aims to replace unilateral digital services taxes (DSTs) on U.S. tech giants including Alphabet's Google, Amazon.com and Apple through a new mechanism to share taxing rights on a broader, global group of companies. Standstill agreements under which Washington has suspended threatened trade retaliation against seven countries -- Austria, Britain, France, India, Italy, Spain and Turkey -- expired on June 30, b", "id": 919813, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/24/0513212/digital-tax-talks-in-g20-spotlight-as-us-tariff-threat-looms?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Digital Tax Talks In G20 Spotlight As US Tariff Threat Looms", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T07:46:51.906968+00:00", "description": "On Sunday, global temperatures reached their highest levels in recorded history (source may be paywalled; alternative source), with a daily average of 17.09 degrees Celsius (62.76 degrees Fahrenheit). \"The historic day comes on the heels of 13 straight months of unprecedented temperatures and the hottest year scientists have ever seen,\" adds the Washington Post, citing preliminary data from the Copernicus Climate Change Service. From the report: Though Sunday was only slightly warmer than the world's previous hottest day, Copernicus researchers noted, it was extraordinarily hotter than anything that came before. Before July 2023, Earth's daily average temperature record -- set in August 2016 -- was 16.8 degrees Celsius (62.24 degrees Fahrenheit). But in the past year, the global has exceeded that old record on 57 days.\n \nScientists have been tracking global temperatures only for the past few centuries. Yet there is good reason to believe that Sunday was the hottest day on Earth since ", "id": 919244, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/24/050242/sunday-was-the-hottest-day-ever-recorded-on-earth-scientists-say?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Sunday Was the Hottest Day Ever Recorded On Earth, Scientists Say", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T04:31:14.238894+00:00", "description": "An anonymous reader quotes a report from 404 Media's Jason Koebler: The Department of Homeland Security bought a dog-like robot that it has modified with an \"antenna array\" that gives law enforcement the ability to overload people's home networks in an attempt to disable any internet of things devices they have, according to the transcript of a speech given by a DHS official at a border security conference for cops obtained by 404 Media. The DHS has also built an \"Internet of Things\" house to train officers on how to raid homes that suspects may have \"booby trapped\" using smart home devices, the official said.\n \nThe robot, called \"NEO,\" is a modified version of the \"Quadruped Unmanned Ground Vehicle (Q-UGV) sold to law enforcement by a company called Ghost Robotics. Benjamine Huffman, the director of DHS's Federal Law Enforcement Training Centers (FLETC), told police at the 2024 Border Security Expo in Texas that DHS is increasingly worried about criminals setting \"booby traps\" with i", "id": 918743, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/07/23/2341250/dhs-has-a-dos-robot-to-disable-internet-of-things-booby-traps-inside-homes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "DHS Has a DoS Robot To Disable Internet of Things 'Booby Traps' Inside Homes", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T02:21:23.504739+00:00", "description": "During Alphabet's second-quarter earnings call today, Alphabet CFO Ruth Porat announced the organization will spend an additional $5 billion on its self-driving subsidiary, Waymo. \"This new round of funding, which is consistent with recent annual investment levels, will enable Waymo to continue to build the world's leading autonomous driving technology company,\" said Porat. TechCrunch reports: Porat noted that Google will focus on improving overall efficiencies in its \"other bets\" segment, which includes innovative projects that are distinct from the tech giant's core search and advertising business. Other companies in this segment are Verily, Calico, Google Ventures and drone company Wing. \"Waymo is an important example of this, with its technical leadership coupled with progress on operational performance,\" Porat continued. The executive noted that parent company Alphabet's 10-Q form, which has yet to be filed, will have more details.<p><div class=\"share_submission\">\n<a class=\"slash", "id": 918416, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/23/2314221/alphabet-to-invest-another-5-billion-into-waymo?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Alphabet To Invest Another $5 Billion Into Waymo", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T02:21:21.281019+00:00", "description": "According to Bloomberg, hackers have leaked internal documents stolen from Leidos Holdings, one of the largest IT services providers of the U.S. government. Reuters reports: The company recently became aware of the issue and believes the documents were taken during a previously reported breach of a Diligent Corp. system it used, the report said, adding that Leidos is investigating it. The Virginia-based company, which counts the U.S. Department of Defense as its primary customer, used the Diligent system to host information gathered in internal investigations, the report added, citing a filing from June 2023. A spokesperson for Diligent said the issue seems to be related to an incident from 2022, affecting its subsidiary Steele Compliance Solutions. The company notified impacted customers and had taken corrective action to contain the incident in November 2022.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Hackers+Leak+Documents+From+Pentago", "id": 918415, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/23/2323210/hackers-leak-documents-from-pentagon-it-services-provider-leidos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Hackers Leak Documents From Pentagon IT Services Provider Leidos", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T01:16:42.458854+00:00", "description": "An anonymous reader quotes a report from the Center for European Policy Analysis (CEPA): Alexey Soldatov, a Russian Internet pioneer and a founder of the first Internet provider in the country, has been sentenced by a court to two years in a labor colony on charges of \"abuse of power.\" Soldatov, 72, had been detained by a court in Moscow. He is terminally ill. Very few in Russia believe in the government charges against a man widely known as a Father of the Russian Internet -- and who is less well known as the father of Andrei Soldatov, one of this article's authors. Soldatov was accused of abuse of power when managing a pool of IP-addresses by an organization he had no position at. This legal absurdity was enough to see him imprisoned even though the court knew of Soldatov's illness, which meant the court had no legal right to pass a custodial sentence. His family believes that the decision is essentially a death sentence. The article details Soldatov's history and his pivotal role i", "id": 918152, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/23/2050252/the-kremlin-jails-the-father-of-russias-internet?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Kremlin Jails the Father of Russia's Internet", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-24T01:16:39.905082+00:00", "description": "Humble Games, the indie game publisher behind the popular pay-what-you-want \"Humble Game Bundle,\" has laid off its entire staff of 36 people. However, the company says it is not shutting down and Humble Bundle will not be impacted. Instead, the job cuts are part of a restructuring of operations. GameSpot reports: In a statement shared with GameSpot, Humble Games confirmed that Humble Bundle will have \"no impact on its operations. Additionally, ongoing and upcoming games from Humble Games will still move ahead and be published by the company. Humble Games is the publisher of many notable indie games, including Stray Gods, Bo: Path of the Teal Lotus, Chinatown Detective Agency, Ikenfell, Unpacking, Slay the Spire, and Midnight Fight Express, just to name a few.\n \nHumble Games is the separate publishing arm of digital storefront Humble Bundle. Both companies are owned by IGN Entertainment, but operate as a separate entities. Earlier this year, IGN Entertainment also bought video game web", "id": 918151, "language": "en-us", "link": "https://games.slashdot.org/story/24/07/23/234220/indie-game-publisher-humble-games-reportedly-lays-off-all-staff?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Indie Game Publisher Humble Games Reportedly Lays Off All Staff", "user": null, "vote": 0}]