[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-04T20:30:00+00:00", "description": "Remember when Rockstar Games released a disappointing re-release of an incredible classic game? No, not Grand Theft Auto: The Trilogy - The Definitive Edition. We're talking about last year's Red Dead Redemption, a port of the 2010 open-world classic for PS4 and Nintendo Switch.\n\nThe lack of quality-of-life features, meagre graphical improvements, and removal of online content, all for $50, made it a challenging recommendation. It's now available on PC, and with the help of Double Eleven, Rockstar has stepped up in terms of graphics options, including native 4K, higher high frame rates, shadow details, and more.\n\nUnfortunately, it's also for $50. While it's somewhat of an improvement over last year's console re-release, Red Dead Redemption on PC is best purchased at a discount. The story, presentation, characters, and world design remain as incredible as ever, which makes it all the more disappointing to see them in such a barebones fashion.", "id": 1452784, "language": null, "link": "https://www.youtube.com/watch?v=aa4hGFGlJKU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/aa4hGFGlJKU/hqdefault.jpg", "title": "Red Dead Redemption PC Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-04T18:30:44+00:00", "description": "Back when S.T.A.L.K.E.R.: Call of Pripyat released, few of us could have predicted that there wouldn’t be another S.T.A.L.K.E.R. game for the next decade and a half, but after a long hiatus, the franchise is finally set to return to the limelight. S.T.A.L.K.E.R. 2: Heart of Chornobyl is almost upon us, and excitement surrounding it is naturally high. \n\nExcited to go hands on with the game as we have been, there’s plenty about it that has caught the eye, from its massive open world to its emphasis on player freedom and agency to its gorgeous visuals and more. Here, we are going to go over a few such things that we cannot wait to experience for ourselves when S.T.A.L.K.E.R. 2 finally releases in a few days’ time.", "id": 1451988, "language": null, "link": "https://www.youtube.com/watch?v=zYh4pKx0q60", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/zYh4pKx0q60/hqdefault.jpg", "title": "Stalker 2: Heart of Chornobyl - 14 THINGS I CAN'T WAIT TO DO", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-04T11:15:03+00:00", "description": "I say this as a compliment- Slitterhead is one of the weirdest games I've played this entire console generation, and definitely the weirdest game I've played this year. Coming from Bokeh Game Studio – a new indie team formed by Keiichiro Toyama, the creator of Silent Hill, Siren, and Gravity Rush – it has certain expectations to live up to, but rather than being a slave to those expectations, it carves out a unique identity for itself. \n\nIt's not without its issues, and it certainly isn't a game that I'd recommend to anyone without any caveats- but if you can look past its issues, there's a very different and interesting gaming experience on offer here.", "id": 1449169, "language": null, "link": "https://www.youtube.com/watch?v=ZOQVM_-dGjk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/ZOQVM_-dGjk/hqdefault.jpg", "title": "Slitterhead Review - One of Weirdest Games of This Generation", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-04T06:30:01+00:00", "description": "All those years ago, Inquisition closed with Trespasser, a tease of something bigger in the future. If you unlock the secret post-credits cutscene in Dragon Age: The Veilguard, you'll witness something that seemingly undoes all those years of story-telling and lore, almost wiping the slate clean. \n\nWith BioWare confirming that there won't be any DLC, instead focusing on the next Mass Effect, it's baffling to tease anything, especially when a future title could undo it all once more. However, it's almost fitting - like it's a problem for the next team to deal with 10 years from now.", "id": 1448044, "language": null, "link": "https://www.youtube.com/watch?v=2-oEk0lTTb4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/2-oEk0lTTb4/hqdefault.jpg", "title": "Dragon Age: The Veilguard - WHAT THE HELL HAPPENED?", "vote": 0}]