[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-15T19:00:19+00:00", "description": "Having started out as a non-playable hidden pallet swap amusingly named after series co-creators Ed Boon and John Tobias (in reverse, at least), few could have predicted in the earliest days of his life as a Mortal Kombat character that Noob Saibot would go on to garner the sort of popularity he did. \n\nFrom a narrative perspective, he hasn’t ever really been at the forefront of things, playing a secondary antagonistic role every now and then at best, but in spite of tcche fact that he isn’t necessarily among the more prominent Mortal Kombat characters, his shadowy and enigmatic persona has certainly endeared him to a great many fans. \n\nWhen Mortal Kombat 1: Khaos Reigns launches not long from now, Noob Saibot will be stepping into the limelight once again, and ahead of his return to the grand stage, here, we’re going to go over his entire story over the course of the Mortal Kombat franchise.", "id": 1149979, "language": null, "link": "https://www.youtube.com/watch?v=gLcEnFZlqcw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/gLcEnFZlqcw/hqdefault.jpg", "title": "The Complete Story of Noob Saibot - Before You Play Mortal Kombat 1: Khaos Reigns [4K]", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-15T16:00:44+00:00", "description": "Final Fantasy 16 launches on PC on September 17, and there are a few things you should know before the game hits shelves. It brings everything available in the PS5 version along with a few features catered to PC players, including a 240 fps cap, support for various upscaling options, and numerous graphical options. \n\nYou won’t have to guess whether your machine can run the game, as the developers have released the minimum and recommended specs to aim for, and if that’s not enough, a demo is available which allows you to test out the game on your PC.\n\nThe demo is quite long, though that’s not a problem, as the save data will transfer to the final retail version of the game.", "id": 1149340, "language": null, "link": "https://www.youtube.com/watch?v=jHJhZ2eb9vE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/jHJhZ2eb9vE/hqdefault.jpg", "title": "Final Fantasy 16 PC - WHAT'S CHANGING?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-15T09:30:11+00:00", "description": "Until Dawn is finally coming to PC and PS5 with a fresh remake releasing this October. This isn’t just some lazy port. The team at Ballistic Moon ensured that they pulled out all the stops to add substantial enhancements and additions to the cult horror hit. \n\nPerhaps the biggest addition is the new over-the-shoulder camera. You can now fully control camera movement around your characters, a huge change from the original’s static camera. Facilitating this new camera are the new collectables, as well as new locations for every previous collectible. \n\nFans are going to have a field day searching every nook and cranny within the gorgeous newly lit environments. Graphics are also built from the ground-up with Unreal Engine 5 replacing the Decima Engine. All of these enhancements make for an enticing new experience, whether you’re a longtime fan of the branching narrative arcs or a new player trying it out on PC.", "id": 1147817, "language": null, "link": "https://www.youtube.com/watch?v=ZZA1YH7bsDA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/ZZA1YH7bsDA/hqdefault.jpg", "title": "How The Until Dawn PS5 Remake Is Shaping Up To be A MUST-PLAY Game For Horror Fans", "vote": 0}]