[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T20:30:00+00:00", "description": "The game all comes down to a few core strengths then - the art, the aesthetic, the atmosphere, and the exploration. All of that is great. Pretty much everything else has caveats, or stumbles greatly in its execution, from the story being entirely obtuse, the combat being either completely trivialized or undermined by the poor camera and controls, and the game’s jank constantly getting in the way and generating friction for the player. \n\nIf you are a fan of the genre, and love the atmosphere and satisfaction of exploring these worlds, and have already run through the several other alternatives available, then it’s worth looking into this game. It’s not full price, which does make it a slightly easier pill to swallow than it otherwise would have been with the sheer number of caveats and issues it has. But if you are not a fan of the genre, or have yet to play other entrants into the genre, most of which are better rounded titles than this is, then I would recommend those before this one", "id": 986706, "language": null, "link": "https://www.youtube.com/watch?v=5YK1wMIki2E", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/5YK1wMIki2E/hqdefault.jpg", "title": "Bleak Faith Forsaken PS5 Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T16:00:50+00:00", "description": "Massive Entertainment's Star Wars Outlaws launches on August 30th for Xbox Series X/S, PS5, and PC. There have been some trepidations about its polish based on recent previews, but some features have been worth highlighting. Thus far, the Syndicate system has looked worthwhile, with player actions influencing favors (and potential betrayals).\n\nThe concept of seeking out Experts to help with Kay's heist endeavor is also intriguing, and the exploration has received some praise. Venturing out on a desolate location to discover new things - it all sounds enticing, especially if you enjoy open-world titles.\n\nHere are 15 things we're excited to do in Star Wars Outlaws, whether the little things like sending Nix after enemies or participating in the big story heist.\n\nIntro 00:00\nNumber 1 0:41\nNumber 2 1:04\nNumber 3 1:37\nNumber 4 2:09\nNumber 5 2:35\nNumber 6 3:16\nNumber 7 3:44\nNumber 8 4:18\nNumber 9 4:47\nNumber 10 5:27\nNumber 11 5:56 \nNumber 12 6:30\nNumber 13 7:01\nNumber 14 7:31\nNumber 15 7:50", "id": 985123, "language": null, "link": "https://www.youtube.com/watch?v=nssdFlDbMuw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/nssdFlDbMuw/hqdefault.jpg", "title": "15 Things We Can't WAIT TO DO In Star Wars Outlaws", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T13:30:01+00:00", "description": "As exciting as the prospect of a fresh new IP can be, there's also an undeniable appeal to a new instalment in an existing franchise that confidently builds on past foundations to deliver a denser and more deftly balanced experience, and thankfully, 2024 is delivering in that area. \n\nHalfway through the year, we've already played quite a few outstanding sequels, while there's plenty more still left to look forward to in the months ahead as well. Here, we're going to talk about notable sequels of 2024 in both groups- some that have released and made their mark, and others that are yet to come but are generating no small amount of excitement.\n\nIntro 00:00\nNumber 1 00:40\nNumber 2 01:30\nNumber 3 2:06\nNumber 4 2:39 \nNumber 5 3:14\nNumber 6 3:55\nNumber 7 4:37 \nNumber 8 5:07\nNumber 9 5:36\nNumber 10 6:13 \nNumber 11 7:17\nNumber 12 8:03\nNumber 13 8:33 \nNumber 14 9:06\nNumber 15 9:36", "id": 983967, "language": null, "link": "https://www.youtube.com/watch?v=anOCBfvkcj0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/anOCBfvkcj0/hqdefault.jpg", "title": "15 NEW Video Game Sequels of 2024 You NEED TO PLAY", "user": null, "vote": 0}]