[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T23:41:42.280417+00:00", "description": "Apple is discontinuing its USB CD and DVD player accessory, the Apple USB SuperDrive. \"As noted by one of our readers, it's no longer possible to buy an Apple USB SuperDrive online via the official Apple Store in the US,\" reports 9to5Mac. \"The product's webpage says that it's 'Sold Out,' and given that it's a product introduced in 2008, it seems very unlikely that Apple will ever produce new units again.\" From the report: Customers can still use their location to see if there's still a unit available for pickup at one of the Apple Retail Stores. The product is still available in other countries such as the UK and Brazil. However, it's probably only a matter of time before Apple's USB SuperDrive disappears from all stores. The MacBook Air was the first MacBook without a built-in CD drive, which led the company to introduce an optical drive sold separately. Apple completely phased out optical drives from its computers in 2013, when all the Macs available in the lineup no longer had a CD", "id": 987655, "language": "en-us", "link": "https://apple.slashdot.org/story/24/08/06/2127230/apple-discontinues-usb-superdrive-after-16-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Discontinues USB SuperDrive After 16 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T23:41:40.467344+00:00", "description": "Italy's telecoms regulator AGCOM has summoned Google and Cloudflare to a September meeting to discuss strategies for combating online piracy, six months after launching its Piracy Shield blocking system. The move comes as IPTV piracy remains resilient despite new anti-piracy legislation passed in the country last year. The law introduced harsher penalties for providers and consumers of pirated content, including fines for watching pirate streams. It also granted more aggressive site-blocking powers. \n\nMajor stream suppliers appear minimally affected by overseas laws. however. AGCOM chief Massimiliano Capitanio seeks commitments from Google to limit pirate services in search results, according to TorrentFreak. The regulator also wants Cloudflare to address IPTV providers using its services to evade blocking.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+and+Cloudflare+Summoned+To+Explain+Their+Plans+To+Defeat+Pirate+IPTV%3A+https%3A%2F", "id": 987654, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/06/2128223/google-and-cloudflare-summoned-to-explain-their-plans-to-defeat-pirate-iptv?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google and Cloudflare Summoned To Explain Their Plans To Defeat Pirate IPTV", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T22:37:12.700063+00:00", "description": "A Reddit user discovered the backend prompts for Apple Intelligence in the developer beta of macOS 15.1, offering a rare glimpse into the specific guidelines for Apple's AI functionalities. Some of the most notable instructions include: \"Do not write a story that is religious, political, harmful, violent, sexual, filthy, or in any way negative, sad, or provocative\"; \"Do not hallucinate\"; and \"Do not make up factual information.\" MacRumors reports: For the Smart Reply feature, the AI is programmed to identify relevant questions from an email and generate concise answers. The prompt for this feature is as follows: \"You are a helpful mail assistant which can help identify relevant questions from a given mail and a short reply snippet. Given a mail and the reply snippet, ask relevant questions which are explicitly asked in the mail. The answer to those questions will be selected by the recipient which will help reduce hallucination in drafting the response. Please output top questions alo", "id": 987354, "language": "en-us", "link": "https://apple.slashdot.org/story/24/08/06/2113250/apples-hidden-ai-prompts-discovered-in-macos-beta?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple's Hidden AI Prompts Discovered In macOS Beta", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T22:37:10.489269+00:00", "description": "Facebook's AI-generated content problem is being fueled by its own creator bonus program, according to an investigation by 404 Media. The program incentivizes users, particularly from developing countries, to flood the platform with AI-generated images for financial gain. The outlet found that influencers in India and Southeast Asia are teaching followers how to exploit Facebook's algorithms and content moderation systems to go viral with AI-generated images. Many use Microsoft's Bing Image Creator to produce bizarre, often emotive content that garners high engagement. \n\n\"The post you are seeing now is of a poor man that is being used to generate revenue,\" said Indian YouTuber Gyan Abhishek in a video, pointing to an AI image of an emaciated elderly man. He claimed users could earn \"$100 for 1,000 likes\" through Facebook's bonus program. While exact payment rates vary, 404 Media verified that consistent viral posting can lead to significant earnings for users in countries like India. ", "id": 987353, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/06/2116258/where-facebooks-ai-slop-comes-from?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Where Facebook's AI Slop Comes From", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T21:32:31.214085+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Unlike Tesla, which hopes to develop its own bipedal 'bot to work on its production line sometime next year, BMW has brought in a robot from Figure AI. The Figure 02 robot has hands with sixteen degrees of freedom and human-equivalent strength. \"We are excited to unveil Figure 02, our second-generation humanoid robot, which recently completed successful testing at the BMW Group Plant Spartanburg. Figure 02 has significant technical advancements, which enable the robot to perform a wide range of complex tasks fully autonomously,\" said Brett Adcock, founder and CEO of Figure AI.\n \nBMW wanted to test how to integrate a humanoid robot into its production process -- how to have the robot communicate with the production line software and human workers and determine what requirements would be necessary to add robots to the mix. The Figure robot was given the job of inserting sheet metal parts into fixtures as part of the process of makin", "id": 986929, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/08/06/2050220/figure-ais-humanoid-robot-helped-assemble-bmws-at-us-factory?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Figure AI's Humanoid Robot Helped Assemble BMWs At US Factory", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T20:26:24.437435+00:00", "description": "theodp writes: After issuing mea culpas over diversity and compensation equity issues, tech companies began to promote their K-12 CS education philanthropy initiatives as corrective measures as they sought to deflect criticism and defeat shareholder calls for greater transparency into hiring and compensation practices. In 2016, for instance, Amazon argued it was already working with tech-backed nonprofits such as Code.org, the Anita Borg Institute, and Girls Who Code to increase women's and minorities' involvement in tech as it sought the SEC's permission to block a shareholder vote on a proposal on gender pay equality. As such, it wasn't terribly surprising to see the nation's tech giants again remind the public of their K-12 CS philanthropy efforts as they recently announced quarterly earnings. \n\nIn the Addressing Racial Injustice and Inequity section of its most recent 10-K Annual Report SEC filing, Microsoft boasted, \"We also expanded our Technology Education and Learning Support ", "id": 986595, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/06/1918207/amazon-microsoft-google-remind-public-of-their-k-12-cs-education-philanthropy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon, Microsoft, Google Remind Public of Their K-12 CS Education Philanthropy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T19:21:39.642369+00:00", "description": "U.S. Judge Amit Mehta released a 286-page ruling Monday in the Google search antitrust case, revealing key details of the tech giant's business practices. The document is packed with factual findings and legal conclusions and some amazing comments. Here's one, for instance: Google pays Apple billions of dollars a year to be the default search engine in Safari. But according to Eddy Cue, Apple's senior vice president of services, there's no other meaningful alternative. During the trial, he said that \"there's no price that Microsoft could ever offer\" to Apple to get the company to preload Bing in Safari. \"I don't believe there's a price in the world that Microsoft could offer us,\" Cue said at another point. \"They offered to give us Bing for free. They could give us the whole company.\" \n\nFor Google, this is a sign that they've earned their default status (which, incidentally, they pay Apple gobs of money to maintain). Judge Mehta says that this is an indication that the \"market reality ", "id": 986232, "language": "en-us", "link": "https://apple.slashdot.org/story/24/08/06/1842234/apple-thinks-bing-is-pretty-bad?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Thinks Bing is Pretty Bad", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T18:17:02.884730+00:00", "description": "Speaking of Google launching a new TV streaming device, the company says it's \"ending production of Chromecast\" after 11 years of selling the streaming dongles. From a report: Even though Chromecast devices will now be available \"while supplies last,\" Google says it will continue to push software and security updates to its newer devices without specifying which ones. The most recent update to the lineup was the Chromecast with Google TV released in 2022. \n\nBut now, Google says \"technology has evolved dramatically\" since the launch of the original Chromecast in 2013. \"We invested heavily in embedding Google Cast technology into millions of TV devices, including Android TV,\" Google writes. \"We are taking the next step in evolving how streaming TV devices can add even more capabilities to your smart TV, built on top of the same Chromecast technology.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Discontinues+the+Chromecast+Line%3A+http", "id": 985829, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/06/1725252/google-discontinues-the-chromecast-line?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Discontinues the Chromecast Line", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T18:17:01.205084+00:00", "description": "Intel has announced significant progress on its 18A process technology, with lead products successfully powering on and booting operating systems. The company's Panther Lake client processor and Clearwater Forest server chip, both built on 18A, achieved these milestones less than two quarters after tape-out. The 18A node, featuring RibbonFET gate-all-around transistors and PowerVia backside power delivery, is on track for production in 2025. \n\nIntel released the 18A Process Design Kit 1.0 in July, enabling foundry customers to leverage these advanced technologies in their designs. \"Intel is out ahead of everyone else in the industry with these innovations,\" Kevin O'Buckley, Intel's new head of Foundry Services stated, highlighting the node's potential to drive next-generation AI solutions. Clearwater Forest will be the industry's first mass-produced, high-performance chip combining RibbonFET, PowerVia, and Foveros Direct 3D packaging technology. It also utilizes Intel's 3-T base-die t", "id": 985828, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/06/182213/intel-foundry-achieves-major-milestones?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Foundry Achieves Major Milestones", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T17:10:57.781479+00:00", "description": "Microsoft said Delta Air Lines turned down repeated offers for assistance following last month's catastrophic system outage, echoing claims by CrowdStrike in an increasingly contentious conflict between the carrier and its technology partners. From a report: Microsoft employees reached out to Delta to give technical support every day from July 19 through July 23, and \"each time Delta turned down Microsoft's offers to help,\" according to a letter Tuesday from the technology giant's attorneys to Delta's representatives. Microsoft Chief Executive Officer Satya Nadella also personally emailed Delta CEO Ed Bastian and never heard back. \"Even though Microsoft's software had not caused the CrowdStrike incident, Microsoft immediately jumped in and offered to assist Delta at no charge,\" according to the letter, which was signed by Mark Cheffo of Dechert LLP. The claims, in response to Delta's hiring of attorney David Boies, heighten the tension after Delta suggested it would try to seek compen", "id": 985486, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/06/1615229/microsoft-hits-back-at-delta-in-clash-over-system-breakdown?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Hits Back at Delta in Clash Over System Breakdown", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T17:10:55.766878+00:00", "description": "An anonymous reader shares a report: Google has revealed technical details of its in-house data transfer tool, called Effingo, and bragged that it uses the project to move an average of 1.2 exabytes every day. As explained in a paper [PDF] and video to be presented on Thursday at the SIGCOMM 2024 conference in Sydney, bandwidth constraints and the stubbornly steady speed of light mean that not even Google is immune to the need to replicate data so it is located close to where it is processed or served. \n\nIndeed, the paper describes managed data transfer as \"an unsung hero of large-scale, globally-distributed systems\" because it \"reduces the network latency from across-globe hundreds to in-continent dozens of milliseconds.\" The paper also points out that data transfer tools are not hard to find, and asks why a management layer like Effingo is needed. The answer is that the tools Google could find either optimized for transfer time or handled point-to-point data streams -- and weren't u", "id": 985485, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/08/06/1650258/need-to-move-12-exabytes-across-the-world-every-day-just-effingo?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Need To Move 1.2 Exabytes Across the World Every Day? Just Effingo", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T16:08:01.586244+00:00", "description": "Google today unveiled its new Google TV Streamer, a $99.99 set-top box replacing the Chromecast. The device, shipping September 24, boasts improved performance with a 22% faster processor (over its predecessor), doubled RAM, and 32GB storage. It integrates Thread and Matter for smart home control, featuring a side-panel accessible via the remote. The Streamer supports Dolby Vision, Dolby Atmos and includes an Ethernet port. Design changes include a low-profile form factor in two colors and a redesigned remote with a finder function. Software enhancements use Gemini AI for content summaries and custom screensavers.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Unveils+%2499+TV+Streamer+To+Replace+Chromecast%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F08%2F06%2F1450209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/s", "id": 984970, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/06/1450209/google-unveils-99-tv-streamer-to-replace-chromecast?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Unveils $99 TV Streamer To Replace Chromecast", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T15:03:44.484288+00:00", "description": "Mozilla, the non-profit behind the Firefox browser, faces an uncertain future following Monday's landmark antitrust ruling against Google. The decision, which found Google illegally maintained its search monopoly, puts Mozilla's primary funding source at risk. In 2021-2022, Mozilla received $510 million from Google out of $593 million total revenue, according to its latest financial report. Fortune adds: You can be sure that critics of the judge's ruling will highlight the potentially devastating impact on Mozilla to make the case that the antitrust ruling will have unintended consequences on smaller tech industry players. Others might argue that Mozilla hasn't done enough with those spoils to differentiate its Firefox browser, or that it could cut a deal with another search engine like Bing if its Google deal goes away completely. Either way, Google will appeal the suit so a long battle may ensue. And there's another big domino to fall: the judge will rule on the remedy or remedies -", "id": 984440, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/06/0624251/the-biggest-loser-in-google-search-ruling-could-be-mozilla-and-firefox?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Biggest Loser in Google Search Ruling Could Be Mozilla and Firefox", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T15:03:42.467547+00:00", "description": "Mainframe computers, stalwarts of high-speed data processing, are finding new relevance in the age of AI. Banks, insurers, and airlines continue to rely on these industrial-strength machines for mission-critical operations, with some now exploring AI applications directly on the hardware, WSJ reported in a feature story. IBM, commanding over 96% of the mainframe market, reported 6% growth in its mainframe business last quarter. The company's latest zSystem can process up to 30,000 transactions per second and hold 40 terabytes of data. WSJ adds: Globally, the mainframe market was valued at $3.05 billion in 2023, but new mainframe sales are expected to decline through 2028, IDC said. Of existing mainframes, however, 54% of enterprise leaders in a 2023 Forrester survey said they would increase their usage over the next two years. \n\nMainframes do have limitations. They are constrained by the computing power within their boxes, unlike the cloud, which can scale up by drawing on computing p", "id": 984439, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/06/0642202/mainframes-find-new-life-in-ai-era?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mainframes Find New Life in AI Era", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T13:57:58.540770+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Hackers delivered malware to Windows and Mac users by compromising their Internet service provider and then tampering with software updates delivered over unsecure connections, researchers said. The attack, researchers from security firm Volexity said, worked by hacking routers or similar types of device infrastructure of an unnamed ISP. The attackers then used their control of the devices to poison domain name system responses for legitimate hostnames providing updates for at least six different apps written for Windows or macOS. The apps affected were the 5KPlayer, Quick Heal, Rainmeter, Partition Wizard, and those from Corel and Sogou.\n \nBecause the update mechanisms didn't use TLS or cryptographic signatures to authenticate the connections or downloaded software, the threat actors were able to use their control of the ISP infrastructure to successfully perform machine-in-the-middle (MitM) attacks that directed targeted users t", "id": 983996, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/06/0419236/mac-and-windows-users-infected-by-software-updates-delivered-over-hacked-isp?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mac and Windows Users Infected By Software Updates Delivered Over Hacked ISP", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T10:43:01.774416+00:00", "description": "OpenAI co-founder John Schulman announced Monday that he is leaving to join rival AI startup Anthropic. CNBC reports: The move comes less than three months after OpenAI disbanded a superalignment team that focused on trying to ensure that people can control AI systems that exceed human capability at many tasks. Schulman had been a co-leader of OpenAI's post-training team that refined AI models for the ChatGPT chatbot and a programming interface for third-party developers, according to a biography on his website. In June, OpenAI said Schulman, as head of alignment science, would join a safety and security committee that would provide advice to the board. Schulman has only worked at OpenAI since receiving a Ph.D. in computer science in 2016 from the University of California, Berkeley.\n \n\"This choice stems from my desire to deepen my focus on AI alignment, and to start a new chapter of my career where I can return to hands-on technical work,\" Schulman wrote in the social media post. He s", "id": 982886, "language": "en-us", "link": "https://slashdot.org/story/24/08/06/0411247/openai-co-founder-john-schulman-is-joining-anthropic?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Co-Founder John Schulman Is Joining Anthropic", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T07:28:36.694638+00:00", "description": "Scientists studying lunar samples brought back by the Apollo missions have determined that the moon's thin atmosphere is produced largely by meteorite impacts. \"Our findings provide a clearer picture of how the moon's surface and atmosphere interact over long timescales, [and] enhance our understanding of space weathering processes,\" said Dr Nicole Nie, the co-author of the new study based at MIT's department of Earth, atmospheric, and planetary sciences. The Guardian reports: Writing in the journal Science Advances, Nie and her colleagues describe how the lunar atmosphere must be constantly replenished because its atoms are continuously being lost to space, primarily because of the moon's weak gravity, or trapped on the lunar surface. Ultraviolet photons from the sun can rerelease the latter, but the researchers say replenishment of the atmosphere is thought to rely on atoms being released from within lunar minerals -- either via vaporisation by meteorite impacts, or by solar wind sp", "id": 982132, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/06/0359238/meteorite-impacts-produce-most-of-moons-thin-atmosphere-study-reveals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meteorite Impacts Produce Most of Moon's Thin Atmosphere, Study Reveals", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T06:23:34.802206+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Distracted driving isn't only a result of drivers using their phones when they should be paying attention. But it is a significant cause of the problem, accounting for at least 13 percent of distracted driving deaths and rising to 1 in 5 for young drivers. Now, a study conducted with customers of the Progressive insurance company has tested different strategies to get those drivers to put their phones down in the car, and it found two that significantly reduced handheld use, with the effect persisting after the end of the study. The study recruited 1,653 customers already enrolled in its Progressive Snapshot program, which involves the use of a smartphone app that detects phone use while driving. Before the start of the trial, the participants all averaged more than 6.4 minutes per hour of handheld use while driving -- Progressive says its safest customers have handheld usage of less than 1 minute per hour while driving. [...] Pay", "id": 981945, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/05/2213228/gamification-gets-drivers-to-put-down-their-phones-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Gamification Gets Drivers To Put Down Their Phones, Study Finds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T03:08:05.711347+00:00", "description": "In a note to clients, seen by Slashdot, brokerage house Jefferies writes: Netflix's last price hike on the standard plan was in Jan 2022, its ad- supported plan remains the cheapest (among major players) in the industry, and its move into live sports increases pricing power - for these 3 reasons we suspect a price hike in Q4 or December of this year could be coming on the standard plan. \n\nAs stated in the Q4 2023 letter (following the announcement of WWE Raw coming in 2025): \"As we invest in and improve Netflix, we'll occasionally ask our members to pay a little extra to reflect those improvements, which in turn helps drive the positive flywheel of additional investment.\" We believe Netflix has been positioning itself throughout this year for a year-end price hike. December / 2025 will have major content releases supporting a pricing increase including the Christmas NFL game, Squid Game 2 on Dec. 26th (season 1 - the #1 watched NFLX show of all time), WWE Raw starting Jan 2025, and St", "id": 981383, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/08/06/0242222/netflix-to-hike-price-again-by-december-jefferies-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Netflix To Hike Price Again By December, Jefferies Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T00:36:47.766871+00:00", "description": "With Windows 10's end-of-life update coming next October, it appears that users are finally making the jump to its successor. As spotted by Neowin, Windows 11 crossed the 30% market share mark for the first time since its release. From the report: According to Statcounter's latest findings, last month, Windows 11 reached a new all-time high of 30.83%, gaining 1.08 points in just one month or 7.17 points year-over-year (it was at 23.66% in July 2023). Just as Windows 11 climbs, Windows 10 loses its market share. It is now below 65%, or 64.99%, to be precise, or -1.06 points in one month. Year-over-year change is 11.15 points (it was at 71.14% in July 2023).\n[...]\n \nOther Windows versions, which are now long unsupported, still have a fair share of customers who refuse to jump-ship. Windows 7, for one, is the third most popular Windows with a 3.04% market share (+0.08 points). Windows 8.1 is fourth with 0.42% (+0.02 points), and Windows XP is fifth with 0.38% (-0.01 points).<p><div class", "id": 981002, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/05/2221219/windows-11-hits-30-market-share-for-the-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Windows 11 Hits 30% Market Share For the First Time", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-06T00:36:45.206904+00:00", "description": "iPhone and Apple Watch users in California will soon be able to add their digital ID and driver's license to the Wallet app, as revealed by new landing pages on the state DMV website. This feature follows a slow rollout since its announcement, with only five states currently supporting it. MacRumors reports: \"Now you can add your California driver's license or state ID to Apple Wallet on iPhone and Apple Watch so you can present it easily and securely in person and in app,\" reads the landing page, which contains broken links and placeholder images, and is still missing a proper website security certificate. The webpages were discovered on Sunday by Jimmy Obomsawin, after someone added a link to the landing pages in an Apple Wallet Wikipedia entry last Wednesday.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=iPhone+Driver's+License+Support+Coming+Soon+To+California%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F08%2F05%2F2227238%2F%3Futm_s", "id": 981001, "language": "en-us", "link": "https://news.slashdot.org/story/24/08/05/2227238/iphone-drivers-license-support-coming-soon-to-california?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "iPhone Driver's License Support Coming Soon To California", "user": null, "vote": 0}]