[{"title": "Democracy on Trial: Gabriel Sterling (interview) | FRONTLINE", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "dead": false, "language": null, "description": "Gabriel Sterling is an elections official in Georgia. He served as the state’s voting system implementation manager from 2019 to 2020 and is currently the chief operating officer for the secretary of state. He testified before the House Select Committee to Investigate the January 6th Attack on the U.S. Capitol.\n\nThe following interview was conducted by Kirk Documentary Group’s Mike Wiser for FRONTLINE on Oct. 17, 2023. It has been edited for clarity and length.\n\nThis interview is being published as part of FRONTLINE’s Transparency Project, an effort to open up the source material behind our documentaries. Explore the transcript of this interview, and others, on the FRONTLINE website: https://www.pbs.org/wgbh/frontline/interview-collection/democracy-on-trial/\n\n#Frontline #Interview #GabrielSterling\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube", "permanent": false, "user": null, "comments": [], "bookmarked": false, "thumbnail": "https://i3.ytimg.com/vi/NwKZYE_Yi94/hqdefault.jpg", "tags": [], "page_rating_contents": 0, "link": "https://www.youtube.com/watch?v=NwKZYE_Yi94", "page_rating_votes": 0, "artist": "FRONTLINE PBS | Official", "page_rating_visits": 0, "age": null, "vote": 0, "date_published": "2024-02-21T16:00:12+00:00", "page_rating": 0, "album": "", "source_obj__id": 218}, {"title": "The Plea (full documentary) | Investigating Plea Bargains in the U.S. Justice System | FRONTLINE", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "dead": false, "language": null, "description": "The vast majority of felony convictions in the U.S. are the result of plea bargains, not jury trials. In this 90-minute documentary, FRONTLINE explored the moral, judicial and constitutional implications of plea bargains’ role in the justice system. (Aired 2004)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: https://www.pbs.org/donate​\n\nIt is the centerpiece of America’s judicial process: the trial by jury system that places a defendant’s fate in the hands of a jury of one’s peers. But most criminal cases in the U.S. never reach a jury and instead are settled through plea bargains in which a person agrees to plead guilty in exchange for a reduced sentence.\n\nProponents say plea bargains are the safety valve that keeps cases moving through the U.S.’s backlogged courts. Critics contend that the push to resolve cases through plea bargains jeopardizes the constitutional rights of defendants, who may be pressured to admit their guilt whe", "permanent": false, "user": null, "comments": [], "bookmarked": false, "thumbnail": "https://i3.ytimg.com/vi/V_Rh9ZlgwV8/hqdefault.jpg", "tags": [], "page_rating_contents": 0, "link": "https://www.youtube.com/watch?v=V_Rh9ZlgwV8", "page_rating_votes": 0, "artist": "FRONTLINE PBS | Official", "page_rating_visits": 0, "age": null, "vote": 0, "date_published": "2024-02-21T00:00:14+00:00", "page_rating": 0, "album": "", "source_obj__id": 218}]