[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "20 Years Later, Does Metal Gear Solid: The Twin Snakes Hold Up? (REVIEW)", "description": "The Metal Gear Solid series continues to be one of the most respected and revered action-adventure franchises of all time, and a lot of that could be credited to the spectacular gameplay and thought-provoking narratives found in each new entry. \n\nThe original Metal Gear Solid was an important milestone in skyrocketing stealth action to the mainstream, and Konami tried to modernize the classic with the release of Twin Snakes on the GameCube. \n\nThe game was met with a divisive critical reception for a wide array of reasons, and with this video we will be revisiting this remake to see how those criticisms have aged. Is Twin Snakes actually that bad, or is it is a misunderstood masterpiece? We break down each and every aspect of the game, see how it holds up in 2024, and finally assess it as a whole with proper scoring.", "link": "https://www.youtube.com/watch?v=GyvMIl5AP-o", "date_published": "2024-01-10T17:30:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i4.ytimg.com/vi/GyvMIl5AP-o/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Tekken 8 vs. Tekken 7 - 15 BIGGEST DIFFERENCES", "description": "It's been almost seven years since the launch of Tekken 7 on consoles, and Bandai Namco is finally delivering a sequel. Tekken 8 is more than just a graphical update that reuses assets from its predecessors. Developed on Unreal Engine 5, it's a giant leap in fidelity while offering several new mechanics.\n\nAside from a Story Mode, there's the new Heat System. New characters, like Victor and Reina, further mix up the gameplay, while stage destruction is more intricate and cinematic than before. There's also the new Battle Lounge, cross-platform play and much more.\n\nWhat are the biggest differences between Tekken 7 and Tekken 8 that you should be aware of? Find out here.", "link": "https://www.youtube.com/watch?v=8uwellSDlEA", "date_published": "2024-01-10T14:30:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i1.ytimg.com/vi/8uwellSDlEA/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "17 MASSIVE Xbox Series X | S Exclusive Games To Look Forward To In 2024 And Beyond", "description": "It’s no secret that Microsoft hasn’t been at its best for quite some time now, and its efforts to strengthen its first-party library of games haven’t been all that impactful. \n\nHowever, 2023 had surprise hits like Hi-Fi Rush and there was Starfield from Bethesda along with Forza Motorsport. But looking at the future of Xbox, there’s quite a bit of possibility that Microsoft and Xbox may have its best year with upcoming releases such as Senua’s Saga: Hellblade 2, Marvel’s Blade, and much more. With this feature, we take a look at the best upcoming Xbox Series X/S exclusives that will be releasing in 2024 and beyond.", "link": "https://www.youtube.com/watch?v=snU-mlsIc9E", "date_published": "2024-01-10T09:30:26+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i4.ytimg.com/vi/snU-mlsIc9E/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]