[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-21T16:30:04+00:00", "description": "When you think PlayStation, several franchises come to mind - Horizon, The Last of Us, Gran Turismo - and rightfully so, given their success. However, in the PS3 era, it was all about Naughty Dog's Uncharted series.\n\nComing off of the Jak and Daxter series, the developer presented more realistic visuals and action-platforming alongside a charismatic new hero in Nathan Drake. Suffice it to say that the series was a success, with it selling millions of copies and earning significant critical praise.\n\nThough Drake's story concluded in Uncharted 4: A Thief's End, there have been reports and rumors of new games, whether it's a reboot or remake. Is Uncharted 5 happening at any point, or does Sony have something else in mind for the franchise?", "language": null, "link": "https://www.youtube.com/watch?v=PTgs-TlNdpY", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/PTgs-TlNdpY/hqdefault.jpg", "title": "Where The Heck Is UNCHARTED 5?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-21T14:30:18+00:00", "description": "Ninja Theory has delivered an excellent sequel with Senua’s Saga: Hellblade 2 which feels like a major improvement in almost every conceivable way. The team took what worked in the original and cranked it up to eleven which includes but is not limited to the stellar visual presentation. \n\nBuilt using Unreal Engine 5, Hellblade 2 flaunts photorealistic visuals adorned by the engine’s rendering techniques like photogrammetry, MetaHuman, and Nanite among others. \n\nHaving a cross-platform engine as the base for development has also helped in maintaining uniformity between the Xbox Series X and PC without skimping out on optimizations and enhancements for each platform. This graphics analysis dives deep into both versions of the game, and we also touch upon performance on our test bench.", "language": null, "link": "https://www.youtube.com/watch?v=VzWQBqeopDY", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/VzWQBqeopDY/hqdefault.jpg", "title": "Hellblade 2 Graphics Analysis - PHOTOREALISM FINALLY ACHIEVED?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-21T08:00:30+00:00", "description": "With Senua’s Saga: Hellblade 2, Ninja Theory sticks to the blueprint set by the first game very closely, delivering an audiovisual tour de force with an incredibly affecting story, and largely simplistic and basic gameplay and design. \n\nMechanically, the game does not compare to any other major peer in the genre – but if you come to these games for the story and for the spectacle, then Ninja Theory and Senua’s Saga: Hellblade 2 will deliver something unforgettable that will truly deliver the rare kind of next generation moment that used to be all too common to consoles not too long ago, and is largely lost to diminishing returns by this point. \n\nThough surprisingly straightforward areas, in others, Hellblade 2 is an unabashed masterpiece.", "language": null, "link": "https://www.youtube.com/watch?v=rmX12AsIHfA", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/rmX12AsIHfA/hqdefault.jpg", "title": "Senua's Saga: Hellblade 2 Review", "user": null, "vote": 0}]