[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T23:53:16.789024+00:00", "description": "Google is advancing the release timeline for Android 16, shifting it to the second quarter of 2025 to better align with new device launches and accelerate access to its latest AI and machine learning resources. It should also \"enable app creators and phone companies to prepare their products for the new software more quickly,\" reports CNET. From the report: [I]n a big-picture sense, the change could help facilitate a new wave of apps with more AI integration, considering developers will get access to Google's latest machine learning and AI resources even sooner. \"We're in a once-in-a-generation moment to completely reimagine what our smartphones can do and how we interact with them,\" Google's Seang Chau, who took on the role of vice president and general manager of the Android Platform earlier this year, said in an interview with CNET. \"It's a really exciting time for smartphones, and we've been putting a lot of thought into what we want to do next with them.\"\n \nIn addition to moving", "id": 1425767, "language": null, "link": "https://tech.slashdot.org/story/24/10/31/2019248/android-16-will-launch-earlier-than-usual?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Android 16 Will Launch Earlier Than Usual", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T22:48:37.748200+00:00", "description": "An anonymous reader quotes a report from SFGATE: If you've recently been laid off and have started the arduous process of looking for a new job, you've probably seen them on networking platforms like LinkedIn: postings for roles that are 30 days old, maybe more, with suspiciously wide salary ranges. They usually have hundreds, or even thousands, of hopeful applicants vying for the same position, but if you do a quick cross-check and notice that the role isn't posted on the company's actual website -- or any of their social media pages -- you should probably stop drafting that cover letter, because it's possible they're not hiring at all. \"Ghost jobs,\" or ads for positions that aren't actually open, are a common phenomenon in the tech industry, which has been plagued by layoffs and budget cuts over recent years. As unemployed workers struggle to regain their footing, recruiters and career coaches who spoke with SFGATE warned that these fake jobs posted by real companies serve multiple", "id": 1425556, "language": null, "link": "https://slashdot.org/story/24/10/31/206209/ghost-jobs-are-wreaking-havoc-on-tech-workers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Ghost Jobs Are Wreaking Havoc On Tech Workers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T22:48:37.317191+00:00", "description": "With Windows 10 support set to expire on October 14, 2025, Microsoft is offering a one-time, one-year Extended Security Updates plan for consumers. \"For $30, you'll receive 'critical' and 'important' security updates -- basically security patches that will continue to protect your Windows 10 PC from any vulnerabilities,\" reports PCWorld. \"That $30 is for one year's worth of updates, and that's the only option at this time.\" From the report: Microsoft has been warning users for years that Windows 10 support will expire in 2025, specifically October 14, 2025. At that point, Windows 10 will officially fall out of support: there will be no more feature updates or security patches. On paper, that would mean that any Windows 10 PC will be at risk of any new vulnerabilities that researchers uncover.\n \nPreviously, Microsoft had quietly hinted that consumers would be offered the same ESU protections offered to businesses and enterprises, as it did in December 2023 and again in an \"editor's no", "id": 1425555, "language": null, "link": "https://tech.slashdot.org/story/24/10/31/2011223/want-to-keep-getting-windows-10-updates-itll-cost-you-30?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Want To Keep Getting Windows 10 Updates? It'll Cost You $30", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T21:43:19.400684+00:00", "description": "Zoox, an Amazon-owned autonomous vehicle company, is set to roll out dozens of its purpose-built robotaxis in San Francisco and Las Vegas, starting with employee rides in San Francisco's SoMa neighborhood and the Las Vegas Strip. \"We have achieved that internal safety readiness\" required to launch the service, said co-founder and CTO Jesse Levinson on the TechCrunch Disrupt 2024 stage. TechCrunch reports: The announcement comes a decade after Zoox was founded and four years since it was acquired by Amazon and unveiled its purpose-built robotaxi. In that time, the nascent autonomous vehicle industry has gone through the full hype cycle that led to multi-billion-dollar valuations and later a wave of shutdowns and consolidation. \"We still exist,\" Levinson said, in a nod to the tumult the industry has gone through in recent years.\n \nLevinson said Zoox is going to take a \"measured approach\" to rolling out its robotaxi service, and noted that his company has been working closely with local", "id": 1425240, "language": null, "link": "https://tech.slashdot.org/story/24/10/31/1949211/zoox-custom-robotaxis-are-finally-coming-to-san-francisco-las-vegas?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Zoox Custom Robotaxis Are Finally Coming To San Francisco, Las Vegas", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T21:43:19.316860+00:00", "description": "Canada's Communications Security Establishment (CSE) revealed a sustained cyber campaign by the People's Republic of China, targeting Canadian government and private sector networks over the past five years. The report also flagged India, alongside Russia and Iran, as emerging cyber threats. The Register reports: The biennial National Cyber Threat Assessment described the People's Republic of China's (PRC) cyber operations against Canada as \"second to none.\" Their purpose is to \"serve high-level political and commercial objectives, including espionage, intellectual property (IP) theft, malign influence, and transnational repression.\" Over the past four years, at least 20 networks within Canadian government agencies and departments were compromised by PRC cyber threat actors. The CSE assured citizens that all known federal government compromises have been resolved, but warned that \"the actors responsible for these intrusions dedicated significant time and resources to learn about the ", "id": 1425239, "language": null, "link": "https://news.slashdot.org/story/24/10/31/1956250/chinese-attackers-accessed-canadian-government-networks-for-five-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Chinese Attackers Accessed Canadian Government Networks For Five Years", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T20:38:18.764303+00:00", "description": "An anonymous reader quotes a report from Ars Technica: More than 500 Amazon workers reportedly signed a letter to Amazon Web Services' (AWS) CEO this week, sharing their outrage over Amazon's upcoming return-to-office (RTO) policy that will force workers into offices five days per week. In September, Amazon announced that starting in 2025, workers will no longer be allowed to work remotely twice a week. At the time, Amazon CEO Andy Jassy said the move would make it easier for workers \"to learn, model, practice, and strengthen our culture.\" Reuters reported today that it viewed a letter from a swath of workers sent to AWS chief Matt Garman on Wednesday regarding claims he reportedly made during an all-hands meeting this month. Garman reportedly told attendees that 9 out of 10 employees he spoke with support the five-day in-office work policy. The letter called the statements \"inconsistent with the experiences of many employees\" and \"misrepresenting the realities of working at Amazon,\"", "id": 1424857, "language": null, "link": "https://slashdot.org/story/24/10/31/1943250/over-500-amazon-workers-decry-non-data-driven-logic-for-5-day-rto-policy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Over 500 Amazon Workers Decry 'Non-Data-Driven' Logic For 5-Day RTO Policy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T19:34:17.760963+00:00", "description": "OpenAI on Thursday launched a search feature within ChatGPT, its viral chatbot, that positions the high-powered AI startup to better compete with search engines like Google, Microsoft's Bing and Perplexity. From a report: ChatGPT search offers up-to-the-minute sports scores, stock quotes, news, weather and more, powered by real-time web search and partnerships with news and data providers, according to the company. It began beta-testing the search engine, called SearchGPT, in July. \n\nThe release could have implications for Google as the dominant search engine. Since the launch of ChatGPT in November 2022, Alphabet investors have been concerned that OpenAI could take market share from Google in search by giving consumers new ways to seek information online.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Launches+ChatGPT+Search%2C+Competing+With+Google+and+Microsoft%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2", "id": 1424435, "language": null, "link": "https://tech.slashdot.org/story/24/10/31/1817213/openai-launches-chatgpt-search-competing-with-google-and-microsoft?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Launches ChatGPT Search, Competing With Google and Microsoft", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T19:34:17.660973+00:00", "description": "Microsoft is once again delaying the roll out of its controversial Recall feature for Copilot Plus PCs. From a report: The software giant had planned to start testing Recall, which creates screenshots of mostly everything you see or do on a Copilot Plus PC, with Windows Insiders in October. Now, Microsoft says it needs more time to get the feature ready. \n\n\"We are committed to delivering a secure and trusted experience with Recall. To ensure we deliver on these important updates, we're taking additional time to refine the experience before previewing it with Windows Insiders,\" says Brandon LeBlanc, senior product manager of Windows, in a statement to The Verge. \"Originally planned for October, Recall will now be available for preview with Windows Insiders on Copilot Plus PCs by December.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Delays+Recall+Again%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F10%", "id": 1424434, "language": null, "link": "https://it.slashdot.org/story/24/10/31/1844259/microsoft-delays-recall-again?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Delays Recall Again", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T18:29:20.568059+00:00", "description": "Amazon, in what it described as a \"difficult decision,\" is winding down Kindle Vella and shutting it down completely in February 2025. From a report: When the company launched the serialized story platform in 2021, it said Vella was a way for readers to discover new fictional stories and a new way for authors to earn from the Kindle Direct Publishing service. But it hasn't caught on as it had hoped, Amazon explains on its website, and it has decided to throw in the towel three years after Vella's debut. \n\nAuthors can only publish stories on Vella until December 4, which is also the last day readers can purchase tokens. While readers will no longer be able to purchase tokens after that, they can continue using those tokens to unlock episodes until the program closes in February. The good news for those who've been following specific authors or stories on Vella is that they won't lose their access to whatever episodes they've already unlocked even after the platform shuts down.<p><div ", "id": 1424060, "language": null, "link": "https://slashdot.org/story/24/10/31/1235234/amazon-is-shutting-down-its-kindle-vella-serialized-story-platform-in-february-2025?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon is Shutting Down Its Kindle Vella Serialized Story Platform in February 2025", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T17:23:30.755259+00:00", "description": "Growing numbers of veteran video game developers are leaving large studios to work on smaller projects, citing bureaucratic burnout and creative constraints at major publishers. Nate Purkeypile, former lead artist on Bethesda's \"Starfield,\" quit in 2021 after facing up to 20 meetings weekly coordinating with a 400-person team across four offices. He has since released \"The Axis Unseen,\" a horror game he developed solo. \n\nThe trend, reported by Bloomberg, coincides with ballooning development costs in the industry. Sony's \"Uncharted 2\" cost $20 million in 2009, while 2020's \"The Last of Us: Part 2\" exceeded $200 million. \"Small studios are not burdened by stockholder expectations,\" Renee Gittins, International Game Developers Association board chair, told the publication. They're \"more nimble, [and] able to take greater risks.\" Recent indie successes like \"Balatro\" and \"Animal Well,\" created by solo developers, have also demonstrated the commercial viability of smaller productions.<p>", "id": 1423598, "language": null, "link": "https://games.slashdot.org/story/24/10/31/1315241/video-game-veterans-are-abandoning-big-studios-for-smaller-teams?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Video Game Veterans Are Abandoning Big Studios For Smaller Teams", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T17:23:30.659197+00:00", "description": "Meta CEO Mark Zuckerberg laid down the newest marker in generative AI training on Wednesday, saying that the next major release of the company's Llama model is being trained on a cluster of GPUs that's \"bigger than anything\" else that's been reported. From a report: Llama 4 development is well underway, Zuckerberg told investors and analysts on an earnings call, with an initial launch expected early next year. \"We're training the Llama 4 models on a cluster that is bigger than 100,000 H100s, or bigger than anything that I've seen reported for what others are doing,\" Zuckerberg said, referring to the Nvidia chips popular for training AI systems. \"I expect that the smaller Llama 4 models will be ready first.\" \n\nIncreasing the scale of AI training with more computing power and data is widely believed to be key to developing significantly more capable AI models. While Meta appears to have the lead now, most of the big players in the field are likely working toward using compute clusters ", "id": 1423597, "language": null, "link": "https://tech.slashdot.org/story/24/10/31/1319259/metas-next-llama-ai-models-are-training-on-a-gpu-cluster-bigger-than-anything-else?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta's Next Llama AI Models Are Training on a GPU Cluster 'Bigger Than Anything' Else", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T16:19:02.668982+00:00", "description": "Amazon has postponed the rollout of its AI-enhanced Alexa voice assistant to 2025, a significant setback in its race to compete with OpenAI's ChatGPT, according to Bloomberg. The delay underscores Amazon's challenges in modernizing Alexa's decade-old architecture, which relies on rigid command-response patterns rather than advanced language models. \n\nFurther reading: Alexa, Where's My Star Trek Computer?<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Delays+AI-Powered+Alexa+Upgrade+Amid+Technical+Challenges%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F10%2F31%2F1250208%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F10%2F31%2F1250208%2Famazon-delays-ai-powered-alexa-upgrade-amid-technical-challenges%3Futm_source%3Dslashdot%26utm_medium%3Dfaceb", "id": 1423050, "language": null, "link": "https://slashdot.org/story/24/10/31/1250208/amazon-delays-ai-powered-alexa-upgrade-amid-technical-challenges?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Delays AI-Powered Alexa Upgrade Amid Technical Challenges", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T16:19:02.256979+00:00", "description": "iPod creator and Nest founder Tony Fadell criticized OpenAI CEO Sam Altman and warned of AI dangers during TechCrunch Disrupt 2024 in San Francisco this week. \"I've been doing AI for 15 years, people, I'm not just spouting shit. I'm not Sam Altman, okay?\" Fadell said, drawing gasps from the audience. \n\nFadell, whose Nest thermostat used AI in 2011, called for more specialized and transparent AI systems instead of general-purpose large language models. He cited a University of Michigan study showing AI hallucinations in 90% of ChatGPT-generated patient reports, warning such errors could prove fatal. \"Right now we're all adopting this thing and we don't know what problems it causes,\" Fadell said, urging government regulation of AI transparency. \"Those could kill people. We are using this stuff and we don't even know how it works.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status='I'm+Not+Just+Spouting+Shit'%3A+iPod+Cre", "id": 1423049, "language": null, "link": "https://slashdot.org/story/24/10/31/1341239/im-not-just-spouting-shit-ipod-creator-nest-founder-fadell-slams-sam-altman?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'I'm Not Just Spouting Shit': iPod Creator, Nest Founder Fadell Slams Sam Altman", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T15:13:12.897430+00:00", "description": "After closing a $69 billion deal to buy virtualization technology company VMware a year ago, Broadcom wasted no time ushering in big changes to the ways customers and partners buy and sell VMware offerings -- and many of those clients aren't happy. ArsTechnica: To get a deeper look at the impact that rising costs and overhauls like the end of VMware perpetual license sales have had on VMware users, Ars spoke with several companies in the process of quitting the software due to Broadcom's changes. Here's what's pushing them over the edge. \n\nFor some, VMware prices more than tripled under Broadcom\nBroadcom closed its VMware acquisition in November 2023, and by December 2023, the company announced that it would stop selling perpetual VMware licenses. VMware products were previously sold under 8,000 SKUs, but they have now been combined into a few bundle packages. Additionally, higher CPU core requirements per CPU subscription have made VMware more expensive for some reseller partners. \n", "id": 1422615, "language": null, "link": "https://it.slashdot.org/story/24/10/31/135212/300-price-hikes-push-disgruntled-vmware-customers-toward-broadcom-rivals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "300% Price Hikes Push Disgruntled VMware Customers Toward Broadcom Rivals", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T14:08:25.192506+00:00", "description": "An anonymous reader quotes a report from Engadget: Last month at Meta Connect, Mark Zuckerberg said that Meta AI was \"on track\" to become the most-used generative AI assistant in the world. The company has now passed a significant milestone toward that goal, with Meta AI passing the 500 million user mark, Zuckerberg revealed during the company's latest earnings call. The half billion user mark comes just barely a year after the social network first launched its AI assistant last fall. Zuckerberg said the company still expects to become the \"most-used\" assistant by the end of 2024, though he's never specified how the company is measuring that metric. Zuck said that AI-driven improvements in feed and video recommendations have led to an 8% increase in time spent on Facebook and 5% increase on Instagram this year. Advertisers have also leveraged the company's AI tools to generate over 15 million ads in just the past month.\n \nSeparately, Meta's Threads app is gaining over a million new s", "id": 1422114, "language": null, "link": "https://tech.slashdot.org/story/24/10/31/0038200/meta-ai-surpasses-500-million-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta AI Surpasses 500 Million Users", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T14:08:24.946083+00:00", "description": "A new study examining a large sample of privately insured patients with obesity found that use of drugs such as Ozempic and Wegovy as anti-obesity medications more than doubled from 2022 to 2023. During that same period, there was a 25.6% decrease in patients undergoing metabolic bariatric surgery to treat obesity. From a report: The study, by researchers at Brigham and Women's Hospital, in collaboration with researchers at Harvard T.H. Chan School of Public Health and the Brown School of Public Health, is published in JAMA Network Open. \"Our study provides one of the first national estimates of the decline in utilization of bariatric metabolic surgery among privately insured patients corresponding to the rising use of blockbuster GLP-1 RA drugs,\" said senior author Thomas C. Tsai, a metabolic bariatric surgeon at Brigham and Women's Hospital. \n\nUsing a national sample of medical insurance claims data from more than 17 million privately insured adults, the researchers identified pati", "id": 1422113, "language": null, "link": "https://science.slashdot.org/story/24/10/31/1230224/weight-loss-surgery-down-25-as-anti-obesity-drug-use-soars?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Weight-Loss Surgery Down 25% as Anti-Obesity Drug Use Soars", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T10:55:57.491340+00:00", "description": "An anonymous reader quotes a report from Behind the Black: According to a new very detailed engineering analysis into the causes of the collapse of the Arecibo radio telescope in Puerto Rico in 2020, the failure was caused first by a surprising interaction between the radio electronics of Arecibo and the traditional methods used to anchor the cables, and second by a failure of inspections to spot the problem as it became obvious.\n \nThe surprising engineering discovery is illustrated [here (PNG)]. The main antenna of Arecibo was suspended above the bowl below by three main cables. The figure shows the basic design of the system used to anchor the cable ends to their sockets. The end of the cable bunches would be inserted into the socket, spread apart, and then zinc would be poured in to fill the gap and then act as a plug and glue to hold the cables in place. According to the report, this system has been used for decades in many applications very successfully.\n \nWhat the report found ", "id": 1420850, "language": null, "link": "https://tech.slashdot.org/story/24/10/31/0016233/arecibo-collapsed-because-of-engineering-failures-that-inspectors-failed-to-spot?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Arecibo Collapsed Because of Engineering Failures That Inspectors Failed To Spot", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T08:45:58.231787+00:00", "description": "Heat-related deaths, food insecurity and the spread of infectious diseases caused by the climate crisis have reached record levels, according to a landmark report. The Guardian: The Lancet Countdown's ninth report on health and the climate breakdown reveals that people across the world face unprecedented threats to their health from the rapidly changing climate. \"This year's stocktake of the imminent health threats of climate inaction reveals the most concerning findings yet,\" warned Dr Marina Romanello, executive director of the Lancet Countdown at University College London. \n\n\"Once again, last year broke climate change records with extreme heatwaves, deadly weather events, and devastating wildfires affecting people around the world. No individual or economy on the planet is immune [to] the health threats of climate change. The relentless expansion of fossil fuels and record-breaking greenhouse gas emissions compounds these dangerous health impacts, and is threatening to reverse the", "id": 1420341, "language": null, "link": "https://news.slashdot.org/story/24/10/31/0114217/record-levels-of-heat-related-deaths-in-2023-due-to-climate-crisis-report-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Record Levels of Heat-Related Deaths in 2023 Due To Climate Crisis, Report Finds", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T07:40:41.051297+00:00", "description": "Nintendo has announced a mobile app called Nintendo Music, which lets users listen to classic video game soundtracks from Nintendo games spanning the last few decades, including Splatoon, Animal Crossing, and The Legend of Zelda. According to The Verge, the app is available on iOS and Android but only Switch Online subscribers will be able to stream the tunes. From the report: The app features curated playlists themed around games, moments, moods, or characters, though you can also build your own. It also supports streaming as well as downloading tracks for offline listening. Curiously, it includes a spoiler feature that lets you filter out tracks that, somehow, might spoil a game you haven't played or finished yet. And if you just want some Hyrule white noise, the app also lets you \"loop songs or extend select tracks to 15, 30, or 60 minutes for uninterrupted listening.\" Here's a list of all the regions the app will be available in.<p><div class=\"share_submission\" style=\"position:re", "id": 1420121, "language": null, "link": "https://games.slashdot.org/story/24/10/31/0031207/nintendo-made-a-music-streaming-app-for-video-game-soundtracks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Nintendo Made a Music Streaming App For Video Game Soundtracks", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T04:25:22.460998+00:00", "description": "In a new video published today, Boston Dynamics' humanoid robot Atlas is shown moving engine parts between bins without any human assistance. TechCrunch reports: Boston Dynamics is quick to note that the actions are being performed autonomously, without \"prescribed or teleoperated movements.\" [...] Boston Dynamics notes, \"The robot is able to detect and react to changes in the environment (e.g., moving fixtures) and action failures (e.g., failure to insert the cover, tripping, environment collision) using a combination of vision, force, and proprioceptive sensors.\"\n \nIn addition to the autonomously executed tasks, the video showcases impressive adaptive -- and strong -- actuators, as the robot pivots at its waist. The action minimizes movements, saving precious seconds in the process.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Boston+Dynamics'+Atlas+Robot+Executes+Autonomous+Automotive+Parts+Picking%3A+https%3A", "id": 1419591, "language": null, "link": "https://hardware.slashdot.org/story/24/10/30/2358247/boston-dynamics-atlas-robot-executes-autonomous-automotive-parts-picking?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Boston Dynamics' Atlas Robot Executes Autonomous Automotive Parts Picking", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T02:13:12.396253+00:00", "description": "An anonymous reader quotes a report from Reuters: Siemens will buy Altair Engineering for $10.6 billion, the American engineering software firm said on Wednesday, as the German company seeks to strengthen its presence in the fast-growing industrial software market. The offer price of $113 per share represents a premium of about 18.7% to Altair's closing price on Oct. 21, a day before Reuters first reported that the company was exploring a sale. The deal for Michigan-based Altair is Siemens's biggest acquisition since Siemens Healthineers bought medical device maker Varian Medical Systems for $16.4 million in 2020. [...]\n \nThe transaction is anticipated to add to Siemens' earnings per share in about two years from the deal's closing, which is expected in the second half of 2025. It will also increase Siemens' digital business revenue by about 8%, adding approximately 600 million euros ($651.36 million) to the company's digital business revenue in fiscal 2023. The transaction would hav", "id": 1419336, "language": null, "link": "https://tech.slashdot.org/story/24/10/31/009227/siemens-to-buy-altair-for-106-billion-in-digital-portfolio-push?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Siemens To Buy Altair For $10.6 Billion In Digital Portfolio Push", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T02:13:10.047615+00:00", "description": "First we had friends. Then we had influencers. And if Mark Zuckerberg is correct, the next big thing in our social media feeds will be AI generated content. Lots of it. Fortune: Zuckerberg described our future feeds during Facebook-parent company Meta's third quarter earnings conference call on Wednesday, describing it as a natural evolution. \"I think were going to add a whole new category of content which is AI generated or AI summarized content, or existing content pulled together by AI in some way,\" the Meta CEO said. \"And I think that that's gonna be very exciting for Facebook and Instagram and maybe Threads, or other kinds of feed experiences over time.\" \n\nZuckerberg touted the company's Llama large language model and the success of products it powers, such as the Meta AI chatbot that is now used by more than 500 million users every month. But Llama will increasingly play a role across Meta's business, Zuckerberg said, including tools for business customers and advertisers. As A", "id": 1419335, "language": null, "link": "https://tech.slashdot.org/story/24/10/31/019228/mark-zuckerberg-says-a-lot-more-ai-generated-content-is-coming-to-fill-up-facebook-and-instagram-feeds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Mark Zuckerberg Says a Lot More AI Generated Content is Coming To Fill Up Facebook and Instagram Feeds", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-31T00:51:43.624798+00:00", "description": "For months, the Colorado Department of State inadvertently exposed partial passwords for voting machines in a public spreadsheet. \"While the incident is embarrassing and already fueling accusations from the state's Republican party, the department said in a statement that it 'does not pose an immediate security threat to Colorado's elections, nor will it impact how ballots are counted,'\" reports Gizmodo. From the report: Colorado NBC affiliate station 9NEWS reported that Hope Scheppelman, vice chair of the state's Republican party, revealed the error in a mass email sent Tuesday morning, which included an affidavit from a person who claimed to have downloaded the spreadsheet and discovered the passwords by clicking a button to reveal hidden tabs.\n \nIn its statement, the Department of State said that there are two unique passwords for each of its voting machines, which are stored in separate places. Additionally, the passwords can only be used by a person who is physically operating t", "id": 1419106, "language": null, "link": "https://yro.slashdot.org/story/24/10/30/2339250/colorado-agency-improperly-posted-passwords-for-its-election-system-online?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Colorado Agency 'Improperly' Posted Passwords for Its Election System Online", "vote": 0}]