[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T23:34:26.748317+00:00", "description": "The Browser Company is developing a new, much simpler browser distinct from Arc, which has proven too complex for mainstream adoption despite a strong following among power users. The Verge's David Pierce reports: Arc is not dying, [says CEO Josh Miller]. He says that over and over, in fact, even after I tell him the YouTube video the company just released sounds like the thing companies say right before they kill a product. It's just that Arc won't change much anymore. It'll get stability updates and bug fixes, and there's a team at The Browser Company dedicated to those. \"In that sense,\" Miller says, \"it feels like a complete-ish product.\" Most of the team's energy and time will now be dedicated to starting from scratch. \"Arc was basically this front-end, tab management innovation,\" Miller says. \"People loved it. It grew like a weed. Then it started getting slow and started crashing a lot, and we felt bad, and we had to learn how to make it fast. And we kind of lost sight, in some ", "id": 1390524, "language": null, "link": "https://tech.slashdot.org/story/24/10/25/211220/the-company-behind-arc-is-now-building-a-second-much-simpler-browser?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Company Behind Arc Is Now Building a Second, Much Simpler Browser", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T23:34:26.590610+00:00", "description": "An anonymous reader quotes a report from InfoWorld: Select developers now are getting free access to JetBrains' WebStorm and Rider IDEs. The company on October 24 announced it has launched non-commercial licenses for its WebStorm JavaScript and TypeScript IDE and the Rider cross-platform .NET and game development IDE. As of now, developers using these IDEs for non-commercial purposes, such as open source project development or content creation, can use them for free. JetBrains views the move as expanding the availability of these IDEs to a broader swath of developer roles. More than two-thirds of developers code outside of work as a hobby and nearly 40% code for educational and learning purposes outside of work, the company said.\"Previously this year, JetBrains released other products under the same terms for non-commercial use, including RustRover, an IDE for Rust development, and Aqua, an IDE designed for test automation,\" notes InfoWorld. \"JetBrains also provides community edition", "id": 1390523, "language": null, "link": "https://tech.slashdot.org/story/24/10/25/2115229/jetbrains-offers-free-use-of-webstorm-and-rider-ides?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "JetBrains Offers Free Use of WebStorm and Rider IDEs", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T22:29:33.908527+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Earlier this year, we reported on the video game archivists asking for a legal DMCA exemption to share Internet-accessible emulated versions of their physical game collections with researchers. Today, the US Copyright Office announced once again that it was denying that request, forcing researchers to travel to far-flung collections for access to the often-rare physical copies of the games they're seeking.\n \nIn announcing its decision, the Register of Copyrights for the Library of Congress sided with the Entertainment Software Association and others who argued that the proposed remote access could serve as a legal loophole for a free-to-access \"online arcade\" that could harm the market for classic gaming re-releases. This argument resonated with the Copyright Office despite a VGHF study that found 87 percent of those older game titles are currently out of print. \"While proponents are correct that some older games will not have a ", "id": 1390286, "language": null, "link": "https://yro.slashdot.org/story/24/10/25/2046233/video-game-libraries-lose-legal-appeal-to-emulate-physical-game-collections-online?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Video Game Libraries Lose Legal Appeal To Emulate Physical Game Collections Online", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T22:29:33.812855+00:00", "description": "The Librarian of Congress has granted a DMCA exemption allowing independent repair of soft-serve machines, addressing the persistent issue of restricted repairs on McDonald's frequently malfunctioning machines. ExtremeTech reports: Section 1201 of the DMCA makes it illegal to bypass a digital lock protecting copyrighted work. That can be the DRM on a video file you download from iTunes, the carrier locks that prevent you from using a phone on other networks, or even the software running a McDonald's soft serve machine that refuses to accept third-party repairs. By locking down a product with DRM, companies can dictate when and how items are repaired under threat of legal consequences. This is an ongoing issue for people who want to fix all those busted ice cream machines.\n \nEarlier this year, iFixit and Public Knowledge submitted their request for an exemption that would have covered a wide swath of industrial equipment. The request included everything from building management softwa", "id": 1390285, "language": null, "link": "https://tech.slashdot.org/story/24/10/25/2052226/us-copyright-office-grants-dmca-exemption-for-ice-cream-machines?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Copyright Office Grants DMCA Exemption For Ice Cream Machines", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T21:24:32.553221+00:00", "description": "Climate scientists who were mocked and gaslighted after speaking up about their fears for the future have said acknowledging strong emotions is vital to their work. From a report: The researchers said these feelings should not be suppressed in an attempt to reach supposed objectivity. Seeing climate experts' fears and opinions about the climate crisis as irrelevant suggests science is separate from society and ultimately weakens it, they said. \n\nThe researchers said they had been subject to ridicule by some scientists after taking part in a large Guardian survey of experts in May, during which they and many others expressed their feelings of extreme fear about future temperature rises and the world's failure to take sufficient action. They said they had been told they were not qualified to take part in this broad discussion of the climate crisis, were spreading doom and were not impartial. \n\nHowever, the researchers said that embracing their emotions was necessary to do good science ", "id": 1389959, "language": null, "link": "https://science.slashdot.org/story/24/10/25/1754241/climate-scientists-respond-to-attacks-on-objectivity?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Climate Scientists Respond To Attacks on Objectivity", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T21:24:32.452590+00:00", "description": "Joe Biden's administration is investigating alleged Chinese efforts to hack US telecoms infrastructure amid reports hackers had targeted the phones of former president Donald Trump and his running mate JD Vance. Financial Times: The FBI and the Cybersecurity and Infrastructure Security Agency said they were investigating \"unauthorised access to commercial telecommunications infrastructure by actors affiliated with the People's Republic of China.\" \n\nThe statement followed a report in the New York Times that Chinese hackers had accessed US telecoms networks and targeted data on Trump and Vance's phones. The FBI declined to say if the hackers had targeted their phones. \n\nSteven Cheung, Trump's campaign spokesperson, blamed the alleged attack on Kamala Harris, the US vice-president and Democratic presidential nominee. But he declined to say if US authorities had informed the campaign about the hacking effort. \n\nCheung said: \"This is the continuation of election interference by Kamala Har", "id": 1389958, "language": null, "link": "https://news.slashdot.org/story/24/10/25/2055241/fbi-investigates-claims-china-tried-to-hack-donald-trumps-phone?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "FBI Investigates Claims China Tried To Hack Donald Trump's Phone", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T20:19:36.932909+00:00", "description": "The top U.S. consumer finance watchdog warned businesses about potential legal problems they could face from using new technology such as artificial intelligence or algorithmic scores to snoop on and evaluate their employees. From a report: The Consumer Financial Protection Bureau on Thursday said \"invasive\" new tools to monitor workers are governed by a law designed to ensure fairness in credit reporting, giving employees specific rights. Employees have the right to consent to the collection of personal information, to receive detailed information and to dispute inaccurate information, the CFPB said in the newly released guidance. \n\n\"Workers shouldn't be subject to unchecked surveillance or have their careers determined by opaque third-party reports without basic protections,\" CFPB Director Rohit Chopra said. More companies are leaning on AI and other powerful tools throughout the employment process, using software that can, for example, interview candidates and surveillance tools t", "id": 1389682, "language": null, "link": "https://yro.slashdot.org/story/24/10/25/1749218/us-consumer-watchdog-cautions-businesses-on-surveillance-of-workers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Consumer Watchdog Cautions Businesses on Surveillance of Workers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T20:19:36.850106+00:00", "description": "Anthropic's Claude chatbot can now write and run JavaScript code. TechCrunch: Today, Anthropic launched a new analysis tool that helps Claude respond with what the company describes as \"mathematically precise and reproducible answers.\" With the tool enabled -- it's currently in preview -- Claude can perform calculations and analyze data from files like spreadsheets and PDFs, rendering the results as interactive visualizations. \n\n\"Think of the analysis tool as a built-in code sandbox, where Claude can do complex math, analyze data, and iterate on different ideas before sharing an answer,\" Anthropic wrote in a blog post. \"Instead of relying on abstract analysis alone, it can systematically process your data -- cleaning, exploring, and analyzing it step-by-step until it reaches the correct result.\" Anthropic gives a few examples of where this might be useful. For instance, a product manager could upload sales data and ask Claude for country-specific performance analysis, while an engine", "id": 1389681, "language": null, "link": "https://slashdot.org/story/24/10/25/1751233/anthropics-ai-can-now-run-and-write-code?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Anthropic's AI Can Now Run And Write Code", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T19:14:32.856216+00:00", "description": "PayPal will begin sharing detailed customer purchase data, including clothing sizes and shopping preferences, with retailers for targeted advertising starting November 27, the payments company announced in a recent privacy update. The initiative affects PayPal's 391 million active consumer accounts worldwide. While customers can opt out through the app's settings, the GAO reports such opt-out rates typically remain below 7% across financial services.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=PayPal+To+Share+Customer+Purchase+Data+with+Retailers%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F10%2F25%2F1743212%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F10%2F25%2F1743212%2Fpaypal-to-share-customer-purchase-data-with-retailers%3Futm_source%3Dslas", "id": 1389356, "language": null, "link": "https://slashdot.org/story/24/10/25/1743212/paypal-to-share-customer-purchase-data-with-retailers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "PayPal To Share Customer Purchase Data with Retailers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T19:14:32.615358+00:00", "description": "An anonymous reader shares a report: OpenAI says that it doesn't intend to release an AI model code-named Orion this year, countering recent reporting on the company's product roadmap. \"We don't have plans to release a model code-named Orion this year,\" a spokesperson told TechCrunch via email. \"We do plan to release a lot of other great technology.\" \n\nThe Verge reported on Thursday that Orion, which is expected to be OpenAI's next frontier model, would launch by December, and that trusted partners would be the first to preview it ahead of a rollout through ChatGPT. According to The Verge, Microsoft, a close OpenAI collaborator and investor, expects to gain access to Orion as early as November.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Says+It+Won't+Release+a+Model+Called+Orion+This+Year%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F10%2F25%2F1747204%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"", "id": 1389355, "language": null, "link": "https://tech.slashdot.org/story/24/10/25/1747204/openai-says-it-wont-release-a-model-called-orion-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Says It Won't Release a Model Called Orion This Year", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T18:09:33.097950+00:00", "description": "An anonymous reader shares a report: Drivers passing through San Francisco have a new roadside distraction to consider: billboards calling out businesses that don't cough up for the open source code that they use. The signs are the work of the Open Source Pledge -- a group that launched earlier this month. It asks businesses that make use of open source code to pledge $2,000 per developer to support projects that develop the code. So far, 25 companies have signed up -- but project co-founder Chad Whitacre wants bigger firms to pay their dues, too. \n\nWhitacre, whose day job is head of open source at app-monitoring biz Sentry, told The Register his employer has for three years operated a scheme to pay developers who maintain and upgrade open source code. \"We do dollars per developer, the thinking being it's the developers and software engineers on the staff at a company who benefit the most from open source, who become more productive because of open source,\" he said. \"I had one conver", "id": 1388939, "language": null, "link": "https://news.slashdot.org/story/24/10/25/1654257/san-francisco-billboards-call-out-tech-firms-for-not-paying-for-open-source?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "San Francisco Billboards Call Out Tech Firms For Not Paying For Open Source", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T17:03:49.171683+00:00", "description": "A government-controlled wallet that had been drained of $20 million on Thursday received most of its funds back Friday, adding another layer of mystery to transactions flagged by blockchain analysts as likely being connected to a high-profile theft. From a report: The pseudonymous blockchain sleuth ZachXBT had said in a tweet Thursday that the transfers resembled the playbook of a bad actor. Engaging with several decentralized finance protocols, the wallet had also tapped so-called instant exchanges after funds were moved across a series of transfers that \"looked nefarious.\" About $19.3 million worth of funds had been returned to the wallet early Friday, per on-chain data collected by Arkham Intelligence, including Ethereum and the stablecoin USDC. Still, ZachXBT said in his Telegram community that funds transferred to exchanges had not yet been returned.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Hacker+Return", "id": 1388522, "language": null, "link": "https://yro.slashdot.org/story/24/10/25/1626224/hacker-returns-193-million-to-drained-us-government-crypto-wallet?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Hacker Returns $19.3 Million To Drained US Government Crypto Wallet", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T17:03:49.026984+00:00", "description": "Seven Spirals writes: A working paper [PDF], published by the National Bureau of Economic Research, studies the employment effects of a guaranteed income by providing $1,000 per month to 1,000 low-income participants for three years, compared to a control group receiving $50 per month. The results show a decrease in labor market participation by 2 percentage points and a reduction of 1.3-1.4 hours in weekly work hours. Most of the additional free time was spent on leisure, and there were no significant improvements in job quality or human capital investments. Overall, the guaranteed income led to a moderate reduction in labor supply without other substantial productive benefits.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Study+Finds+UBI+Results+Are+Not+Positive%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F10%2F25%2F1640219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/tw", "id": 1388521, "language": null, "link": "https://news.slashdot.org/story/24/10/25/1640219/study-finds-ubi-results-are-not-positive?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Study Finds UBI Results Are Not Positive", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T15:52:18.462450+00:00", "description": "Microsoft is seeking to boost its video games business with the release of the latest instalment of the Call of Duty franchise on Friday, pushing to increase subscription revenues through the new game to offset falling Xbox console sales. Financial Times: Black Ops 6 is the first of the best-selling series to be launched on the tech giant's Game Pass subscription service. It represents the biggest test of the company's gaming strategy [non-paywalled link] since its $75bn deal to acquire Activision Blizzard -- makers of Call of Duty -- received sign-off from regulators last year. Microsoft hopes that the release will help achieve its target of reaching 110mn Game Pass subscribers by 2030, a substantial rise from 34mn in February this year. \n\nThe company has shifted its focus towards its subscription games service as hardware sales have slowed in recent years. Xbox hardware revenue fell 13 per cent year-on-year in Microsoft's fiscal 2024, which ended in June. For the first time this ye", "id": 1388085, "language": null, "link": "https://games.slashdot.org/story/24/10/25/1447203/microsoft-bets-on-latest-call-of-duty-to-power-up-video-games-strategy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Bets on Latest 'Call of Duty' To Power Up Video Games Strategy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T15:52:18.223017+00:00", "description": "Scientists from 15 countries warned in an open letter that the potential collapse of the Atlantic Ocean's main circulation system (AMOC) has been \"greatly underestimated\" and could have devastating global impacts, according to oceanographer Stefan Rahmstorf who spoke to The Guardian. The AMOC system, which moves heat through the northern Atlantic and influences weather patterns across Europe, has shown signs of weakening over the past 60-70 years due to global warming, with indicators including a persistent cold spot in the northern Atlantic and record-low salt levels in seawater. \n\nRahmstorf, who heads the Earth system analysis department at Germany's Potsdam Institute for Climate Impact Research, estimates a 50% chance of the system reaching a critical tipping point this century, which could trigger severe consequences including regional cooling in northwestern Europe, shifting rainfall patterns, and rising sea levels.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a ", "id": 1388084, "language": null, "link": "https://news.slashdot.org/story/24/10/25/1456256/we-dont-know-where-the-tipping-point-is-climate-expert-on-potential-collapse-of-atlantic-circulation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'We Don't Know Where the Tipping Point Is': Climate Expert on Potential Collapse of Atlantic Circulation", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T13:16:51.577598+00:00", "description": "Four astronauts splashed down in the Gulf of Mexico on Friday after their record ISS mission stretched to eight months due to Boeing capsule malfunctions and hurricane disruptions. The SpaceX Dragon capsule landed off Florida's coast before dawn, carrying NASA astronauts Matthew Dominick, Michael Barratt, Jeanette Epps and Russian cosmonaut Alexander Grebenkin. \n\nTechnical issues with Boeing's Starliner capsule in September, followed by Hurricane Milton and persistent rough seas, delayed their planned return by two months. The crew launched in March as part of NASA's commercial crew program. Their replacements include Boeing Starliner test pilots Butch Wilmore and Suni Williams, whose mission expanded from eight days to eight months, alongside two SpaceX-launched astronauts. The new crew will remain aboard the station until February.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=SpaceX+Brings+Home+Astronauts+After", "id": 1387109, "language": null, "link": "https://science.slashdot.org/story/24/10/25/1213246/spacex-brings-home-astronauts-after-boeings-starliner-delays-extend-iss-mission?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "SpaceX Brings Home Astronauts After Boeing's Starliner Delays Extend ISS Mission", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T13:16:51.048078+00:00", "description": "OFF Radio Krakow sparked controversy by replacing its journalists with AI-generated presenters in an experiment to attract younger audiences. CNN Business reports: Weeks after letting its journalists go, OFF Radio Krakow relaunched this week, with what it said was &#226;oethe first experiment in Poland in which journalists ... are virtual characters created by AI.\" The station in the southern city of Krakow said its three avatars are designed to reach younger listeners by speaking about cultural, art and social issues including the concerns of LGBTQ+ people. \"Is artificial intelligence more of an opportunity or a threat to media, radio and journalism? We will seek answers to this question,\" the station head, Marcin Pulit, wrote in a statement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Polish+Radio+Station+Replaces+Journalists+With+AI+'Presenters'%3A+https%3A%2F%2Fradio.slashdot.org%2Fstory%2F24%2F10%2F25%2F041", "id": 1387108, "language": null, "link": "https://radio.slashdot.org/story/24/10/25/0418209/polish-radio-station-replaces-journalists-with-ai-presenters?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Polish Radio Station Replaces Journalists With AI 'Presenters'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T11:05:21.167358+00:00", "description": "An anonymous reader quotes a report from Reuters: The European Space Agency is in talks with SpaceX about the possibility of Elon Musk's space venture joining an international charter designed to reduce a growing swarm of debris in space, Director General Josef Aschbacher told Reuters. The 22-nation agency is spearheading one of several efforts to roll back the mass of space junk swirling round the planet from past missions that poses a risk to active satellites. Aschbacher said 110 countries or entities have joined ESA's Zero Debris charter, which aims to stop any new orbital garbage being generated by 2030.\n \nAsked whether SpaceX, whose satellites now make up some two thirds of spacecraft active in low Earth orbit, had signed up, Aschbacher said: \"Not yet, but we are in discussion with them... This is a charter that keeps evolving and... we will keep raising the topics because they are so fundamental.\" [...] There are currently 18,897 pieces of trackable space junk in orbit, accord", "id": 1386315, "language": null, "link": "https://science.slashdot.org/story/24/10/25/0423244/europe-in-talks-with-spacex-on-tackling-space-junk?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Europe In Talks With SpaceX On Tackling Space Junk", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T08:36:11.004215+00:00", "description": "UnitedHealth Group said a ransomware attack in February resulted in more than 100 million individuals having their private health information stolen. The U.S. Department of Health and Human Services first reported the figure on Thursday. TechCrunch reports: The ransomware attack and data breach at Change Healthcare stands as the largest known digital theft of U.S. medical records, and one of the biggest data breaches in living history. The ramifications for the millions of Americans whose private medical information was irretrievably stolen are likely to be life lasting. UHG began notifying affected individuals in late July, which continued through October. The stolen data varies by individual, but Change previously confirmed that it includes personal information, such as names and addresses, dates of birth, phone numbers and email addresses, and government identity documents, including Social Security numbers, driver's license numbers, and passport numbers. The stolen health data in", "id": 1385569, "language": null, "link": "https://yro.slashdot.org/story/24/10/25/0412240/unitedhealth-says-change-healthcare-hack-affects-over-100-million?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "UnitedHealth Says Change Healthcare Hack Affects Over 100 Million", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T03:40:45.728738+00:00", "description": "An anonymous reader quotes a report from New Scientist: As the world emerged from the lockdowns of the covid-19 pandemic, many countries promised to rebuild their economies in a climate-friendly fashion, amid hopes the recovery effort could accelerate the global journey to net-zero emissions. In reality, the opposite has happened. Instead of a \"green recovery,\" global greenhouse gas emissions are rising much faster now than they did in the decade preceding the global pandemic. Emissions rose 1.3 percent to 57.1 gigatons of carbon dioxide equivalent in 2023. That is a far faster annual rate of growth than during the decade 2010-2019, when emissions grew on average 0.8 percent per year. In fact, global greenhouse gas emissions are now just below the 59.1 gigatons peak recorded in 2019.\n \nAll sources of greenhouse gas emissions except land use are rising, according to a report from the United Nations Global Environment Program (UNEP), as economies continued to rebound from covid-19. Emi", "id": 1384745, "language": null, "link": "https://news.slashdot.org/story/24/10/24/2128219/carbon-emissions-are-now-growing-faster-than-before-the-pandemic?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Carbon Emissions Are Now Growing Faster Than Before the Pandemic", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T02:38:07.865436+00:00", "description": "Starting next week, Google Photos will label when an image was edited with AI. The Verge reports: \"Photos edited with tools like Magic Editor, Magic Eraser and Zoom Enhance already include metadata based on technical standards from The International Press Telecommunications Council (IPTC) to indicate that they've been edited using generative AI,\" John Fisher, engineering director of Google Photos, wrote in a blog post. \"Now we're taking it a step further, making this information visible alongside information like the file name, location and backup status in the Photos app.\"\n \nThe \"AI info\" section will be found in the image details view of Google Photos both on the web and in the app. These labels won't be limited strictly to generative AI, either. Google says it'll also specify when a \"photo\" contains elements from several different images -- such as when people use the Pixel's Best Take and Add Me features. [...] \"This work is not done, and we'll continue gathering feedback and eva", "id": 1384570, "language": null, "link": "https://tech.slashdot.org/story/24/10/24/2122224/google-photos-will-soon-show-you-if-an-image-was-edited-with-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Photos Will Soon Show You If an Image Was Edited With AI", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T01:33:33.232420+00:00", "description": "An anonymous reader quotes a report from TechCrunch: Smashing, a new app curating the best of the web from Goodreads co-founder Otis Chandler, is now available to the public. Like Goodreads, the app aims to create a community around content. But this time, instead of books, the focus is on web content -- like news articles, blog posts, social media posts, podcasts, and more. In addition, Smashing is introducing an AI Questions feature that allows you to engage with the content being shared in different ways, including by viewing a news story from different perspectives or asking the AI to poke holes in the story, among other things. By viewing different angles of a story, you can see how both the political left and right view the subject. Or, in the case of a company's stock, you might be presented with both the bull and bear case.\n \nThere are a good handful of AI prompts available at launch, notes Chandler, and not all will make sense to use on every news story or piece of content. ", "id": 1384382, "language": null, "link": "https://slashdot.org/story/24/10/24/2028242/goodreads-founder-debuts-ai-powered-app-for-online-readers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Goodreads' Founder Debuts AI-Powered App For Online Readers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T01:33:32.818308+00:00", "description": "MojoKid writes: Intel has lifted the embargo on independent reviews of its new Core Ultra 200S series Arrow Lake-S processors, which mark a shift in its desktop CPU strategy with symmetrical core/thread counts (no Hyperthreading) and a dedicated 13 TOPS NPU. This series features a disaggregated tiled design for the first time in Intel's desktop chips, focusing on efficiency and power reduction. The Core Ultra 5 245, priced around $300, and the Ultra 9 285K at $589 deliver strong performance, particularly in creator workloads, competing well with AMD's Ryzen CPUs, while the Ultra 9 285K's price undercuts AMD's Ryzen 9 9950X significantly. While gaming performance shows slight regression in spots, the new chips are much more power-efficient than their predecessors. Overall, the platform offers leading-edge features, competitive pricing, and solid performance for creators, gamers and workstation pros.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"", "id": 1384381, "language": null, "link": "https://hardware.slashdot.org/story/24/10/24/211234/intel-arrow-lake-core-ultra-200s-tested-competitively-priced-with-creator-performance?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Arrow Lake Core Ultra 200S Tested: Competitively Priced With Creator Performance", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-25T01:33:32.429707+00:00", "description": "The EU Court of Justice ruled in favor of Intel, dismissing the European Commission's appeal and ending a nearly two-decade-long case over allegations that Intel's rebates to computer makers were anticompetitive. Reuters reports: The European Commission had fined Intel for giving rebates to computer makers Dell, Hewlett-Packard and Lenovo for buying most of their chips from Intel, which regulators said was an attempt to block Advanced Micro Devices. Regulators generally oppose rebates offered by dominant companies because they fear they may be anticompetitive, while companies say enforcers must prove discounts have anticompetitive effects before companies are sanctioned.\n \nEU regulators had initially fined Intel 1.06 billion euros ($1.14 billion) but a lower tribunal scrapped that. Intel's case was boosted earlier this year when an adviser to the court said regulators had not properly performed an economic analysis.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class", "id": 1384380, "language": null, "link": "https://yro.slashdot.org/story/24/10/24/2113245/europes-top-court-rules-for-intel-to-end-long-running-antitrust-case?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Europe's Top Court Rules For Intel To End Long-Running Antitrust Case", "vote": 0}]