[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-10T20:30:04+00:00",
        "description": "Whether you’re a fan of the original 2002 cult classic or a survival horror fan who missed the boat, you owe it to yourself to play The Thing: Remastered. Playable on PC, PS4, PS5, Xbox One, Xbox Series X/S, and Switch, The Thing: Remastered sits at a very reasonable $29.99 price point. \n\nNot only does The Thing: Remastered serve as a wonderful sequel to the original sci- fi horror film, but it also introduced several groundbreaking mechanics when it first released. The squad-based trust/fear system utilized smart AI and played on players’ fears in fun ways. \n\nThough the original’s implementation of those squad mechanics were rough around the edges, the remaster smooths most of them out to a satisfying degree. \n\nOf course, the visual overhaul achieved with this remaster is also worthy of accolades, all running at a smooth 144fps, no less. With brilliantly varied level design and a rich survival horror atmosphere, The Thing Remastered is the ideal way to play the beloved cult classic.",
        "id": 1683938,
        "language": null,
        "link": "https://www.youtube.com/watch?v=lqKVoJ9lIzU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/lqKVoJ9lIzU/hqdefault.jpg",
        "title": "The Thing Remastered Review - The Final Verdict",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-10T17:30:05+00:00",
        "description": "In our AAA console gaming bubble, the Nikki franchise hasn't made too many waves, to the extent that many might not have even been aware of its existence. For about a decade, the Nikki games have been an exclusively mobile-oriented affair, which, combined with their nature as dress-up games, meant that even though the audience that they targeted has only grown larger with time, there hasn't been too much overlap with the console gaming sphere.\n\nDeveloper Infold Games' goal was to change that with Infinity Nikki, the fifth instalment in the series and the first to be released on PC and console- and all early indications seem to be pointing to the studio having successfully pulled it off. As we approached Infinity Nikki's launch at the tail end of 2024, the game was amassing increasing excitement and anticipation, and now that audiences have managed to dive in and get a taste of its offerings, it's clear that whatever it is that the game has going on has got its claws sunk deep into th",
        "id": 1682603,
        "language": null,
        "link": "https://www.youtube.com/watch?v=TTOvDHGfwz8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/TTOvDHGfwz8/hqdefault.jpg",
        "title": "Why Is Infinity Nikki TAKING OFF?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-10T13:30:12+00:00",
        "description": "The end of the year is usually one of cheer and anticipation, especially with the Holiday season (and discounts) rolling around. However, it's also when The Game Awards occur, showcasing the stand-out video games when it comes to art direction, sound design, performances, and storytelling.\n\nTaking place on December 12th, 4:30 PM PST, this year is no different, and the competition is fierce. But there's one more component to look forward to, year in and year out: New game announcements. World premieres. Trailers for the year (or years) to come, building hype for the future of gaming.\n\nSome titles have already been rumored for the show from reliable sources, while others could appear to offer new details and gameplay. The hype is overwhelming for something significant, but what could this year hold? Check out 15 of the biggest announcements that could happen at The Game Awards 2024.",
        "id": 1680671,
        "language": null,
        "link": "https://www.youtube.com/watch?v=L0dZ9-PRqDk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/L0dZ9-PRqDk/hqdefault.jpg",
        "title": "15 HUGE GAME Announcements That Could Happen At The Game Awards 2024",
        "vote": 0
    }
]