[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-30T21:30:01+00:00", "description": "Emergent gameplay isn’t new; Dragon’s Dogma 2 certainly isn’t the first game to deploy emergence to tell its story and deliver its open world, but the sheer chance of experimentation on offer here is borderline unrivalled. \n\nBeyond commonplace RPG tropes like dialogue choices or attack versus stealth strategies Dragon’s Dogma 2 gives players a plethora of components which they can tinker with to generate specific outcomes. \n\nSee, emergent gameplay isn’t strictly about player choice, it’s about the game’s guiding principles and surprise events presenting unique possibilities. This video aims to make sense of this concept, and how this game’s open world fosters and supports emergent gameplay, from its environmental changes such as day-night cycle and weather, to character classes and AI companions that influence how the world reacts.", "language": null, "link": "https://www.youtube.com/watch?v=UiQzsnmXuS8", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/UiQzsnmXuS8/hqdefault.jpg", "title": "Dragon's Dogma 2's EMERGENT OPEN WORLD Is Borderline Unrivalled", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-30T15:30:01+00:00", "description": "The open world shooter has become a household genre in gaming with its fun mechanics and systemic design elements that make for a dynamic moment-to-moment gameplay loop. \n\nFar Cry 2 paved the way for the mega-hit that was Far Cry 3, and Far Cry 4 iterated on those elements with several refinements and improvements that made for a compelling open-world experience back in the day. \n\nWith this video, we take a look back at the game and uncover what made it tick.", "language": null, "link": "https://www.youtube.com/watch?v=86X-xiXGIsk", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/86X-xiXGIsk/hqdefault.jpg", "title": "What Made Far Cry 4 ONE HELL OF A GAME?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-30T09:30:01+00:00", "description": "Suicide Squad: Kill the Justice League hasn't been doing so hot since its long-dreaded launch in February. Between a boring end-game, repetitive objectives, a story that quickly goes off-rails and the ever-irritating live service trappings, it's about where many expected it.\n\nSeason of the Joker is the first post-launch content addition, introducing the first new playable character, The Joker. Unfortunately, the \"content\" part is extremely light, with the player grinding through the same repetitive activities to take on yet another reskinned boss - er, Brainiac clone.\n\nThe story is also laughably bare, with a motion comic intro showcasing The Joker's predicament and a \"humorous\" scene where he joins the Squad. Couple this with the grind to get The Joker, which Rocksteady will give instant access to at $10, and this first Episode of content only solidifies the game's dismal state.", "language": null, "link": "https://www.youtube.com/watch?v=a8C4nkTUfJA", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/a8C4nkTUfJA/hqdefault.jpg", "title": "Suicide Squad: Kill The Justice League’s Joker Season - WHAT THE HELL?!", "user": null, "vote": 0}]