[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-07T17:30:02+00:00", "description": "Undisputed fills the decade-old boxing game void quite well with its realistic graphics and impressive licensed fighter roster. Fans can create their own fighter to compete with others online and in the game’s Career Mode when Undisputed launches on October 11th . \n\nWhile the graphical polish and animation are impressive, Undisputed doesn’t pretend to supply a worthy replacement to Fight Night’s beloved story mode. There’s no cutscenes or voice acting to be had here, no, this is a text-based management game requiring careful balance of your fighter’s health, finances, and staff. \n\nThe gameplay within the modes of Undisputed is realistic enough, featuring over 60 different punches and a level of polish regarding game performance. There’s a lot of strategy involved here, whether it be through fighter stats, balancing stamina, or anticipating an opponent’s knockout punch. There’s a lot to like with Undisputed, even if there’s some notable flaws here and there.", "id": 1281971, "language": null, "link": "https://www.youtube.com/watch?v=9b1EuoB6MXQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/9b1EuoB6MXQ/hqdefault.jpg", "title": "Undisputed Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-07T15:30:29+00:00", "description": "Remakes have been the rage for a few years, and Until Dawn is no exception. The interactive horror drama became a surprise success after launching in 2015 for the PS4, and while many craved a remaster or PS5 upgrade, Sony has answered with a remake. Helmed by Ballistic Moon, it's out now for PS5 and PC.\n\nOn top of rebuilding it from the ground up with Unreal Engine 5, the remake offers brand new animations, ray traced ambient occlusion and shadows, a new third-person camera, vastly overhauled models with much more details, and more. Fans can even look forward to an updated injury system and altered cinematography for some scenes.\n\nOf course, the big question is how it measures up to the original. Is it a faithful remake, or does it take liberties with what worked nearly a decade ago? Join us as we compare the original and remake.", "id": 1281092, "language": null, "link": "https://www.youtube.com/watch?v=weFNldgXCTI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/weFNldgXCTI/hqdefault.jpg", "title": "Until Dawn Remake vs Original Graphics Comparison - A Worthy Upgrade?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-07T13:30:32+00:00", "description": "Bloober Team has done a commendable job of taking what worked in the original Silent Hill 2 and packaging it for a modern audience with visuals that have been updated from the ground up. \n\nSilent Hill 2 Remake is built using Unreal Engine 5, and it makes good use of the engine’s toolkit to create stunning vistas and technically sound environments. Things have obviously changed by a significant margin, but to what extent exactly? With this video, we will be delving into exactly that as we take a look at both versions of the game side by side and break down individual aspects of the presentation.", "id": 1280525, "language": null, "link": "https://www.youtube.com/watch?v=fT8yu_5j4lU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/fT8yu_5j4lU/hqdefault.jpg", "title": "Silent Hill 2 Remake vs Original Graphics Comparison - An Unreal Engine 5 Special", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-07T06:45:02+00:00", "description": "When you think about Dragon Ball, several things come to mind. The Dragon Ball Super anime, the recent manga arcs, maybe even video games like Dragon Ball FighterZ and Kakarot. However, for many gaming fans, the franchise peaked with Dragon Ball: Budokai Tenkaichi 3, a 3D arena fighter with a massive roster and an approachable yet complex battle system.\n\nWhile a comeback for the series seemed impossible, Budokai Tenkaichi is essentially back with Dragon Ball: Sparking! ZERO. Launching on October 11th for Xbox Series X/S, PS5, and PC, it features an even bigger roster, brand new modes like Episode Battle and Custom Battle, an Edit Mode for creating and sharing scenarios, and much more.\n\nTo say that the response has been incredible would be an understatement - it's currently the top-selling title on Steam ahead of release. But what makes Sparking! ZERO one of the biggest games of the year and a can't miss experience? Find out here.", "id": 1278162, "language": null, "link": "https://www.youtube.com/watch?v=vnLCVux7MR0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/vnLCVux7MR0/hqdefault.jpg", "title": "How Dragon Ball: Sparking! ZERO Is Shaping Up To Be The MUST-PLAY GAME OF THE YEAR", "vote": 0}]