[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-07T12:42:56+00:00", "description": "Uzbrójcie się w cierpliwość, bo nie zawsze szybkie spełnienie naszych pragnień, tego co wypisujemy na tych kartkach, jest dla nas dobre 🙏 Ja wiem, że ten rok czasu, przez który leczyłem się na moją chorobę, naprawdę wyleczył wiele rzeczy: na mojej duszy, w mojej rodzinie, w moich znajomych. To nie chodzi o to, żebyśmy byli od razu zdrowi na ciele, ale chodzi o to, żebyśmy przede wszystkim byli zdrowi na duchu 🙌 Chwała Tobie Jezu Chryste, chwała Tobie Matko Najświętsza! Króluj w moje niebieskie niebiańskie! 💙\n\n📜 Fragment jednego ze świadectw wygłoszonego przez uczestnika zawierzenia podczas Zawierzenia Niepokalanemu Sercu Maryi Królowej Korony Polski na Jasnej Górze w dniu 7 września 2024 r. 🙏\n\nCałość znajdziesz tutaj: https://studio.youtube.com/video/cjK7PUycKq8/edit\n\nA wiesz co jeszcze jest niesamowite? 😊 Te zawierzenia odbywają się co miesiąc na Jasnej Górze! Możesz sobie wyobrazić? 😍 Każdy może przyjechać, a jak nie może, to nic straconego - można dołączyć przez internet! 🙏 Ważne, ", "id": 1279929, "language": null, "link": "https://www.youtube.com/watch?v=RBfgsPbEL88", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 178, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/RBfgsPbEL88/hqdefault.jpg", "title": "Nie zawsze od razu, ale zawsze na czas", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-07T12:40:10+00:00", "description": "Poprosiłam Maryję o pomoc w znalezieniu auta, bo kompletnie się na tym nie znamy i mogliby nam wcisnąć jakieś stare, powypadkowe. 🙏 W lipcu znaleźliśmy osobę, która czekała ponad miesiąc, aż uzbieramy finanse. Kupiliśmy 6-letnie auto, wypasioną, limitowaną wersję Hondy – sportową! 🤩 Sprzedający wymienił w nim wszystko, co tylko się dało. Córka dostała plik faktur – pełen bank! 😊 W aucie były też wymienione oleje, a środek wyglądał jak nowy. ✨ Oprócz tego, tydzień przed kupnem, Maryja wskazała nam osobę, która sprzedaje auto jako firma, więc 1200 zł podatku już nie płacimy! 🥳 W dniu sprzedaży facet stwierdził jeszcze, że czegoś drobnego nie zdążył zrobić i obniżył cenę o kolejny 1000 zł! 😲\n\n📜 Fragment jednego ze świadectw wygłoszonych przez uczestniczkę podczas Zawierzenia Niepokalanemu Sercu Maryi Królowej Korony Polski na Jasnej Górze w dniu 7 września 2024 r. 🙏\n\nCałość znajdziesz tutaj: https://studio.youtube.com/video/cjK7PUycKq8/edit\n\nA wiesz co jeszcze jest niesamowite? 😊 Te zawi", "id": 1279930, "language": null, "link": "https://www.youtube.com/watch?v=-l2wo29UY_c", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 178, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/-l2wo29UY_c/hqdefault.jpg", "title": "Z Maryją za Kierownicą Nowego Auta", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-07T12:40:01+00:00", "description": "Okazało się, że nie będziemy mogli mieć dzieci ze względu na różne choroby autoimmunologiczne. 😔 Adoptowaliśmy pierwsze dziecko, a po jakimś czasie zdecydowaliśmy się na adopcję drugiego. 🙏 Właśnie tego drugiego dziecka doczekaliśmy się w dniu Świętego Józefa! 🥰 Za dwa lata, zupełnie niespodziewanie, okazało się, że jestem w ciąży. 🤰 Po roku pojechaliśmy do Kalisza podziękować Świętemu Józefowi za Darusia. 🙏 Po powrocie, zaledwie po dwóch tygodniach, okazało się, że jestem w kolejnej ciąży! 🤯 Gdy Józio miał 5 lat, lekarze zdiagnozowali u niego guza w mózgu. 😭 Koleżanka przysłała mi obrazek z Aktem Zawierzenia i całą noc, gdzieś tam w szpitalu, modliłam się właśnie tym aktem. 🙏 Następnego dnia, po badaniu rezonansem, okazało się, że ten guz to tak naprawdę specyficzna budowa mózgu Józia! 🥳\n\n📜 Fragment jednego ze świadectw wygłoszone przez uczestniczkę zawierzenia podczas Zawierzenia Niepokalanemu Sercu Maryi Królowej Korony Polski na Jasnej Górze w dniu 7 września 2024 r. 🙏\n\n Całość zn", "id": 1279931, "language": null, "link": "https://www.youtube.com/watch?v=6qjMJQ2ghE8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 178, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/6qjMJQ2ghE8/hqdefault.jpg", "title": "Od niepłodności do cudu macierzyństwa 🙏#jasnagóra #wiarawboga #wiaraczynicuda #wiaranadziejamiłość", "vote": 0}]