[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T23:02:58.245918+00:00",
        "description": "Berlin-based T2 Linux developer Ren&eacute; Rebe is also long-time Slashdot reader ReneR &mdash; and popped by with a special announcement for the holidays:\n\nThe T2 Linux team has unveiled T2 Linux SDE 24.12, codenamed \"Sky's the Limit!\", delivering a massive update for this highly portable source-based Linux distribution... With 3,280 package updates, 206 new features, and the ability to boot on systems with as little as 512MB RAM, this release further strengthens T2 Linux's position as the ultimate tool for developers working across diverse hardware and embedded systems.\n \nSome highlights from Rene's announcement:\n\n \"The release includes 37 pre-compiled ISOs with Glibc, Musl, and uClibc, supporting 25 CPU architectures like ARM(64), RISCV(64), Loongarch64, SPARC(64), and vintage retro computing platforms such as M68k, Alpha, and even initial Nintendo Wii U support added.\"\n\" The Cosmic Desktop, a modern Rust-based environment, debuts alongside expanded application support for non-ma",
        "id": 1759092,
        "language": null,
        "link": "https://linux.slashdot.org/story/24/12/21/2143207/t2-linux-sde-2412-skys-the-limit-released-with-37-isos-for-25-cpu-isas?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "T2 Linux SDE 24.12 'Sky's the Limit!' Released With 37 ISOs For 25 CPU ISAs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T23:02:58.155227+00:00",
        "description": "An anonymous reader shared this report from NBC News:\n\n\nU.S. life expectancy rose last year, hitting its highest level since the beginning of the Covid pandemic, according to a report from the Centers for Disease Control and Prevention. \n\nThe report, released Thursday, found that life expectancy at birth was 78.4 years in 2023. That's a significant rise &mdash; nearly a full year &mdash; from the life expectancy of 77.5 years in 2022. \"The increase we had this year &mdash; the 0.9 year &mdash; that's unheard of prior to the pandemic,\" said Ken Kochanek, a statistician at the National Center for Health Statistics who co-authored the report. \"Life expectancy in the United States never goes up or down any more than one- or two-tenths,\" he said. \"But then when Covid happened, you had this gigantic drop, and now we have a gigantic drop in Covid. So, you have this gigantic increase in life expectancy.\" \n\nFrom 2019 to 2021, U.S. life expectancy dropped from 78.8 years to 76.4. Covid deaths ",
        "id": 1759091,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/21/0536247/us-life-expectancy-rose-to-784-years-in-2023---highest-level-since-pandemic?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Life Expectancy Rose to 78.4 years in 2023 - Highest Level Since Pandemic",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T21:56:41.592927+00:00",
        "description": "\"Voyager 1 is currently exploring interstellar space at a distance of 15.5 billion miles (24.9 billion kilometers) away from Earth,\" writes Gizmodo. \n\nAnd yet a team of amateur astronomers in the Netherlands was able to receive Voyager's signals on a 1950s telescope designed to detect weak, low-frequency emissions from deep space:\n\n NASA uses the [Earth-based] Deep Space Network (DSN) to communicate with its spacecraft, but the global array of giant radio antennas is optimized for higher frequency signals. Though NASA's DSN antennas are capable of detecting S-band missives from Voyager &mdash; it can also communicate in X-band &mdash; the spacecraft's signal can appear to drop due to how far Voyager is from Earth. The Dwingeloo telescope, on the other hand, is designed for observing at lower frequencies than the 8.4 gigahertz telemetry transmitted by Voyager 1, according to the C.A. Muller Radio Astronomy Station... [W]hen Voyager 1 switched to a lower frequency, its messages fell wi",
        "id": 1758876,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/21/0612239/voyager-1-signals-from-interstellar-space-detected-by-amateur-astronomers-on-1950s-telescope?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Voyager 1 Signals from Interstellar Space Detected by Amateur Astronomers on 1950s Telescope",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T19:47:03.737363+00:00",
        "description": "Nature magazine reports that \"A study that stoked enthusiasm for the now-disproven idea that a cheap malaria drug can treat COVID-19 has been retracted &mdash; more than four-and-a-half years after it was published.\"\n\nResearchers had critiqued the controversial paper many times, raising concerns about its data quality and an unclear ethics-approval process. Its eventual withdrawal, on the grounds of concerns over ethical approval and doubts about the conduct of the research, marks the 28th retraction for co-author Didier Raoult, a French microbiologist, formerly at Marseille's Hospital-University Institute Mediterranean Infection (IHU), who shot to global prominence in the pandemic. French investigations found that he and the IHU had violated ethics-approval protocols in numerous studies, and Raoult has now retired. \n\nThe paper, which has received almost 3,400 citations according to the Web of Science database, is the highest-cited paper on COVID-19 to be retracted, and the second-mo",
        "id": 1758338,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/20/141202/hydroxychloroquine-promoting-covid-study-retracted-after-4-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hydroxychloroquine-Promoting COVID Study Retracted After 4 Years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T19:47:03.437358+00:00",
        "description": "On Thursday New Jersey lawmakers passed a resolution \"calling on the federal government to conduct a 'rigorous and ongoing' investigation into the drone sightings in the state,\" reports the Associated Press:\n\nMeanwhile, federal and local authorities are warning against pointing lasers at suspected drones, because aircraft pilots are being hit in the eyes more often. Authorities also said they are concerned people might fire weapons at manned aircraft that they have mistaken for drones... \n\nWhite House national security spokesperson John Kirby said Monday that the federal government has yet to identify any public safety or national security risks. \"There are more than 1 million drones that are lawfully registered with the Federal Aviation Administration here in the United States,\" Kirby said. \"And there are thousands of commercial, hobbyist and law enforcement drones that are lawfully in the sky on any given day. That is the ecosystem that we are dealing with.\" The federal government ",
        "id": 1758337,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/21/1935235/us-drone-sightings-provoke-reactions-from-new-jersey-legislature-federal-government?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Drone Sightings Provoke Reactions From New Jersey Legislature, Federal Government",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T18:30:24.398826+00:00",
        "description": "An anonymous reader shared this report from TechCrunch:\n\nMicrosoft-owned GitHub announced on Wednesday a free version of its popular Copilot code completion/AI pair programming tool, which will also now ship by default with Microsoft's popular VS Code editor. Until now, most developers had to pay a monthly fee, starting at $10 per month, with only verified students, teachers, and open source maintainers getting free access... \n\n\nThere are some limitations to the free version, which is geared toward occasional users, not major work on a big project. Developers on the free plan will get access to 2,000 code completions per month, for example, and as a GitHub spokesperson told me, each Copilot code suggestion will count against this limit &mdash; not just accepted suggestions. And while GitHub recently added the ability to switch between different foundation models, users on the free plan are limited to Anthropic's Claude 3.5 Sonnet and OpenAI's GPT-4o. (The paid plans also include Goog",
        "id": 1758058,
        "language": null,
        "link": "https://developers.slashdot.org/story/24/12/21/0443255/microsoft-integrates-a-free-version-of-its-copilot-coding-ai-into-github-vs-code?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Integrates a Free Version of Its 'Copilot' Coding AI Into GitHub, VS Code",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T17:25:56.347226+00:00",
        "description": "\"California's population grew this year by nearly a quarter of a million residents,\" reports the Los Angeles Daily News, \"closing in on record-high population levels the Golden State reached before the pandemic, the U.S. Census Bureau reported Thursday.\" \nAlthough \"Data showed the state is growing more slowly than the country as a whole and other large states in the South...\"\n\nThe Census Bureau's Vintage 2024 population estimates show California's population on July 1, 2024 was 39,431,000, an increase of 233,000 from the year before, and just 125,000 short of the 2020 high point. \nFor Jeff Bellisario, executive director of the Bay Area Council Economic Institute, there are two ways to look at the new data. \"There's the optimistic look that in the past year, we have seen the population increase... bigger increases than we have in a decade, so I do think there is some truth to the narrative of folks coming back to California,\" he said. On the other hand, California is still far behind ",
        "id": 1757833,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/21/056208/californias-population-jumps-back-to-near-pre-pandemic-levels?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "California's Population Jumps Back to Near Pre-Pandemic Levels",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T16:20:47.785941+00:00",
        "description": "The Linux Foundation partnered with GitHub and Harvard's Laboratory for Innovation Science to research organization-driven investments in open source software &mdash; the how and the why &mdash; surveying over 500 organizations around the world. \nSo what are the highlights from the published report?\n\nThe median responding organization invests $520,600 (2023 USD) of annual value to OSS. \n\nResponding organizations annually invest $1.7 billion in open source, which can be extrapolated to estimate that approximately $7.7 billion is invested across the entire open source ecosystem annually. 86% of investment is in the form of contribution labor by employees and contractors working for the funding organization, with the remaining 14% being direct financial contributions. \nBut the ultimate goal of the research was ideas \"to improve monitoring and investing in open source\" (to \"create a more sustainable and impactful open source economy...\")\n\nIn this research, we discovered a few key obstacl",
        "id": 1757555,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/21/0016200/open-source-software-funding-report-finds-86-of-corporate-contributions-are-employees-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Open Source Software Funding Report' Finds 86% of Corporate Contributions are Employees' Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T13:05:22.407395+00:00",
        "description": "sciencehabit shares a report from Science Magazine: With a few keystrokes, anyone can ask an artificial intelligence (AI) program such as ChatGPT to write them a term paper, a rap song, or a play. But don't expect William Shakespeare's originality. A new study finds such output remains derivative -- at least for now. [...] [O]bjectively testing this creativity has been tricky. Scientists have generally taken two tacks. One is to use another computer program to search for signs of plagiarism -- though a lack of plagiarism does not necessarily equal creativity. The other approach is to have humans judge the AI output themselves, rating factors such as fluency and originality. But that's subjective and time intensive. So Ximing Lu, a computer scientist at the University of Washington, and colleagues created a program featuring both objectivity and a bit of nuance.\n \nCalled DJ Search, it collects pieces of text of a minimum length from whatever the AI outputs and searches for them in lar",
        "id": 1756729,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/21/0058254/ai-writing-is-improving-but-it-still-cant-match-human-creativity?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Writing Is Improving, But It Still Can't Match Human Creativity",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T10:55:36.618040+00:00",
        "description": "Last week, startup Embodied announced it was closing down, and its product, an $800 robot for kids ages 5 to 10, would soon be bricked. Now, in a blog post published on Friday, CEO Paolo Pirjanian shared that Embodied's technical team is working on a way to open-source the robot, ensuring it can continue operating indefinitely. Ars Technica reports: The notice says that after releasing OpenMoxie, Embodied plans to release \"all necessary code and documentation\" for developers and users. Pirjanian said that an over-the-air (OTA) update is now available for download that will allow previously purchased Moxies to support OpenMoxie. The executive noted that Embodied is still \"seeking long-term answers\" but claimed that the update is a \"vital first step\" to \"keep the door open\" for the robot's continued functionality.\n \nAt this time, OpenMoxie isn't available and doesn't have a release date. Embodied's wording also seems careful to leave an opening for OpenMoxie to not actually release; al",
        "id": 1756237,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/21/0039217/startup-set-to-brick-800-kids-robot-is-trying-to-open-source-it-first?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Startup Set To Brick $800 Kids Robot Is Trying To Open Source It First",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T07:40:09.257219+00:00",
        "description": "Axiom Space has revised its plan for assembling its commercial space station by launching the Payload, Power, and Thermal module first, enabling it to operate as a free-flying platform as early as 2028 -- two years ahead of the original timeline. Space.com reports: NASA awarded Axiom Space a contract in 2020 to attach one or more modules to the International Space Station (ISS), which is set to retire by 2030 at the earliest. The original plan called for Axiom to detach a multi-module group from the ISS, creating a commercial outpost in low Earth orbit that will continue operating after the ISS is gone. But that plan has now been altered.\n \nTo create its space station, Axiom plans to launch five modules: a payload/power/thermal element, an airlock, a research/manufacturing hub, and a pair of habitat modules. The original plan was for Axiom to launch the Habitat 1 module to the ISS first, followed by the additional elements. The new assembly sequence will see the Payload, Power and Th",
        "id": 1755645,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/21/0048247/axioms-private-space-station-could-arrive-as-early-as-2028?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Axiom's Private Space Station Could Arrive As Early As 2028",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T04:25:03.923112+00:00",
        "description": "An anonymous reader quotes a report from Reuters: Malaysia has agreed to resume the search for the wreckage of missing Malaysia Airlines Flight MH370, its transport minister said on Friday, more than 10 years after it disappeared in one of the world's greatest aviation mysteries. Flight MH370, a Boeing 777 carrying 227 passengers and 12 crew, vanished en route from Kuala Lumpur to Beijing on March 8, 2014. \n[...] MH370's last transmission was about 40 minutes after it took off from Kuala Lumpur for Beijing. The pilots signed off as the plane entered Vietnamese air space over the Gulf of Thailand and soon after its transponder was turned off. \"Our responsibility and obligation and commitment is to the next of kin,\" Transport Minister Anthony Loke told a press conference. \"We hope this time will be positive, that the wreckage will be found and give closure to the families.\"\n \nFurther reading: Could Sea Explosions Finally Locate the 2014 Crash Site of Flight MH370?<p><div class=\"share_s",
        "id": 1755211,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/21/0030258/10-years-later-malaysia-to-resume-hunt-for-flight-mh370?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "10 Years Later: Malaysia To Resume Hunt For Flight MH370",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T03:18:45.269514+00:00",
        "description": "Five years ago, journalist and sci-fi author Cory Doctorow published a short story that explored the radicalization of individuals denied healthcare coverage. As The Guardian notes in a recent article, the story \"might seem eerily similar\" to the recent shooting of UnitedHealthcare's CEO. While it appears that the alleged shooter never read the story, Doctorow said: \"I feel like the most important thing about that is that it tells you that this is not a unique insight.\" Doctorow continued: \"that the question that I had is a question other people have had.\" As an activist in favor of liberalizing copyright laws and a proponent of the Creative Commons organization, it's important to note that Doctorow advocates for systemic reform through collective action rather than violence. Here's an excerpt from the The Guardian's article: In Radicalized, one of four novellas comprising a science fiction novel of the same name, Doctorow charts the journey of a man who joins an online forum for fat",
        "id": 1755083,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/21/0021215/cory-doctorows-prescient-novella-about-health-insurance-and-murder?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Cory Doctorow's Prescient Novella About Health Insurance and Murder",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T02:12:21.918288+00:00",
        "description": "The EU is pushing Apple to make iOS more interoperable with other platforms, requiring features like AirDrop and AirPlay to work seamlessly with Android and third-party devices, while also enabling background app functionality and cross-platform notifications. 9to5Google reports: A new document released (PDF) by the European Commission this week reveals a number of ways the EU wants Apple to change iOS and its features to be more interoperable with other platforms. There are some changes to iOS itself, such as opening up notifications to work on third-party smartwatches as they do with the Apple Watch. Similarly, the EU wants Apple to let iOS apps work in the background as Apple's first-party apps do, as this is a struggle of some apps, especially companion apps for accessories such as smartwatches (other than the Apple Watch, of course). But there are also some iOS features that the EU directly wants Apple to open up to other platforms, including Android. [...]\n \nAs our sister site ",
        "id": 1754899,
        "language": null,
        "link": "https://apple.slashdot.org/story/24/12/20/2320225/eu-wants-apple-to-open-airdrop-and-airplay-to-android?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "EU Wants Apple To Open AirDrop and AirPlay To Android",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T02:12:21.117015+00:00",
        "description": "The rise of AI has rendered traditional CAPTCHA tests increasingly ineffective, as bots can now \"[solve] these puzzles in milliseconds using artificial intelligence (AI),\" reports The Conversation. \"How ironic. The tools designed to prove we're human are now obstructing us more than the machines they're supposed to be keeping at bay.\" The report warns that the imminent arrival of AI agents -- software programs designed to autonomously interact with websites on our behalf -- will further complicate matters. From the report: Developers are continually coming up with new ways to verify humans. Some systems, like Google's ReCaptcha v3 (introduced in 2018), don't ask you to solve puzzles anymore. Instead, they watch how you interact with a website. Do you move your cursor naturally? Do you type like a person? Humans have subtle, imperfect behaviors that bots still struggle to mimic. Not everyone likes ReCaptcha v3 because it raises privacy issues -- plus the web company needs to assess us",
        "id": 1754898,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/20/2331225/yes-i-am-a-human-bot-detection-is-no-longer-working?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "'Yes, I am a Human': Bot Detection Is No Longer Working",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T00:41:04.449437+00:00",
        "description": "The U.S. Department of Justice has charged Russian-Israeli national, Rostislav Panev, for his alleged role as a developer in the LockBit ransomware group, accused of designing malware and maintaining infrastructure for attacks that extorted over $500 million and caused billions in global damages. CyberScoop reports: The arrest is part of a broader campaign by international law enforcement agencies to dismantle LockBit. In February, a coordinated operation led by the U.K.'s National Crime Agency in cooperation with the FBI and the U.S. Justice Department disrupted LockBit's infrastructure, seizing websites and servers critical to its operations. These efforts significantly curtailed the group's ability to launch further attacks and extort victims.\n \nPanev is one of several individuals charged in connection with LockBit. Alongside him, other key figures have been indicted, including Dmitry Khoroshev, alleged to be \"LockBitSupp,\" the group's primary creator and administrator. Khoroshev,",
        "id": 1754650,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/20/2231217/justice-department-unveils-charges-against-alleged-lockbit-developer?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Justice Department Unveils Charges Against Alleged LockBit Developer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T00:41:04.364386+00:00",
        "description": "An anonymous reader quotes a report from PCMag: Amazon employees are striking after the online retail giant missed a deadline to begin negotiations for a union contract. Roughly 10,000 employees have gone on strike as of Dec. 19. Workers are forming picket lines in New York City, Atlanta, Southern California, San Francisco, and Skokie, IL. Per a press release from the Teamsters, employees at other facilities have authorized strikes as well. Local unions are also putting up picket lines at hundreds of fulfillment centers nationwide, which could cause package delays ahead of the holidays.\n \n\"If your package is delayed during the holidays, you can blame Amazon's insatiable greed. We gave Amazon a clear deadline to come to the table and do right by our members. They ignored it,\" says Teamsters General President Sean M. O'Brien. \"These greedy executives had every chance to show decency and respect for the people who make their obscene profits possible. Instead, they've pushed workers to t",
        "id": 1754649,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/20/2253215/10000-amazon-workers-go-on-strike-ahead-of-holiday-rush?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "10,000 Amazon Workers Go On Strike Ahead of Holiday Rush",
        "vote": 0
    }
]