[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T21:30:00+00:00",
        "description": "Supernatural is a survival horror game that revolves around a detective looking into the mystery of a missing housemaid in a seemingly haunted house. \n\nThe game’s core feature revolves around making use of the player’s microphone to not only adjust how scary the game gets, but to also interact with the antagonistic supernatural entity that seems to be roaming the house’s hallways.\n\nIn practice, while getting the microphone to work can be a finicky experience for some, Supernatural offers up a fun couple of hours for fans of the horror genre. While the game won’t have players going guns blazing against hordes of zombies, it will definitely have players on the edge of their seats thanks to gorgeous visuals and some excellent sound design - aspects that often tend to be make-or-break for horror games.",
        "id": 1758900,
        "language": null,
        "link": "https://www.youtube.com/watch?v=5VC_ivIyZAE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5VC_ivIyZAE/hqdefault.jpg",
        "title": "Supernatural Is An Ultra Realistic Horror Game In Unreal Engine 5, But Is It Any Good? | Review",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T15:30:02+00:00",
        "description": "With 2024 finally over, it's time to look forward to the year ahead and all the noteworthy titles coming out. January is full of big-name titles, including long-awaited follow-ups such as Dynasty Warriors: Origins, Sniper Elite: Resistance, and Citizen Sleeper 2: Starward Vector, each building on their series in amazing ways.\n\nOf course, some major PC ports, like Marvel's Spider-Man 2, also wait with top-of-the-line visuals for those with the best hardware. Fans of remasters can also look forward to Freedom Wars: Remastered, Ys Memoire: The Oath in Felghana, and Donkey Kong Country Returns HD, which offer higher resolutions, quality-of-life features, and more.\n\nAnd if all that isn't enough, there are new IPs like Eternal Strands. Check out our picks for the biggest games to watch out for in January 2025.",
        "id": 1757572,
        "language": null,
        "link": "https://www.youtube.com/watch?v=6ctAqZ6grOA",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6ctAqZ6grOA/hqdefault.jpg",
        "title": "15 NEW Games of January 2024 To Look Forward To",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T06:30:04+00:00",
        "description": "Open-world games are an interesting genre. With the right gameplay loop and design, they can offer some of the most expansive experiences in gaming. If things go wrong, you're looking at a slog that annoys people and ultimately makes the world feel like work rather than something organic and worthy of exploration.\n\nThough this year hasn't had the most top-tier releases - to say nothing of the titles that fizzled out - it's offered some pretty top-tier open-world games like Final Fantasy 7 Rebirth, Elden Ring: Shadow of the Erdtree, Like a Dragon: Infinite Wealth, Dragon's Dogma 2, and Satisfactory. There have also been some great efforts in semi-open world space like Black Myth: Wukong's larger areas.\n\nWhich are the best ones from 2024 that are worth playing? Find out as we run through our 20 picks for the best open-world and semi-open-world games.",
        "id": 1755647,
        "language": null,
        "link": "https://www.youtube.com/watch?v=CQuG2267cZ4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/CQuG2267cZ4/hqdefault.jpg",
        "title": "20 AMAZING OPEN AND SEMI-OPEN WORLD GAMES of 2024 You Totally Need To Play",
        "vote": 0
    }
]