[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T14:00:00+00:00",
        "description": "<p dir=\"ltr\">This year, I decided I'd finally play 2022's Case of the Golden Idol, a mystery game that thrusts you onto the scene of a murder moments after it's happened. You pan through several screens, absorb every detail you possibly can, gather clues in the form of nouns and verbs, and make logic-based deductions by filling in the missing details in passages that tell the story of what occurred there. There are systems in place to guide you in the right direction, and the game begins quite simply, but by its end, I was being pushed to my absolute limit. The first few cases took all of about 10-25 minutes, but the final one in the game seemed to stretch across the span of an entire night. My head was positively bursting with possible motives and culprits, and kudos to Case of the Golden Idol for allowing me the room to be wrong about these cases until I eventually divined the right permutation of terms and cracked the case. It was one of the most frustrating ends of a game ever, a",
        "id": 1758987,
        "language": "en-US",
        "link": "https://www.gamespot.com/articles/2024s-best-games-let-me-figure-it-out/1100-6528592/?ftag=CAD-01-10abi2f",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 126,
        "source_url": "https://www.gamespot.com/feeds/mashup",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1585/15855271/4418885-best-loreli.jpg",
        "title": "2024's Best Games Let Me Figure It Out",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-21T04:00:00+00:00",
        "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4417823-eldenringshadowoftheerdtree3.jpg\" /><br /><h3><p dir=\"ltr\">The best role-playing games are the ones that effortlessly transport you to faraway lands, and in 2024, there was no shortage of fantasy adventures in this genre. This is a category of video games that feature a lot of legacy titles and franchises, and 2024's best-reviewed RPGs pulled from several franchises like Dragon Age, Final Fantasy, and Trails.</p><p dir=\"ltr\">In addition to those established heavyweights, we also got a new entry in the Like a Dragon series, Atlus releasing not one but three critically acclaimed games, and World of Warcraft kicking off a new golden age with its The War Within expansion. Thanks to our sister site Metacritic, we've rounded up the RPGs that received the highest Metascores in 2024 (as of December 5), and you can see them all for yourself in the list below.</p><p>For a look back at the year that was, you can a",
        "id": 1756610,
        "language": "en-US",
        "link": "https://www.gamespot.com/gallery/the-best-rpgs-of-2024-according-to-metacritic/2900-6096",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 126,
        "source_url": "https://www.gamespot.com/feeds/mashup",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/4417833-metacriticbestrpg2024.jpg",
        "title": "The Best RPGs Of 2024 According To Metacritic",
        "vote": 0
    }
]