[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-19T17:30:12+00:00", "description": "From Washington D.C. to Boston, the Fallout franchise has explored a number of different locations throughout America across its long history, but there’s a bevy of locations that it hasn’t been to yet that could serve as excellent settings for a new Fallout game. \n\nWith Bethesda currently having its hands full with The Elder Scrolls 6 and post-launch work on Starfield, it will obviously be many, many years before we get to see the next mainline instalment in the Fallout franchise, but with all the ongoing Fallout excitement brought about by Amazon Prime’s recently released series, we’ve caught ourselves wondering where we would like to see Fallout 5 take place. Here, that’s exactly what we’ll be talking about.", "language": null, "link": "https://www.youtube.com/watch?v=yfUJtz-yqWI", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/yfUJtz-yqWI/hqdefault.jpg", "title": "Fallout 5 - Six Potential Settings We'd Love To See", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-19T13:30:20+00:00", "description": "All Fallout titles, including the once-disastrous Fallout 76, are seeing increased player numbers thanks to Amazon's recent Fallout TV series. While newcomers discover what makes these titles so compelling, it's interesting for long-time players to look back on some of them, specifically Fallout 4.\n\nAnnounced in June 2015 and launched just a few months later, Fallout 4 received extensive buzz as Bethesda's next big thing after The Elder Scrolls 5: Skyrim. It created headlines due to its settlement building, brand new setting and story, improved gunplay, revamped dialogue system and many other features. When it finally launched, it was a critical and commercial success.\n\nHowever, opinions among players would quickly become divided. Join us as we look back on Fallout 4's history - the good, the bad and the ugly - and why it sowed so much discord among franchise fans.", "language": null, "link": "https://www.youtube.com/watch?v=osOVKpYeMVI", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/osOVKpYeMVI/hqdefault.jpg", "title": "Why Fallout 4 Was So Divisive AMONG GAMERS", "user": null, "vote": 0}]