[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-03T15:30:16+00:00", "description": "As we have seen on no few occasions over the years, the demand for focused and linear AA single player games is never going to go away, and with Unknown 9: Awakening, developer Reflector Entertainment and publisher Bandai Namco are looking to deliver something in that very specific arena. \n\nTouted as the centerpiece of a new multimedia narrative universe, Unknown 9: Awakening has looked increasingly intriguing with each of its gameplay showings, with an interesting core premise, the promise of complex stealth and action gameplay, and more. \n\nWhether it can deliver on those promises obviously remains to be seen, but the game has certainly turned heads in the lead up to its release. With its launch around the corner, here, we’re going to go over a few key details that you should know about it.", "id": 1260524, "language": null, "link": "https://www.youtube.com/watch?v=oJ3gq9xN2I0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/oJ3gq9xN2I0/hqdefault.jpg", "title": "Unknown 9: Awakening - 10 Things You NEED To Know Before You Buy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-03T13:30:08+00:00", "description": "FromSoftware's input with Dark Souls aside, Souls-likes have come and gone through the years, each putting a unique spin on brutally difficult exploration, combat and boss fights. We've also seen a fair number of Sekiro-likes, catering to a different skill set but still requiring patience. However, few titles have attempted to reconcile the two.\n\nThis leads us to Nexon's The First Berserker: Khazan. It sees the disgraced General Khazan on a mission for revenge. It stands out among the competition, mixing Souls-like exploration and mechanics with Sekiro-like parrying alongside a dash of Nioh, a loot system, and a gorgeous anime art style.\n\nAfter going hands-on with the recent closed beta, The First Berserker: Khazan has immediately become a hack-and-slash title worth looking forward to before its launch next year. Even in this stage, it's an unforgiving yet exhilarating experience.\n\nThis is based on Closed Beta.", "id": 1260525, "language": null, "link": "https://www.youtube.com/watch?v=7xwA5_HRUqM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/7xwA5_HRUqM/hqdefault.jpg", "title": "The First Berserker Khazan Is A Top Tier Mix of Dark Souls And Sekiro", "vote": 0}]