[{"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T22:57:07.205104+00:00", "description": "An anonymous reader quotes a report from Ars Technica: DirecTV is pulling out of an agreement to buy its satellite rival Dish after bondholders objected to terms of the deal. DirecTV issued an announcement last night saying \"it has notified EchoStar of its election to terminate, effective as of 11:59 p.m., ET on Friday, November 22nd, 2024, the Equity Purchase Agreement (EPA) pursuant to which it had agreed to acquire EchoStar's video distribution business, Dish DBS.\"\n \nIn the deal announced on September 30, DirecTV was going to buy the Dish satellite TV and Sling TV streaming business from EchoStar for a nominal fee of $1. DirecTV would have taken on $9.75 billion of Dish debt if the transaction moved ahead. The deal did not include the Dish Network cellular business. Dish bondholders quickly objected to terms requiring them to take a loss on the value of their debt. DirecTV had said Dish notes would be exchanged with \"a reduced principal amount of DirecTV debt which will have terms", "id": 1569406, "language": null, "link": "https://tech.slashdot.org/story/24/11/22/222244/directv-terminates-deal-to-buy-dish-satellite-business?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "DirecTV Terminates Deal To Buy Dish Satellite Business", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T22:57:07.121406+00:00", "description": "Baidu's new Apollo Go robotaxi brings significant advances in affordability and scalability that should make U.S. competitors like Waymo a bit nervous, according to The Verge's Andrew J. Hawkins. From the report: The RT6 is the sixth generation of Apollo Go's driverless vehicle, which made its official debut in May 2024. It's a purpose-built, Level 4 autonomous vehicle, meaning it's built without the need for a human driver. And here's the thing that should make US competitors nervous: adopting a battery-swapping solution, the price for one individual RT6 is \"under $30,000,\" Baidu CEO Robin Li said in an earnings call. \"All the strengths just mentioned above are driving us forward, paving the way to validate our business model,\" Li added. [...]\n \nWe still don't know the net effect of Baidu's cost improvements. But bringing down the upfront cost of each individual vehicle to below $30,000 will go a long way toward improving the company's unit economics, in which each vehicle brings in", "id": 1569405, "language": null, "link": "https://tech.slashdot.org/story/24/11/22/2213210/baidus-supercheap-robotaxis-should-scare-the-hell-out-of-the-us?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Baidu's Supercheap Robotaxis Should Scare the Hell Out of the US", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T21:52:18.270614+00:00", "description": "Netflix is looking toward Discord for help in figuring out who, exactly, is leaking unreleased footage from some of its popular shows. From a report: The Northern District of California court issued a subpoena on Thursday to compel Discord to share information that can help identify a Discord user who's reportedly involved in leaking episodes and images from Netflix shows like Arcane and Squid Game. \n\nDocuments filed alongside the subpoena specifically call out an unreleased and copyrighted image from the second season of Squid Game, posted by a Discord user @jacejohns4n. In an interview linked on the user's now deleted X account, published on Telegram, the leaker claimed responsibility for the self-described \"worst leak in streaming history,\" where episodes of Arcane, Heartstopper, Dandadan, Terminator Zero, and other shows were published online. Netflix confirmed in August that a post production studio was hacked.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class", "id": 1569095, "language": null, "link": "https://yro.slashdot.org/story/24/11/22/2013212/netflix-subpoenas-discord-to-id-alleged-arcane-squid-game-leaker?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Netflix Subpoenas Discord To ID Alleged Arcane, Squid Game Leaker", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T21:52:18.152734+00:00", "description": "Weeks after federal regulators announced a \"click-to-cancel\" rule for subscription businesses, a New York judge has ruled that SiriusXM made it too difficult for customers to end their service. Deadline: New York State Supreme Court Justice Lyle Frank's ruling, issued Thursday, upheld elements of a lawsuit filed against the satellite audio firm in 2023 by New York Attorney General Letitia James. In a post on X after Frank's ruling, she wrote that the company \"illegally forced people to go through a long and burdensome process to simply cancel their subscriptions. We sued SiriusXM to protect people's wallets, and now, SiriusXM must simplify its cancellation process and stop taking advantage of New Yorkers.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=SiriusXM+Made+It+Too+Tough+For+Customers+To+End+Their+Subscriptions%2C+NY+Judge+Rules%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F22%2F2021233%2F%3Futm_source%", "id": 1569094, "language": null, "link": "https://slashdot.org/story/24/11/22/2021233/siriusxm-made-it-too-tough-for-customers-to-end-their-subscriptions-ny-judge-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "SiriusXM Made It Too Tough For Customers To End Their Subscriptions, NY Judge Rules", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T20:47:33.152538+00:00", "description": "Microsoft has released a public preview of its redesigned Windows Recall feature, five months after withdrawing the original version due to security concerns. The feature will initially be available only on Qualcomm Snapdragon X Elite and Plus Copilot+ PCs running Windows Insider Dev channel build 26120.2415. \n\nRecall, which continuously captures and indexes screenshots and text for later search, now includes mandatory encryption, opt-in activation, and Windows Hello authentication. The feature requires Secure Boot, BitLocker encryption, and attempts to automatically mask sensitive data like passwords and credit card numbers. The feature is exclusive to Copilot+ PCs equipped with neural processing units for local AI processing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft's+Controversial+Recall+Scraper+is+Finally+Entering+Public+Preview%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F11%2F22%2F206216%2F", "id": 1568712, "language": null, "link": "https://it.slashdot.org/story/24/11/22/206216/microsofts-controversial-recall-scraper-is-finally-entering-public-preview?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft's Controversial Recall Scraper is Finally Entering Public Preview", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T18:34:00.602697+00:00", "description": "An anonymous reader shares a report: Plex is beginning to test its \"newly reimagined Plex experience,\" which will be available first on mobile and is coming to TV platforms \"very soon.\" Plex says the new experience has been in development for almost two years and is \"designed to bring everything you love into one seamless interface.\" But don't worry -- while the new version of the app is currently missing some features, Plex says it will be \"closing those gaps\" and will keep the current app available during the preview, which will hopefully prevent a Sonos-like debacle. \n\nA big change for the new app is redesigned navigation that more clearly delineates between media you might have on your Plex server and the company's streaming and on-demand offerings. The bottom bar has dedicated tabs for your media libraries, live TV, and on-demand movies and shows. The Watchlist, which lets you make a list of things you want to watch, has a spot at the top of the app. And artwork is shown more pr", "id": 1567857, "language": null, "link": "https://entertainment.slashdot.org/story/24/11/22/1757247/plexs-upcoming-app-redesign-is-a-big-swing-at-going-legit?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Plex's Upcoming App Redesign is a Big Swing at Going Legit", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T17:28:11.611099+00:00", "description": "Damage to two undersea fiber-optic cables in the Baltic Sea this month points to growing vulnerability of critical submarine infrastructure, with German officials suspecting sabotage and Swedish police investigating a Chinese cargo vessel's involvement. \n\nThe incident highlights escalating risks to the global submarine cable network, which carries 99% of international telecommunications traffic through 530 cable systems spanning 850,000 miles. These garden hose-thick cables facilitate trillions in daily financial transactions and vital government communications. \n\nSecurity experts warn that Russia has increased monitoring of undersea cables amid tensions over Ukraine. Taiwan reported 36 cable damages by foreign vessels since 2019, while Houthi rebels denied targeting Red Sea cables this year. Though most of the 100-plus annual cable faults are accidental, deliberate sabotage remains a concern. Repairs are costly, with new transatlantic cables running up to $250 million.<p><div class=", "id": 1567474, "language": null, "link": "https://tech.slashdot.org/story/24/11/22/1650214/how-the-worlds-vital-undersea-data-cables-are-being-targeted?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "How the World's Vital Undersea Data Cables Are Being Targeted", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T16:23:17.369794+00:00", "description": "An anonymous reader shares a report: OpenAI is preparing to launch a frontal assault on Google. The ChatGPT owner recently considered developing a web browser that it would combine with its chatbot, and it has separately discussed or struck deals to power search features for travel, food, real estate and retail websites, according to people who have seen prototypes or designs of the products. \n\nOpenAI has spoken about the search product with website and app developers such as Conde Nast, Redfin, Eventbrite and Priceline, these people said. OpenAI also has discussed powering artificial intelligence features on devices made by Samsung, a key Google business partner, similar to a deal OpenAI recently struck with Apple, according to people who were briefed about the situation at OpenAI.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI+Considers+Taking+on+Google+With+Browser%3A+https%3A%2F%2Ftech.slashdot.org%2Fsto", "id": 1566954, "language": null, "link": "https://tech.slashdot.org/story/24/11/22/1421209/openai-considers-taking-on-google-with-browser?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Considers Taking on Google With Browser", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T16:23:17.268239+00:00", "description": "Amazon said on Friday it will invest an additional $4 billion in AI startup Anthropic, following earlier investments of $4 billion made in September and March. As part of the deal, Amazon Web Services will become Anthropic's primary training partner, with the AI firm committing to use AWS's Trainium and Inferentia chips for future model development. \n\nAnthropic operates the Claude large language model.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Amazon+Doubles+Investment+in+AI+Startup+Anthropic+To+%248+Billion%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F22%2F1552251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F22%2F1552251%2Famazon-doubles-investment-in-ai-startup-anthropic-to-8-billion%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook", "id": 1566953, "language": null, "link": "https://slashdot.org/story/24/11/22/1552251/amazon-doubles-investment-in-ai-startup-anthropic-to-8-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Doubles Investment in AI Startup Anthropic To $8 Billion", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T15:19:01.016636+00:00", "description": "Apple's restrictions on mobile browsers are limiting innovation and holding back new features that could benefit iPhone users, according to provisional findings published today by the UK's Competition and Markets Authority (CMA). From a report: In its report, the CMA's independent inquiry group determined that Apple's Safari browser policies prevent competing browsers from implementing certain features, such as faster webpage loading technologies. The investigation also revealed that many UK app developers would prefer to offer progressive web apps as an alternative to App Store distribution, but Apple's current iOS limitations make this impractical. \n\nAdding to competitive concerns, the regulator highlighted a revenue-sharing agreement between Apple and Google that \"significantly reduces their financial incentives to compete\" in the mobile browser space on iOS. The CMA also found that both companies can manipulate how users are presented with browser choices, making their own offeri", "id": 1566440, "language": null, "link": "https://apple.slashdot.org/story/24/11/22/1413218/apples-browser-rules-stifle-innovation-on-ios-says-uk-regulator?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple's Browser Rules Stifle Innovation on iOS, Says UK Regulator", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T13:10:03.885160+00:00", "description": "An anonymous reader quotes a report from PYMNTS: The Justice Department's proposal to resolve its antitrust case over online search against Google reportedly would force the tech giant to unwind its partnership with artificial intelligence (AI) company Anthropic. A recommendation in the Justice Department's court filing Wednesday (Nov. 20) that Google be barred from partnerships with companies that control where consumers search for information, is intended to apply to the company's investment in Anthropic, Bloomberg reported Thursday (Nov. 21). [...]\n \nIt was reported in October 2023 that Google had invested $500 million in Anthropic and agreed to contribute another $1.5 billion over time. During that same month, PYMNTS reported that Anthropic's commitment to building and deploying what the company said are generative AI capabilities with stronger built-in guardrails, differentiated it from other foundational AI models on the market. On Tuesday (Nov. 19), the U.K.'s competition watc", "id": 1565605, "language": null, "link": "https://tech.slashdot.org/story/24/11/22/0351253/doj-antitrust-case-aims-to-undo-google-anthropic-partnership?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "DOJ Antitrust Case Aims To Undo Google-Anthropic Partnership", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T12:05:00.913450+00:00", "description": "Mozilla has warned that the Justice Department's proposed breakup of Google could harm independent web browsers, pushing back against a key element of the government's antitrust remedy. \n\nThe maker of Firefox browser said in a statement the DOJ's blanket ban on search revenue-sharing deals would disproportionately impact smaller players that rely on such agreements, while failing to meaningfully increase competition in search. \n\nFirefox and similar browsers account for a small share of US search queries but provide crucial alternatives for privacy-conscious consumers, Mozilla said. The DOJ's wide-ranging proposal, submitted to a federal court in Washington, includes forcing Google to sell its Chrome browser and prohibiting the company from paying other firms to set Google as their default search engine. \n\nThe plan follows an August ruling that found Google illegally monopolized the search market. In a statement, Mozilla argued that rather than an outright prohibition on search agreem", "id": 1565122, "language": null, "link": "https://news.slashdot.org/story/24/11/22/1112255/mozilla-warns-dojs-google-breakup-plan-may-hurt-small-browser-makers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Mozilla Warns DOJ's Google Breakup Plan May Hurt Small Browser Makers", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T10:59:31.119901+00:00", "description": "The Register's Simon Sharwood reports: Japan's National Consumer Affairs Center on Wednesday suggested citizens start \"digital end of life planning\" and offered tips on how to do it. The Center's somewhat maudlin advice is motivated by recent incidents in which citizens struggled to cancel subscriptions their loved ones signed up for before their demise, because they didn't know their usernames or passwords. The resulting \"digital legacy\" can be unpleasant to resolve, the agency warns, so suggested four steps to simplify ensure our digital legacies aren't complicated:\n \n- Ensuring family members can unlock your smartphone or computer in case of emergency;\n- Maintain a list of your subscriptions, user IDs and passwords;\n- Consider putting those details in a document intended to be made available when your life ends;\n- Use a service that allows you to designate someone to have access to your smartphone and other accounts once your time on Earth ends.\n \nThe Center suggests now is the ti", "id": 1564756, "language": null, "link": "https://yro.slashdot.org/story/24/11/22/0340231/put-your-usernames-and-passwords-in-your-will-advises-japans-government?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Put Your Usernames and Passwords In Your Will, Advises Japan's Government", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T07:44:15.328119+00:00", "description": "China has overtaken Germany and Japan in terms of robot density, according to an annual report by the International Federation of Robotics (IFR). Reuters reports: South Korea is the world leader with 1,012 robots per 10,000 employees, up 5% since 2018, said the IFR. Singapore comes next, followed by China with 470 robots per 10,000 workers - more than double the density it had in 2019. That compares with 429 per 10,000 employees in Germany, which has had an annual growth rate of 5% since 2018, said IFR.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=China+Overtakes+Germany+and+Japan+In+Robot+Density%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F11%2F22%2F0333251%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F11%2F22%2F0333251%2Fchin", "id": 1564006, "language": null, "link": "https://hardware.slashdot.org/story/24/11/22/0333251/china-overtakes-germany-and-japan-in-robot-density?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "China Overtakes Germany and Japan In Robot Density", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T04:29:17.812224+00:00", "description": "An anonymous reader quotes a report from Ars Technica: A federal court yesterday ruled against parents who sued a Massachusetts school district for punishing their son who used an artificial intelligence tool to complete an assignment. Dale and Jennifer Harris sued Hingham High School officials and the School Committee and sought a preliminary injunction requiring the school to change their son's grade and expunge the incident from his disciplinary record before he needs to submit college applications. The parents argued that there was no rule against using AI in the student handbook, but school officials said the student violated multiple policies.\n \nThe Harris' motion for an injunction was rejected in an order (PDF) issued yesterday from US District Court for the District of Massachusetts. US Magistrate Judge Paul Levenson found that school officials \"have the better of the argument on both the facts and the law.\"\n \n\"On the facts, there is nothing in the preliminary factual record ", "id": 1563377, "language": null, "link": "https://yro.slashdot.org/story/24/11/21/2330242/school-did-nothing-wrong-when-it-punished-student-for-using-ai-court-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "School Did Nothing Wrong When It Punished Student For Using AI, Court Rules", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T02:24:39.366415+00:00", "description": "According to Business Insider (paywalled), Microsoft's Copilot tool inadvertently let customers access sensitive information, such as CEO emails and HR documents. Now, Microsoft is working to fix the situation, deploying new tools and a guide to address the privacy concerns. The story was highlighted by Salesforce CEO Marc Benioff. From the report: These updates are designed \"to identify and mitigate oversharing and ongoing governance concerns,\" the company said in a blueprint for Microsoft's 365 productivity software suite. [...] Copilot's magic -- its ability to create a 10-slide road-mapping presentation, or to summon a list of your company's most profitable products -- works by browsing and indexing all your company's internal information, like the web crawlers used by search engines. IT departments at some companies have set up lax permissions for who can access internal documents -- selecting \"allow all\" for the company's HR software, say, rather than going through the trouble ", "id": 1563045, "language": null, "link": "https://yro.slashdot.org/story/24/11/21/2315249/microsoft-copilot-customers-discover-it-can-let-them-read-hr-documents-ceo-emails?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Copilot Customers Discover It Can Let Them Read HR Documents, CEO Emails", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T02:24:38.787043+00:00", "description": "Google is introducing \"Restore Credentials,\" a feature that simplifies transferring app credentials when switching Android devices to keep you logged into your apps. The Verge reports: While some apps already did this, Google is making it easier for developers to include this experience by implementing a \"restore key\" that automatically transfers to the new phone and logs you back into the app. [...] Restore Credentials requires less work than the previous approach on Android, and can automatically check if a restore key is available and log you back in at the first app launch. A restore key is a public key that uses existing passkey infrastructure to move about your credentials.\n \nRestore keys can also be backed up to the cloud, although developers can opt out. For that reason, transferring directly from device to device will still likely be more thorough than restoring from the cloud, as is the case with Apple devices today. Notably, Google says restore keys do not transfer if you ", "id": 1563044, "language": null, "link": "https://mobile.slashdot.org/story/24/11/21/2323246/androids-restore-credentials-feature-will-automatically-log-you-in-to-your-apps-on-a-new-phone?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Android's 'Restore Credentials' Feature Will Automatically Log You In To Your Apps On a New Phone", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T01:18:43.823200+00:00", "description": "An anonymous reader quotes a report from KrebsOnSecurity: The financial technology firm Finastra is investigating the alleged large-scale theft of information from its internal file transfer platform, KrebsOnSecurity has learned. Finastra, which provides software and services to 45 of the world's top 50 banks, notified customers of the security incident after a cybercriminal began selling more than 400 gigabytes of data purportedly stolen from the company. London-based Finastra has offices in 42 countries and reported $1.9 billion in revenues last year. The company employs more than 7,000 people and serves approximately 8,100 financial institutions around the world. A major part of Finastra's day-to-day business involves processing huge volumes of digital files containing instructions for wire and bank transfers on behalf of its clients.\n \nOn November 8, 2024, Finastra notified financial institution customers that on Nov. 7 its security team detected suspicious activity on Finastra's", "id": 1562780, "language": null, "link": "https://it.slashdot.org/story/24/11/21/2043251/fintech-giant-finastra-investigating-data-breach?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Fintech Giant Finastra Investigating Data Breach", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T01:18:43.463266+00:00", "description": "According to Bloomberg (paywalled), Apple is developing a new version of Siri powered by large language models (LLMs). TechCrunch reports: The new assistant reportedly will fully replace the Siri interface that users rely on today, and Apple is planning to release the feature in the spring of 2026. The feature seems like it will be similar to OpenAI's Advanced Voice Mode but with all the same access to personal information and apps that Siri has today. Until then, Apple is relying on third parties to power the iPhone's advanced AI features.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Is+Reportedly+Building+a+More+Conversational+Siri+Powered+By+LLMs%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F11%2F21%2F231235%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.", "id": 1562779, "language": null, "link": "https://apple.slashdot.org/story/24/11/21/231235/apple-is-reportedly-building-a-more-conversational-siri-powered-by-llms?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Is Reportedly Building a More Conversational Siri Powered By LLMs", "vote": 0}, {"age": null, "album": "", "author": null, "bookmarked": false, "comments": [], "date_published": "2024-11-22T00:05:47.937794+00:00", "description": "The Trade Desk, one of the largest publicly traded advertising technology companies in the world, is building a connected television operating system. Axios reports: Existing OS providers, like Roku, Amazon's Fire TV and Google's Android TV, have a conflict of interest because they own content, [CEO and founder Jeff Green] said. Green believes that conflict of interest has muddled the advertising ecosystem for everyone. \"We're looking at a concentration around a handful of players that lack objectivity,\" Green said. \"We think we're in a unique position to make the ecosystem better.\" [...]\n \nVentura, a nod to the company's headquarters in Ventura, California, will be rolled out to the market in the second half of 2025, Green said. The company has been working to build the system quietly for three years. While some OS developers, such as Google, Amazon and Roku, have also developed their own hardware devices to service their operating systems, Green said The Trade Desk has \"no intentio", "id": 1562501, "language": null, "link": "https://tech.slashdot.org/story/24/11/21/2038255/the-trade-desk-is-building-a-ctv-os-called-ventura?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Trade Desk Is Building a CTV OS Called Ventura", "vote": 0}]