[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Splinter Cell Remake - What THE HELL Is Going On?", "description": "In 2021, the developer announced it was working on a remake of Splinter Cell, built from the ground up on the Snowdrop Engine. It was good news for a fanbase waiting for anything regarding the franchise and getting vague reassurances that it's not dead. \n\nThe fact that the development team wanted to make it possible to complete the entire game in a non-lethal fashion while retaining the feel of the original was also great news.\n\nHowever, the last major development update was earlier this year and thus far, the remake is still considered in the \"early production\" stage. It's always tough to wait for a video game's release, especially when it's a remake of one of the most beloved stealth titles. So where the heck is it, and what could be the hold-up? Is there any reason to worry? Let's talk about it.", "link": "https://www.youtube.com/watch?v=pkspAnbzZQM", "date_published": "2023-11-30T15:30:12+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/pkspAnbzZQM/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "We Played These 15 WORST GAMES OF 2023 So You Don't Have To", "description": "Without a shadow of doubt, 2023 will go down as one of the greatest years in gaming history, but though the last several months have been characterized by stellar titles that will be remembered as all-time greats, there have also been plenty of games that have stood out for the exact opposite reasons. \n\nIn a year of many highs, there have also been quite a few lows, with games that have failed to not only live up to expectations, but also even failed to deliver the most basic and fundamental things you would expect to see in any game that you’re paying money to play. \n\nHere, we’re going to talk about a few games that released in 2023 that we’re going to try our best to forget, but probably are going to have nightmares about for some time to come.", "link": "https://www.youtube.com/watch?v=HpM654fn_QE", "date_published": "2023-11-30T09:30:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/HpM654fn_QE/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]