[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-09T22:45:00+00:00", "description": "2023 was somewhat of a year of recovery for Microsoft’s first-party efforts, with the likes of Hi-Fi Rush, Starfield, and Forza Motorsport restoring some faith after what had been a disastrously dry 2022, though in 2024, it feels like Xbox Game Studios’ output has slipped back once again. \n\nAfter a decidedly disappointing year, however, it looks like Xbox is still going to somehow finish 2024 strong, with a trifecta of major upcoming releases lined up for the year’s final weeks. \n\nThird-party partner exclusive S.T.A.L.K.E.R. 2: Heart of Chornobyl and first-party duo Microsoft Flight Simulator 2024 and Indiana Jones and the Great Circle are all looking loke legitimately excellent games based on all that we’ve seen of it so far, giving Xbox a potential leg up over other platforms to close out the year.", "id": 1486291, "language": null, "link": "https://www.youtube.com/watch?v=nQxn3Oxt8i8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/nQxn3Oxt8i8/hqdefault.jpg", "title": "Xbox Looks Set To End 2024 On A Strong Note After An Otherwise Disappointing Year", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-09T13:45:01+00:00", "description": "A publisher rarely releases not one but two of the biggest games of the year in one month, and not just in terms of hype. Yet Microsoft is doing just that in November with Microsoft Flight Simulator 2024 out on the 19th and S.T.A.L.K.E.R. 2: Heart of Chornobyl launching on the 20th for Xbox Series X/S and PC.\n\nAs massive as the former is, S.T.A.L.K.E.R. 2 is an entirely different beast. Set in the Chornobyl Exclusion Zone during modern times, it follows the mysterious Skif, who ventures inside for his own reasons. \n\nWith a hand-crafted 60+ square kilometre map, players can encounter various characters, random events, Stalker stashes, terrifying mutants, Anomalies, and more.\n\nUltimately, it's up to them how they play through the story, with the narrative branching with major decisions and unlocking different endings. Whether you're customizing the many different weapons, sitting by the campfire with other Stalkers or delving deeper into the Zone, S.T.A.L.K.E.R. 2: Heart of Chornobyl p", "id": 1484086, "language": null, "link": "https://www.youtube.com/watch?v=FXBmCzyEeN4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/FXBmCzyEeN4/hqdefault.jpg", "title": "STALKER 2 Heart of Chornobyl - 15 Things You NEED TO KNOW Before You Buy", "vote": 0}]