[{"tags": [], "album": "", "artist": null, "comments": [], "dead": false, "age": null, "page_rating_contents": 94, "source_obj__id": 129, "date_published": "2024-03-21T19:30:01+00:00", "permanent": false, "language": null, "page_rating_visits": 0, "bookmarked": false, "link": "https://www.youtube.com/watch?v=IN_-GGvsrVs", "vote": 0, "page_rating_votes": 0, "thumbnail": "https://i2.ytimg.com/vi/IN_-GGvsrVs/hqdefault.jpg", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "13 Things Rise of the Ronin Doesn't Tell You", "user": null, "page_rating": 94, "description": "Team Ninja has a reputation for crafting dense, multilayered RPGs that players can lose themselves in for countless hours, and though its newest outing, Rise of the Ronin, is very different from the developer’s past works, it does still have a lot going on that players need to keep an eye on. \n\nFrom its open world and the many activities it houses to the many underlying systems that govern its combat, progression, and more, Rise of the Ronin asks players to juggle several balls at once, even if it is a much more approachable game than the likes of Nioh or Wo Long: Fallen Dynasty. \n\nAs such, here, we’ve compiled a few handy tips and tricks that will help you more quickly get a grasp on things as you begin your journey in Rise of the Ronin."}, {"tags": [], "album": "", "artist": null, "comments": [], "dead": false, "age": null, "page_rating_contents": 94, "source_obj__id": 129, "date_published": "2024-03-21T11:00:22+00:00", "permanent": false, "language": null, "page_rating_visits": 0, "bookmarked": false, "link": "https://www.youtube.com/watch?v=QeQVZJoBs7s", "vote": 0, "page_rating_votes": 0, "thumbnail": "https://i2.ytimg.com/vi/QeQVZJoBs7s/hqdefault.jpg", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Rise of the Ronin PS5 Graphics Analysis - Does Team Ninja's First Open World Game Deliver The Goods?", "user": null, "page_rating": 94, "description": "Team Ninja has built its reputation off the back of smash hits like Nioh and Wo Long, and the developer has now cemented itself as a powerhouse when it comes to action games. \n\nIt’s latest release Rise of the Ronin is different from its previous games thanks to its transition to an open-world structure. We know that Rise of the Ronin is still utilizing the same in-house engine as Wo Long, so how has the rendering pipeline changed? \n\nWith this video, we take a look at the technical aspects of Rise of the Ronin on PS5, right from the lighting to reflections and much more. We also take a look at the various graphical options available, and how they perform on the PS5."}, {"tags": [], "album": "", "artist": null, "comments": [], "dead": false, "age": null, "page_rating_contents": 94, "source_obj__id": 129, "date_published": "2024-03-21T11:00:02+00:00", "permanent": false, "language": null, "page_rating_visits": 0, "bookmarked": false, "link": "https://www.youtube.com/watch?v=3jGrjhLUDH4", "vote": 0, "page_rating_votes": 0, "thumbnail": "https://i4.ytimg.com/vi/3jGrjhLUDH4/hqdefault.jpg", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Rise of the Ronin Review - The Final Verdict", "user": null, "page_rating": 94, "description": "Rise of the Ronin is surprisingly underwhelming. Where combat and traversal are concerned, the game does deserve a lot of credit, because in those areas, at the very least, it manages to remain an enjoyable experience for the most part. In nearly every other way, however, it fails to make any sort of a mark. \n\nAs an open world game, it feels too generic and by-the-numbers, not just because of how cookie cutter its content offerings tend to be, but also because of how lifeless and bland the world feels. Meanwhile, the game doesn’t do a good job of backing its storytelling ambitions either, with poor writing and acting performances failing to do justice to what is, at least on paper, a setting with a lot of promise. This is probably Team Ninja’s most unremarkable game in a long time."}]