[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Top 10 Racing Games of 2023 You DEFINITELY Need To Play", "description": "Racing games, like so many other genres, enjoyed a pretty solid 12 months in 2023. From big developers to small, from arcadey experiences to authentic simulators, from bikes to supercars to Lego bricks, from open worlds to stage-based racers, there was a healthy and impressively varied selection of new games to play for fans of the racing genre throughout the course of the year. \n\nPerhaps we didn’t get a single game that was able to stand out as one of the genre’s best offerings ever the way so many other genres did in 2023, but collectively, the steady stream of racers that we played throughout the year delivered on several fronts. Here, we’re going to recognize a few of those games, and talk about the ones that stand out as our favorites.", "link": "https://www.youtube.com/watch?v=T1bKIsRLqRs", "date_published": "2023-12-27T15:30:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/T1bKIsRLqRs/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "12 SLEEPER HITS of 2023 You Missed Playing", "description": "2023 has been a remarkable year for video games, with some of the medium’s best-ever seeing the light of day since January. However, for smaller studios this represents a constant fight to grab a share of the limelight for their games, which as always is a shame because the 12 games on this rundown possess some of the most creative, innovative, and downright beautiful experiences of the year. \n\nSome of these games are recognizable, of course, but their player numbers and general hype are somewhat lacking, so this feature aims to shine a light on games that have probably passed most of you by. Hopefully there’ll be something new here for you to dive into.", "link": "https://www.youtube.com/watch?v=lFScgILVWI8", "date_published": "2023-12-27T09:30:21+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/lFScgILVWI8/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]