[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "10 WORST SINGLE PLAYER Games of 2023", "description": "From its first month to its last, 2023 has delivered some truly incredible games across a variety of genres, on all platforms, and from developers from throughout the industry- so much so, in fact, that it’s easily going to go down as one of gaming’s best and most packed years. \n\nAt the same time, however, there hasn’t been any shortage of shockingly bad games either. Over the course of the year, we’ve played quite a few awful single player experiences that we’re going to want to forget all about as soon as possible, from major AAA titles to smaller games with much smaller ambitions. Here, we’re going to talk about a few such solo stinkers that have stood out for all the wrong reasons.", "link": "https://www.youtube.com/watch?v=FIiCemKcYr0", "date_published": "2023-12-15T14:30:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/FIiCemKcYr0/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "GTA 6 SINGLE PLAYER Looks Great But What About GTA Online?", "description": "Grand Theft Auto 6 is already breaking records before its release in 2025, with nearly 148 million views (and counting) on the first trailer. There's immense hype over the setting, the new protagonists and the visual fidelity. However, there is a giant question mark over one aspect of the experience - the online multiplayer.\n\nGrand Theft Auto Online is a massive deal for Rockstar Games and Take-Two Interactive. How will GTA 6 handle the transition? Will it introduce GTA Online 2? Will Rockstar pull support for the original and focus all resources on the follow-up? Could it run both at the same time? Is multiplayer even planned?\n\nWe don't know, but it's still a lingering issue worth discussing, especially since Red Dead Online went out with a whimper.", "link": "https://www.youtube.com/watch?v=VFo2V38JltI", "date_published": "2023-12-15T09:30:10+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/VFo2V38JltI/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]