[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-31T12:00:00+00:00",
        "description": "<p dir=\"ltr\">Earth Defense Force 6 is the pinnacle of a series that many people view as being a fairly mindless shooter. Despite that, it also has the best use and interpretation of time travel of any game I've played. It does that without leveraging new-fangled fancy graphics, instead relying on quality storytelling and some very cool meta decisions that change up the usual “just pick the next mission” grind that’s present in these games. EDF 6 uses all of these things to great effect, and it makes the time-travel concept almost feel believable.</p><p dir=\"ltr\"><strong>Earth Defense Force 6 spoilers follow.</strong></p><p dir=\"ltr\">The fact that time travel is ingrained into basically every aspect of the story means that, while it's not as visually striking as the time travel offered in something like Dishonored or Titanfall, it's more engrossing. The way it's interwoven into the mechanics as well makes for an incredibly novel take on the concept I’ve not seen before, especially whe",
        "id": 1812103,
        "language": "en-US",
        "link": "https://www.gamespot.com/articles/earth-defense-force-6-is-a-master-of-time-travel/1100-6528516/?ftag=CAD-01-10abi2f",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 126,
        "source_url": "https://www.gamespot.com/feeds/mashup",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1585/15855271/4417381-edf.png",
        "title": "Earth Defense Force 6 Is A Master Of Time Travel",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-31T05:00:00+00:00",
        "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1601/16018044/4418292-january2025games.jpg\" /><br /><h3><p>It's the start of a brand-new year, and with big games scheduled to release throughout 2025, January is so far shaping up to be a modest month for new arrivals. So far, the biggest highlights include a few remasters like Donkey Kong Country Returns, Star Wars: Jedi Power Battles, and Freedom Wars, while PC gamers get two PS5 ports in the form of Marvel's Spider-Man 2 and Final Fantasy 7 Rebirth.</p><p>On the indie side, the long-awaited Hyper Light Breaker enters early access, Warside looks like it'll scratch an Advance Wars itch, and Sniper Elite: Resistance will give you a tour of France as you turn Nazis into gruesome confetti.</p><p>February 2025 will be the big month for new releases, as it's loaded with high-profile games like Civilization 7, Assassin's Creed Shadows, Avowed, and Monster Hunter Wilds. For a closer look at what the rest of the year holds in stor",
        "id": 1810026,
        "language": "en-US",
        "link": "https://www.gamespot.com/gallery/the-biggest-game-releases-of-january-2025/2900-6020",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 126,
        "source_url": "https://www.gamespot.com/feeds/mashup",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1601/16018044/4418292-january2025games.jpg",
        "title": "The Biggest Game Releases Of January 2025",
        "vote": 0
    }
]