[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T19:30:02+00:00", "description": "The original Monster Hunter Stories came out for the 3DS at a time when the system was in the very final legs of its lifecycle, while Montser Hunter itself had not yet hit global popularity as a mainstream franchise - which means many may have let the JRPG spinoff fly entirely under the radar. Now, however, the developer has remastered the game and brought it over to modern platforms (except Xbox), and though I wouldn’t call it an unmissable masterpiece or anything approaching that, I do find it an easy game to recommend. \n\nMonster Hunter Stories certainly shows its age (and the fact that it was made for the 3DS) in some areas, but it’s ultimately still a fun and charming RPG that fans of the genre will likely enjoy.", "id": 719481, "language": null, "link": "https://www.youtube.com/watch?v=NSb88LXUU0k", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NSb88LXUU0k/hqdefault.jpg", "title": "Monster Hunter: Stories 1 PS4 Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T15:30:02+00:00", "description": "Elden Ring is absolutely FromSoftware’s most ambitious entry in their Soulsborne canon. Taking the brutal, fast-paced combat their games are famous for, the deep exploration, and complex lore and implanting it into open world design has proven a masterstroke. \n\nA big part of the game’s ambition is its boss battles, and whilst only 13 of the game’s 238 bosses need to be defeated to see the credits roll, there’s a such a wealth of fantastical creature designs testing player mettle and skill you’d be missing out if you didn’t seek out these challenges. \n\nThis feature highlights 15 of the most difficult bosses in the entire game but bear in mind that difficulty is subjective. Individual player skill will likely yield a different list for everyone.", "id": 718656, "language": null, "link": "https://www.youtube.com/watch?v=BSjuhRMpRBk", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/BSjuhRMpRBk/hqdefault.jpg", "title": "15 HARDEST Elden Ring Bosses That Pushed Our Skills To The Max", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T09:45:01+00:00", "description": "Creations went live in Starfield this week, bringing official modding to the space-faring RPG after months of anticipation. It's already off to a strong start with new outfits, tweaks, overhauls to core mechanics, decorations and much more. Unfortunately, the release hasn't been without controversy.\n\nBethesda added a free new feature with the update called the Tracker's Alliance, allowing players to hunt down bounty targets. After completing the first mission, players must spend real Credits (acquired with real money) to access the second. Its length and the rewards leave much to be desired, even more when compared to the work of independent modders.\n\nSuffice it to say that fans aren't happy and have begun leaving negative reviews on Steam, plunging its recent rating into \"Mostly Negative.\" Is this a precedent for what you can expect from future content? Will Bethesda change course? Find out more here.", "id": 717437, "language": null, "link": "https://www.youtube.com/watch?v=FysYgkbqCNQ", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/FysYgkbqCNQ/hqdefault.jpg", "title": "Starfield Is Charging HOW MUCH for New Missions?", "user": null, "vote": 0}]