[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T23:35:51.208516+00:00", "description": "The $22 million paid by Change Healthcare's parent company to unlock its systems \"may have emboldened bad actors to further target the vulnerable industry,\" writes Axios:\nThere were 44 attacks against the health care sector in April, the most that [cybersecurity firm] Recorded Future has seen in the four years it's been collecting data. It was also the second-largest month-over-month jump, after 30 ransomware attacks were recorded in March. There were 32 attacks in February and May. \n\nBut an analysis by the security-focused magazine CSO says the \"disastrous\" incident also \"starkly illustrated the fragility of the healthcare sector, prompting calls for regulatory action.\"\nIn response to the attack, US politicians have called for mandated baseline cybersecurity standards in the health sector, as well as better information sharing. They have also raised concerns that industry consolidation is increasing cyber risk. \n\nSo what went wrong? The attackers used a set of stolen credentials to r", "id": 720059, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/15/2048219/security-lessons-from-the-change-healthcare-ransomware-catastrophe?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Security Lessons from the Change Healthcare Ransomware Catastrophe", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T22:30:28.567881+00:00", "description": "The New York Times magazine remembers that once upon a time, in the early 1990s, \"some prominent researchers were promoting, and the media helped popularize, the idea that moderate drinking...was linked to greater longevity. \n\n\"The cause of that association was not clear, but red wine, researchers theorized, might have anti-inflammatory properties that extended life and protected cardiovascular health...\"\n\nMore recently, though, research has piled up debunking the idea that moderate drinking is good for you. Last year, a major meta-analysis that re-examined 107 studies over 40 years came to the conclusion that no amount of alcohol improves health; and in 2022, a well-designed study found that consuming even a small amount brought some risk to heart health. That same year, Nature published research stating that consuming as little as one or two drinks a day (even less for women) was associated with shrinkage in the brain &mdash; a phenomenon normally associated with aging... \n\n[M]ore p", "id": 719906, "language": "en-us", "link": "https://slashdot.org/story/24/06/15/1713240/researchers-find-no-amount-of-alcohol-is-healthy-for-you?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Researchers Find No Amount of Alcohol is Healthy For You", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T21:27:01.181021+00:00", "description": "Wednesday The Information reported that OpenAI had doubled its annualized revenue &mdash; a measure of the previous month's revenue multiplied by 12 &mdash; in the last six months. It's now $3.4 billion (which is up from around $1 billion last summer, notes Engadget). \n\nAnd now an anonymous reader shares a new report from The Information:\n\nOpenAI CEO Sam Altman recently told some shareholders that the artificial intelligence developer is considering changing its governance structure to a for-profit business that OpenAI's nonprofit board doesn't control, according to a person who heard the comments. One scenario Altman said the board is considering is a for-profit benefit corporation, which rivals such as Anthropic and xAI are using, this person said.\n\nSuch a change could open the door to an eventual initial public offering of OpenAI, which currently sports a private valuation of $86 billion, and may give Altman an opportunity to take a stake in the fast-growing company, a move some in", "id": 719733, "language": "en-us", "link": "https://slashdot.org/story/24/06/15/1927218/openai-ceo-says-company-could-become-a-for-profit-corporation-like-xai-anthropic?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI CEO Says Company Could Become a For-Profit Corporation Like xAI, Anthropic", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T20:22:26.522553+00:00", "description": "Have scientists discovered infrared radiation, evidence of waste heat generated by the energy-harvesting star-surrounding spheres first proposed by British American physicist Freeman Dyson? CNN reports:\n\n\n[A] new study that looked at 5 million stars in the Milky Way galaxy suggests that seven candidates could potentially be hosting Dyson spheres &mdash; a finding that's attracting scrutiny and alternate theories... Using historical data from telescopes that pick up infrared signatures, the research team looked at stars located within less than 1,000 light-years from Earth: \"We started with a sample of 5 million stars, and we applied filters to try to get rid of as much data contamination as possible,\" said lead study author Mat&iacute;as Suazo, a doctoral student in the department of physics and astronomy of Uppsala University in Sweden. \"So far, we have seven sources that we know are glowing in the infrared but we don't know why, so they stand out....\" \n\nAmong the natural causes that", "id": 719586, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/15/1855235/have-scientists-found-potential-evidence-of-dyson-spheres?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Have Scientists Found 'Potential Evidence' of Dyson Spheres?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T19:16:57.998214+00:00", "description": "This week the Rust Foundation jointly announced \"the Safety-Critical Rust Consortium\" with industry partners including Arm, AdaCore, Lynx Software Technologies, and Toyota's mobility tech subsidiary Woven. Its goal is supporting \"responsible use\" of Rust \"in safety-critical software &mdash; systems whose failure can impact human life or cause severe environmental or property harm.\" \n\n\"This is exciting,\" said Rust creator Graydon Hoare in a statement. \"I am truly pleased to see the Rust Foundation and anyone in the safety-critical space coming together on this topic.\" \n\nFrom the announcement:\n\n\"Safety is our foremost priority in vehicle software development. Traditionally, achieving the highest levels of safety has been a complex and lengthy endeavor, requiring the use of specialized tools and processes beyond the programming language,\" said JF Bastien, Distinguished Engineer at Woven by Toyota. \"We are therefore pleased to collaborate with leading experts in the safety industry to int", "id": 719383, "language": "en-us", "link": "https://developers.slashdot.org/story/24/06/15/0349253/rusts-foundation-announces-a-new-safety-critical-rust-consortium?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Rust's Foundation Announces a New 'Safety-Critical Rust Consortium'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T18:11:53.520627+00:00", "description": "French photovoltaics group Hespul tested solar panels installed in 1992, reports PV Magazine:\n\nThe testing showed that the modules still produce on average 79.5% of their initial power after 31 years of operation. In a previous testing carried out 11 years ago, the panels were found to produce 91.7% of their initial power. \"This result exceeds the performance promised by the manufacturers who said the panels would have maintained 80% of their output after 25 years,\" said Hespul. \n\nThe drop in performance is on average 20.5%, or 0.66% per year over 31 years, and 1.11% per year over the last 11 years... Another more recent study carried out by the US Department of Energy's National Renewable Energy Laboratory (NREL) on 1,700 American sites totaling 7.2 GW of power, showed a median degradation of around -0.75%/year. Moveover, another research study focused on 4,300 residential installations in operation in Europe and used different data processing methodologies. Depending on the methods,", "id": 719154, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/15/050255/solar-modules-deployed-in-france-in-1992-still-provide-795-of-original-output?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Solar Modules Deployed In France In 1992 Still Provide 79.5% of Original Output", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T17:06:51.381028+00:00", "description": "Slashdot reader BrianFagioli shares his report from BetaNews:\nThe PC community is abuzz with Qualcomm's recent announcement of its Snapdragon X Elite SoC, a powerhouse chipset that promises to revolutionize the performance and energy efficiency of laptops and tablets. While Windows 11 Copilot+ PCs are set to feature this advanced processor, Linux enthusiasts have reasons to celebrate as well. You see, TUXEDO Computers is bringing this cutting-edge technology to the Linux world with its upcoming ARM notebook, positioning it as a strong competitor to Windows 11 Copilot+ devices. \n\nIn a recent update, TUXEDO Computers revealed its ambitious project of developing an ARM notebook powered by the Snapdragon X Elite SoC from Qualcomm. This announcement has generated significant excitement, as it presents a viable alternative to traditional x86 notebooks, offering comparable performance with lower energy consumption, directly challenging the dominance of Windows 11 Copilot+... Benchmarks sugge", "id": 718952, "language": "en-us", "link": "https://linux.slashdot.org/story/24/06/15/0528243/linux-vs-windows-11-copilot-pcs-tuxedo-unveils-snapdragon-x-elite-arm-notebook?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Linux vs Windows 11 Copilot+ PCs? TUXEDO Unveils Snapdragon X Elite ARM Notebook", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T16:01:49.531143+00:00", "description": "An anonymous reader shared this report from Futurism:\n\n\nAn AI chatbot named VIC, or Virtually Integrated Citizen, is trying to make it onto the ballot in this year's mayoral election for Wyoming's capital city of Cheyenne. \nBut as reported by Wired, Wyoming's secretary of state is battling against VIC's legitimacy as a candidate &mdash; and now, an investigation is underway. \nAccording to Wired, VIC, which was built on OpenAI's GPT-4 and trained on thousands of documents gleaned from Cheyenne council meetings, was created by Cheyenne resident and library worker Victor Miller. Should VIC win, Miller told Wired that he'll serve as the bot's \"meat puppet,\" operating the AI but allowing it to make decisions for the capital city.... \"My campaign promise,\" Miller told Wired, \"is he's going to do 100 percent of the voting on these big, thick documents that I'm not going to read and that I don't think people in there right now are reading....\" \nUnfortunately for the AI and its &mdash; his? &m", "id": 718733, "language": "en-us", "link": "https://politics.slashdot.org/story/24/06/15/0433244/an-ai-generated-candidate-wants-to-run-for-mayor-in-wyoming?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "An AI-Generated Candidate Wants to Run For Mayor in Wyoming", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T14:57:32.872240+00:00", "description": "Friday the Python Software Foundation published several blog posts about this year's \"Python Language Summit\" May 15th (before PyCon US), which featured talks and discussions by core developers, triagers, and Python implementation maintainers. \n\nThere were several lightning talks. One talk came from the maintainer of the PyO3 project, offering Rust bindings for the Python C API (which requires mapping Rust concepts to Python &mdash; leaving a question as to how to map Rust's error-handling panic! macro). There was a talk on formalizing the PEP prototype process, and a talk on whether the Python team should have a more official presence in the Apple App Store (and maybe the Google Play Store). One talk suggested changing the formatting of error messages for assert statements, and one covered a \"highly experimental\" project to support structured data sharing between Python subinterpreters. One talk covered Python's \"unsupported build\" warning and how it should behave on platforms beyond", "id": 718367, "language": "en-us", "link": "https://developers.slashdot.org/story/24/06/15/0642232/python-language-summit-2024-security-workflows-calendar-versioning-transforms-and-lightning-talks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Python 'Language Summit' 2024:  Security Workflows, Calendar Versioning, Transforms and Lightning Talks", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T10:33:33.104325+00:00", "description": "wgoodman shares a report from The Register: NASA's Voyager 1 spacecraft is back in action and conducting normal science operations for the first time since the veteran probe began spouting gibberish at the end of 2023. All four of the spacecraft's remaining operational instruments are now returning usable data to Earth, according to NASA. Some additional work is needed to tidy up the effects of the issue. Engineers need to resynchronize the timekeeping software of Voyager 1's three onboard computers to ensure that commands are executed at the correct times. Maintenance will also be performed on the digital tape recorder, which records some data from the plasma instrument for a six-monthly downlink to Earth.\n \nVoyager 1's woes began in November 2023, when the spacecraft stopped transmitting usable data back to Earth. Rather than engineering and science data, NASA found itself faced with a repeating pattern of ones and zeroes, as though the spacecraft was somehow stalled. Engineers reck", "id": 717614, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/15/0343232/voyager-1-returns-to-normal-science-operations?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Voyager 1 Returns To Normal Science Operations", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T07:18:05.659275+00:00", "description": "The Pentagon announced the first winners of its $5.6 billion National Security Space Launch program, with Jeff Bezos' Blue Origin securing a spot for the first time alongside Elon Musk's SpaceX and United Launch Alliance (ULA). These companies will compete for contracts through mid-2029 under the program's Phase 3, which is expected to include 90 rocket launch orders. CNBC reports: Under the program, known as NSSL Phase 3 Lane 1, the trio of companies will be eligible to compete for contracts through mid-2029. ULA and SpaceX have already been competing for contracts under the previous Phase 2 edition of NSSL: In total, over five years of Phase 2 launch orders, the military assigned ULA with 26 missions worth $3.1 billion, while SpaceX got 22 missions worth $2.5 billion. Blue Origin, as well as Northrop Grumman, missed out on Phase 2 when the Pentagon selected ULA and SpaceX for the program in August 2020. But with Phase 3, the U.S. military is raising the stakes -- and widening the fi", "id": 717101, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/15/0023248/blue-origin-joins-spacex-ula-in-winning-bids-for-56-billion-pentagon-rocket-program?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Blue Origin Joins SpaceX, ULA In Winning Bids For $5.6 Billion Pentagon Rocket Program", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T04:03:00.974053+00:00", "description": "An anonymous reader quotes a report from Reuters: Alphabet's Google must face trial on U.S. antitrust enforcers' claim that the internet search juggernaut illegally dominates the online advertising technology market, a federal judge ruled on Friday. U.S. District Judge Leonie Brinkema in Alexandria, Virginia, denied Google's motion during a hearing, according to court records. Google had argued for a win without a trial, saying that antitrust laws do not block companies from refusing to deal with rivals and that regulators had not accurately defined the ad tech market. Court papers did not specify what reasons the judge provided at the hearing. Motions like the one Google filed are only granted where a judge determines there is no factual dispute to send to trial. Last year, the U.S. Justice department and eight states sued Google, calling for the break up of the search giant's ad-technology business over alleged illegal monopolization of the digital advertising market.<p><div class=\"", "id": 716716, "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/15/0018251/google-loses-bid-to-end-us-antitrust-case-over-digital-advertising?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Loses Bid To End US Antitrust Case Over Digital Advertising", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T02:58:01.291527+00:00", "description": "Drew Turney reports via Live Science: The \"Turing test,\" first proposed as \"the imitation game\" by computer scientist Alan Turing in 1950, judges whether a machine's ability to show intelligence is indistinguishable from a human. For a machine to pass the Turing test, it must be able to talk to somebody and fool them into thinking it is human. Scientists decided to replicate this test by asking 500 people to speak with four respondents, including a human and the 1960s-era AI program ELIZA as well as both GPT-3.5 and GPT-4, the AI that powers ChatGPT. The conversations lasted five minutes -- after which participants had to say whether they believed they were talking to a human or an AI. In the study, published May 9 to the pre-print arXiv server, the scientists found that participants judged GPT-4 to be human 54% of the time.\n \nELIZA, a system pre-programmed with responses but with no large language model (LLM) or neural network architecture, was judged to be human just 22% of the time", "id": 716609, "language": "en-us", "link": "https://slashdot.org/story/24/06/15/005204/gpt-4-has-passed-the-turing-test-researchers-claim?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "GPT-4 Has Passed the Turing Test, Researchers Claim", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T01:53:15.682761+00:00", "description": "The Energy Information Administration (EIA) expects Americans' monthly electricity bills to average $173 between June through August, compared to $168 last summer. \"The slight bump in costs comes from consumers cranking up their air conditioning more to cope with a warmer season than last year,\" writes The Verge's Justine Calma. \"Bills would have jumped higher, if not for lower residential electricity prices helping to balance out some of the increased energy use from air conditioning.\" From the report: Some regions are likely to be harder hit by the weather than others. Because of heat and humidity along the Gulf Coast, residents in Southern states typically use the most electricity in the summer to cool their homes. The Pacific Coast, meanwhile, faces the biggest potential percentage increase in retail electricity prices in the nation -- a 7 percent jump since last year. Wholesale electricity costs there have risen since 2022, in part because of a heat and drought-induced shortfall ", "id": 716489, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/14/224222/electricity-bills-forecasted-to-climb-with-summer-heat?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Electricity Bills Forecasted To Climb With Summer Heat", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T00:48:09.727408+00:00", "description": "In a featured article for The Verge, David Pierce explores the world of competitive Excel, highlighting its rise from a hobbyist activity to a potential esport, showcased during the Excel World Championship in Las Vegas. Top spreadsheet enthusiasts competed at the MGM Grand to solve complex Excel challenges, emphasizing the transformative power and ubiquity of spreadsheets in both business and entertainment. An anonymous reader quotes an excerpt from the report: Competitive Excel has been around for years, but only in a hobbyist way. Most of the people in this room full of actuaries, analysts, accountants, and investors play Excel the way I play Scrabble or do the crossword -- exercising your brain using tools you understand. But last year's competition became a viral hit on ESPN and YouTube, and this year, the organizers are trying to capitalize. After all, someone points out to me, poker is basically just math, and it's all over TV. Why not spreadsheets? Excel is a tool. It's a game", "id": 716277, "language": "en-us", "link": "https://slashdot.org/story/24/06/14/2140221/the-verges-david-pierce-reports-on-the-excel-world-championship-from-vegas?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Verge's David Pierce Reports On the Excel World Championship From Vegas", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-15T00:48:07.027728+00:00", "description": "A critical vulnerability in the PHP programming language (CVE-2024-4577) has been exploited by ransomware criminals, leading to the infection of up to 1,800 servers primarily in China with the TellYouThePass ransomware. This vulnerability, which affects PHP when run in CGI mode, allows attackers to execute malicious code on web servers. Ars Technica's Dan Goodin reports: As of Thursday, Internet scans performed by security firm Censys had detected 1,000 servers infected by a ransomware strain known as TellYouThePass, down from 1,800 detected on Monday. The servers, primarily located in China, no longer display their usual content; instead, many list the site's file directory, which shows all files have been given a .locked extension, indicating they have been encrypted. An accompanying ransom note demands roughly $6,500 in exchange for the decryption key. The vulnerability, tracked as CVE-2024-4577 and carrying a severity rating of 9.8 out of 10, stems from errors in the way PHP conve", "id": 716276, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/14/2156224/ransomware-attackers-quickly-weaponize-php-vulnerability-with-98-severity-rating?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ransomware Attackers Quickly Weaponize PHP Vulnerability With 9.8 Severity Rating", "user": null, "vote": 0}]