[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-14T19:00:06+00:00", "description": "Stoic's Towerborne is a big departure for a developer better known for its turn-based role-playing games. While it maintains a sumptuous art style and epic soundtrack, the combat is more beat 'em up focused while the goal is earning better loot.\n\nAs a newly-resurrected Ace, players take on missions from the Belfry to venture out into the ruined world and take on all threats, including Gobos, Merks, and everything in between. Players can choose from four classes, and upon exploring the map, they'll uncover bit by bit via clearing hex tiles.\n\nSeveral current features, like combat, difficulty, loot, objective design, and narrative, need further polishing, even with some solid fundamentals. Nevertheless, the current vision, especially when playing alongside others, is intriguing and backed by some addictive gameplay. Even if the live service approach is worrying, I'm still curious how Towerborne will evolve as it enters PC early access.", "id": 1145934, "language": null, "link": "https://www.youtube.com/watch?v=Bz2N8UE8-Hw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/Bz2N8UE8-Hw/hqdefault.jpg", "title": "Towerborne Early Access Review - This Xbox Studios' Game Has Potential", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-14T16:00:56+00:00", "description": "Dead Rising has garnered somewhat of a cult following since it first dropped in 2006, but despite its quiet success there have always been several complaints which, gracefully, the developers have addressed in this Deluxe Remaster coming on September 19th. \n\nGraphical overhauls are expected, crafted via the RE Engine – but quality of life improvements, boosts to gameplay and user experience, will elevate Dead Rising Deluxe Edition to one of the foremost zombie survival horrors, if not one of the biggest games, come the year’s end.", "id": 1145362, "language": null, "link": "https://www.youtube.com/watch?v=vnPzR80V8eQ", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/vnPzR80V8eQ/hqdefault.jpg", "title": "Why Dead Rising: Deluxe Remaster May Be One of the Biggest Games of the Year", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-14T09:30:17+00:00", "description": "Grand Theft Auto is a highly successful franchise from Rockstar, and it’s not hard to understand why it has been so popular with gamers. It’s rebellious, action-packed, and features some of the most memorable open worlds in the gaming industry. With that said, the franchise is not without its flaws. \n\nSome of these flaws are found in GTA 4 which features annoying car handling and repetitive missions. Furthermore, there’s not much to do once players are done with the main story. Other problems emerge with GTA Online which features intrusive microtransactions and is constantly plagued by player griefing. Perhaps one of the biggest problems is that the wait time between titles has stretched considerably, leaving fans without a new GTA title for years.", "id": 1143864, "language": null, "link": "https://www.youtube.com/watch?v=p0Bu9cGOUwY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/p0Bu9cGOUwY/hqdefault.jpg", "title": "15 GTA Problems NOBODY WANTS TO ADMIT", "vote": 0}]