[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Granblue Fantasy Versus: Rising Review - The Final Verdict", "description": "Cygames' Granblue Fantasy Versus: Rising is like an enhanced version of its predecessor, but don't let that put you off. The gameplay mechanics are much more involved, with more potential for mix-ups courtesy of Triple Attacks, Raging Strikes and Chains for aggressive players, and the Brave Counter to get out of tight spots. \n\nYou also have tons of cosmetics to unlock, an in-depth Training Mode and, perhaps best of all, rollback netcode for online play, which works well.\n\nGranblue Fantasy Versus: Rising stands out as a fighter despite so much competition.", "link": "https://www.youtube.com/watch?v=boFBm1ondAI", "date_published": "2023-12-14T18:30:32+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/boFBm1ondAI/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "PS5 vs. Xbox -  WHO WON 2023?", "description": "The stars aligned in ways that no one could have foreseen to ensure that 2023 would go down as one of the best and most densely packed years in gaming history, but between PlayStation and Xbox, which platform enjoyed the better year? \n\nBoth obviously benefited from a cavalcade of stellar multiplatform titles thanks to a never-ending stream of major new releases, while both also had their ups and downs when it came to exclusives. But between PS5 and Xbox Series X/S, which one has the edge when looking back at 2023, especially where their aforementioned lineups of exclusive releases are concerned? Here, we take a look back at the year that has been for both platforms, and try and figure out which one comes out on top.", "link": "https://www.youtube.com/watch?v=w_vcu0jLfq4", "date_published": "2023-12-14T14:30:29+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/w_vcu0jLfq4/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "The Day Before Review - IS THIS A VIDEO GAME?!", "description": "The Day Before is more than just poorly designed. It's also more than just a scam, advertised as an open-world survival MMO while delivering a subpar extraction shooter that doesn't let you track multiple requests, provide a compass for navigation, send waypoints or even melee.\n\nIt's more than a game with the least charismatic characters you've ever met or the most pointless mechanics - like owning a plot of land and building a house for no reason or benefit. It's also more than a little buggy, with crashes that can remove all your stuff, infected enemies getting stuck on cars and poor optimization.\n\nAbove everything else, The Day Before is boring. It should be a mess that elicits anger, but it's a mind-numbing experience that does nothing more than dull your thought process. And that, after all the controversies, is truly an achievement.", "link": "https://www.youtube.com/watch?v=MfU_6J90qJ4", "date_published": "2023-12-14T10:30:07+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/MfU_6J90qJ4/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]