[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-16T15:30:17+00:00", "description": "Survival crafting titles come and go, but there have been major heavy hitters this year alone. Head The Planet Crafter to the list - an unexpected but well-made sci-fi adventure that challenges you to terraform an entire planet.\n\nWith a hand-crafted map and an extensive array of options for customizing one's experience, the gameplay loop is streamlined but still wholly addictive. You'll quickly go from managing the bare essentials to exploring the barren regions of the world, building networks of reactors and turbines and even splicing animal DNA to create your paradise of choice.\n\nThe Planet Crafter could use more quality-of-life features and isn't the most story-heavy experience. Nevertheless, whether you're seeking a hardened sci-fi adventure focused on survival or to kick back and build to your heart's content, there's a lot to sink one's teeth into.", "language": null, "link": "https://www.youtube.com/watch?v=m7K_cPredVA", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/m7K_cPredVA/hqdefault.jpg", "title": "The Planet Crafter Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-16T13:30:17+00:00", "description": "Microsoft has had a rough few years when it comes to Xbox Series X/S exclusives. Several of its announced titles have faced various development troubles and lacked updates since their initial announcements. However, Playground Games' Fable is perhaps one of the more egregious.\n\nDespite receiving an in-game trailer at last year's Xbox Games Showcase, the action RPG has lacked any substantial development updates, much less a gameplay reveal or even a release date. We don't know how it plays. Remember that this is a project rumored since at least 2018 and reportedly launching sometime in 2025. It has extensive development resources, not including Eidos Montreal's rumored involvement.\n\nSo, what's going on with Fable? Microsoft continues to hype it up as something special but doesn't offer substantial details. Could there be any substance to the recent departures of some developers? Find out more here.", "language": null, "link": "https://www.youtube.com/watch?v=XuyYD177f5k", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/XuyYD177f5k/hqdefault.jpg", "title": "Where The HELL IS FABLE?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-16T09:30:14+00:00", "description": "Dealing with a disappointing game can be difficult, especially when it has significant hype. It's even more disheartening when the title is a new entry in a favorite franchise or even an eagerly awaited sequel years in the making.\n\nNevertheless, some releases can and do underwhelm for several different reasons. Not enough development time, new features, crunch, lack of a proper vision, inexperience with the genre in question, removing features prevalent in the previous title, bugs, lack of polish - the list goes on. Some of these are beyond the developer's control; others are easily preventable but allowed to fester for whatever reason.\n\nHere are our picks for the top 30 most disappointing games throughout the history of games. Some of them launched in a pretty dismal state but turned out well after several updates, while others just couldn't be salvaged no matter what.", "language": null, "link": "https://www.youtube.com/watch?v=q0OgjRKo4Do", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/q0OgjRKo4Do/hqdefault.jpg", "title": "Top 30 MOST DISAPPOINTING Games of All Time", "user": null, "vote": 0}]