[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T08:28:34+00:00", "description": "<p>Last Updated on November 14, 2024 Gladiator 2 has been a long time coming. Ridley Scott’s masterpiece arrived at the turn of the millennium and made a megastar of Russell Crowe in the title role. Decades later, we are back in Ancient Rome in the glorious Colosseum in a sequel that may have come as a surprise to many considering the first film’s ending. So Gladiator 2 is here with Paul Mescal in the main role with a lot to live up to – do the film gods stand with Gladiator 2 or should it have been killed with a merciful stroke of the sword? Gladiator 2 is a great film. Paul Mescal holds his own as Lucius, Maximus’s son (bit of a reach following the first one but I went with it), who was sent away from Rome following the events of the first film and now lives in Numidia where General Acacius’s forces arrive to conquer and end up killing Lucius’s wife. Driven by vengeance, he cuts his way through his opponents and rises to the position of gladiator during the Colosseum games thanks t", "id": 1513046, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-gladiator-2", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 137, "source_url": "https://www.grimdarkmagazine.com/feed", "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: Gladiator 2", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T04:06:00+00:00", "description": "<p>Family is everything, even if it means following your family into a bloodbath. House of Bone and Rain by Gabino Iglesias explores a blood-soaked, noir-horror world where loyalties between blood brothers are tested and asks how far would you really, truly go for a friend in need? What would you actually do for them? How much blood would you spill for them? What I loved about this novel was its pacing. Right from page one, House of Bone and Rain brings you into a world of death and revenge. Set in Puerto Rico before the arrival of a deadly hurricane, the story follows Gabe, a young man with a group of friends he&#8217;d do anything for. He and his friends Xavier, Tavo, Paul, and Bimbo follow a simple code: “if you fuck with one of us, you fuck with all of us”. When Bimbo&#8217;s mother, María, is murdered at the club she works at, Bimbo cashes in on that loyalty and asks them for help getting revenge. It&#8217;s a classic morality tale that forces the reader to look at Gabe to see w", "id": 1512192, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-house-of-bone-and-rain-by-gabino-iglesias", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 137, "source_url": "https://www.grimdarkmagazine.com/feed", "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: House of Bone and Rain by Gabino Iglesias", "vote": 0}]