[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T23:47:46.701767+00:00", "description": "An update to OpenAI's ChatGPT app for macOS adds integration with third-party apps, including developer tools such as VS Code, Terminal, iTerm2 and Apple's Xcode. 9to5Mac reports: In a demo seen by 9to5Mac, ChatGPT was able to understand code from an Xcode project and then provide code suggestions without the user having to manually copy and paste content into the ChatGPT app. It can even read content from more than one app at the same time, which is very useful for working with developer tools. According to OpenAI, the idea is to expand integration to more apps in the future. For now, integration with third-party apps is coming exclusively to the Mac version of ChatGPT, but there's another catch. The feature requires a paid ChatGPT subscription, at least for now.\n \nChatGPT Plus and Team subscribers will receive access to integration with third-party apps on macOS starting today, while access for Enterprise and Education users will be rolled out \"in the next few weeks.\" OpenAI told 9", "id": 1518599, "language": null, "link": "https://apple.slashdot.org/story/24/11/14/2129230/chatgpt-for-macos-now-works-with-third-party-apps-including-apples-xcode?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "ChatGPT For macOS Now Works With Third-Party Apps, Including Apple's Xcode", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T23:47:46.612942+00:00", "description": "Phoronix's Michael Larabel reports: The OpenMP Architecture Review Board announced from SC24 that OpenMP 6.0 is now available as a major upgrade to the OpenMP specification for multi-process programming within C / C++ / Fortran. A big emphasis on OpenMP 6.0 is making it easier for developers to embrace. OpenMP 6.0 aims to make it easier to support parallel programming in new applications, easier to adapt to new use-cases, and more fine-grained developer control.\n \nOpenMP 6.0 simplifies task programming with support for task execution by free-agent threads, allowing for recording of task graphs for efficient replay, and other improvements. OpenMP 6.0 also brings support for array syntax applications, better control over memory allocations and accessibility, easier writing of asynchronous data transfers, and other improvements for enhanced device support / offloading. There is also easier programming of loop transformations, support for induction, support for C23 / Fortran 2023 / C++23", "id": 1518598, "language": null, "link": "https://developers.slashdot.org/story/24/11/14/2131258/openmp-60-released?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenMP 6.0 Released", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T22:42:38.138012+00:00", "description": "An anonymous reader quotes a report from Data Center Dynamics: The Japanese government is planning to invest approximately $65 billion to support the country's semiconductor and AI industries. The initiative, which will run until the end of the decade, is expected to generate ~$104 billion in public and private investment during the period. According to a report from Reuters, this new round of funding will specifically target state-backed chip foundry Rapidus and other AI chip suppliers.\n \nRapidus was founded in November 2022 when the Japanese government and eight Japanese technology and automotive firms, including SoftBank, Sony, and NTT, invested more than $500 million to launch the business. Speaking at a news conference this week, Japanese Prime Minister Shigeru Ishiba did not provide any information about how the venture would be financed but said the government would not issue deficit-covering bonds. Japan's government also said it won't raise taxes to finance the $65 billion p", "id": 1518318, "language": null, "link": "https://yro.slashdot.org/story/24/11/14/2126202/japanese-government-to-invest-65-billion-to-support-domestic-chip-sector?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Japanese Government To Invest $65 Billion To Support Domestic Chip Sector", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T21:40:03.559111+00:00", "description": "South Korean researchers have developed a \"morphing\" wheel that can navigate stairs and obstacles up to 1.3 times its radius, potentially revolutionizing mobility devices and robotics. \n\nThe wheel, created by the Korea Institute of Machinery and Materials (KIMM), features a chain-based outer hoop and sensor-controlled spoke wires that adjust stiffness based on terrain. Inspired by water droplet mechanics, it transitions between solid and fluid states when encountering impediments.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Researchers+Are+Trying+To+Reinvent+the+Wheel%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F11%2F14%2F1514225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F11%2F14%2F1514225%2Fresearchers-are-trying-to-reinvent-", "id": 1517861, "language": null, "link": "https://science.slashdot.org/story/24/11/14/1514225/researchers-are-trying-to-reinvent-the-wheel?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Researchers Are Trying To Reinvent the Wheel", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T21:40:03.247240+00:00", "description": "Scientists have developed a method to reuse components from decommissioned data center servers, potentially reducing the carbon footprint of cloud computing infrastructure. \n\nThe research team from Microsoft, Carnegie Mellon University and the University of Washington demonstrated that older RAM modules and solid-state drives can be safely repurposed in new server builds without compromising performance, according to papers presented at recent computer architecture conferences. \n\nWhen combined with energy-efficient processors, the prototype servers achieved an 8% reduction in total carbon emissions during Azure cloud service testing. Researchers estimate the approach could cut global carbon emissions by up to 0.2% if widely adopted. The cloud computing industry currently accounts for 3% of global energy consumption and could represent 20% of emissions by 2030, according to computing experts. Most data centers, including Microsoft's Azure, typically replace servers every 3-5 years.<p>", "id": 1517860, "language": null, "link": "https://it.slashdot.org/story/24/11/14/1759211/second-life-for-server-components?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Second Life for Server Components ", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T21:40:02.945341+00:00", "description": "An anonymous reader shares a report: After dragging its feet for years, Microsoft has finally released the first official Windows 11 ISOs for PCs with an Arm64 processor. This means users can now clean install Windows 11 using official offline media on an Arm64-based PC, including the latest Snapdragon X Copilot+ PCs. \n\nThe ISOs contain version 24H2 can be downloaded from the official Microsoft website, and are around 5GB in size depending on the language you select. According to the company, the ISOs are primarily designed for running Windows 11 in a virtual machine on Arm64 PCs. However, it also mentions that you can use them to clean install Windows 11 directly onto Arm64 hardware too.Unfortunately, depending on the Arm64 PC you have, you may need to do some additional work to get the ISO bootable.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Releases+Windows+11+ISOs+for+Arm64-based+PCs%3A+https%3A%2", "id": 1517859, "language": null, "link": "https://tech.slashdot.org/story/24/11/14/189216/microsoft-releases-windows-11-isos-for-arm64-based-pcs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Releases Windows 11 ISOs for Arm64-based PCs", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T21:40:02.696643+00:00", "description": "The Federal Trade Commission is preparing to launch an investigation into anti-competitive practices at Microsoft's cloud computing business, Financial Times reported Thursday, as the US regulator continues to pursue Big Tech in the final weeks of Joe Biden's presidency. From the report: The FTC is examining allegations that Microsoft is abusing its market power in productivity software by imposing punitive licensing terms to prevent customers from moving their data from its Azure cloud service to competitors' platforms, according to people with direct knowledge of the matter. \n\nTactics being examined include substantially increasing subscription fees for those that leave, charging steep exit fees and allegedly making its Office 365 products incompatible with rival clouds, they added.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=US+Regulators+Plan+To+Investigate+Microsoft's+Cloud+Business%3A+https%3A%2F%2Fnews.sl", "id": 1517858, "language": null, "link": "https://news.slashdot.org/story/24/11/14/2024223/us-regulators-plan-to-investigate-microsofts-cloud-business?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Regulators Plan To Investigate Microsoft's Cloud Business", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T21:40:02.402115+00:00", "description": "An academic journal has retracted two papers because it determined their authors used unlicensed software. The Register: Elsevier's Ain Shams Engineering Journal withdrew two papers exploring dam failures after complaints from Flow Science, the Santa Fe, New Mexico-based maker of a computational fluid dynamics application called FLOW-3D. \n\n\"Following an editorial investigation as a result of a complaint from the software distributor, the authors admitted that the use of professional software, FLOW-3D program for the results published in the article, was made without a license from the developer,\" a note from the journal's editor-in-chief explains. \n\n\"One of the conditions of submission of a paper for publication is that the article does not violate any intellectual property rights of any person or entity and that the use of any software is made under a license or permission from the software owner.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=", "id": 1517857, "language": null, "link": "https://science.slashdot.org/story/24/11/14/2047223/academic-papers-yanked-after-authors-found-to-have-used-unlicensed-software?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Academic Papers Yanked After Authors Found To Have Used Unlicensed Software", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T18:16:06.870024+00:00", "description": "Public trust in scientists is showing signs of recovery, according to a new Pew Research Center survey, though levels remain below pre-pandemic highs. The October 2024 study, which surveyed 9,593 U.S. adults, reveals that 76% of Americans have \"a great deal\" or \"a fair amount\" of confidence in scientists' commitment to public interests -- a modest increase from 73% in 2023, but still short of the 87% recorded in early 2020. \n\nThe survey -- whose results were released Thursday [PDF] -- also highlights persistent partisan differences, with 88% of Democrats expressing trust in scientists compared to 66% of Republicans. However, Republican trust increased by 5% points since 2023, marking the first uptick since the pandemic's onset. On scientists' policy engagement, Americans remain divided: 51% support scientists' active participation in policy debates concerning scientific matters, while 48% prefer they maintain focus on research and empirical findings.<p><div class=\"share_submission\" s", "id": 1516594, "language": null, "link": "https://science.slashdot.org/story/24/11/14/172220/trust-in-science-recovers-slightly-but-remains-below-pre-pandemic-levels?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Trust in Science Recovers Slightly, But Remains Below Pre-Pandemic Levels", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T18:16:06.777750+00:00", "description": "Google is rolling out AI-powered scam call detection for Android phones, aiming to protect users from increasingly sophisticated phone fraud schemes. The new feature, available in beta for Pixel 6 and newer devices, analyzes conversation patterns in real-time to identify potential scams. When suspicious patterns emerge, such as urgently requesting fund transfers, the system alerts users through audio, haptic, and visual warnings. \n\nThe detection system operates entirely on-device using Google's machine learning models, with no call audio or transcripts stored or transmitted externally. While Pixel 9 devices utilize Google's advanced Gemini Nano AI model, earlier Pixel phones use the standard machine learning for detection, the company said. The feature, which is opt-in and can be disabled at any time, is currently limited to English-speaking Phone by Google beta users in the United States. Google plans to expand availability to additional Android devices in the future.<p><div class=\"", "id": 1516593, "language": null, "link": "https://tech.slashdot.org/story/24/11/14/1650231/google-rolls-out-call-screening-ai-to-thwart-phone-fraudsters?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Rolls Out Call Screening AI To Thwart Phone Fraudsters", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T17:12:42.242431+00:00", "description": "Apple released Final Cut Pro 11 this week, marking the first major version change in over a decade for its professional video editing software. The update introduces several AI-powered features, including a new \"Magnetic Mask\" function that automatically tracks objects through video clips for targeted color grading and effects. \n\nThe suite now offers on-device automatic caption generation for dialogue tracks and adds support for spatial video editing compatible with Apple Vision Pro. Users can adjust the depth of titles and objects for 3D viewing. The update requires macOS 14.6 and at least 8GB of RAM, with some features exclusive to Apple silicon Macs. \n\nExisting Final Cut Pro X users will receive the upgrade at no cost, while new users can purchase the software for $299. Accompanying updates include Final Cut Camera for iPhone, which now supports H.265 HEVC format for Apple Log footage on iPhone 15/16 Pro models, and Final Cut Pro for iPad 2.1, featuring enhanced automated color gr", "id": 1516113, "language": null, "link": "https://apple.slashdot.org/story/24/11/14/1421237/apple-launches-final-cut-pro-11-the-first-version-change-in-13-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Launches Final Cut Pro 11, the First Version Change in 13 Years", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T17:12:41.944274+00:00", "description": "AMD has announced plans to cut 4% of its global workforce as it repositions to compete in the AI chip market dominated by Nvidia. The layoffs will affect approximately 1,040 employees of its 26,000-strong workforce reported at the end of 2023. CNBC adds: AMD produces powerful AI accelerators for data centers, including the MI300X, which companies such as Meta and Microsoft purchase as an alternative to Nvidia-based systems. But Nvidia dominates the market for powerful AI chips, with over 80% market share, partially because it developed the core software that AI engineers use to develop programs such as OpenAI's ChatGPT.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AMD+To+Lay+Off+4%25+of+Workforce%2C+or+About+1%2C000+Employees%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F14%2F0726238%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashp", "id": 1516112, "language": null, "link": "https://slashdot.org/story/24/11/14/0726238/amd-to-lay-off-4-of-workforce-or-about-1000-employees?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AMD To Lay Off 4% of Workforce, or About 1,000 Employees", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T16:08:15.147495+00:00", "description": "An anonymous reader writes: JPL in California announced this week a layoff of 325 workers, about 5% of its workforce, the third major layoff imposed this year. \n\nThe JPL press release indicates the layoffs are because of NASA budget cutbacks, but does not provide any specificity. The cause centers mostly around NASA's decision to pause its Mars Sample Return project, which JPL was leading. From this report: This is the third round of layoffs at JPL this year, a reduction spurred primarily by major budgetary cuts to the Mars Sample Return mission, which is managed by JPL. NASA directed $310 million this year to the effort to bring Mars rocks back to Earth, a steep drop from the $822.3 million it spent on the program the previous year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=JPL+To+Cut+5%25+of+Workforce%2C+Its+Third+Layoff+This+Year%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F11%2F14%2F0712251%2F%3Fut", "id": 1515606, "language": null, "link": "https://science.slashdot.org/story/24/11/14/0712251/jpl-to-cut-5-of-workforce-its-third-layoff-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "JPL To Cut 5% of Workforce, Its Third Layoff This Year", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T15:03:09.978939+00:00", "description": "An anonymous reader quotes a report from TechCrunch: U.K. consumer rights group 'Which?' is filing a legal claim against Apple under competition law on behalf of some 40 million users of iCloud, its cloud storage service. The collective proceeding lawsuit, which is seeking 3 billion pounds in compensation damages (around $3.8 billion at current exchange rates), alleges that Apple has broken competition rules by giving its own cloud storage service preferential treatment and effectively locking people into paying for iCloud at \"rip-off\" prices. \"iOS has a monopoly and is in control of Apple's operating systems and it is incumbent on Apple not to use that dominance to gain an unfair advantage in related markets, like the cloud storage market. But that is exactly what has happened,\" Which wrote in a press release announcing filing the claim with the U.K.'s Competition Appeal Tribunal (CAT).\n \nThe lawsuit accuses Apple of encouraging users of its devices to sign up to iCloud for photo st", "id": 1515146, "language": null, "link": "https://yro.slashdot.org/story/24/11/14/0555231/apple-faces-uk-icloud-monopoly-compensation-claim-worth-38-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Faces UK 'iCloud Monopoly' Compensation Claim Worth $3.8 Billion", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T15:03:09.870893+00:00", "description": "Washington Post: The Consumer Financial Protection Bureau has taken steps to place Google under formal federal supervision, an extraordinary move that could subject the technology giant to the regular inspections and other rigorous monitoring that the government imposes on major banks. \n\nGoogle has fiercely resisted the idea over months of highly secretive talks, according to two people familiar with the discussions, who spoke on the condition of anonymity to describe them -- setting up what may ultimately be a major legal clash with vast implications for the CFPB's powers in the digital age. \n\nThe exact scope of the CFPB's concerns is not clear, and its order does not appear to be final. The political fate of the bureau's work under Director Rohit Chopra is also in doubt, as the watchdog agency braces for potentially significant changes to its leadership and agenda with the return of President-elect Donald Trump to the White House. \n\nFormed in the aftermath of the 2008 financial cri", "id": 1515145, "language": null, "link": "https://news.slashdot.org/story/24/11/14/1439227/cfpb-looks-to-place-google-under-federal-supervision?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "CFPB Looks To Place Google Under Federal Supervision", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T13:58:55.813547+00:00", "description": "An anonymous reader quotes a report from TechCrunch: U.K. consumer rights group 'Which?' is filing a legal claim against Apple under competition law on behalf of some 40 million users of iCloud, its cloud storage service. The collective proceeding lawsuit, which is seeking 3 billion pounds in compensation damages (around $3.8 billion at current exchange rates), alleges that Apple has broken competition rules by giving its own cloud storage service preferential treatment and effectively locking people into paying for iCloud at \"rip-off\" prices. \"iOS has a monopoly and is in control of Apple's operating systems and it is incumbent on Apple not to use that dominance to gain an unfair advantage in related markets, like the cloud storage market. But that is exactly what has happened,\" Which wrote in a press release announcing filing the claim with the U.K.'s Competition Appeal Tribunal (CAT).\n \nThe lawsuit accuses Apple of encouraging users of its devices to sign up to iCloud for photo st", "id": 1514657, "language": null, "link": "https://yro.slashdot.org/story/24/11/14/0555231/apple-faces-uk-icloud-monopoly-compensation-claim-worth-38-million?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Faces UK 'iCloud Monopoly' Compensation Claim Worth $3.8 Million", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T13:58:55.401739+00:00", "description": "The European Union has fined Meta $840 million for unfairly tying its Facebook Marketplace classified ads service to its social network, marking the company's first EU antitrust penalty. \n\nThe European Commission ruled Meta must stop bundling Marketplace with Facebook's social platform and cease imposing unfair conditions on competing classified ads services. Regulators found Meta exploited Facebook's massive user base to disadvantage rivals and used competitors' advertising data to enhance Marketplace. \n\nEU antitrust chief Margrethe Vestager said Meta \"tied its online classified ads service Facebook Marketplace to its personal social network Facebook and imposed unfair trading conditions on other online classified ads service providers.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Fined+%24840+Million+For+Breaching+EU+Antitrust+Rules%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F11%2F14%2F1350227%2F%3F", "id": 1514656, "language": null, "link": "https://tech.slashdot.org/story/24/11/14/1350227/meta-fined-840-million-for-breaching-eu-antitrust-rules?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Fined $840 Million For Breaching EU Antitrust Rules", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T10:31:23.476338+00:00", "description": "A new study reveals that late work is judged more negatively than on-time submissions, even if delays are minimal or pre-communicated. \"The findings suggest that, while you might be tempted to take the maximum allotted time to put the finishing touches to a report, submission or piece of work, the extra effort might not be appreciated by colleagues if it comes at the expense of punctual delivery,\" reports The Guardian. From the report: The study surveyed thousands of people in the US and UK, including managers, executives, human resources personnel and others whose jobs included an element of evaluating others. Participants were asked to rate pieces of work, such as advertising flyers, art, business proposals, product pitches, photography and news articles. But first, they were told it was either submitted early, on deadline or late. \"Late\" work was consistently rated as worse in quality than when people were told the same work was completed early or on time. The difference was equiv", "id": 1513423, "language": null, "link": "https://science.slashdot.org/story/24/11/14/067226/missed-deadlines-lead-people-to-judge-work-more-harshly-study-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Missed Deadlines Lead People To Judge Work More Harshly, Study Says", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T07:15:59.937759+00:00", "description": "During a public joint hearing today titled \"Unidentified Anomalous Phenomena: Exposing the Truth,\" four experts testified that the U.S. is running secret UAP programs, including crash retrieval and reverse-engineering programs for advanced nonhuman technology. Although the Pentagon maintains there's no evidence of alien spacecraft, witnesses like Luis Elizondo and Michael Gold argue that UAPs represent an intelligence enigma and call for open, stigma-free study to address potential security concerns and unknown scientific possibilities. NPR reports: Tim Gallaudet, retired rear admiral, U.S. Navy; CEO of Ocean STL Consulting, LLC\n\n\"Confirmation that UAPs are interacting with humanity came for me in January 2015,\" Gallaudet said in his written testimony (PDF). He describes being part of a pre-deployment naval exercise off the U.S. East Coast that culminated in the famous \"Go Fast\" video, in which a Navy F/A-18 jet's sensors recorded \"an unidentified object exhibiting flight and structu", "id": 1512718, "language": null, "link": "https://entertainment.slashdot.org/story/24/11/14/0543247/experts-testify-us-is-running-secret-uap-programs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Experts Testify US Is Running Secret UAP Programs", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T04:01:36.554940+00:00", "description": "An anonymous reader quotes a report from Ars Technica: There's a general consensus that we won't be able to consistently perform sophisticated quantum calculations without the development of error-corrected quantum computing, which is unlikely to arrive until the end of the decade. It's still an open question, however, whether we could perform limited but useful calculations at an earlier point. IBM is one of the companies that's betting the answer is yes, and on Wednesday, it announced a series of developments aimed at making that possible. On their own, none of the changes being announced are revolutionary. But collectively, changes across the hardware and software stacks have produced much more efficient and less error-prone operations. The net result is a system that supports the most complicated calculations yet on IBM's hardware, leaving the company optimistic that its users will find some calculations where quantum hardware provides an advantage. [...]\n \nWednesday's announceme", "id": 1512115, "language": null, "link": "https://tech.slashdot.org/story/24/11/14/018246/ibm-boosts-the-amount-of-computation-you-can-get-done-on-quantum-hardware?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "IBM Boosts the Amount of Computation You Can Get Done On Quantum Hardware", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T01:53:52.805163+00:00", "description": "The FBI raided Polymarket CEO Shayne Coplan's Manhattan apartment, seizing his phone and electronic devices. A source close to the matter told The New York Post it was politically motivated due to Polymarket's successful prediction of Trump's election win. It's \"grand political theater at its worst,\" the source said. \"They could have asked his lawyer for any of these things. Instead, they staged a so-called raid so they can leak it to the media and use it for obvious political reasons.\"\n \nAlthough no charges were filed, the raid has sparked controversy, with speculation of political retribution and concerns over potential market manipulation, as Polymarket faces scrutiny both in the U.S. and from French regulators. The New York Post reports: Coplan was not arrested and has not been charged, a Polymarket spokesperson told The Post on Wednesday evening. \"Polymarket is a fully transparent prediction market that helps everyday people better understand the events that matter most to them,", "id": 1511718, "language": null, "link": "https://politics.slashdot.org/story/24/11/14/0056250/fbi-seizes-polymarket-ceos-phone-electronics-after-betting-platform-predicts-trump-win?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "FBI Seizes Polymarket CEO's Phone, Electronics After Betting Platform Predicts Trump Win", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T01:53:52.495589+00:00", "description": "Wi-Fi 8 (also known as IEEE 802.11bn Ultra High Reliability) is expected to arrive around 2028, prioritizing an enhanced user experience over speed by optimizing interactions between devices and access points. While it retains similar bandwidth specifications as the previous standard, Wi-Fi 8 aims to improve network efficiency, reducing interference and congestion for a more reliable and adaptive connection. PCWorld's Mark Hachman reports: As of Nov. 2024, MediaTek believes that Wi-Fi 8 will look virtually identical to Wi-Fi 7 in several key areas: The maximum physical layer (PHY) rate will be the same at 2,880Mbps x 8, or 23Gbits/s. It will also use the same four frequency bands (2, 4, 5, and 6GHz) and the same 4096 QAM modulation across a maximum channel bandwidth of 320MHz. (A Wi-Fi 8 router won't get 23Gbps of bandwidth, of course. According to MediaTek, the actual peak throughput in a \"clean,\" or laboratory, environment is just 80 percent or so of the hypothetical peak throughpu", "id": 1511717, "language": null, "link": "https://mobile.slashdot.org/story/24/11/14/0042254/wi-fi-8-trades-speed-for-a-more-reliable-experience?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Wi-Fi 8 Trades Speed For a More Reliable Experience", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T00:31:20.522151+00:00", "description": "An anonymous reader quotes a report from Ars Technica: The classic PC games market is \"in a sorry state,\" according to DRM-free and classic-minded storefront GOG. Small games that aren't currently selling get abandoned, and compatibility issues arise as technology moves forward or as one-off development ideas age like milk. Classic games are only 20 percent of GOG's catalog, and the firm hasn't actually called itself \"Good Old Games\" in 12 years. And yet, today, GOG announces that it is making \"a significant commitment of resources\" toward a new GOG Preservation Program. It starts with 100 games for which GOG's own developers are working to create current and future compatibility, keeping them DRM-free and giving them ongoing tech support, along with granting them a \"Good Old Game: Preserved by GOG\" stamp.\n \nGOG is not shifting its mission of providing a DRM-free alternative to Steam, Epic, and other PC storefronts, at least not entirely. But it is demonstrably excited about a new fo", "id": 1511471, "language": null, "link": "https://games.slashdot.org/story/24/11/13/2139229/gogs-preservation-program-is-the-drm-free-store-refocusing-on-the-classics?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "GOG's Preservation Program Is the DRM-Free Store Refocusing On the Classics", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T00:31:20.381788+00:00", "description": "Bluesky has reached 15 million users, driven by a recent surge in U.S. signups following the presidential election. It's currently the top free app on iOS. The Verge reports: The platform, which rests on the decentralized AT Protocol, added about a million new users in the last week. Bluesky COO Rose Wang recently told The Verge that the \"majority\" of new users flocking to the platform have been from the US. Meta's Threads is still outpacing Bluesky, having recently hit 275 million monthly users and growing at a rate of over a million signups per day. But Bluesky offers a very different experience. Both are ad-free (for now), but whereas Threads uses a single Meta-made algorithmic feed, Bluesky offers user-created algorithmic feeds in addition to its \"Discover\" and \"Popular With Friends\" ones.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bluesky+Crosses+the+15+Million+User+Mark%3A+https%3A%2F%2Ftech.slashdot.org%", "id": 1511470, "language": null, "link": "https://tech.slashdot.org/story/24/11/14/0017205/bluesky-crosses-the-15-million-user-mark?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Bluesky Crosses the 15 Million User Mark", "vote": 0}]