[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T17:45:00+00:00", "description": "The Stalker series is coming back after a long, long hiatus. Close to a decade and a half on from the launch of its launch instalment, we'll soon be getting Stalker 2: Heart of Chornobyl, and though developer GSC Game World has said that newcomers are going to be able to understand and enjoy the game's story without any prior knowledge of the series, at the end of the day, it is a sequel to the original trilogy, which means it's going to follow up on the series' story thus far, at least in some fashion. \n\nAs such, with Stalker 2's launch around the corner, here, we're going to take a look back and recap the story of the entire series so far.", "id": 1516674, "language": null, "link": "https://www.youtube.com/watch?v=2urY1v2RkMI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/2urY1v2RkMI/hqdefault.jpg", "title": "The Full Story of STALKER Series - Before You Play STALKER 2: Heart of Chornobyl", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-14T11:30:08+00:00", "description": "With the PlayStation 5 Pr's launch last week, it's becoming more apparent that the console is more than talk. Sony's PlayStation Spectral Super Resolution, advanced ray tracing, and stronger GPU have begun making waves in many PS5 titles.\n\nThe jury is still out on whether it's worth upgrading. However, if you're brand new to the console (and have $700 to drop on it), what are some of the most noteworthy titles to play on it? There are the usual suspects, like Marvel's Spider-Man 2, Ratchet and Clank: Rift Apart, Horizon Forbidden West, Alan Wake 2 and Final Fantasy 7 Rebirth.\n\nHowever, if you have an 8K display,  it may also be worth checking out Gran Turismo 7 and F1 24 since they both leverage the console's experimental 8K resolution mode in interesting ways. Check out all the other noteworthy PS5 titles running on the Pro and how they benefit from the console's power.", "id": 1513868, "language": null, "link": "https://www.youtube.com/watch?v=G3wa8EKcZsw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/G3wa8EKcZsw/hqdefault.jpg", "title": "10 BEST PS5 Pro Enhanced Games That Make The Most of The Console's Power", "vote": 0}]