[{"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T19:15:03+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://www.youtube.com/watch?v=s9rnh2250Xc", "permanent": false, "age": null, "thumbnail": "https://i4.ytimg.com/vi/s9rnh2250Xc/hqdefault.jpg", "source_obj__id": 129, "title": "Dragon's Dogma 2 Graphics Analysis: PC vs. PS5 Comparison, PC Performance, Frame Rate And More [4K]", "page_rating_contents": 94, "comments": [], "artist": null, "language": null, "page_rating": 94, "page_rating_visits": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "description": "Dragon’s Dogma 2 takes everything players love about action role playing games and amps up those ideas up to eleven. With a large open-world and more focus on build crafting, Dragon’s Dogma 2 should be a must-play for anyone who loves the open world genre. \n\nBut what about the technical side of it all? How does the RE Engine fare when it comes to rendering a huge open world like this one, and how does Dragon’s Dogma 2 perform? Is the uncapped 30fps a deal-breaker? With this video, we try to answer these questions as we break down individual aspects of the presentation like lighting, reflections and other graphical parameters.", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T15:00:09+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://www.youtube.com/watch?v=AmjPHEdktBY", "permanent": false, "age": null, "thumbnail": "https://i2.ytimg.com/vi/AmjPHEdktBY/hqdefault.jpg", "source_obj__id": 129, "title": "Dragon's Dogma 2 Review - The Final Verdict", "page_rating_contents": 94, "comments": [], "artist": null, "language": null, "page_rating": 94, "page_rating_visits": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "description": "Dragon’s Dogma 2 is not your typical open world game. It has an extreme aversion to holding your hand in even the slightest manner possible, to the extent that many may not view it as a very inviting or approachable experience. \n\nBut in doing so, it delivers an open world experience unlike anything else out there. The developer has crafted a massive world here, one that feels alive and unpredictable in ways that games very rarely manage to capture.\n\nExploration is constantly rewarded, the combat is deep and visceral, and the progression mechanics are immensely engaging. All of that comes together in an experience that delivers excellent emergent gameplay and thoroughly immerses you in its world.", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T10:00:43+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://www.youtube.com/watch?v=oRyv91PzeqY", "permanent": false, "age": null, "thumbnail": "https://i4.ytimg.com/vi/oRyv91PzeqY/hqdefault.jpg", "source_obj__id": 129, "title": "15 Best Open World Gangster Games You Need To Play", "page_rating_contents": 94, "comments": [], "artist": null, "language": null, "page_rating": 94, "page_rating_visits": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "description": "There’s just a weird experience that comes from assuming the role of a gangster or a criminal in video game and taking it to streets as you take up dangerous jobs and eventually make it big in a virtual world that’s bursting with opportunities. \n\nSuch kinds of games aren’t exactly dime a dozen, but over the last handful of years, we have gotten quite a number of games that let us do just that. We are talking about games like Grand Theft Auto 5, Yakuza 0, and much more; games that basically let you play as a gangster. With this video, we will be taking a look at 15 of the best games that fit this description, complete with what makes them stand out.", "user": null}]