[{"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T23:51:43.173082+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://hardware.slashdot.org/story/24/03/20/2029236/intel-prepares-for-100-billion-spending-spree-across-four-us-states?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Intel Prepares For $100 Billion Spending Spree Across Four US States", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "After securing billions in federal grants and loans, Reuters reports that the company is \"planning a $100-billion spending spree across four U.S. states\" to build and expand its chip manufacturing factories. From the report: The centerpiece of Intel's five-year spending plan is turning empty fields near Columbus, Ohio, into what CEO Pat Gelsinger described to reporters on Tuesday as \"the largest AI chip manufacturing site in the world,\" starting as soon as 2027. Intel's plan will also involve revamping sites in New Mexico and Oregon and expanding operations in Arizona, where longtime rival Taiwan Semiconductor Manufacturing Co is also building a massive factory that it hopes will receive funding from President Joe Biden's push to bring advanced semiconductor manufacturing back to the United States. [...]\n \nGelsinger said about 30% of the $100-billion plan will be spent on construction costs such as labor, piping and concrete. The remaining will go towards buying chipmaking to", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T22:47:00.352439+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://tech.slashdot.org/story/24/03/20/1717212/researcher-who-oversaw-flock-surveillance-study-now-questions-how-it-was-done?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Researcher Who Oversaw Flock Surveillance Study Now Questions How It Was Done", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "samleecole writes: Last month, the surveillance company Flock Safety published a study and press release claiming that its automated license plate readers (ALPR) are \"instrumental in solving 10 percent of reported crime in the U.S.\" The study was done by Flock employees, and given legitimacy with the \"oversight\" of two academic researchers whose names are also on the paper. Now, one of those researchers has told 404 Media that \"I personally would have done things much differently\" than the Flock researchers did. \n\nThe researcher, Johnny Nhan of Texas Christian University, said that he has pivoted future research on Flock because he found \"the information that is collected by the police departments are too varied and incomplete for us to do any type of meaningful statistical analysis on them.\" Flock is one of the largest vendors of ALPR cameras and other surveillance technologies, and is partially responsible for the widespread proliferation of this technology. It markets its ", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T22:46:58.793297+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://tech.slashdot.org/story/24/03/20/2015259/google-reshapes-fitbit-in-its-image-as-users-allege-planned-obsolescence?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Google Reshapes Fitbit In Its Image As Users Allege 'Planned Obsolescence'", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "An anonymous reader quotes a report from Ars Technica: Google closed its Fitbit acquisition in 2021. Since then, the tech behemoth has pushed numerous changes to the wearable brand, including upcoming updates announced this week. While Google reshapes its fitness tracker business, though, some long-time users are regretting their Fitbit purchases and questioning if Google's practices will force them to purchase their next fitness tracker elsewhere.\n \nAs is becoming common practice with consumer tech announcements of late, Google's latest announcements about Fitbit seemed to be trying to convince users of the wonders of generative AI and how that will change their gadgets for the better. In a blog post yesterday, Dr. Karen DeSalvo, Google's chief health officer, announced that Fitbit Premium subscribers would be able to test experimental AI features later this year (Google hasn't specified when). \"You will be able to ask questions in a natural way and create charts just for yo", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T21:42:11.660107+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://news.slashdot.org/story/24/03/20/1815256/us-broadband-providers-to-begin-providing-new-comparison-labels?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "US Broadband Providers To Begin Providing New Comparison Labels", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "Major U.S. broadband internet providers must start displaying information similar to nutrition labels on food products to help consumers shop for services starting on April 10, under new rules from the Federal Communications Commission. From a report: Verizon Communications said it will begin providing the labels on Wednesday. The FCC first moved to mandate the labels in 2022. Smaller providers will be required to provide labels starting in October. The rules require broadband providers to display, at the point of sale, labels that show prices, speeds, fees and data allowances for both wireless and wired products.\nVerizon Chief Customer Experience Officer Brian Higgins said in an interview the labels will help consumers make \"an equal comparison\" between product offerings, speeds and fees. \n\nHiggins said standardized labels across the industry \"make it easier for customers to do a comparison of which provider is going to be the best fit for their needs.\" He said customers wil", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T21:42:10.135393+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://games.slashdot.org/story/24/03/20/1736214/nvidia-partners-with-ubisoft-to-further-develop-its-ai-driven-npcs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "NVIDIA Partners With Ubisoft To Further Develop Its AI-driven NPCs", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "NVIDIA has been working on adding generative AI to non-playable characters (NPCs) for a while now. The company is hoping a newly-announced partnership with Ubisoft will accelerate development of this technology and, ultimately, bring these AI-driven NPCs to modern games. From a report: Ubisoft helped build new \"NEO NPCs\" by using NVIDIA's Avatar Cloud Engine (ACE) technology, with an assist from dynamic NPC experts Inworld AI. The end result? Characters that don't repeat the same phrase over and over, while ignoring the surrounding violent mayhem. These NEO NPCs are said to interact in real time with players, the environment and other in-game characters. NVIDIA says this opens up \"new possibilities for emergent storytelling.\" To that end, Ubisoft's narrative team built complete backgrounds, knowledge bases and conversational styles for two NPCs as a proof of concept.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=NVIDIA+Partners+With", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T21:42:08.539363+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://tech.slashdot.org/story/24/03/20/1747200/laid-off-techies-face-sense-of-impending-doom-with-job-cuts-at-highest-since-dot-com-crash?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Laid-off Techies Face 'Sense of Impending Doom' With Job Cuts at Highest Since Dot-com Crash", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "An anonymous reader shares a report: Since the start of the year, more than 50,000 workers have been laid off from over 200 tech companies, according to tracking website Layoffs.fyi. It's a continuation of the predominant theme of 2023, when more than 260,000 workers across nearly 1,200 tech companies lost their jobs. Alphabet, Amazon, Meta and Microsoft have all taken part in the downsizing this year, along with eBay, Unity Software, SAP and Cisco. Wall Street has largely cheered on the cost-cutting, sending many tech stocks to record highs on optimism that spending discipline coupled with efficiency gains from artificial intelligence will lead to rising profits. PayPal announced in January that it was eliminating 9% of its workforce, or about 2,500 jobs. \n\nFor the tens of thousands of people in Croisant's [anecdote in the linked story] position, the path toward reemployment is daunting. All told, 2023 was the second-biggest year of cuts on record in the technology sector, b", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T21:42:06.966910+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://apple.slashdot.org/story/24/03/20/1531209/eus-vestager-warns-about-apple-meta-fees-disparaging-rival-products?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "EU's Vestager Warns About Apple, Meta Fees, Disparaging Rival Products", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "EU antitrust chief Margrethe Vestager on Tuesday warned Apple and Meta on their new fees for their services, saying that this may hinder users from enjoying the benefits of the Digital Markets Act which aims to give them more choices. From a report: Apple announced a slew of changes in January in a bid to comply with the landmark EU tech legislation which requires it to open up its closed eco-system to rivals. \n\nA new fee structure includes a core technology fee of 50 euro cents per user account per year that major app developers will have to pay even if they do not use any of Apple's payment services, which has triggered criticism from rivals such as Fortnite creator Epic Games. Vestager said the new fees have attracted her attention. \"There are things that we take a keen interest in, for instance, if the new Apple fee structure will de facto not make it in any way attractive to use the benefits of the DMA. That kind of thing is what we will be investigating,\" she told Reute", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T21:42:05.412139+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://slashdot.org/story/24/03/20/181209/airbus-ceo-says-boeings-problems-are-bad-for-whole-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Airbus CEO Says Boeing's Problems Are Bad For Whole Industry", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "Airbus takes no pleasure in the technical problems plaguing U.S. rival Boeing as they damage the image of the entire aerospace industry, said the CEO of the European planemaker. From a report: \"I am not happy with the problems of my competitor. They are not good for the industry a whole,\" Guillaume Faury told the \"Europe 2024\" conference in Berlin, when asked about technical problems at Boeing. \"We are in an industry where quality and safety is top priority,\" he added. Further reading: Airbus Is Pulling Ahead as Boeing's Troubles Mount.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Airbus+CEO+Says+Boeing's+Problems+Are+Bad+For+Whole+Industry%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F03%2F20%2F181209%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F03%2F20%2F181209", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T18:28:21.157925+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://it.slashdot.org/story/24/03/20/1755229/apex-legends-hacker-said-he-hacked-tournament-games-for-fun?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Apex Legends Hacker Said He Hacked Tournament Games 'For Fun'", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "An anonymous reader shares a report: On Sunday, the world of video games was shaken by a hacking and cheating scandal. During a competitive esports tournament of Apex Legends, a free-to-play shooter video game played by hundreds of thousands of players daily, hackers appeared to insert cheats into the games of two well-known streamers -- effectively hacking the players midgame. \"Wait, what the fuck? I'm getting hacked, I'm getting hacked bro, I'm getting hacked,\" said one of the players allegedly compromised during a livestream of the gameplay. The incidents forced the organizers of the Apex Legends Global Series tournament, which has a $5 million total prize pool, to postpone the event indefinitely \"due to the competitive integrity of this series being compromised.\" \n\nAs the midgame hacks were underway, the game's chatbot displayed messages on-screen that appeared to come from the hackers: \"Apex hacking global series, by Destroyer2009 &amp;R4andom,\" the messages read. In an ", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T17:23:09.174921+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://news.slashdot.org/story/24/03/20/1629228/intel-awarded-up-to-85-billion-in-chips-act-grants-with-billions-more-in-loans-available?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Intel Awarded Up To $8.5 Billion in CHIPS Act Grants, With Billions More in Loans Available", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "The White House said Wednesday Intel has been awarded up to $8.5 billion in CHIPS Act funding, as the Biden administration ramps up its effort to bring semiconductor manufacturing to U.S. soil. From a report: Intel could receive an additional $11 billion in loans from the CHIPS and Science Act, which was passed in 2022. The awards will be announced by President Joe Biden in Arizona on Wednesday. The money will help \"leading-edge semiconductors made in the United States\" keep \"America in the driver's seat of innovation,\" U.S. Secretary of Commerce Gina Raimondo said on a call with reporters. Intel and the White House said their agreement is nonbinding and preliminary and could change. \n\nIntel has long been a stalwart of the U.S. semiconductor industry, developing chips that power many of the world's PCs and data center servers. However, the company has been eclipsed in revenue by Nvidia, which leads in artificial intelligence chips, and has been surpassed in market cap by riva", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T17:23:07.696286+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://news.slashdot.org/story/24/03/20/1542239/why-do-people-let-their-life-insurance-lapse?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Why Do People Let Their Life Insurance Lapse?", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "The abstract of a new paper published on Journal of Financial Economics: We study aggregate lapsation risk in the life insurance sector. We construct two lapsation risk factors that explain a large fraction of the common variation in lapse rates of the 30 largest life insurance companies. The first is a cyclical factor that is positively correlated with credit spreads and unemployment, while the second factor is a trend factor that correlates with the level of interest rates. Using a novel policy-level database from a large life insurer, we examine the heterogeneity in risk factor exposures based on policy and policyholder characteristics. \n\nYoung policyholders with higher health risk in low-income areas are more likely to lapse their policies during economic downturns. We explore the implications for hedging and valuation of life insurance contracts. Ignoring aggregate lapsation risk results in mispricing of life insurance policies. The calibrated model points to overpricing", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T16:18:10.203883+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://slashdot.org/story/24/03/20/1426203/openais-chatbot-store-is-filling-up-with-spam?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "OpenAI's Chatbot Store is Filling Up With Spam", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "An anonymous reader shares a report: When OpenAI CEO Sam Altman announced GPTs, custom chatbots powered by OpenAI's generative AI models, onstage at the company's first-ever developer conference in November, he described them as a way to \"accomplish all sorts of tasks\" -- from programming to learning about esoteric scientific subjects to getting workout pointers. \"Because [GPTs] combine instructions, expanded knowledge and actions, they can be more helpful to you,\" Altman said. \"You can build a GPT ... for almost anything.\" He wasn't kidding about the anything part. \n\nTechCrunch found that the GPT Store, OpenAI's official marketplace for GPTs, is flooded with bizarre, potentially copyright-infringing GPTs that imply a light touch where it concerns OpenAI's moderation efforts. A cursory search pulls up GPTs that purport to generate art in the style of Disney and Marvel properties, serve as little more than funnels to third-party paid services, advertise themselves as being abl", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T16:18:08.386504+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://tech.slashdot.org/story/24/03/20/1528225/ethereum-foundation-under-investigation-by-state-authority?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Ethereum Foundation Under Investigation by 'State Authority'", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "CoinDesk: The Ethereum Foundation -- the Swiss non-profit organization at the heart of the Ethereum ecosystem -- is under investigation by an unnamed \"state authority,\" according to the group's website's GitHub repository. The scope of the investigation and its focus was unknown at press time. According to the GitHub commit dated Feb. 26, 2024, \"we have received a voluntary enquiry from a state authority that included a requirement for confidentiality.\" \n\nThe investigation comes during a time of change for Ethereum's technology. Ethereum is the second-largest blockchain by market cap after Bitcoin, launching in 2015 following an initial coin offering for the chain's native ETH token. Earlier this month, the chain underwent a major technical upgrade, dubbed Dencun, designed to bring down transaction costs for users of Ethereum-based layer-2 platforms.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ethereum+Foundation+Under+Investigati", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T15:12:55.699712+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://slashdot.org/story/24/03/20/145249/openai-to-release-materially-better-gpt-5-for-its-chatbot-mid-year-report-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "OpenAI To Release 'Materially Better' GPT-5 For Its Chatbot Mid-Year, Report Says", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "An anonymous reader shares a report: The generative AI company helmed by Sam Altman is on track to put out GPT-5 sometime mid-year, likely during summer, according to two people familiar with the company. Some enterprise customers have recently received demos of the latest model and its related enhancements to the ChatGPT tool, another person familiar with the process said. These people, whose identities Business Insider has confirmed, asked to remain anonymous so they could speak freely. \"It's really good, like materially better,\" said one CEO who recently saw a version of GPT-5. \n\nOpenAI demonstrated the new model with use cases and data unique to his company, the CEO said. He said the company also alluded to other as-yet-unreleased capabilities of the model, including the ability to call AI agents being developed by OpenAI to perform tasks autonomously. The company does not yet have a set release date for the new model, meaning current internal expectations for its release", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T15:12:53.432281+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://yro.slashdot.org/story/24/03/20/1432224/users-ditch-glassdoor-stunned-by-site-adding-real-names-without-consent?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Users Ditch Glassdoor, Stunned By Site Adding Real Names Without Consent", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "Readers waspleg and SpzToid shared the following report: Glassdoor, where employees go to leave anonymous reviews of employers, has recently begun adding real names to user profiles without users' consent. \n\nGlassdoor acquired Fishbowl, a professional networking app that integrated with Glassdoor last July. This acquisition meant that every Glassdoor user was automatically signed up for a Fishbowl account. And because Fishbowl requires users to verify their identities, Glassdoor's terms of service changed to require all users to be verified. \n\nEver since Glassdoor's integration with Fishbowl, Glassdoor's terms say that Glassdoor 'may update your Profile with information we obtain from third parties. We may also use personal data you provide to us via your resume(s) or our other services.' This effort to gather information on Fishbowl users includes Glassdoor staff consulting publicly available sources to verify information that is then used to update Glassdoor users' accounts", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T13:03:57.864201+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://it.slashdot.org/story/24/03/20/0657250/disabling-cyberattacks-are-hitting-critical-us-water-systems-white-house-warns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "'Disabling Cyberattacks' Are Hitting Critical US Water Systems, White House Warns", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "An anonymous reader quotes a report from Ars Technica: The Biden administration on Tuesday warned the nation's governors that drinking water and wastewater utilities in their states are facing \"disabling cyberattacks\" by hostile foreign nations that are targeting mission-critical plant operations. \"Disabling cyberattacks are striking water and wastewater systems throughout the United States,\" Jake Sullivan, assistant to the President for National Security Affairs, and Michael S. Regan, administrator of the Environmental Protection Agency, wrote in a letter. \"These attacks have the potential to disrupt the critical lifeline of clean and safe drinking water, as well as impose significant costs on affected communities.\" [...]\n \n\"Drinking water and wastewater systems are an attractive target for cyberattacks because they are a lifeline critical infrastructure sector but often lack the resources and technical capacity to adopt rigorous cybersecurity practices,\" Sullivan and Regan ", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T10:49:30.435791+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://science.slashdot.org/story/24/03/20/0651255/physicist-claims-universe-has-no-dark-matter-and-is-twice-as-old-as-we-thought?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Physicist Claims Universe Has No Dark Matter and Is Twice As Old As We Thought", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "schwit1 shares a report from ScienceAlert: Sound waves fossilized in the maps of galaxies across the Universe could be interpreted as signs of a Big Bang that took place 13 billion years earlier than current models suggest. Last year, theoretical physicist Rajendra Gupta from the University of Ottawa in Canada published a rather extraordinary proposal that the Universe's currently accepted age is a trick of the light, one that masks its truly ancient state while also ridding us of the need to explain hidden forces. Gupta's latest analysis suggests oscillations from the earliest moments in time preserved in large-scale cosmic structures support his claims. \"The study's findings confirm that our previous work about the age of the Universe being 26.7 billion years has allowed us to discover that the Universe does not require dark matter to exist,\" says Gupta. \"In standard cosmology, the accelerated expansion of the Universe is said to be caused by dark energy but is in fact due ", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T07:23:27.471926+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://science.slashdot.org/story/24/03/19/2154218/europe-turns-to-the-falcon-9-to-launch-its-navigation-satellites?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Europe Turns To the Falcon 9 To Launch Its Navigation Satellites", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "The European Union has agreed to launch four Galileo navigation satellites on SpaceX's Falcon 9 rocket at a 30 percent premium over the standard launch price. Ars Technica reports: According to Politico, the security agreement permits staff working for the EU and European Space Agency to have access to the launch pad at all times and, should there be a mishap with the mission, the first opportunity to retrieve debris. With the agreement, final preparations can begin for two launches of two satellites each, on the Falcon 9 rocket from Florida. These Galileo missions will occur later this year. The satellites, which each weigh about 700 kg, will be launched into an orbit about 22,000 km above the planet.\n \nThe heightened security measures are due to the proprietary technology incorporated into the satellites, which cost hundreds of millions of euros to build; they perform a similar function to US-manufactured Global Positioning System satellites. The Florida launches will be th", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T04:08:51.975876+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://news.slashdot.org/story/24/03/19/2145211/only-seven-countries-meet-who-air-quality-standard-research-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Only Seven Countries Meet WHO Air Quality Standard, Research Finds", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "An anonymous reader quotes a report from The Guardian: Only seven countries are meeting an international air quality standard, with deadly air pollution worsening in places due to a rebound in economic activity and the toxic impact of wildfire smoke, a new report has found. Of 134 countries and regions surveyed in the report, only seven -- Australia, Estonia, Finland, Grenada, Iceland, Mauritius and New Zealand -- are meeting a World Health Organization (WHO) guideline limit for tiny airborne particles expelled by cars, trucks and industrial processes. The vast majority of countries are failing to meet this standard for PM2.5, a type of microscopic speck of soot less than the width of a human hair that when inhaled can cause a myriad of health problems and deaths, risking serious implications for people, according to the report by IQAir, a Swiss air quality organization that draws data from more than 30,000 monitoring stations around the world.\n \nWhile the world's air is gene", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T00:46:16.517795+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://tech.slashdot.org/story/24/03/19/218216/modern-web-bloat-means-some-pages-load-21mb-of-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Modern Web Bloat Means Some Pages Load 21MB of Data", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "Christopher Harper reports via Tom's Hardware: Earlier this month, Danluu.com released an exhaustive 23-page analysis/op-ed/manifesto on the current status of unoptimized web pages and web app performance, finding that just loading a web page can even bog down an entry-level device that can run the popular game PUBG at 40 fps. In fact, the Wix webpage requires loading 21MB of data for one page, while the more famous websites Patreon and Threads load 13MB of data for one page. This can result in slow load times that reach up to 33 seconds or, in some cases, result in the page failing to load at all.\n \nAs the testing above shows, some of the most brutally intensive websites include the likes of... Quora, and basically every major social media platform. Newer content production platforms like Squarespace and newer Forum platforms like Discourse also have significantly worse performance than their older counterparts, often to the point of unusability on some devices. The Tecno S8", "user": null}, {"vote": 0, "album": "", "tags": [], "dead": false, "date_published": "2024-03-20T00:46:14.724933+00:00", "bookmarked": false, "page_rating_votes": 0, "link": "https://slashdot.org/story/24/03/19/226239/nvidias-jensen-huang-says-agi-is-5-years-away?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "age": null, "thumbnail": null, "source_obj__id": 306, "title": "Nvidia's Jensen Huang Says AGI Is 5 Years Away", "page_rating_contents": 94, "comments": [], "artist": null, "language": "en-us", "page_rating": 94, "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "description": "Haje Jan Kamps writes via TechCrunch: Artificial General Intelligence (AGI) -- often referred to as \"strong AI,\" \"full AI,\" \"human-level AI\" or \"general intelligent action\" -- represents a significant future leap in the field of artificial intelligence. Unlike narrow AI, which is tailored for specific tasks (such as detecting product flaws, summarize the news, or build you a website), AGI will be able to perform a broad spectrum of cognitive tasks at or above human levels. Addressing the press this week at Nvidia's annual GTC developer conference, CEO Jensen Huang appeared to be getting really bored of discussing the subject -- not least because he finds himself misquoted a lot, he says. The frequency of the question makes sense: The concept raises existential questions about humanity's role in and control of a future where machines can outthink, outlearn and outperform humans in virtually every domain. The core of this concern lies in the unpredictability of AGI's decision-m", "user": null}]