[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T20:30:03+00:00", "description": "There are few games that commit to their central conceit and framing as much as Empire of the Ants does. A lot of the problems the game runs into arise directly from that commitment, but that same commitment allows Empire of the Ants to deliver an extremely unique experience that stands out not just because of the premise, but also because of how well it executes on it. \n\nThose fumbles and foibles are few, and largely, Empire of the Ants is firing on all cylinders to deliver a uniquely compelling game that fans of real time strategy games, or simply players looking for relaxing gameplay or a surprisingly thought-provoking story, will appreciate.", "id": 1459655, "language": null, "link": "https://www.youtube.com/watch?v=NfwSF0xSHv8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NfwSF0xSHv8/hqdefault.jpg", "title": "Empire of the Ants Review - One of the Biggest Surprises of 2024", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T18:30:38+00:00", "description": "We’re four years into the Xbox Series X’s console lifecycle and the graphical potential is starting to really come alive. Games like Hellblade II and Alan Wake 2 push the system to its absolute limits, delivering genre-defining 4K visuals and silky-smooth framerates. \n\nInterestingly enough, a good number of games on this list are exclusive to Xbox and PC, highlighting just how powerful the Series X is. A small number of games here were on the Xbox One but upscaled and enhanced beautifully for Series X. \n\nWhile some visual masterworks like Hi-Fi Rush rely on a more stylistic comic book approach to its visuals, others like Stalker 2 rely on ultra- realistic vistas. Whether you’re playing heavily stylized games or realistic open worlds, Xbox Series X lets you bask in their beauty with 4K visuals and some of this generation’s most impressive graphics.", "id": 1458946, "language": null, "link": "https://www.youtube.com/watch?v=lByBchMBrNo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/lByBchMBrNo/hqdefault.jpg", "title": "Top 15 Graphically Intensive Xbox Series X Games of All Time [2024 Edition]", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T13:30:34+00:00", "description": "Expectations can be dangerous in the gaming industry when applied to projects several years out. Whether you're a fan of BioWare or not, it's hard to predict the next Mass Effect's quality because we know very little about it.\n\nHowever, after Dragon Age: The Veilguard, there are some concerns for the future. Not necessarily because it's a bad game but rather because it falters in all the ways where it should have succeeded. A focus on companions, one of BioWare's specialties, should have offered more than just segmented stories that don't intertwine with each other. Opting for missions over an open world should have meant better pacing and objective variety.\n\nIf the next Mass Effect should take anything from The Veilguard, it's that expectations don't always align with execution. Even if BioWare returns to its roots and creates single-player narrative RPGs, there's no guarantee they'll live up to the hype.", "id": 1456667, "language": null, "link": "https://www.youtube.com/watch?v=qcGmzWoHfZU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qcGmzWoHfZU/hqdefault.jpg", "title": "Dragon Age: The Veilguard LEFT ME NERVOUS About The Next Mass Effect", "vote": 0}]