[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T23:10:56.162421+00:00", "description": "The FBI warned on Tuesday that polling stations across multiple U.S. states received fake bomb threats sent from Russian email domains, forcing brief evacuations at two voting sites in Georgia's Fulton County. \n\nThe threats, which targeted locations in Georgia, Michigan, and Wisconsin, have not been deemed credible, the FBI said in a statement. The evacuated Fulton County sites reopened after 30 minutes, prompting local officials to seek extended voting hours beyond the 7 p.m. ET deadline. \n\nThe incidents follow Friday's joint intelligence warning from the FBI, ODNI, and CISA about Russian-created fake videos aimed at undermining election integrity. The agencies also reported Russian actors are spreading false claims about planned election fraud by U.S. officials.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Russian+Email+Domains+Target+US+Polling+Sites+with+Bomb+Threats%2C+FBI+Says%3A+https%3A%2F%2Fnews.slashdot", "id": 1460301, "language": null, "link": "https://news.slashdot.org/story/24/11/05/2238205/russian-email-domains-target-us-polling-sites-with-bomb-threats-fbi-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Russian Email Domains Target US Polling Sites with Bomb Threats, FBI Says", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T22:05:56.993846+00:00", "description": "SpaceX has launched the world's first wood-paneled satellite into space \"to test the suitability of timber as a renewable building material in future exploration of destinations like the Moon and Mars,\" reports the BBC. From the report: Made by researchers in Japan, the tiny satellite weighing just 900g is heading for the International Space Station on a SpaceX mission. It will then be released into orbit above the Earth. Named LignoSat, after the Latin word for wood, its panels have been built from a type of magnolia tree, using a traditional technique without screws or glue. Researchers at Kyoto University who developed it hope it may be possible in the future to replace some metals used in space exploration with wood.\n \n\"Wood is more durable in space than on Earth because there's no water or oxygen that would rot or inflame it,\" Kyoto University forest science professor Koji Murata told Reuters news agency. \"Early 1900s airplanes were made of wood,\" Prof Murata said. \"A wooden sat", "id": 1459943, "language": null, "link": "https://science.slashdot.org/story/24/11/05/2047247/worlds-first-wood-paneled-satellite-launched-into-space?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "World's First Wood-Paneled Satellite Launched Into Space ", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T22:05:56.760373+00:00", "description": "Amazon is launching drone deliveries from its Tolleson, AZ, same-day delivery site, making over 50,000 essentials available to eligible customers in the West Valley Phoenix area. The Verge reports: The news came after Amazon announced it was shutting down its testing zone location in Lockeford, California. The new Tolleson location integrates drone deliveries into Amazon's delivery network for the first time, and the drones will deploy right next to the fulfillment center. Amazon is using its latest MK30 drones that can carry up to 5 pounds while also flying \"twice as far\" and running \"50 percent quieter\" than its previous models that sometimes crashed and burned in testing.\n \nAmazon will launch the drones from its hybrid facility. The Federal Aviation Administration (FAA) has approved Amazon's drones for Beyond Visual Line of Sight (BVLOS), meaning they can be flown out of visual range from the operator. The company claims it's the first to launch both a new facility and BVLOS drone", "id": 1459942, "language": null, "link": "https://tech.slashdot.org/story/24/11/05/2054203/amazon-starts-drone-deliveries-in-arizona?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Starts Drone Deliveries In Arizona", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T21:00:55.524246+00:00", "description": "An anonymous reader quotes a report from TechCrunch: The Mozilla Foundation, the non-profit arm of the Firefox browser maker Mozilla, has laid off 30% of its employees as the organization says it faces a \"relentless onslaught of change.\" When reached by TechCrunch, Mozilla Foundation's communications chief Brandon Borrman confirmed the layoffs in an email. \"The Mozilla Foundation is reorganizing teams to increase agility and impact as we accelerate our work to ensure a more open and equitable technical future for us all. That unfortunately means ending some of the work we have historically pursued and eliminating associated roles to bring more focus going forward,\" read the statement shared with TechCrunch.\n \nAccording to its annual tax filings, the Mozilla Foundation reported having 60 employees during the 2022 tax year. The number of employees at the time of the layoffs was closer to 120 people, according to a person with knowledge. When asked by TechCrunch, Mozilla's spokesperson ", "id": 1459575, "language": null, "link": "https://tech.slashdot.org/story/24/11/05/2039228/mozilla-foundation-lays-off-30-staff-drops-advocacy-division?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Mozilla Foundation Lays Off 30% Staff, Drops Advocacy Division", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T19:56:12.815549+00:00", "description": "An anonymous reader shares a report: Tucked inside a 32-page earnings report, oil and gas giant BP revealed it was killing 18 early-stage hydrogen projects, a move that could have a chilling effect on the nascent hydrogen industry. The decision, along with the sale of the company's U.S. on-shore wind power operations, will save BP $200 million annually and help boost its bottom line. The hydrogen industry, which has relied on oil and gas companies both financially and through lobbying efforts, is preparing for a grimmer outcome. \n\nBP has been a supporter of hydrogen. The company's venture capital arm has invested in several green hydrogen startups, including Electric Hydrogen and Advanced Ionics. Earlier this year, BP said it would develop \"more than 10\" hydrogen projects in the U.S., Europe, and Australia. Now, BP is scaling back those plans, saying it'll develop between five and ten projects. The company is keeping quiet about which ones will receive the green light.<p><div class=\"", "id": 1459223, "language": null, "link": "https://hardware.slashdot.org/story/24/11/05/1841248/oil-giant-bp-is-killing-18-hydrogen-projects-chilling-the-nascent-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Oil Giant BP is Killing 18 Hydrogen Projects, Chilling the Nascent Industry", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T18:51:51.869525+00:00", "description": "AMD has surpassed Intel in datacenter processor sales for the first time in history, marking a dramatic shift in the server chip market. AMD's datacenter revenue hit $3.549 billion in Q3, edging out Intel's $3.3 billion, according to SemiAnalysis. \n\nThe milestone ends Intel's decades-long dominance in server processors, where it held over 90% market share until recent years. AMD's EPYC processors now power many high-end servers, commanding premium prices despite selling at lower costs than comparable Intel chips.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AMD+Overtakes+Intel+in+Datacenter+Sales+For+First+Time%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F05%2F1818222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F05%2F1818222%2Famd-over", "id": 1458806, "language": null, "link": "https://slashdot.org/story/24/11/05/1818222/amd-overtakes-intel-in-datacenter-sales-for-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AMD Overtakes Intel in Datacenter Sales For First Time", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T17:46:00.250053+00:00", "description": "spatwei writes: Google has used a large language model (LLM) agent called \"Big Sleep\" to discover a previously unknown, exploitable memory flaw in a widely used software for the first time, the company announced Friday. \n\nThe stack buffer underflow vulnerability in a development version of the popular open-source database engine SQLite was found through variant analysis by Big Sleep, which is a collaboration between Google Project Zero and Google DeepMind. \n\nBig Sleep is an evolution of Project Zero's Naptime project, which is a framework announced in June that enables LLMs to autonomously perform basic vulnerability research. The framework provides LLMs with tools to test software for potential flaws in a human-like workflow, including a code browser, debugger, reporter tool and sandbox environment for running Python scripts and recording outputs. \n\nThe researchers provided the Gemini 1.5 Pro-driven AI agent with the starting point of a previous SQLIte vulnerability, providing conte", "id": 1458408, "language": null, "link": "https://tech.slashdot.org/story/24/11/05/1532207/googles-big-sleep-llm-agent-discovers-exploitable-bug-in-sqlite?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's Big Sleep LLM Agent Discovers Exploitable Bug In SQLite", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T17:45:59.887575+00:00", "description": "Apple has warned investors that future products may never be as profitable as its iPhone business, as it pushes into unproven new markets such as artificial intelligence and virtual reality headsets. From a report: The iPhone maker added the new warning on growth and profit margins to its latest annual report, in the list of \"risk factors\" facing the tech group's business. \n\n\"New products, services and technologies may replace or supersede existing offerings and may produce lower revenues and lower profit margins,\" Apple said, \"which can materially adversely impact the company's business, results of operations and financial condition.\" Apple routinely warns investors in its annual reports that competition, foreign exchange, supply chain issues and other factors can put \"volatility and downward pressure\" on its margins. The same 10-K regulatory filing in previous years suggested that new product introductions could have \"higher cost structures.\" But until now, Apple has not been so di", "id": 1458407, "language": null, "link": "https://apple.slashdot.org/story/24/11/05/171227/apple-warns-investors-future-products-may-never-be-as-profitable-as-iphone?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Warns Investors Future Products May Never Be as Profitable as iPhone", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T17:45:59.569868+00:00", "description": "The degradation of the world's soils and landscapes is threatening human life, and must be addressed as a matter of urgency, the government of Saudi Arabia has said. The Guardian: Neglect of the land is wiping trillions of dollars from global economies, hampering agricultural production, disrupting water supplies, threatening children with poor nutrition, and destroying vital ecosystems, according to the country's deputy environment minister. Land degradation, and ways to combat the problem, will come into sharp focus at a global summit to be held in the nation's capital, Riyadh, in December. \n\nThe conference of the parties (Cop) to the UN convention on combating desertification (CCD), which takes place every two years, is often an overlooked international meeting, sparsely attended compared with the Cops on climate and on biodiversity. But as this year's host, Saudi Arabia is planning to put the issue of land management in the spotlight, inviting senior ministers and heads of govern", "id": 1458406, "language": null, "link": "https://news.slashdot.org/story/24/11/05/1735247/degradation-of-land-is-threat-to-human-life-saudi-government-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Degradation of Land is Threat To Human Life, Saudi Government Says", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T15:50:58.563613+00:00", "description": "India's government challenged Wikipedia's legal immunity as a tech platform on Tuesday, issuing a notice questioning whether the online encyclopedia should be reclassified as a publisher. The move follows Delhi High Court warnings to suspend Wikipedia's India operations over a defamation case filed by Asian News International. The news agency seeks to unmask contributors who labeled it a \"government propaganda tool.\" Justice Navin Chawla threatened contempt proceedings after Wikipedia cited its lack of physical presence in India to request more time for disclosing user information. The court deemed the site's open editing feature \"dangerous.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=India+Issues+Notice+To+Wikipedia+Over+Concerns+of+Bias%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F05%2F1437225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"><", "id": 1457518, "language": null, "link": "https://news.slashdot.org/story/24/11/05/1437225/india-issues-notice-to-wikipedia-over-concerns-of-bias?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "India Issues Notice To Wikipedia Over Concerns of Bias", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T15:50:58.076115+00:00", "description": "India's capital territory of Delhi is keen to use artificial rain to fight air pollution this year, its Environment Minister Gopal Rai said on Tuesday, as deteriorating air quality in the region led to an increase in respiratory illnesses. From a report: Large swathes of north India battle pollution each winter as cold air traps dust, vehicle emissions and smoke from farm fires in the breadbasket states of Punjab and Haryana, shrouding the national capital and its suburbs in a toxic haze. Cloud-seeding - the method of triggering rain by seeding clouds with salts - was considered to curb pollution in 2023 too but the plan did not materialise due to unfavourable weather conditions. \n\n\"I appeal to the federal environment minister...now in Delhi and north India, the pollution has reached the border of 400,\" Rai told reporters, referring to the air quality index (AQI) score on Tuesday. \"The next 10 days are quite crucial...help us get permission for artificial rain, call a meeting,\" he sa", "id": 1457517, "language": null, "link": "https://news.slashdot.org/story/24/11/05/1528239/delhi-wants-artificial-rain-to-tackle-worsening-air-pollution?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Delhi Wants Artificial Rain To Tackle Worsening Air Pollution", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T14:45:53.978418+00:00", "description": "Apple is exploring a push into smart glasses with an internal study of products currently on the market, setting the stage for the company to follow Meta into an increasingly popular category. From a report: The initiative, code-named Atlas, got underway last week and involves gathering feedback from Apple employees on smart glasses, according to people with knowledge of the matter. Additional focus groups are planned for the near future, said the people, who asked not to be identified because the work is secret. \n\nThe studies are being led by Apple's Product Systems Quality team, part of the hardware engineering division. \"Testing and developing products that all can come to love is very important to what we do at Apple,\" the group wrote in an email to select employees at the company's headquarters in Cupertino, California. \"This is why we are looking for participants to join us in an upcoming user study with current market smart glasses.\"<p><div class=\"share_submission\" style=\"posi", "id": 1457034, "language": null, "link": "https://apple.slashdot.org/story/24/11/05/145230/apple-explores-push-into-smart-glasses-with-atlas-user-study?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Explores Push Into Smart Glasses With 'Atlas' User Study", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T13:40:20.623387+00:00", "description": "An anonymous reader quotes a report from the New York Times: Meta will allow U.S. government agencies and contractors working on national security to use its artificial intelligence models for military purposes, the company said on Monday, in a shift from its policy that prohibited the use of its technology for such efforts. Meta said that it would make its A.I. models, called Llama, available to federal agencies and that it was working with defense contractors such as Lockheed Martin and Booz Allen as well as defense-focused tech companies including Palantir and Anduril. The Llama models are \"open source,\" which means the technology can be freely copied and distributed by other developers, companies and governments.\n \nMeta's move is an exception to its \"acceptable use policy,\" which forbade the use of the company's A.I. software for \"military, warfare, nuclear industries,\" among other purposes. In a blog post on Monday, Nick Clegg, Meta's president of global affairs, said the compan", "id": 1456607, "language": null, "link": "https://news.slashdot.org/story/24/11/05/043209/meta-permits-its-ai-models-to-be-used-for-us-military-purposes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Permits Its AI Models To Be Used For US Military Purposes", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T10:25:21.392594+00:00", "description": "The Federal Energy Regulatory Commission (FERC) blocked Amazon's bid to access more power from the Susquehanna nuclear plant for its Pennsylvania data center, citing grid reliability and consumer cost concerns. The Hill reports: In a 2-1 decision, the FERC found the regional grid operator, PJM Interconnection, failed to prove that the changes to the transmission agreement with Susquehanna power plant were necessary. The regulator's two Republican commissioners, Mark Christie and Lindsay See, outvoted Democratic chair Willie Phillips. The chair's two fellow Democratic commissioners, David Rosner and Judy Chang, sat out the vote. \"Co-location arrangements of the type presented here present an array of complicated, nuanced and multifaceted issues, which collectively could have huge ramifications for both grid reliability and consumer costs,\" Christie wrote in a concurring statement.\n \nIn a dissenting statement, Phillips argued the deal with Amazon \"represents a 'first of its kind' co-lo", "id": 1455508, "language": null, "link": "https://hardware.slashdot.org/story/24/11/05/0357243/us-regulator-rejects-bid-to-boost-nuclear-power-to-amazon-data-center?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Regulator Rejects Bid To Boost Nuclear Power To Amazon Data Center", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T07:10:08.519443+00:00", "description": "Astronomers have discovered a supermassive black hole in the early Universe devouring matter at over 40 times the Eddington limit. ScienceAlert reports: Led by astronomer Hyewon Suh of Gemini Observatory and NSF's NOIRLab, a team of researchers used JWST to take follow-up observations of a smattering of galaxies identified by the Chandra X-ray Observatory that were bright in X-rays but dim in other wavelengths. When they got to LID-568, they were having trouble identifying its distance across space-time. The galaxy was very faint and very hard to see; but, using the integral field spectrograph on JWST's NIRSpec instrument, the team homed in on the galaxy's exact position. LID-568's far-off location is surprising. Although the object is faint from our position in the Universe, its distance means it must be incredibly intrinsically bright. Detailed observations revealed powerful outflows from the supermassive black hole, a signature of accretion as some of the material is being diverte", "id": 1454849, "language": null, "link": "https://science.slashdot.org/story/24/11/05/0352224/researchers-spot-black-hole-eating-stuff-at-over-40x-the-theoretical-limit?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Researchers Spot Black Hole Eating Stuff At Over 40x the Theoretical Limit", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T03:55:19.486068+00:00", "description": "An anonymous reader quotes a report from The Guardian: Sweden has vetoed plans for 13 offshore windfarms in the Baltic Sea, citing unacceptable security risks. The country's defence minister, Pal Jonson, said on Monday that the government had rejected plans for all but one of 14 windfarms planned along the east coast. The decision comes after the Swedish armed forces concluded last week that the projects would make it more difficult to defend Nato's newest member.\n \nThe proposed windfarms would have been located between Aland, the autonomous Finnish region between Sweden and Finland, and the Sound, the strait between southern Sweden and Denmark. The Russian exclave of Kaliningrad is only about 310 miles (500km) from Stockholm. Wind power could affect Sweden's defence capabilities across sensors and radars and make it harder to detect submarines and possible attacks from the air if war broke out, Jonson said. The only project to receive the green light to was Poseidon, which will incl", "id": 1454224, "language": null, "link": "https://hardware.slashdot.org/story/24/11/05/0011207/sweden-scraps-plans-for-13-offshore-windfarms-over-russia-security-fears?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Sweden Scraps Plans For 13 Offshore Windfarms Over Russia Security Fears", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T02:49:50.259039+00:00", "description": "Apple released the first beta of visionOS 2.2, introducing new \"Wide\" and \"Ultrawide\" modes for the Mac Virtual Display feature on the Vision Pro headset. MacRumors reports: Apple has previously said the ultra-wide version of Mac Virtual Display is equivalent to having two physical 4K displays sitting side by side on a desk. Mac Virtual Display is now available in three sizes: Normal, Wide, and Ultrawide. visionOS 2.2 will likely be released to the public in December alongside iOS 18.2, iPadOS 18.2, macOS Sequoia 15.2, watchOS 11.2, tvOS 18.2, and other updates. Further reading: Apple Delays Cut-price Vision Headset Until 2027, Analyst Ming-Chi Kuo Says<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=visionOS+2.2+Beta+Adds+Wide+and+Ultrawide+Modes+To+Mac+Virtual+Display%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F11%2F05%2F006202%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.co", "id": 1454072, "language": null, "link": "https://hardware.slashdot.org/story/24/11/05/006202/visionos-22-beta-adds-wide-and-ultrawide-modes-to-mac-virtual-display?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "visionOS 2.2 Beta Adds Wide and Ultrawide Modes To Mac Virtual Display", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T01:45:07.715669+00:00", "description": "Leading fintech and digital asset firms, including Robinhood, Kraken and Galaxy Digital, have introduced a joint stablecoin pegged to the U.S. dollar. Called the Global Dollar Network, it seeks to enhance the stablecoin market by lowering transaction costs, boosting consumer protections, and facilitating cross-border transactions with rewards for institutional participants. Crypto Briefing reports: The network will utilize Paxos's new stablecoin, the Global Dollar (USDG), which complies with the Monetary Authority of Singapore's upcoming stablecoin framework. USDG is designed to return yield on reserve assets to participants who contribute to its adoption, encouraging the development of crypto and financial solutions using the token. The Global Dollar Network aims to address shortcomings in the stablecoin market, such as high transaction costs and limited consumer protections.\n \nThe network has opened an invite-only phase for select custodians, exchanges, payment processors, merchant", "id": 1453855, "language": null, "link": "https://news.slashdot.org/story/24/11/04/2356230/robinhood-and-kraken-launch-new-global-stablecoin-network-with-paxos-usdg?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Robinhood and Kraken Launch New Global Stablecoin Network With Paxos' USDG", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T01:45:07.419939+00:00", "description": "According to The Verge, Netflix plans to delist almost all of its interactive shows and films as of December 1st. Only four of the 24 interactive titles will remain: Black Mirror: Bandersnatch, Unbreakable Kimmy Schmidt: Kimmy vs. the Reverend, Ranveer vs. Wild with Bear Grylls, and You vs. Wild. From the report: The removal of the titles marks a disappointing conclusion to Netflix's earliest efforts into interactive content. The company first launched the interactive titles in 2017 with Puss in Book: Trapped in an Epic Tale, and I remember being wowed (and horrified) by paths in Black Mirror: Bandersnatch. In addition to specials based on franchises like Carmen Sandiego and Boss Baby, Netflix also tried ideas like a daily trivia series and a trivia game you could play with a friend. But the relatively few titles available suggests the format wasn't much of a hit -- Puss in Book has apparently been gone for a while. \"The technology served its purpose, but is now limiting as we focus ", "id": 1453854, "language": null, "link": "https://entertainment.slashdot.org/story/24/11/05/000250/netflix-is-removing-nearly-all-of-its-interactive-titles?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Netflix Is Removing Nearly All of Its Interactive Titles", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T00:40:12.215315+00:00", "description": "Amazon's Prime Video has introduced \"X-Ray Recaps,\" a generative AI feature that will recap what you're watching. The new tool can create text summaries of \"full seasons of TV shows, single episodes, and even pieces of episodes,\" the company says in a blog post. The Verge reports: X-Ray Recaps will be accessible from the detail page of a show or in X-Ray while you're watching something. The tool \"analyzes various video segments, combined with subtitles or dialogue, to generate detailed descriptions of key events, places, times, and conversations,\" Amazon says. Amazon has also applied \"guardrails\" to help the feature avoid sharing spoilers and to keep summaries concise.\n \nX-Ray Recaps, which is are beta, are coming to Fire TV devices starting today, with support for \"additional devices\" available by the end of this year, Amazon says. The feature, at launch, will work with all Amazon MGM Studios Original series.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slas", "id": 1453670, "language": null, "link": "https://entertainment.slashdot.org/story/24/11/04/2148215/prime-video-will-let-you-summon-ai-to-recap-what-youre-watching?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Prime Video Will Let You Summon AI To Recap What You're Watching", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-05T00:40:12.078817+00:00", "description": "An anonymous reader quotes a report from TechCrunch: The CEO of AI search company Perplexity, Aravind Srinivas, has offered to cross picket lines and provide services to mitigate the effect of a strike by New York Times tech workers. The NYT Tech Guild announced its strike Monday, after setting November 4 as its deadline months earlier. The workers represented provide software support and data analysis for the Times, on the business side of the outlet. They have been asking for an annual 2.5% wage increase and to cement a current two days per week in-office expectation, among other things. [...] Picketers demonstrated in front of the NYT building in New York as negotiations continued. Meanwhile, on X, formerly known as Twitter, Perplexity's CEO offered to step in for the striking workers.\n \nReplying to Semafor media editor Max Tani quoting the publisher, Srinivas wrote: \"Hey AG Sulzberger @nytimes sorry to see this. Perplexity is on standby to help ensure your essential coverage is a", "id": 1453669, "language": null, "link": "https://news.slashdot.org/story/24/11/04/2155213/perplexity-ceo-offers-to-replace-striking-nyt-staff-with-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Perplexity CEO Offers To Replace Striking NYT Staff With AI", "vote": 0}]