[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-26T04:06:54+00:00", "description": "<p>Coming off the massive (yes, literally) A Chorus of Dragons series, Jenn Lyons is back with the standalone dragon fantasy The Sky on Fire. She plays with expectations and tropes, giving us a rich and detailed world in which dragons are not creatures softened and turned loyal. She was twice-nominated for the Astounding Award for Best New Writer and is a geek through and through, having a background in graphic design and video games. Her new book The Sky on Fire is great fun to read &#8211; and it was great to catch up with Jenn ahead of publication and talk dragons, mature characters and writing. [GdM] Can you give our readers an elevator pitch for The Sky on Fire, please? [JL] It’s Dragonriders of Pern meets Ocean’s 11. Probably the easiest elevator pitch I’ve ever done. [GdM] Dragons are having a huge moment. What’s your impression of the trend and where does your fascination with dragons stem from? [JL] My obsession with dragons probably stems from Disney’s Sleeping Beauty, which", "id": 768025, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/an-interview-with-jenn-lyons", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "An Interview with Jenn Lyons", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-26T01:00:36+00:00", "description": "<p>For the first time, Elric the Necromancer will be printed in English! Adapted from the stories by, and with approval from, Michael Moorcock, this features his character Elric &#8211; who must face an epic threat without his legendary Stormbringer. Originally published in French, this is the first time the tale has been translated into English. Written by Jean-Luc Cano and Julien Blondel, and with art from Valentin Secher, this gorgeous book is something you need to check out. This is the second of Titan Comic&#8217;s translations of Blondel and Cano&#8217;s Moorcock-approved works we&#8217;ve reviewed, having also reviewed Dreaming City. For fans of Moorcock’s albino Eternal Champion, this is an adaptation that cannot be missed. We have the blurb and a sneak peek into the first pages of the comic, below, thanks to publisher Titan Comics. About Elric the Necromancer Two years after the sack of the great city of Imrryr, Elric wanders across the land as a mercenary, still grieving the", "id": 768026, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/exclusive-first-look-at-elric-the-necromancer-by-jean-luc-cano-and-julien-blondel", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "EXCLUSIVE first look at Elric the Necromancer by Jean-Luc Cano and Julien Blondel", "user": null, "vote": 0}]