[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-26T19:45:00+00:00", "description": "If there is one thing that we can always trust FromSoftware to do, it’s to stuff its games full of so many secrets and hidden nuggets that players will be finding them even several years after a game has released. \n\nElden Ring, being the open world behemoth that it was, was obviously crawling with a bevy of such secrets, and to no one’s surprise, FromSoftware has crammed a metric ton of these in the newly released Shadow of the Erdtree as well. \n\nThe Realm of Shadow is a vast, dense new map that is stuffed with hidden areas, bosses, and more, all of which you can completely miss as you make your way through its offerings. Here, we’re going to highlight a few such secrets.", "id": 772347, "language": null, "link": "https://www.youtube.com/watch?v=VwZMwMmYcW0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/VwZMwMmYcW0/hqdefault.jpg", "title": "10 SECRET Encounters You Missed In Elden Ring: Shadow of The Erdtree", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-26T15:45:00+00:00", "description": "It's only been three years since The First Descendant was announced and touted as one of many new titles in development at Nexon. Set to launch on July 2nd for Xbox One, Xbox Series X/S, PS4, PS5, and PC, the free-to-play looter shooter has looked impressive with its Unreal Engine 5-powered visuals.\n\nHowever, for a market that's seen its highs (Destiny 2: The Final Shape) and lows (Suicide Squad: Kill the Justice League, Skull and Bones), what else does it bring to the table? We recently went hands-on with a preview build, trying out the story and exploring its various Battlefields before jumping into the endgame.\n\nThe result is a mix that could appeal to genre fans. Check out 15 new details about The First Descendant before diving in next week.", "id": 772348, "language": null, "link": "https://www.youtube.com/watch?v=5e9hUSQKq6o", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/5e9hUSQKq6o/hqdefault.jpg", "title": "The First Descendant - 15 NEW THINGS You Need To Know Before You Jump In", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-26T09:45:03+00:00", "description": "This November, PS5 and Xbox Series X/S will both be four years old, which means both consoles are a little bit past the halfway point in their lifecycles, which is absolutely nuts to think about, because the both current-gen platforms barely have anything to show for their four years of existence so far. \n\nUsually when a console is entering its fourth year, it has well and truly hit its stride, following up on consistent past support with a steady string of new releases to build up a healthy library of games that cannot be played on previous generation consoles. That, however, has very much not been the case with PS5 and Xbox Series X/S so far. Here, we talk about all of that and more.", "id": 768872, "language": null, "link": "https://www.youtube.com/watch?v=qhaxc5Y1rXw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qhaxc5Y1rXw/hqdefault.jpg", "title": "This Console Generation Has Been Almost Completely Useless So Far", "user": null, "vote": 0}]