[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Why I CAN'T WAIT For This Game!", "description": "Following one of the standout titles in the early current-gen era is Like a Dragon: Infinite Wealth, the hotly anticipated follow-up to a predecessor which shook up the series in gigantic ways. \n\nOf those changes, returning is the RPG-like turn-based combat, albeit with refinements to freshen up the dynamism of fighting. Streetwise underdog Ichiban Kasuga returns as a central protagonist, only this time he’s joined by Kazuma Kiryu, the hard-fisted mainstay of the series up to its seventh iteration. \n\nInfinite Wealth substitutes Japan’s seedy underbelly for the tropical climbs of Hawaii too. With an emotional story the beating heart, and enough side distractions to fill lesser games, Like a Dragon: Infinite Wealth is shaping up to be a massive undertaking, but quite possibly one of the best games of 2024.", "link": "https://www.youtube.com/watch?v=sKI6GfTInoE", "date_published": "2024-01-06T15:30:21+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/sKI6GfTInoE/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 NEW And Upcoming GTA 6 Like Games of 2024 And Beyond", "description": "Grand Theft Auto has proven itself so influential that it’s become a shorthand description for any open world adventure game. Those games that are especially crime-centric are thought of in comparison to Grand Theft Auto, but truth is GTA’s exceptional open worlds, immersive life sim experiences, plus combat and car driving mechanics can be just as influential to other games that aren’t necessarily focused on becoming a criminal kingpin. \n\nThe 15 games on this rundown do risk being overshadowed by Grand Theft Auto 6, but that’d be a great shame because some of these games look truly remarkable, and certainly capable of exploring new ideas and locations in a genre that’s become amongst the world’s most popular.", "link": "https://www.youtube.com/watch?v=skastlDMKFI", "date_published": "2024-01-06T09:30:24+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/skastlDMKFI/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]