[{"page_rating": 94, "manual_status_code": 0, "status_code": 0, "permanent": false, "age": null, "link": "https://www.youtube.com/watch?v=BTy3Dv7uIBw", "page_rating_contents": 94, "user": null, "description": "Every year there is a barrage of AAA single player games which dominate their moment in the limelight, commandeering wish lists and pre-orders. Alongside these games, there’re always numerous lesser-known titles which don’t quite get their moment to shine. \n\nThis video aims to highlight these such games; games which haven’t got the marketing weight behind them to propel them to their peak, or have sunken beneath the radar since their announcement, or are simply too niche to garner as ravenous a following as your Spider-Man 2’s would. \n\nThere’s 15 here which you may have heard of, but likely haven’t, but these games should provide as much exhilaration as your more well-known titles.", "tags": [], "bookmarked": false, "thumbnail": "https://i3.ytimg.com/vi/BTy3Dv7uIBw/hqdefault.jpg", "artist": null, "language": null, "vote": 0, "date_published": "2024-03-24T15:30:02+00:00", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "page_rating_visits": 0, "comments": [], "title": "15 Amazing Looking SINGLE PLAYER GAMES You Don't Know Are Coming", "page_rating_votes": 0, "source_obj__id": 129}, {"page_rating": 94, "manual_status_code": 0, "status_code": 0, "permanent": false, "age": null, "link": "https://www.youtube.com/watch?v=1m07K4D8zEY", "page_rating_contents": 94, "user": null, "description": "When the studio behind Nioh and Ninja Gaiden puts out a new game and describes it as its biggest and most ambitious title ever, you have no choice but to sit up and take notice, especially if that game is also being given the full backing of being a PlayStation Studios title. \n\nRise of the Ronin has now launched, after a long development cycle, to those expectations, but it’s fair to say that it hasn’t quite managed to live up to them. From its open world to its attempts to tell a more involved story, the action RPG stumbles in a number of key areas. \n\nHere, we’re going to talk about all of that and more, and about how Rise of the Ronin might still turn out to be a net positive for Team Ninja in the long run.", "tags": [], "bookmarked": false, "thumbnail": "https://i2.ytimg.com/vi/1m07K4D8zEY/hqdefault.jpg", "artist": null, "language": null, "vote": 0, "date_published": "2024-03-24T11:00:01+00:00", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": "", "page_rating_visits": 0, "comments": [], "title": "What The Hell Went Wrong With Rise of the Ronin?", "page_rating_votes": 0, "source_obj__id": 129}]