[{"date_published": "2024-03-22T23:49:20.105367+00:00", "link": "https://yro.slashdot.org/story/24/03/22/1954248/dutch-court-orders-isp-to-block-annas-archive-and-libgen?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "The Dutch pirate site blocklist has expanded with two new targets, shadow libraries Anna's Archive and Library Genesis. The court order was obtained by local anti-piracy group BREIN, acting on behalf of major publishers. Interestingly, Z-Library isn't listed in the blocking order, despite explicit warnings previously issued by BREIN. TorrentFreak reports: All blocking requests were submitted by local anti-piracy group BREIN, which acts on behalf of rightsholders. These include the major Hollywood studios but BREIN's purview is much broader. Last week, it obtained the latest blocking order, this time on behalf of the publishing industry. Issued by the Rotterdam District Court, the order requires a local Internet provider to block two well-known shadow libraries; \"Anna's Archive\" and \"Library Genesis\" (LibGen). News of this new court order was shared by BREIN which notes that both sites were found to make copyright infringing works available on a large scale. At the time of wri", "page_rating_contents": 94, "vote": 0, "title": "Dutch Court Orders ISP To Block 'Anna's Archive' and 'LibGen'", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T22:44:31.680123+00:00", "link": "https://tech.slashdot.org/story/24/03/22/1937234/mozilla-drops-onerep-after-ceo-admits-to-running-people-search-networks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader quotes a report from KrebsOnSecurity: The nonprofit organization that supports the Firefox web browser said today it is winding down its new partnership with Onerep, an identity protection service recently bundled with Firefox that offers to remove users from hundreds of people-search sites. The move comes just days after a report by KrebsOnSecurity forced Onerep's CEO to admit that he has founded dozens of people-search networks over the years. Mozilla only began bundling Onerep in Firefox last month, when it announced the reputation service would be offered on a subscription basis as part of Mozilla Monitor Plus. Launched in 2018 under the name Firefox Monitor, Mozilla Monitor also checks data from the website Have I Been Pwned? to let users know when their email addresses or password are leaked in data breaches. On March 14, KrebsOnSecurity published a story showing that Onerep's Belarusian CEO and founder Dimitiri Shelest launched dozens of people-sear", "page_rating_contents": 94, "vote": 0, "title": "Mozilla Drops Onerep After CEO Admits To Running People-Search Networks", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T22:44:29.783469+00:00", "link": "https://tech.slashdot.org/story/24/03/22/1945212/booms-xb-1-supersonic-demonstrator-makes-first-flight?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Boom Supersonic's first aircraft, the XB-1, completed its first flight today and met \"all of its test objectives.\" From a report: This initial test only saw the aircraft 7,120 feet above sea level and fly at a top speed of 238 knots (274 mph) -- far from Mach 1, the speed of sound. The first flight of XB-1 took place at the Mojave Air &amp; Space Port in California, in the same airspace where the X-1 broke the sound barrier, the X-15 conducted test flights for altitude and speed records, and the SR-71 Blackbird was also tested. According to Boom, the XB-1 will be testing, among other things:\n \nAugmented reality vision system: Two nose-mounted cameras, digitally augmented with attitude and flight path indications, feed a high-resolution pilot display enabling excellent runway visibility. This system allows for improved aerodynamic efficiency without the weight and complexity of a movable nose.\nDigitally-optimized aerodynamics: Engineers used computational fluid dynamics simula", "page_rating_contents": 94, "vote": 0, "title": "Boom's XB-1 Supersonic Demonstrator Makes First Flight", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T21:39:33.709516+00:00", "link": "https://tech.slashdot.org/story/24/03/22/1910200/cable-isp-fined-10000-for-lying-to-fcc-about-where-it-offers-broadband?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An Internet service provider that admitted lying to the FCC about where it offers broadband will pay a $10,000 fine and implement a compliance plan to prevent future violations. ArsTechnica: Jefferson County Cable (JCC), a small ISP in Toronto, Ohio, admitted that it falsely claimed to offer fiber service in an area that it hadn't expanded to yet. A company executive also admitted that the firm submitted false coverage data to prevent other ISPs from obtaining government grants to serve the area. Ars helped expose the incident in a February 2023 article. \n\nThe FCC announced the outcome of its investigation on March 15, saying that Jefferson County Cable violated the Broadband Data Collection program requirements and the Broadband DATA Act, a US law, \"in connection with reporting inaccurate information or data with respect to the Company's ability to provide broadband Internet access service.\" The FCC said: \"To settle this matter, Jefferson County Cable agrees to pay a $10,000", "page_rating_contents": 94, "vote": 0, "title": "Cable ISP Fined $10,000 For Lying To FCC About Where It Offers Broadband", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T21:39:31.632137+00:00", "link": "https://apple.slashdot.org/story/24/03/22/1924206/doj-blames-apple-for-failure-of-amazon-fire-phone-windows-phone-and-htc?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "DOJ, in the court filing (PDF): Many prominent, well-financed companies have tried and failed to successfully enter the relevant markets because of these entry barriers. Past failures include Amazon (which released its Fire mobile phone in 2014 but could not profitably sustain its business and exited the following year); Microsoft (which discontinued its mobile business in 2017); HTC (which exited the market by selling its smartphone business to Google in September 2017); and LG (which exited the smartphone market in 2021). Today, only Samsung and Google remain as meaningful competitors in the U.S. performance smartphone market. Barriers are so high that Google is a distant third to Apple and Samsung despite the fact that Google controls development of the Android operating system.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=DOJ+Blames+Apple+For+Failure+of+Amazon+Fire+Phone%2C+Windows+Phone+and+HTC%3A+https%3A%2F%2Fapple.slashdot.", "page_rating_contents": 94, "vote": 0, "title": "DOJ Blames Apple For Failure of Amazon Fire Phone, Windows Phone and HTC", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T20:34:27.298575+00:00", "link": "https://tech.slashdot.org/story/24/03/22/194233/google-testing-ai-overviews-in-search-results-even-if-you-have-not-opted-in?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Search Engine Land: Google is now testing AI overviews in the main Google Search results, even if you have not opted into the Google Search Generative Experience labs feature. Google said this is an experience on a \"subset of queries, on a small percentage of search traffic in the U.S.,\" a Google spokesperson told Search Engine Land.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Testing+AI+Overviews+in+Search+Results%2C+Even+If+You+Have+Not+Opted+In%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F03%2F22%2F194233%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F03%2F22%2F194233%2Fgoogle-testing-ai-overviews-in-search-results-even-if-you-have-not-opted-in%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large", "page_rating_contents": 94, "vote": 0, "title": "Google Testing AI Overviews in Search Results, Even If You Have Not Opted In", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T19:31:11.456953+00:00", "link": "https://news.slashdot.org/story/24/03/22/1837215/security-and-climate-change-drive-a-return-to-nuclear-energy-as-over-30-nations-sign-summit-pledge?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "In the shadow of a massive monument glorifying nuclear power, over 30 nations from around the world pledged to use the controversial energy source to help achieve a climate-neutral globe while providing countries with an added sense of strategic security. Associated Press: The idea of a Nuclear Energy Summit would have been unthinkable a dozen years ago after the 2011 Fukushima nuclear accident in Japan, but the tide has turned in recent years. A warming planet has made it necessary to phase out fossil fuels, while the war in Ukraine has laid bare Europe's dependence on Russian energy. \"We have to do everything possible to facilitate the contribution of nuclear energy,\" said Rafael Grossi, the head of the International Atomic Energy Agency. \"It is clear: Nuclear is there. It has an important role to play,\" he said. \n\nIn a solemn pledge, 34 nations, including the United States, China, France, Britain and Saudi Arabia, committed \"to work to fully unlock the potential of nuclear", "page_rating_contents": 94, "vote": 0, "title": "Security and Climate Change Drive a Return To Nuclear Energy as Over 30 Nations Sign Summit Pledge", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T19:31:09.975056+00:00", "link": "https://news.slashdot.org/story/24/03/22/1855210/dot-wants-to-know-how-big-airlines-use-passenger-data?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "The U.S. Department of Transportation has announced it will conduct a review of the data practices of the country's ten largest airlines, amid concerns over potential misuse of customer information for upselling, overcharging, targeted advertising, and third-party data sales, as well as the security of systems handling sensitive data such as passport numbers. From a report: The probe will look at air carriers' policies and procedures to determine if they are safeguarding personal info properly, unfairly or deceptively monetizing it, or sharing it with third parties, the agency said yesterday. If they're indeed doing anything \"problematic,\" they can look forward to scrutiny, fines, and new rules, says the DOT. \"Airline passengers should have confidence that their personal information is not being shared improperly with third parties or mishandled by employees,\" said US Transportation Secretary Pete Buttigieg. \n\n\"This review of airline practices is the beginning of a new initia", "page_rating_contents": 94, "vote": 0, "title": "DOT Wants To Know How Big Airlines Use Passenger Data", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T18:26:07.742829+00:00", "link": "https://games.slashdot.org/story/24/03/22/1810245/switch-emulator-suyu-hit-by-gitlab-dmca-project-lives-on-through-self-hosting?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Switch emulator Suyu -- a fork of the Nintendo-targeted and now-defunct emulation project Yuzu -- has been taken down from GitLab following a DMCA request Thursday. But the emulation project's open source files remain available on a self-hosted git repo on the Suyu website, and recent compiled binaries remain available on an extant GitLab repo. From a report: While the DMCA takedown request has not yet appeared on GitLab's public repository of such requests, a GitLab spokesperson confirmed to The Verge that the project was taken down after the site received notice \"from a representative of the rightsholder.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Switch+Emulator+Suyu+Hit+By+GitLab+DMCA%2C+Project+Lives+on+Through+Self-hosting%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F03%2F22%2F1810245%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" h", "page_rating_contents": 94, "vote": 0, "title": "Switch Emulator Suyu Hit By GitLab DMCA, Project Lives on Through Self-hosting", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T17:24:02.241713+00:00", "link": "https://science.slashdot.org/story/24/03/22/1434250/geologists-reject-declaration-of-anthropocene-epoch?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "The guardians of the world's official geological timescale have firmly rejected a proposal to declare an Anthropocene epoch, after an epic academic row. From a report: The proposal would have designated the period from 1952 as the Anthropocene to reflect the planet-changing impact of humanity. It would have ended the Holocene epoch, the 11,700 years of stable climate since the last ice age and during which human civilisation arose. The International Union of Geological Sciences (IUGS) has announced, however, that geologists have rejected the idea in a series of votes. Those objecting noted a much longer history of human impacts on Earth, including the dawn of agriculture and the industrial revolution, and unease about including a new unit in the geological timescale with a span of less than less than a single human lifetime, it said. Most units span thousands or millions of years. \n\nIt also acknowledged: \"The Anthropocene as a concept will continue to be widely used not only ", "page_rating_contents": 94, "vote": 0, "title": "Geologists Reject Declaration of Anthropocene Epoch", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T17:24:00.739806+00:00", "link": "https://science.slashdot.org/story/24/03/22/1437242/more-than-half-of-chickenpox-diagnoses-are-wrong-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader shares a report: Thanks to the vaccination program that began in 1995, chickenpox is now relatively rare. Cases of the miserable, itchy condition have fallen more than 97 percent. But, while children have largely put the oatmeal baths and oven mitts behind them, doctors have apparently let their diagnostic skills get a little crusty. According to a study published Thursday, public health researchers in Minnesota found that 55 percent of people diagnosed with chickenpox based on their symptoms were actually negative for the varicella-zoster virus, the virus that causes chickenpox. The study noted that the people were all diagnosed in person by health care providers in medical facilities. But, instead of chickenpox, lab testing showed that some of the patients were actually infected with an enterovirus, which can cause a rash, or the herpes simplex virus 1, which causes cold sores. \n\nThe study, published in the Centers for Disease Control and Prevention's Mo", "page_rating_contents": 94, "vote": 0, "title": "More Than Half of Chickenpox Diagnoses Are Wrong, Study Finds", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T16:16:02.084041+00:00", "link": "https://news.slashdot.org/story/24/03/22/1135241/higher-temperatures-mean-higher-food-and-other-prices?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Food prices and overall inflation will rise as temperatures climb with climate change, a new study by an environmental scientist and the European Central Bank found. From a report: Looking at monthly price tags of food and other goods, temperatures and other climate factors in 121 nations since 1996, researchers calculate that \"weather and climate shocks\" will cause the cost of food to rise 1.5 to 1.8 percentage points annually within a decade or so, even higher in already hot places like the Middle East, according to a study in Thursday's journal Communications, Earth and the Environment. \n\nAnd that translates to an increase in overall inflation of 0.8 to 0.9 percentage points by 2035, just caused by climate change extreme weather, the study said. Those numbers may look small, but to banks like the U.S. Federal Reserve that fight inflation, they are significant, said study lead author Max Kotz, a climate scientist at the Potsdam Institute for Climate Impact Research in Germa", "page_rating_contents": 94, "vote": 0, "title": "Higher Temperatures Mean Higher Food and Other Prices", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T16:16:00.459395+00:00", "link": "https://news.slashdot.org/story/24/03/22/1358207/us-cyber-investors-pledge-spyware-is-off-limits---with-a-catch?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader shares a report: On Monday, the Biden administration announced that six new countries had joined an international coalition to fight the proliferation of commercial spyware, sold by companies such as NSO Group or Intellexa. Now, some investors have announced that they too are committed to fighting spyware. But at least one of those investors, Paladin Capital Group, has previously invested in a company that developed malware, according to a leaked 2021-dated slide deck obtained by TechCrunch, although the firm tells TechCrunch it \"got out\" of the firm some time ago. \n\nIn the last couple of years, the U.S. government has led an effort to limit or at least restrain the use of spyware across the world by putting surveillance tech makers like NSO Group, Candiru, and Intellexa on blocklists, as well as imposing export controls on those companies and visa restrictions on people involved in the industry. More recently, the government has imposed economic sanctions", "page_rating_contents": 94, "vote": 0, "title": "US Cyber Investors Pledge Spyware is Off Limits - With a Catch", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T15:11:58.298618+00:00", "link": "https://apple.slashdot.org/story/24/03/22/1234245/doj-lawsuit-against-apple-is-headline-grabber-but-poses-limited-near-term-impact?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader shares a report: The U.S. Department of Justice filed a lawsuit against Apple Thursday, accusing the company led by CEO Tim Cook of engaging in anti-competitive business practices. The allegations include claims that Apple prevents competitors from accessing certain iPhone features and that the company's actions impact the \"flow of speech\" through its streaming service, Apple TV+. \n\nHowever, even if the DOJ proves any of the allegations, it is highly unlikely that Apple will face material changes for years, as history shows that such lawsuits often take a significant amount of time to reach the trial, let alone a resolution. The DOJ's ongoing case against Google, filed in 2020, only went to trial in 2023, with no remedies or financial implications expected for up to two more years. \n\nThis is not the first time Apple has faced legal action from the DOJ. In 2012, the agency sued Apple for conspiring with publishers to increase ebook prices, a lawsuit that wa", "page_rating_contents": 94, "vote": 0, "title": "DOJ Lawsuit Against Apple is Headline Grabber But Poses Limited Near-Term Impact", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T14:04:23.744466+00:00", "link": "https://yro.slashdot.org/story/24/03/22/0255246/texas-sues-xhamster-and-chaturbate?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader quotes a report from 404 Media: Texas Attorney General Ken Paxton just sued two more porn sites, xHamster and Chaturbate, alleging they aren't complying with age verification laws. As first reported by local news outlet KXAN, the Office of the Attorney General filed two civil lawsuits on Tuesday afternoon against Hammy Media, which owns xHamster, and Multi Media, which owns Chaturbate. Texas Governor Greg Abbott signed HB 1181 into law in June, which requires porn sites to verify the ages of users through a driver's license or passport. If porn sites don't force consenting adults to hand over a government-issued ID in order to watch other consenting adults have sex on camera, they face heavy fines.\n \nPaxton's lawsuit against xHamster asks the court to force the site to pay a civil penalty of up to $1.67 million, with an additional $10,000 a day since filing. For Chaturbate, it's $1.78 million plus $10,000 per day. Last week, Pornhub's parent company Aylo b", "page_rating_contents": 94, "vote": 0, "title": "Texas Sues xHamster and Chaturbate", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T14:04:22.174144+00:00", "link": "https://apple.slashdot.org/story/24/03/22/1238200/apple-held-talks-with-chinas-baidu-over-ai-for-its-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Apple has held preliminary talks with Baidu about using the Chinese company's generative AI technology in its devices in China, the latest example of the iPhone maker's efforts to widen its AI capabilities. From a report: The U.S. tech giant has been exploring using external partners to help accelerate its AI ambitions. It has held discussions with companies including Google and OpenAI about using their technology to power its mobile features. In China, Apple has been looking for a local generative AI model provider, mainly because China requires such models to be vetted by its cyberspace regulator before being launched to the public, people familiar with the matter said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Held+Talks+With+China's+Baidu+Over+AI+for+Its+Devices%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F03%2F22%2F1238200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_", "page_rating_contents": 94, "vote": 0, "title": "Apple Held Talks With China's Baidu Over AI for Its Devices", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T10:49:35.901530+00:00", "link": "https://news.slashdot.org/story/24/03/22/0243251/e-waste-is-growing-5x-faster-than-it-can-be-recycled-says-un?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "According to a United Nations report, humans are producing electronic waste almost five times faster than we're recycling it. \"While e-waste recycling has benefits estimated to include $23 billion of monetized value from avoided greenhouse gas emissions and $28 billion of recovered materials like gold, copper, and iron, it also comes at a cost -- $10 billion associated with e-waste treatment and $78 billion of externalized costs to people and the environment,\" reports The Register. \"Overall, this puts the net annual economic monetary cost of e-waste at $37 billion. And this is expected to reach $40 billion by 2030 if improvements in e-waste management and policies aren't made.\" From the report: The 2024 Global E-waste Monitor (GEM) [PDF] was prepared by the UN's International Telecommunication Union (ITU) and the UN Institute for Training and Research (UNITAR). The report reveals that annual generation of e-waste -- discarded devices with a plug or battery -- is growing at a ", "page_rating_contents": 94, "vote": 0, "title": "E-Waste Is Growing 5x Faster Than It Can Be Recycled, Says UN", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T07:26:33.502730+00:00", "link": "https://tech.slashdot.org/story/24/03/22/0236237/vernor-vinge-father-of-the-tech-singularity-has-died-at-age-79?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "\"Vernor Vinge, who three times won the Hugo for best novel, has died,\" writes Slashdot reader Felix Baum. Ars Technica reports: On Wednesday, author David Brin announced that Vernor Vinge, sci-fi author, former professor, and father of the technological singularity concept, died from Parkinson's disease at age 79 on March 20, 2024, in La Jolla, California. The announcement came in a Facebook tribute where Brin wrote about Vinge's deep love for science and writing. \"A titan in the literary genre that explores a limitless range of potential destinies, Vernor enthralled millions with tales of plausible tomorrows, made all the more vivid by his polymath masteries of language, drama, characters, and the implications of science,\" wrote Brin in his post.\n \nAs a sci-fi author, Vinge won Hugo Awards for his novels A Fire Upon the Deep (1993), A Deepness in the Sky (2000), and Rainbows End (2007). He also won Hugos for novellas Fast Times at Fairmont High (2002) and The Cookie Monster ", "page_rating_contents": 94, "vote": 0, "title": "Vernor Vinge, Father of the Tech Singularity, Has Died At Age 79", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T04:10:30.864947+00:00", "link": "https://it.slashdot.org/story/24/03/21/2222235/unitedhealth-group-paid-more-than-2-billion-to-providers-following-cyberattack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "An anonymous reader quotes a report from CNBC: UnitedHealth Group said Monday that it's paid out more than $2 billion to help health-care providers who have been affected by the cyberattack on subsidiary Change Healthcare. \"We continue to make significant progress in restoring the services impacted by this cyberattack,\" UnitedHealth CEO Andrew Witty said in a press release. \"We know this has been an enormous challenge for health care providers and we encourage any in need to contact us.\"\n \nUnitedHealth disclosed nearly a month ago that a cyber threat actor breached part of Change Healthcare's information technology network. The fallout has wreaked havoc across the U.S. health-care system. Change Healthcare offers e-prescription software and tools for payment management, so the interruptions left many providers temporarily unable to fill medications or get reimbursed for their services by insurers. UnitedHealth, which provides care for 152 million people, said on Monday that i", "page_rating_contents": 94, "vote": 0, "title": "UnitedHealth Group Paid More Than $2 Billion To Providers Following Cyberattack", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T02:00:49.806102+00:00", "link": "https://tech.slashdot.org/story/24/03/21/2217203/windows-11-notepad-finally-gets-spellcheck-and-autocorrect?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Microsoft today announced a preview release of Windows Notepad, with built-in spellchecking and an autocorrect feature. BleepingComputer reports: Microsoft says they are rolling out this preview to Insiders in the Windows 11 Canary and Dev channels, but it may take some time before it's available for everyone. \"With this update, Notepad will now highlight misspelled words and provide suggestions so that you can easily identify and correct mistakes,\" reads Microsoft's announcement. \"We are also introducing autocorrect which seamlessly fixes common typing mistakes as you type.\"\n \nOnce installed, Notepad will now show a red squiggly line under misspelled words that, when clicked, shows suggestions on the correct spelling. It's also possible to ignore words in a single text document or add them to the global dictionary so they are not shown in the future.\n \nMicrosoft says that this feature will be turned off for log and source code files. This is because it's common for non-stand", "page_rating_contents": 94, "vote": 0, "title": "Windows 11 Notepad Finally Gets Spellcheck and Autocorrect", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T00:55:46.060207+00:00", "link": "https://apple.slashdot.org/story/24/03/21/2146215/apple-launches-all-in-one-manuals-specs-and-downloads-website?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Apple has launched a new \"Documentation\" page to its website that provides links to user guides, repair manuals, tech specs, software downloads, and more for a variety of its products. MacRumors reports: Some of this information was previously found across separate pages on Apple's website, and it has now been combined in one place for convenient access. The page includes categories for the Mac, iPhone, iPad, iPod, Vision Pro, Apple Watch, Apple TV, AirPods, HomePod, displays like the Studio Display and Pro Display XDR, accessories like the Apple Pencil and Magic Keyboard, and software. There is also a search tool on the page that provides links to support documents and other relevant information based on the keywords entered.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Launches+All-In-One+'Manuals%2C+Specs%2C+and+Downloads'+Website%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F03%2F21%2F2146215%2F%3Futm_source%3Dtwitte", "page_rating_contents": 94, "vote": 0, "title": "Apple Launches All-In-One 'Manuals, Specs, and Downloads' Website", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T00:55:44.583212+00:00", "link": "https://bsd.slashdot.org/story/24/03/21/225211/redis-to-adopt-source-available-licensing-starting-with-next-version?utm_source=rss1.0mainlinkanon&utm_medium=feed", "description": "Longtime Slashdot reader jgulla shares an announcement from Redis: Beginning today, all future versions of Redis will be released with source-available licenses. Starting with Redis 7.4, Redis will be dual-licensed under the Redis Source Available License (RSALv2) and Server Side Public License (SSPLv1). Consequently, Redis will no longer be distributed under the three-clause Berkeley Software Distribution (BSD). The new source-available licenses allow us to sustainably provide permissive use of our source code.\n \nWe're leading Redis into its next phase of development as a real-time data platform with a unified set of clients, tools, and core Redis product offerings. The Redis source code will continue to be freely available to developers, customers, and partners through Redis Community Edition. Future Redis source-available releases will unify core Redis with Redis Stack, including search, JSON, vector, probabilistic, and time-series data models in one free, easy-to-use pack", "page_rating_contents": 94, "vote": 0, "title": "Redis To Adopt 'Source-Available Licensing' Starting With Next Version", "album": "", "source_obj__id": 306, "page_rating_votes": 0, "language": "en-us", "comments": [], "bookmarked": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "dead": false, "thumbnail": null, "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}]