[{"date_published": "2024-03-22T20:00:13+00:00", "link": "https://www.youtube.com/watch?v=WMV7XbDFHsI", "description": "MLB The Show 24 doesn’t fix what isn’t broken with its gameplay, and it complements its consistently stellar on-field gameplay with new content meant to honor baseball’s history and the people that make the game what it is today.", "page_rating_contents": 94, "vote": 0, "title": "MLB The Show 24 Review - The Final Verdict", "album": "", "source_obj__id": 129, "page_rating_votes": 0, "language": null, "comments": [], "bookmarked": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "dead": false, "thumbnail": "https://i4.ytimg.com/vi/WMV7XbDFHsI/hqdefault.jpg", "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T15:30:17+00:00", "link": "https://www.youtube.com/watch?v=hbrEB8fScBg", "description": "There are dense open world games, and then there are games like Dragon’s Dogma 2. It is a massive experience that stuffs its open world full of a bevy of interacting and interweaving systems to deliver emergent gameplay, but with everything that it’s got going on, and with the game’s own aversion to hold players’ hands, there’s plenty here that can be a bit difficult to grasp, especially in your early hours.\n\nTo that end, from a multitude of systems and mechanics to master both in and out of combat to figuring out how best to deal with the many perils of the open world, here in this guide, we’re going to list out a few handy tips and tricks that you should keep in mind in the early hours of your journey.", "page_rating_contents": 94, "vote": 0, "title": "15 Things Dragon's Dogma 2 Doesn't Tell You", "album": "", "source_obj__id": 129, "page_rating_votes": 0, "language": null, "comments": [], "bookmarked": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "dead": false, "thumbnail": "https://i1.ytimg.com/vi/hbrEB8fScBg/hqdefault.jpg", "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}, {"date_published": "2024-03-22T11:00:14+00:00", "link": "https://www.youtube.com/watch?v=KvW-kPGb5nA", "description": "Dragon's Dogma 2 is now available and has received rave reviews from critics. Many consider it an early Game of the Year contender for its open-world design, combat and emergent gameplay.\n\nHowever, there's also been a strong focus on its performance. While announced as having an uncapped frame rate, reviewers have pointed out frame drops in both the console and PC versions. The latter is worse off because even those well above the recommended specifications will struggle to maintain a steady frame rate in packed cities.\n\nThe developer has promised a fix, blaming NPCs for the high CPU load, but how long it could take remains to be seen. Open-world development on this scale isn't easy, but with a $70 price tag, players are questioning why they should line up at launch with such severe issues.", "page_rating_contents": 94, "vote": 0, "title": "Dragon's Dogma 2 PC Performance - What Is Going On?", "album": "", "source_obj__id": 129, "page_rating_votes": 0, "language": null, "comments": [], "bookmarked": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "dead": false, "thumbnail": "https://i4.ytimg.com/vi/KvW-kPGb5nA/hqdefault.jpg", "user": null, "page_rating_visits": 0, "age": null, "page_rating": 94, "artist": null, "permanent": false, "tags": []}]