[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T22:45:00+00:00", "description": "Graphics are constantly improving year-on-year, and to keep up with the most demanding games you’ll likely need a high-end PC in order to experience the best gaming has to offer in terms of visuals and performance. \n\nHowever, should you decide to undergo the astronomical investment there’re numerous games that’ll reward you with the most mind-blowing graphics gaming has to offer, undeniably beyond the capabilities of consoles. \n\nThe games on this rundown are all reasonably modern, although there’s a couple that are four years old, or older, showcasing that good graphics need to be supported by thoughtful art direction in order to ensure longevity. The list is ranked from good to best, and they all demonstrate fantastic graphics worthy of PC gaming.", "id": 1490540, "language": null, "link": "https://www.youtube.com/watch?v=D1us5POeR0g", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/D1us5POeR0g/hqdefault.jpg", "title": "Top 15 PC Games With BREATHTAKING Graphics [2024 Edition]", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T13:45:03+00:00", "description": "Four years. It's been almost four years since the Xbox Series X/S launched. It almost feels like yesterday when Microsoft confirmed rumors about this magical Project Scarlett and everything it had to offer. Despite the state of the world in 2020, the pair of consoles had a pretty strong launch, especially when stacked against the PS5.\n\nHowever, things have been very up and down for the Xbox Series X/S since then. Microsoft has expanded on Game Pass and Xbox Game Studios, acquiring Bethesda, and others. Hardware sales have dropped significantly over time, though, and for all the games it's revealed, Xbox is seemingly wanting more.\n\nWhat does the console report card look like after all this time, and what's next for the Xbox Series X/S? Join us as we look back at the console's life cycle alongside its most defining releases (and mishaps).", "id": 1488632, "language": null, "link": "https://www.youtube.com/watch?v=v1ADrX6qm30", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/v1ADrX6qm30/hqdefault.jpg", "title": "Four Years Later, Is The Xbox Series X | S Worth It?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T09:30:07+00:00", "description": "As a genre, stealth has evolved massively over the last two decades. We’re now used to seeing games that build stealth mechanics into gameplay rather than being titles that are solely dedicated to the act of sneakily infiltrating, silently taking action, and evading without detection as was more commonplace in the past. \n\nRegardless of a game’s principal intentions, there’s still a level of measured immersion in stealth gameplay that can’t be beat, so it doesn’t necessarily matter if the game is ostensibly a stealth title or not. \n\nThat’s the yardstick we’re using for this rundown anyway; the game’s featured here come from a broad spectrum of genres, but their commonality is an infusion of stealth-based mechanics; an incisiveness demanded of the player being the main criteria for their inclusion on this list.", "id": 1487712, "language": null, "link": "https://www.youtube.com/watch?v=G2m_3KFrb-k", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/G2m_3KFrb-k/hqdefault.jpg", "title": "15 MUST PLAY Stealth Games That Will Test How Good You Are As A Gamer [2024 Edition]", "vote": 0}]