[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T23:23:58.191707+00:00", "description": "Long-time Slashdot reader Geoffrey.landis writes: Despite its impressive output, a recent study from MIT suggests generative AI doesn't have a coherent understanding of the world. While the best-performing large language models have surprising capabilities that make it seem like the models are implicitly learning some general truths about the world, that isn't necessarily the case. The recent paper showed that Large Language Models and game-playing AI implicitly model the world, but the models are flawed and incomplete. \n\nAn example study showed that a popular type of generative AI model accurately provided turn-by-turn driving directions in New York City, without having formed an accurate internal map of the city. Though the model can still navigate effectively, when the researchers closed some streets and added detours, its performance plummeted. And when they dug deeper, the researchers found that the New York maps the model implicitly generated had many nonexistent streets curvin", "id": 1490513, "language": null, "link": "https://slashdot.org/story/24/11/10/1911204/generative-ai-doesnt-have-a-coherent-understanding-of-the-world-mit-researchers-find?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Generative AI Doesn't Have a Coherent Understanding of the World, MIT Researchers Find", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T22:18:13.269960+00:00", "description": "Long-time Slashdot reader DesScorp writes:\n\nThe Washingtonian magazine reports that yet another company is ending most remote work for its employees. The Post's previous policy from 2022 until now had been 3 days in office, 2 days remote. The employee union for the paper, the Washington Post Guild, will oppose the mandate. \n\nThe union sent members a defiant email, according to the article. \"Guild leadership sees this for what it is: a change that stands to further disrupt our work than to improve our productivity or collaboration.\"\n\n\nManagers will have to return beginning February 3, 2025, and all other employees will be expected in the office beginning June 2 [according to a memo from publisher Will Lewis]. \"I want that great office energy for us every day,\" Lewis writes. \"I am reliably informed that is how it used to be here before Covid, and it's important we get this back.\"\n\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/", "id": 1490292, "language": null, "link": "https://it.slashdot.org/story/24/11/10/193236/washington-post-employees-ordered-back-to-the-office?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Washington Post Employees Ordered Back To the Office", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T21:12:47.705534+00:00", "description": "\"Java application security would be enhanced through two proposals aimed at resisting quantum computing attacks,\" reports InfoWorld, \"one plan involving digital signatures and the other key encapsulation.\"\n\n\nThe two proposals reside in the OpenJDK JEP (JDK Enhancement Proposal) index. \n\n\nThe Quantum-Resistant Module-Lattice-Based Digital Signature Algorithm proposal calls for enhancing the security of Java applications by providing an implementation of the quantum-resistant module-latticed-based digital signature algorithm (ML-DSA). ML-DSA would secure against future quantum computing attacks by using digital signatures to detect unauthorized modifications to data and to authenticate the identity of signatories. ML-DSA was standardized by the United States National Institute of Standards and Technology (NIST) in FIPS 204. \n\nThe Quantum-Resistant Module-Lattice-Based Key Encapsulation Mechanism proposal calls for enhancing application security by providing an implementation of the qua", "id": 1490083, "language": null, "link": "https://developers.slashdot.org/story/24/11/10/1853200/java-proposals-would-boost-resistance-to-quantum-computing-attacks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Java Proposals Would Boost Resistance to Quantum Computing Attacks", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T20:08:45.140207+00:00", "description": "Slashdot reader sciencehabit shared this report from Science magazine: Elephants love showering to cool off, and most do so by sucking water into their trunks and spitting it over their bodies. But an elderly pachyderm named Mary has perfected the technique by using a hose as a showerhead, much in the way humans do. The behavior is a remarkable example of sophisticated tool use in the animal kingdom. But the story doesn't end there. Mary's long, luxurious baths have drawn so much attention that an envious elephant at the Berlin Zoo has figured out how to shut the water off on her supersoaking rival&mdash;a type of sabotage rarely seen among animals. Both behaviors, reported today in Current Biology, further cement elephants as complex thinkers, says Lucy Bates, a behavioral ecologist at the University of Portsmouth not involved in the study. The work, she says, 'suggests problem solving or even 'insight.''<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop", "id": 1489858, "language": null, "link": "https://science.slashdot.org/story/24/11/10/1830235/this-elephant-learned-to-use-a-hose-as-a-shower-then-her-rival-sought-revenge?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "This Elephant Learned To Use a Hose As a Shower. Then Her Rival Sought Revenge", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T19:02:54.880126+00:00", "description": "Salesforce \"plans to hire more than 1,000 workers to sell its new generative AI agent product,\" reports Bloomberg:\n\nThe hiring surge is aimed at capitalizing on \"amazing momentum\" for the new artificial intelligence product, Chief Executive Marc Benioff said in a message. \"Agentforce became available just two weeks ago and we're already hearing incredible feedback from our customers.\" \n\nThe top seller of customer relations management software, Salesforce pivoted its AI strategy this year to focus on agents &mdash; tools that can complete tasks such as customer support or sales development without human supervision. It launched the product, dubbed Agentforce, last month, with initial pricing of about $2 per agent conversation.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Salesforce+to+Hire+1%2C000+People+for+Big+AI+Product+Sales+Push%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F10%2F1819213%2F%3Futm_source%3", "id": 1489628, "language": null, "link": "https://slashdot.org/story/24/11/10/1819213/salesforce-to-hire-1000-people-for-big-ai-product-sales-push?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Salesforce to Hire 1,000 People for Big AI Product Sales Push", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T17:58:19.080635+00:00", "description": "The Free Software Foundation turns forty on October 4, 2025 \"and we will end our thirties on a high note!\" they announced this week:\n\n We wish we were celebrating the achievement of software freedom for all computer users, but we're not there yet. Until our mission becomes reality and we can retire, instead, we are celebrating forty years of activism, and all that we have achieved. \n\nSince our founding in 1985, we laid out many stepping stones on the road to software freedom, and we're eager to continue building the road ahead. We will celebrate our fortieth in the spirit of bringing the international free software community together, discussing what we can do next to make the world freer, and celebrating how far we've come. We're aiming for a libre planet! Sounds familiar? Instead of hosting one LibrePlanet conference in 2025, we're planning a jam-packed anniversary year, filled with several new and exciting activities! \n\nWe'll begin the anniversary year with an unprecedented memora", "id": 1489347, "language": null, "link": "https://news.slashdot.org/story/24/11/09/0642203/free-software-foundation-plans-year-of-celebrations-for-its-40th-anniversary?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Free Software Foundation Plans Year of Celebrations For Its 40th Anniversary", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T16:52:38.516386+00:00", "description": "NASA hopes to stimulate in-space manufacturing through a multi-year \"laser beam welding collaboration\" with Ohio State University. The project \"seeks to understand the physical processes of welding on the lunar surface,\" according to NASA.gov, \"such as investigating the effects of laser beam welding in a combined vacuum and reduced gravity environment.\"\n\nThe goal is to increase the capabilities of manufacturing in space to potentially assemble large structures or make repairs on the Moon, which will inform humanity's next giant leap of sending astronauts to Mars and beyond. \"For a long time, we've used fasteners, rivets, or other mechanical means to keep structures that we assemble together in space,\" said Andrew O'Connor, a Marshall materials scientist who is helping coordinate the collaborative effort and is NASA's technical lead for the project. \"But we're starting to realize that if we really want strong joints and if we want structures to stay together when assembled on the luna", "id": 1489076, "language": null, "link": "https://science.slashdot.org/story/24/11/10/0120249/nasa-investigates-laser-beam-welding-in-a-vacuum-for-in-space-manufacturing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA Investigates Laser-Beam Welding in a Vacuum for In-Space Manufacturing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T15:47:52.870903+00:00", "description": "Nathan Sobo \"joined GitHub in late 2011 to build the Atom text editor,\" according to an online biography, \"and he led the Atom team until 2018.\" Max Brunsfeld joined the Atom team in 2013, and \"While driving Atom towards its 1.0 launch during the day, Max spent nights and weekends building Tree-sitter, a blazing-fast and expressive incremental parsing framework that currently powers all code analysis at GitHub.\" \n\nLast year they teamed up with Antonio Scandurra (another Atom alumnus) to launch a new startup called Zed (which in 2023 raised $10 million, according to TechCrunch). And today the open source blog It's FOSS checks in on their open-source code editor &mdash; \"Zed Editor\". Mainly written in Rust, it supports running in CLI, diagnosing project-wide errors, split panes, and markdown previews:\n\n\nBy default, any added content is treated as plain text. I used the language switcher to change it to Rust so that I would get proper syntax highlighting, indentation, error detection, a", "id": 1488853, "language": null, "link": "https://developers.slashdot.org/story/24/11/10/0314256/the-team-behind-githubs-atom-ide-build-a-cross-platform-ai-optional-zed-editor?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Team Behind GitHub's 'Atom' IDE Build a Cross-Platform, AI-Optional 'Zed Editor'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T13:37:58.745355+00:00", "description": "\"The Rust trademark policy has been updated and a new draft is available to view,\" announced the Rust Foundation this week. \n\nThe last proposed trademark policy (in April of 2023) was criticized by open source advocate Bruce Perens in The Register as \"far awry of fair use which is legally permitted.\" The Rust Foundation says this new version has \"incorporated a number of suggestions from the Rust community,\" in a blog post that summarizes the feedback and enumerates specific ways it's been addressed:\n\n\n\n1. We primarily plan to lean on community reports for enforcement and have no intention of spending our limited resources policing the work of small creators. \n\n2. We have removed the non-legal language summary and instead have clarified wording throughout as best we can while keeping the policy valid. \n\n3. The Rust trademark does not cover use of the word \"Rust\" in general and instead pertains to its use in relevant technical settings. \n\n4. We have updated the logo usage policy. Colo", "id": 1488334, "language": null, "link": "https://developers.slashdot.org/story/24/11/10/0358239/rust-foundation-shares-draft-of-new-simpler-trademark-policy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Rust Foundation Shares Draft of New, Simpler Trademark Policy", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T09:17:13.725856+00:00", "description": "Sodium-ion batteries are cheaper than lithium-ion batteries &mdash; and they're also more environmentally friendly. And \"In the past few years, sodium-ion battery production has increased in the United States,\" reports the Washington Post, with a new factory planned to manufacture them \"in the same way as lithium-ion batteries, just with different ingredients. Instead of using expensive materials like lithium, nickel and cobalt, these will be made of sodium, iron and manganese...\"\n\n Last month, sodium-ion battery manufacturer Natron Energy announced it would open a \"gigafactory\" in North Carolina that would produce 24 gigawatt hours of batteries annually, enough energy to charge 24,000 electric vehicles. But sodium-ion batteries are still early in their development compared with lithium-ion, and they have yet to hit the market on a massive scale. \n\n\"It's unlikely sodium-ion could displace lithium-ion anytime soon,\" said Keith Beers, polymer science and materials chemistry principal e", "id": 1487496, "language": null, "link": "https://hardware.slashdot.org/story/24/11/09/0414255/americas-first-sodium-ion-battery-gigafactory-announced-cost-14-billion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "America's First Sodium-Ion Battery Gigafactory Announced. Cost: $1.4 Billion", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T04:56:24.577002+00:00", "description": "On Tuesday Massachusetts voted to become the first state to allow gig-working drivers to join labor unions, reports WBUR:\nSince these gig workers are classified as independent contractors, federal law allowing employees the right to unionize does not apply to them. With the passage of this ballot initiative, Massachusetts is the first state to give ride-hailing drivers the ability to collectively bargain over working conditions. \n\nSupporters have said the ballot measure \"could provide a model for other states to let Uber and Lyft drivers unionize,\" reports Reuters, \"and inspire efforts to organize them around the United States.\"\n\nRoxana Rivera, assistant to the president of 32BJ SEIU, an affiliate of the Service Employees International Union, that had spearheaded a campaign to pass the proposal, said its approval shows that Massachusetts voters want drivers to have a meaningful check against the growing power of app-based companies... The Massachusetts vote was the latest front in a ", "id": 1486902, "language": null, "link": "https://it.slashdot.org/story/24/11/10/0041235/gig-working-uber-and-lyft-drivers-can-unionize-say-massachusetts-voters?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Gig-Working Uber and Lyft Drivers Can Unionize, Say Massachusetts Voters", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T03:52:19.941754+00:00", "description": "Friday \"would have been his 38th birthday,\" writes the EFF, remembering Aaron Swartz as \"a digital rights champion who believed deeply in keeping the internet open...\" And they add that today the official web site for Aaron Swartz Day honored his memory with a special podcast \"featuring those carrying on the work around issues close to his heart,\" including an appearance by Brewster Kahle, founder of the Internet Archive. \nThe first speaker is Ryan Shapiro, FOIA expert and co-founder of the national security transparency non-profit Property of the People. The Aaron Swartz Day site calls him \"the researcher who discovered why the FBI had such an interest in Aaron in the years right before the JSTOR fiasco.\" (That web page calls it an \"Al Qaeda phishing expedition that left Aaron with an 'International Terrorism Investigation' code in his FBI database file forever,\" as reported by Gizmodo.) \n\nOther speakers on the podcast include:\n\n\n Nathan Dyer of SecureDrop, Newsroom Support Engineer", "id": 1486789, "language": null, "link": "https://yro.slashdot.org/story/24/11/10/0242215/aaron-swartz-day-commemorated-with-those-carrying-on-the-work?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Aaron Swartz Day Commemorated With 'Those Carrying on the Work'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-10T00:36:15.899307+00:00", "description": "This week Discover magazine looks at evidence &mdash; both old and new &mdash; for a ninth planet in our solar system:\n\n\"Orbits of the most distant small bodies &mdash; comets or asteroids &mdash; seem to be clustered on one half or one side of the solar system,\" says Amir Siraj [an astrophysicist with Princeton University]. \"That's very weird and something that can't be explained by our current understanding of the solar system.\" A 2014 study in Nature first noted these orbits. A 2021 study in The Astronomical Journal examined the clustering in the orbit and concluded that \"Planet Nine\" was likely closer and brighter than expected. \n\nAstrophysicists don't agree whether the clustering in the orbit is a real effect. Some have argued it is biased because the view that scientists currently have is limited, Siraj says. \"This debate for the last decade has a lot of scientists confused, including myself. I decided to look at the problem from scratch,\" he says. \n\nIn a 2024 paper, Siraj and ", "id": 1486419, "language": null, "link": "https://science.slashdot.org/story/24/11/09/067233/is-there-new-evidence-for-a-9th-planet---planet-x?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Is There New Evidence for a 9th Planet - Planet X?", "vote": 0}]