[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T23:55:25.349518+00:00", "description": "AT&amp;T has signed a $1 billion multi-year deal with Corning to acquire fiber and connectivity solutions. Reuters reports: With the U.S. wireless market facing a slowdown, telecom companies such as AT&amp;T and rival Verizon have doubled down on their high-speed internet businesses, an area that has long been dominated by broadband companies such as Comcast. Demand has also been growing for AT&amp;T's plans that allow customers to combine its high-speed fiber data with its wireless phone service for a discount. In the third quarter, AT&amp;T reported 28.3 million fiber passings, or the number of potential customer locations a fiber network passes by. It remains on track to pass more than 30 million fiber passings by the end of 2025.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AT%26amp%3BT+Announces+%241+Billion+Fiber+Deal+With+Corning%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F10%2F28%2F2057252%2F%3Futm_sourc", "id": 1404726, "language": null, "link": "https://slashdot.org/story/24/10/28/2057252/att-announces-1-billion-fiber-deal-with-corning?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AT&amp;T Announces $1 Billion Fiber Deal With Corning", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T23:55:25.054097+00:00", "description": "Russia has enacted a new law expanding control over cryptocurrency mining, granting multiple federal agencies access to digital currency identifier addresses, among other things. The country is also advancing its regulatory framework and experimenting with crypto in international trade. From a report: Taking effect on Nov. 1, the legislation includes several amendments designed to strengthen oversight and impose limitations on crypto mining activities based on regional needs. The law enables the Russian government to implement mining restrictions by location and define specific procedures and circumstances for banning mining operations. A notable provision in the law gives the government the power to stop digital currency mining pools from functioning in certain areas. Additionally, the government now has the authority to regulate infrastructure providers supporting mining operations.\n \nThis legislation also grants multiple federal agencies, beyond the Federal Financial Monitoring Se", "id": 1404725, "language": null, "link": "https://yro.slashdot.org/story/24/10/28/217212/russia-publishes-new-crypto-law-expanding-state-control-over-digital-assets?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Russia Publishes New Crypto Law Expanding State Control Over Digital Assets", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T22:50:01.785457+00:00", "description": "An anonymous reader quotes a report from The Verge: Apple's AI features are finally starting to appear. Apple Intelligence is launching today on the iPhone, iPad, and Mac, offering features like generative AI-powered writing tools, notification summaries, and a cleanup tool to take distractions out of photos. It's Apple's first official step into the AI era, but it'll be far from its last. Apple Intelligence has been available in developer and public beta builds of Apple's operating systems for the past few months, but today marks the first time it'll be available in the full public OS releases. Even so, the features will still be marked as \"beta,\" and Apple Intelligence will very much remain a work in progress. (You'll have to get on a waitlist to try Apple Intelligence, too.) Siri gets a new look, but its most consequential new features -- like the ability to take action in apps -- probably won't arrive until well into 2025.\n \nIn the meantime, Apple has released a very \"AI starter ", "id": 1404531, "language": null, "link": "https://mobile.slashdot.org/story/24/10/28/2053259/apple-intelligence-is-out-today?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Intelligence Is Out Today", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T21:46:09.372541+00:00", "description": "An anonymous reader shares a report:Around 1.5 million of Britain's 7.2 million lampposts could be removed to save money and reduce carbon emissions and replaced with lighting that will make it safer for pedestrians. \n\nUnder existing rules, there is no requirement to light pavements for pedestrians. They are only lit because light spills over from lampposts, which were principally installed to make it safer for motorists. But today's cars have such effective headlights that lampposts, which are generally 10m tall on A-roads and 6m tall on residential roads, are not necessary in many parts of Britain. Lampposts will remain in place in many locations where they are necessary, such as in cities where CCTV cameras rely on good lighting.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Britain+To+Axe+Up+To+1.5+Million+Lampposts%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F10%2F28%2F1947245%2F%3Futm_source%3Dtwitter%2", "id": 1404158, "language": null, "link": "https://news.slashdot.org/story/24/10/28/1947245/britain-to-axe-up-to-15-million-lampposts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Britain To Axe Up To 1.5 Million Lampposts", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T21:46:09.126555+00:00", "description": "A commercial military simulation software, originally inspired by Tom Clancy novels, has become an unexpected tool for military training across NATO forces and defense analysts worldwide. Command: Professional Edition, developed by Britain's Slitherine Software, has secured contracts with the U.S. Air Force and British Strategic Command, while Taiwanese analysts use it to war-game potential conflicts with China. \n\nThe software's success stems from its vast database of military equipment and capabilities, compiled through contributions from its million-strong user base. Marine Corps University's wargaming director Tim Barrick employs the software to train officers, noting its effectiveness in developing tactical creativity. \"These are not simple problems,\" said Barrick, a retired Marine colonel, told WSJ. \n\nA fascinating excerpt from the report: Command's British publisher, Slitherine Software, stumbled into popularity. The family business got started around 2000 selling retail CD-ROM", "id": 1404157, "language": null, "link": "https://games.slashdot.org/story/24/10/28/2027229/a-million-people-play-this-video-wargame-so-does-the-pentagon?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "A Million People Play This Video Wargame. So Does the Pentagon.", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T20:40:39.621595+00:00", "description": "Apple has maintained the controversial bottom-charging design in its new $79-$99 USB-C Magic Mouse, released alongside the new iMac Tuesday, despite years of customer criticism. The port location, unchanged since 2015, renders the mouse unusable while charging.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple's+New+Mouse+Retains+Flawed+Charging+Design%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F10%2F28%2F1919238%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F10%2F28%2F1919238%2Fapples-new-mouse-retains-flawed-charging-design%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://apple.slashdot.org/story/24/10/28/1919238/apples-new-mouse-retains-", "id": 1403840, "language": null, "link": "https://apple.slashdot.org/story/24/10/28/1919238/apples-new-mouse-retains-flawed-charging-design?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple's New Mouse Retains Flawed Charging Design", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T20:40:39.521055+00:00", "description": "Microsoft took the unusual step on Monday of publicly criticizing longtime rival Google for running \"shadow campaigns\" in Europe designed to discredit the software giant with regulators. CNBC: Microsoft lawyer Rima Alaily wrote in a blog post that Google hired a firm to recruit European cloud companies to represent the search company's case. \"This week an astroturf group organized by Google is launching,\" Microsoft lawyer Rima Alaily wrote in a blog post. \"It is designed to discredit Microsoft with competition authorities, and policymakers and mislead the public. Google has gone through great lengths to obfuscate its involvement, funding, and control, most notably by recruiting a handful of European cloud providers, to serve as the public face of the new organization.\" \n\nThe conflict represents a fresh battle between two companies that do battle in cloud infrastructure as well as online advertising and productivity software. The latest chapter surfaces as Google faces heightened regu", "id": 1403839, "language": null, "link": "https://tech.slashdot.org/story/24/10/28/202206/microsoft-calls-out-google-for-running-shadow-campaigns-in-europe-to-influence-regulators?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Calls Out Google For Running 'Shadow Campaigns' in Europe To Influence Regulators", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T19:36:00.602253+00:00", "description": "Italian technology firm Bending Spoons has emerged as an unconventional private equity player, acquiring struggling tech companies and dramatically restructuring them for profitability, most notably with its purchase of note-taking app Evernote. \n\nThe Milan-based company, valued at $2.6 billion, has acquired six companies since 2022, including WeTransfer and Meetup's assets. CEO Luca Ferrari has told investors the company could deploy up to $2 billion for future acquisitions. Bending Spoons typically targets subscription-based software companies with steady cash flow, implementing steep price hikes and significant staff reductions post-acquisition. \n\nAt Evernote, the company dismissed over half the workforce and increased annual subscription costs by 63% to $130. The strategy appears to be working. Bending Spoons reports annual sales have surged to $700 million from $162 million in 2022, with Evernote turning profitable earlier this year.<p><div class=\"share_submission\" style=\"positi", "id": 1403473, "language": null, "link": "https://tech.slashdot.org/story/24/10/28/1850228/private-equity-hipsters-are-coming-for-your-favorite-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Private Equity Hipsters Are Coming for Your Favorite Apps", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T18:30:00.595221+00:00", "description": "England and Wales have recorded their lowest birth rate since records began in 1938, with women having an average of 1.44 children in 2023, official data showed on Monday. The figure falls well below the 2.1 children per woman needed to maintain a stable population without migration in developed nations, the Office for National Statistics reported. \n\nThe rate has declined steadily since 2010. The steepest drops occurred among women under 30, with new mothers in 2023 averaging almost a year older than in 2013. Experts link the decline to multiple factors, including widespread contraception use, women's increased participation in education and employment, and rising childcare and housing costs. The trend mirrors similar patterns across developed economies, with EU nations like Italy and Spain reporting rates as low as 1.2 children per woman in 2023.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Birth+Rate+in+England", "id": 1403035, "language": null, "link": "https://news.slashdot.org/story/24/10/28/171236/birth-rate-in-england-and-wales-plunges-to-lowest-level-since-1938?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Birth Rate in England and Wales Plunges To Lowest Level Since 1938", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T18:30:00.499423+00:00", "description": "There's finally an \"official\" definition of open source AI. The Open Source Initiative (OSI), a long-running institution aiming to define and \"steward\" all things open source, today released version 1.0 of its Open Source AI Definition (OSAID). TechCrunch: The product of several years of collaboration with academia and industry, the OSAID is intended to offer a standard by which anyone can determine whether AI is open source -- or not. You might be wondering why consensus matters for a definition of open source AI. Well, a big motivation is getting policymakers and AI developers on the same page, said OSI EVP Stefano Maffulli. \n\n\"Regulators are already watching the space,\" Maffulli told TechCrunch, noting that bodies like the European Commission have sought to give special recognition to open source. \"We did explicit outreach to a diverse set of stakeholders and communities -- not only the usual suspects in tech. We even tried to reach out to the organizations that most often talk to", "id": 1403034, "language": null, "link": "https://news.slashdot.org/story/24/10/28/1811209/we-finally-have-an-official-definition-for-open-source-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "We Finally Have an 'Official' Definition For Open Source AI", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T17:26:54.859854+00:00", "description": "An anonymous reader shares a report: As Meta tries to keep up with OpenAI in developing AI, the Facebook owner is working on a search engine [non-paywalled link] that crawls the web to provide conversational answers about current events to people using its Meta AI chatbot. \n\nIn doing so, Meta hopes to lower its reliance on Google Search and Microsoft's Bing, which currently provide information about news, sports and stocks to people using Meta AI, according to a person who has spoken with the search engine team. It could also give Meta a backup option if Google or Microsoft withdrew from these arrangements, according to a person who has been involved with the strategy.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Develops+AI+Search+Engine+To+Lessen+Reliance+on+Google%2C+Microsoft%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F10%2F28%2F1618231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"ht", "id": 1402599, "language": null, "link": "https://tech.slashdot.org/story/24/10/28/1618231/meta-develops-ai-search-engine-to-lessen-reliance-on-google-microsoft?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Develops AI Search Engine To Lessen Reliance on Google, Microsoft", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T16:19:52.424240+00:00", "description": "AmiMoJo shares a report: Tech behemoth OpenAI has touted its artificial intelligence-powered transcription tool Whisper as having near \"human level robustness and accuracy.\" But Whisper has a major flaw: It is prone to making up chunks of text or even entire sentences, according to interviews with more than a dozen software engineers, developers and academic researchers. \n\nThose experts said some of the invented text -- known in the industry as hallucinations -- can include racial commentary, violent rhetoric and even imagined medical treatments. Experts said that such fabrications are problematic because Whisper is being used in a slew of industries worldwide to translate and transcribe interviews, generate text in popular consumer technologies and create subtitles for videos. \n\n[...] It's impossible to compare Nabla's AI-generated transcript to the original recording because Nabla's tool erases the original audio for \"data safety reasons,\" Nabla's chief technology officer Martin Ra", "id": 1402105, "language": null, "link": "https://tech.slashdot.org/story/24/10/28/1510255/researchers-say-ai-tool-used-in-hospitals-invents-things-no-one-ever-said?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Researchers Say AI Tool Used in Hospitals Invents Things No One Ever Said", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T16:19:52.336506+00:00", "description": "Apple has updated the iMac lineup with an M4 chip. The new iMac, announced this morning, includes an M4 chip with an 8-core CPU and up to a 10-core GPU. The entry-level model costs $1,299 with two Thunderbolt USB-C 4 ports, while the higher-end models start at $1,499 and have four ports. The Verge: It's also bundled with accessories that now use USB-C charging ports instead of Lightning. Like the prior model, the new iMac has a 24-inch, 4.5K display. However, Apple is offering a new \"nano-texture glass option\" for $200 extra, which is supposed to help reduce reflections and glare. \n\nAdditionally, the iMac's base RAM has been doubled to 16GB over the prior model, with the ability to configure the higher-end option with up to 32GB. Apple's new iMac also comes with a 12MP webcam, along with new Apple Intelligence features that are starting to roll out today, such as AI-powered writing and editing features and a redesigned Siri.<p><div class=\"share_submission\" style=\"position:relative;\">", "id": 1402104, "language": null, "link": "https://apple.slashdot.org/story/24/10/28/169206/apple-updates-the-imac-with-m4-chip?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Updates the iMac With M4 Chip", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T15:15:54.028655+00:00", "description": "Indonesia has banned sales of Apple's iPhone 16, citing the tech giant's failure to meet local investment requirements, the country's Ministry of Industry said. The ministry said Apple's local unit has not fulfilled the mandatory 40% local content threshold for smartphones, making imported iPhone 16 units illegal for sale in Southeast Asia's largest economy. \n\nAbout 9,000 iPhone 16 devices have entered Indonesia through passenger luggage since last month's launch. \"These phones entered legally, but will be illegal if traded,\" the ministry said. Apple has invested 1.48 trillion rupiah ($108 million) of its 1.71 trillion rupiah commitment in Indonesia. The company operates four developer academies but no manufacturing facilities in the country, despite government pressure to expand its presence.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Banned+From+Selling+iPhone+16+in+Indonesia%3A+https%3A%2F%2Fapple.slas", "id": 1401535, "language": null, "link": "https://apple.slashdot.org/story/24/10/28/1254235/apple-banned-from-selling-iphone-16-in-indonesia?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Banned From Selling iPhone 16 in Indonesia", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T15:15:53.938830+00:00", "description": "Banks and regulators are warning that QR code phishing scams -- also known as \"quishing\" -- are slipping through corporate cyber defences and increasingly tricking customers into giving up their financial details. From a report: Lenders including Santander, HSBC, and TSB have joined the UK National Cyber Security Centre and US Federal Trade Commission among others to raise concerns about a rise in fraudulent QR codes being deployed for sophisticated fraud campaigns. \n\nThe new type of email scam often involves criminals sending QR codes in attached PDFs. Experts said the strategy is effective because the messages frequently get through corporate cyber security filters -- software that typically flags malicious website links, but often does not scan images within attachments. \"The appeal for criminals is that it's bypassing all of the [cyber security] training and it's also bypassing our products,\" said Chester Wisniewski, a senior adviser at security software company Sophos.<p><div cl", "id": 1401534, "language": null, "link": "https://it.slashdot.org/story/24/10/28/1450245/banks-and-regulators-warn-of-rise-in-quishing-qr-code-scams?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Banks and Regulators Warn of Rise in 'Quishing' QR Code Scams", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T12:20:34.282979+00:00", "description": "An anonymous reader shared this report from the blog OMG Ubuntu:\n\nHaving recently announced is own range of Raspberry Pi-branded SD cards (with support for command queuing on the Pi 5 and reliable read/write speeds) the company is now offering its own range of branded Raspberry Pi SSDs... And for those who don't have an M.2 expansion board? Well, that's where the new Raspberry Pi SSD Kit comes in. It bundles the official M.2 HAT+ with an SSD for an all-in-one, ready-to-roll solution. \n\nEben Upton expects it to be a popular feature:\n\nWhen we launched Raspberry Pi 5, almost exactly a year ago, I thought the thing people would get most excited about was the three-fold increase in performance over 2019's Raspberry Pi 4. But very quickly it became clear that it was the other new features &mdash; the power button (!), and the PCI Express port &mdash; that had captured people's imagination. We've seen everything from Ethernet adapters, to AI accelerators, to regular PC graphics cards attach", "id": 1400431, "language": null, "link": "https://hardware.slashdot.org/story/24/10/28/052209/raspberry-pi-launches-its-own-branded-sd-cards-and-ssds---plus-ssd-kits?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Raspberry Pi Launches Its Own Branded SD Cards and SSDs - Plus SSD Kits", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T08:33:46.072977+00:00", "description": "When SpaceX developed reusable boosters for its Falcon rockets, it helped cut costs of launches. \nNow the Wall Street Journal reports that last week's first-time catch of \"its huge Starship booster\" could \"extend SpaceX's cost advantages, especially in launches to low-Earth orbit, where SpaceX and others operate satellites.\"\nA fully and rapidly reusable Starship would push down SpaceX's costs by limiting the need to crank out new hardware and cutting downtime between flights, space industry executives say. Bain, the consulting firm, has estimated that Starship would reduce the cost of getting each kilogram to low-Earth orbit by 50 to 80 times... SpaceX's rocket peers are moving toward reusability, but they are behind the progress Musk's company has made. \n\n- The huge booster that will power New Glenn, the orbital rocket Jeff Bezos' Blue Origin is developing, is designed to be reusable. That rocket is slated to launch for the first time next month. \n- ULA, the rocket operator owned by", "id": 1399562, "language": null, "link": "https://science.slashdot.org/story/24/10/28/0348222/spacexs-competitors-scramble-to-try-to-build-reusable-rockets?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "SpaceX's Competitors Scramble to Try to Build Reusable Rockets", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T05:18:23.063115+00:00", "description": "An anonymous reader shared this report from the Verge:\n\nEver wondered why some of your Instagram videos tend to look blurry, while others are crisp and sharp? It's because, on Instagram, the quality of your video apparently depends on how many views it's getting. \n\nHere's part of Mosseri's explanation, from the video, which was reposted by a Threads user today. \"In general, we want to show the highest-quality video we can ... But if something isn't watched for a long time &mdash; because the vast majority of views are in the beginning &mdash; we will move to a lower quality video. And then if it's watched again a lot then we'll re-render the higher quality video....\" \n\nThe shift in quality \"isn't huge,\" Mosseri said in response to another Threads user, who'd asked if that approach disadvantaged smaller creators. That's \"the right concern,\" he told them, but said people interact with videos based on its content, not its quality. That's consistent with how Meta has described its approa", "id": 1399044, "language": null, "link": "https://tech.slashdot.org/story/24/10/28/0250217/instagram-and-meta-throttle-video-quality-as-views-go-down?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Instagram (and Meta) Throttle Video Quality as Views Go Down", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T03:04:50.068831+00:00", "description": "Communications of the ACM checks in on the quest for room-temperature superconductivity. \"Time and time again, physicists have announced breakthroughs that were later found to be irreproducible, in error, or even fraudulent.\" \n\nBut \"The issue is once again simmering...\"\n\n\nIn January 2024, a group of researchers from Europe and South America announced they had achieved a milestone in room-temperature ambient-pressure superconductivity. Using Scotch-taped cleaved pyrolytic graphite with surface wrinkles, which formed line defects, they observed a room-temperature superconducting state. Their paper, published in the journal Advanced Quantum Technologies, has gained considerable attention in the scientific world... Although many in the scientific community remain incredulous, if valid, this development could help solve a key piece of the puzzle: how defects and wrinkles in a material such as scotch-taped cleaved pyrolytic graphite (HOPG) affect electrical properties and behavior within s", "id": 1398731, "language": null, "link": "https://hardware.slashdot.org/story/24/10/28/0211230/the-search-for-room-temperature-superconductivity-is-continuing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Search for Room-Temperature Superconductivity is Continuing", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T00:41:12.912351+00:00", "description": "\"Friction between bosses and their employees over the terms of their return shows no signs of abating,\" reports the Los Angeles Times.\n\nBut there's one big loophole...\nAbout 80% of organizations have put in place return-to-office policies, but in a sign that many managers are reluctant to clamp down on the flexibility employees have become accustomed to, only 17% of those organizations actively enforce their policies, according to recent research by real estate brokerage CBRE. \"Some organizations out there have 'mandated' something, but if most of your organization is not following that mandate, then there is not too much you can do to enforce it,\" said Julie Whelan, head of research into workplace trends for CBRE... \n\nThe tension \"is due to the fact that we have changed since we all went to our separate corners and then came back\" from pandemic-imposed office exile, said Elizabeth Brink, a workplace expert at architecture firm Gensler. \"It's fair to say that we have different needs ", "id": 1398445, "language": null, "link": "https://it.slashdot.org/story/24/10/27/2317213/theres-a-big-problem-with-return-to-office-mandates-enforcing-them?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "There's a Big Problem with Return-to-Office Mandates: Enforcing Them", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T00:41:12.789369+00:00", "description": "When it comes to introducing liability for software products, \"the EU and U.S. are taking very different approaches,\" according to Lawfare's cybersecurity newsletter. \"While the U.S. kicks the can down the road, the EU is rolling a hand grenade down it to see what happens.\"\n\nUnder the status quo, the software industry is extensively protected from liability for defects or issues, and this results in systemic underinvestment in product security. Authorities believe that by making software companies liable for damages when they peddle crapware, those companies will be motivated to improve product security... [T]he EU has chosen to set very stringent standards for product liability, apply them to people rather than companies, and let lawyers sort it all out. \n\nEarlier this month, the EU Council issued a directive updating the EU's product liability law to treat software in the same way as any other product. Under this law, consumers can claim compensation for damages caused by defective", "id": 1398444, "language": null, "link": "https://tech.slashdot.org/story/24/10/28/0012241/can-the-eu-hold-software-makers-liable-for-negligence?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Can the EU Hold Software Makers Liable For Negligence?", "vote": 0}]