[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T22:15:02+00:00", "description": "Dave Rubin of “The Rubin Report” shares a DM clip of Megyn Kelly having a tense exchange with Bill Maher on “Real Time with Bill Maher” over illegal immigration and why she is going to vote for Donald Trump.\nWatch Dave Rubin's FULL DIRECT MESSAGE: https://www.youtube.com/watch?v=oTI5bLIb9-o&list=PLEbhOtC9klbDG22n--rCDbv02-n8l6agL&index=1&pp=gAQBiAQB\n\nWATCH the MEMBER-EXCLUSIVE segment of the show here: https://rubinreport.locals.com/\n\nCheck out the NEW RUBIN REPORT MERCH here:\nhttps://daverubin.store/\n\n----------\n\nToday’s Sponsors:\n1775 Coffee - Their new K-Cup Pods are packed with single-origin, high-altitude beans, handpicked for maximum flavor. Rubin Report viewers get 15% off their order.\nGo to: https://1775coffee.com/RUBIN and use code RUBIN  \n\n----------\n\n#RubinReport #BillMaher #RealTime #MegynKelly #Trump #facts #logic #owned #DaveRubin\n\nThe Direct Message segments of the Rubin Report are a chance for Dave Rubin to directly address current events, political news and the topic", "id": 1404464, "language": null, "link": "https://www.youtube.com/watch?v=hQVjm7zDnPU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 438, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/hQVjm7zDnPU/hqdefault.jpg", "title": "Watch Megyn Kelly Destroy Bill Maher’s Narrative w/ Facts in Only 5 Minutes", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T15:00:28+00:00", "description": "Dave Rubin of “The Rubin Report” cracks up Greg Gutfeld and his audience with his reactions to Bob Woodward’s revelations about Joe Biden’s cognitive decline in his new book “War”; “Morning Joe’s” Mika Brzezinski’s fears for women under a Trump presidency; Hillary Clinton’s reaction to Trump’s rally at Madison Square Garden; Helen Mirren’s bizarre comments on Nirvana’s Kurt Cobain; and much more.\n\nCheck out the NEW RUBIN REPORT MERCH here:\nhttps://daverubin.store/\n\n#RubinReport #Gutfeld #GregGutfeld #FoxNews #Biden #BobWoodward #War #Trump #DaveRubin\n\nIs the state of US news driving you crazy? Does the coverage of political news rarely seem “fair and balanced”? Serious discussions on US politics is vital to having a healthy democracy. No matter what political party you belong to, we need to be able to hear a variety of political perspectives. Whether you majored in political science or just want to have a deeper understanding of the issues you’ll want to check out this playlist:\nhttp", "id": 1402431, "language": null, "link": "https://www.youtube.com/watch?v=IYzu1giiugc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 438, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/IYzu1giiugc/hqdefault.jpg", "title": "Gutfeld! Crowd Roars at Dave Rubin’s Reaction to Woodward’s Biden Revelations", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-28T13:03:04+00:00", "description": "Dave Rubin of “The Rubin Report” talks about Joe Rogan’s interview with Donald Trump, where they discussed why voters no longer have any trust in the media and Trump’s past appearance on “The View,” where he was treated quite differently by Whoopi Goldberg and Joy Behar; Trump’s massive rally at Madison Square Garden with Elon Musk, Robert F. Kennedy Jr., Tulsi Gabbard, Vivek Ramaswamy, and Dr. Phil; Alexandria Ocasio-Cortez and Tim Walz’s reactions to the rally and the off-color jokes of Tony Hinchcliffe; Megyn Kelly having a tense exchange with Bill Maher on “Real Time with Bill Maher” over illegal immigration and why she is going to vote for Donald Trump; JD Vance getting into a tense exchange with CNN’s Jake Tapper over Russiagate and CNN’s blatant bias in favor of the Kamala Harris campaign; CNN’s Anderson Cooper trashing the liberal bias of MSNBC to Charlamagne tha God; and much more.\n\nWATCH the MEMBER-EXCLUSIVE segment of the show here: https://rubinreport.locals.com/\n\nCheck o", "id": 1403483, "language": null, "link": "https://www.youtube.com/watch?v=oTI5bLIb9-o", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 438, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/oTI5bLIb9-o/hqdefault.jpg", "title": "Joe Rogan & Trump Rant About Why This Industry Is Almost Dead", "vote": 0}]