[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-09T15:30:21+00:00", "description": "There's little room in the competitive shooter and deck-builder markets, but how about a title that combines the two? Bad Guitar Studio's FragPunk is one such title, mashing the tactical shooting and team play of a title like Valorant with cards that can alter the flow of a match.\n\nYour typical match of Shard Clash consists of attacking to plant the Convertor or defending against the opposition. Weapons range from assault rifles and shotguns to SMGs and snipers, with realistic recoil and spread, while ten playable characters (better known as Lancers) offer unique abilities and playstyles. When the Shard Cards come out, anything goes, from spawning bouncy mushrooms to switching sides.\n\nCouple this with an over-the-top and heavily stylized presentation, and FragPunk looks to be more than another pretender to the hero shooter throne. Check out ten things you should know about it.\n\nNote: Impressions based on closed alpha.", "id": 834580, "language": null, "link": "https://www.youtube.com/watch?v=lsmeGMY-uMg", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/lsmeGMY-uMg/hqdefault.jpg", "title": "FragPunk - 10 NEW Details You Need To Know About This Fast-Paced, Futuristic Hero Shooter", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-09T10:00:45+00:00", "description": "Stop me if you've heard this one before. A live-service looter shooter launches after a suitable, sometimes bordering on excessive, amount of hype. Its player counts, at least on Steam (perhaps other platforms as well), range from underwhelming to horrendous. Then it fades away, popping up occasionally with new seasonal content that barely musters any attention while many wonder how big-time publishers could expect more.\n\nMarvel's Avengers, Suicide Squad: Kill the Justice League, and even Skull and Bones to an extent – it feels like we've seen some variation on this rule throughout the years. However, exceptions always exist. Helldivers 2 proved that a live service title still has commercial appeal, with over 12 million copies sold as of May. We now have Nexon's The First Descendant proving that not all looter shooters are doomed to obscurity.", "id": 832628, "language": null, "link": "https://www.youtube.com/watch?v=iI5_VyFqkdo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/iI5_VyFqkdo/hqdefault.jpg", "title": "Why Are Gamers ADDICTED To The First Descendant?", "user": null, "vote": 0}]