[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T19:30:00+00:00", "description": "Three years on from its original release for the Switch and PC, Monster Hunter Stories 2: Wings of Ruin has made its way over to the PlayStation 4, with the developer porting the game to go along with the launch of its remastered predecessor, and though it obviously isn’t the new mainline entry we’re all waiting with bated breaths for (we’re going to have to wait until next year for that), for fans of the franchise, and especially for fans of traditional JRPGs, it’s still a game that’s rather easy to recommend. \n\nBoasting an endearing and heartfelt story, a genuinely engaging and mechanically complex combat system, meaningful customization options, and a gorgeous art style, Monster Hunter Stories 2 is a solid game that’s worth your time.", "id": 707896, "language": null, "link": "https://www.youtube.com/watch?v=EHp4bIBXY2c", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/EHp4bIBXY2c/hqdefault.jpg", "title": "Monster Hunter Stories 2: Wings of Ruin PS4 Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T15:30:02+00:00", "description": "With Elden Ring: Shadow of the Erdtree launching on June 21st for Xbox, PlayStation and PC, now is a great time to jump into the acclaimed open-world action RPG. What are the best ways to prepare for the expansion, whether you're starting or in the middle of the campaign?\n\nHow do you defeat the bosses necessary to open the path forward to the new content? For that matter, what are some of the consumables and items that you should have handy? What are the best weapons? While it may be a lot of work, preparing for The Land of Shadow is more straightforward than it seems, whether knowing the best Talismans or the ideal ways to stock up on materials.\n\nCheck out 12 ways to prep for Elden Ring: Shadow of the Erdtree and perhaps minimize the amount of inevitable deaths.", "id": 706517, "language": null, "link": "https://www.youtube.com/watch?v=51yFeirqucA", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/51yFeirqucA/hqdefault.jpg", "title": "Elden Ring: Shadow of the Erdtree: 12 BEST WAYS TO PREPARE", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T09:45:00+00:00", "description": "Sony’s catalog of first party properties is a massively impressive one, to say the very least. Starting with the PS1 days, right up until now, PlayStation has done an incredible job of delivering games, experiences, and characters that cannot be found on any other consoles, something that’s unlikely to change anytime soon. \n\nBut though that strategy means there’s never a shortage of great first party exclusives on PlayStation consoles, that abundance of riches means there’s also more than a few properties that have, as a result of being crowded out by other fellow first party franchises, been forced into dormancy. Here, we’re going to talk about a few such franchises that we would love to see sequels for but know how unlikely (if not impossible) that will be.", "id": 704150, "language": null, "link": "https://www.youtube.com/watch?v=4ldJB503uco", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/4ldJB503uco/hqdefault.jpg", "title": "5 Games Every PS5 Fan Wants But Will NEVER GET IT", "user": null, "vote": 0}]