[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T22:46:38.451772+00:00", "description": "The Ukraine cyber police, supported by information from the Dutch police, arrested a 28-year-old Russian man in Kyiv for aiding Conti and LockBit ransomware operations by making their malware undetectable and conducting at least one attack himself. He was arrested on April 18, 2024, as part of a global law enforcement operation known as \"Operation Endgame,\" which took down various botnets and their main operators. \"As the Conti ransomware group used some of those botnets for initial access on breached endpoints, evidence led investigators to the Russian hacker,\" reports BleepingComputer. From the report: The Ukrainian police reported that the arrested individual was a specialist in developing custom crypters for packing the ransomware payloads into what appeared as safe files, making them FUD (fully undetectable) to evade detection by the popular antivirus products. The police found that the man was selling his crypting services to both the Conti and LockBit cybercrime syndicates, hel", "id": 709012, "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/13/2045239/police-arrest-conti-and-lockbit-ransomware-crypter-specialist?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Police Arrest Conti and LockBit Ransomware Crypter Specialist", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T22:46:36.412383+00:00", "description": "An anonymous reader quotes a report from TechCrunch: Amazon says that it will commit up to $230 million to startups building generative AI-powered applications. The investment, roughly $80 million of which will fund Amazon's second AWS Generative AI Accelerator program, aims to position AWS as an attractive cloud infrastructure choice for startups developing generative AI models to power their products, apps and services. Much of the new tranche -- including the entire portion set aside for the accelerator program -- comes in the form of compute credits for AWS infrastructure, meaning that it can't be transferred to other cloud service providers like Google Cloud and Microsoft Azure.\n \nTo sweeten the pot, Amazon is pledging that startups in this year's Generative AI Accelerator cohort will gain access to experts and tech from Nvidia, the program's presenting partner. They will also be invited to join the Nvidia Inception program, which provides companies opportunities to connect with ", "id": 709011, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/13/2054257/amazon-says-itll-spend-230-million-on-generative-ai-startups?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Says It'll Spend $230 Million On Generative AI Startups", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T21:41:31.573749+00:00", "description": "An anonymous reader quotes a report from Singapore's CNA news channel: Kandula Nagaraju, 39, was sentenced to two years and eight months' jail on Monday (Jun 10) for one charge of unauthorized access to computer material. Another charge was taken into consideration for sentencing. His contract with NCS was terminated in October 2022 due to poor work performance and his official last date of employment was Nov 16, 2022. According to court documents, Kandula felt \"confused and upset\" when he was fired as he felt he had performed well and \"made good contributions\" to NCS during his employment. After leaving NCS, he did not have another job in Singapore and returned to India.\n \nBetween November 2021 and October 2022, Kandula was part of a 20-member team managing the quality assurance (QA) computer system at NCS. NCS is a company that offers information communication and technology services. The system that Kandula's former team was managing was used to test new software and programs befor", "id": 708748, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/13/2011245/fired-employee-accessed-ncs-computer-test-system-and-deleted-servers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Fired Employee Accessed NCS' Computer 'Test System' and Deleted Servers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T21:41:29.920503+00:00", "description": "During its earnings call on Monday, Oracle CEO Safra Catz told analysts that it is shutting down its ads business. \"In Q4, we decided to exit the advertising business, which had declined to about $300 million in revenue in fiscal year '24,\" said Catz, according to an earnings transcript. Adweek's Catherine Perloff reports: In August 2022, Business Insider reported that Oracle Advertising made $2 billion in revenue. At the time, revenue was only growing by 2% a year and many employees had been laid off as part of a reorganization in 2022, Business Insider reported. Oracle spent billions on entering the advertising business, acquiring nearly a dozen ad technology companies for over a decade. Notable acquisitions include data firms DataLogix, bought in 2014 for $1.2 billion, and brand safety platform Moat, purchased in 2017 for a reported $850 million. \"Oracle's bet on the advertising industry was undermined when Meta [...] shut down its data to third parties including Oracle in 2018, fo", "id": 708747, "language": "en-us", "link": "https://developers.slashdot.org/story/24/06/13/2027254/oracle-is-shutting-down-its-ad-business?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Oracle Is Shutting Down Its Ad Business", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T20:36:38.540079+00:00", "description": "Speaking of Microsoft, the House Homeland Security committee is grilling Microsoft President Brad Smith Thursday about the software giant's plans to improve its security after a series of devastating hacks reached into federal officials' email accounts, challenging the company's fitness as a dominant government contractor. Washington Post adds:The questioning followed a withering report on one of those breaches, where the federal Cyber Safety Review Board found the event was made possible by a \"cascade of avoidable errors\" and a security culture \"that requires an overhaul.\" In that hack, suspected agents of China's Ministry of State Security last year created digital keys using a tool that allowed them to pose as any existing Microsoft customer. Using the tool, they impersonated 22 organizations, including the U.S. Departments of State and Commerce, and rifled through Commerce Secretary Gina Raimondo's email among others. \n\nThe event triggered the sharpest criticism in decades of the ", "id": 708265, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/13/1946242/congress-seeks-answers-from-microsoft-boss-after-a-cascade-of-security-errors?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Congress Seeks Answers From Microsoft Boss After a 'Cascade' of Security Errors", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T19:31:24.413772+00:00", "description": "The sun fired off a volley of radiation-riddled outbursts in May. When they slammed into Earth's magnetic bubble, the world was treated to iridescent displays of the northern and southern lights. But our planet wasn't the only one in the solar firing line. From a report: A few days after Earth's light show, another series of eruptions screamed out of the sun. This time, on May 20, Mars was blitzed by a beast of a storm. Observed from Mars, \"this was the strongest solar energetic particle event we've seen to date,\" said Shannon Curry, the principal investigator of NASA's Mars Atmosphere and Volatile Evolution orbiter, or MAVEN, at the University of Colorado, Boulder. \n\nWhen the barrage arrived, it set off an aurora that enveloped Mars from pole to pole in a shimmering glow. If they were standing on the Martian surface, \"astronauts could see these auroras,\" Dr. Curry said. Based on scientific knowledge of atmospheric chemistry, she and other scientists say, observers on Mars would have ", "id": 707876, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/13/1922257/mars-got-cooked-by-a-recent-solar-storm?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Mars Got Cooked by a Recent Solar Storm", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T17:21:15.347431+00:00", "description": "Turkish authorities have arrested a student for cheating during a university entrance exam by using a makeshift device linked to AI software to answer questions. From a report: The student was spotted behaving in a suspicious way during the exam at the weekend and was detained by police, before being formally arrested and sent to jail pending trial. Another person, who was helping the student, was also detained.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Turkish+Student+Arrested+For+Using+AI+To+Cheat+in+University+Exam%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F06%2F13%2F1634228%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F06%2F13%2F1634228%2Fturkish-student-arrested-for-using-ai-to-cheat-in-university-exam%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><", "id": 707039, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/13/1634228/turkish-student-arrested-for-using-ai-to-cheat-in-university-exam?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Turkish Student Arrested For Using AI To Cheat in University Exam", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T17:21:13.299078+00:00", "description": "cusco writes: Indian space startup Agnikul used a 3-D printer from German company EOS to print an engine out of inconel, a high-performance nickel-chromium alloy, in one solid piece over the course of roughly 72 hours. While other companies like Relativity Space and Rocket Lab are using 3-D printers extensively, Agnikul's engine is unique in being printed in one go, rather than as multiple components that need to be stitched together. This approach significantly speeds up manufacturing time. \n\nThe single-engine technology demonstration rocket produced 6 kilonewtons of thrust and reached an altitude of 6.5 kilometers before splashing down into the ocean. The launch vehicle used was about 6 meters tall with a single engine, making it roughly equivalent to the second stage of the company's planned commercial product, Agnibaan. Agnibaan will be a two-stage rocket, 18 meters tall, featuring eight engines in total, and capable of carrying a 300-kilogram payload to an altitude of around 700 ", "id": 707038, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/13/1713215/indian-startup-3d-prints-rocket-engine-in-just-72-hours?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Indian Startup 3D Prints Rocket Engine in Just 72 Hours", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T16:17:28.381033+00:00", "description": "Amazon unveiled a new generative AI-powered version of its Alexa voice assistant at a packed event in September 2023, demonstrating how the digital assistant could engage in more natural conversation. However, nearly a year later, the updated Alexa has yet to be widely released, with former employees citing technical challenges and organizational dysfunction as key hurdles, Fortune reported Thursday. The magazine reports that the Alexa large language model lacks the necessary data and computing power to compete with rivals like OpenAI. Additionally, Amazon has prioritized AI development for its cloud computing unit, AWS, over Alexa, the report said. Despite a $4 billion investment in AI startup Anthropic, privacy concerns and internal politics have prevented Alexa's teams from fully leveraging Anthropic's technology.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=How+Amazon+Blew+Alexa's+Shot+To+Dominate+AI%3A+https%3A%2F%2Fslashdot.org%2Fstor", "id": 706557, "language": "en-us", "link": "https://slashdot.org/story/24/06/13/1356217/how-amazon-blew-alexas-shot-to-dominate-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How Amazon Blew Alexa's Shot To Dominate AI", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T16:17:26.835477+00:00", "description": "Assisted driving systems and robot taxis are becoming more popular in China with government help, as cities designate large areas for testing on public roads. From a report: The world's largest experiment in driverless cars is underway on the busy streets of Wuhan, a city in central China with 11 million people, 4.5 million cars, eight-lane expressways and towering bridges over the muddy waters of the Yangtze River. A fleet of 500 taxis navigated by computers, often with no safety drivers in them for backup, buzz around. The company that operates them, the tech giant Baidu, said last month that it would add a further 1,000 of the so-called robot taxis in Wuhan. \n\nAcross China, 16 or more cities have allowed companies to test driverless vehicles on public roads, and at least 19 Chinese automakers and their suppliers are competing to establish global leadership in the field. No other country is moving as aggressively. The government is providing the companies significant help. In additi", "id": 706556, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/13/1345228/china-is-testing-more-driverless-cars-than-any-other-country?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China Is Testing More Driverless Cars Than Any Other Country", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T15:11:08.336674+00:00", "description": "Wells Fargo fired more than a dozen employees last month after investigating claims that they were faking work. From a report: The staffers, all in the firm's wealth- and investment-management unit, were \"discharged after review of allegations involving simulation of keyboard activity creating impression of active work,\" according to disclosures filed with the Financial Industry Regulatory Authority. \"Wells Fargo holds employees to the highest standards and does not tolerate unethical behavior,\" a company spokesperson said in a statement. \n\nDevices and software to imitate employee activity, sometimes known as \"mouse movers\" or \"mouse jigglers,\" took off during the pandemic-spurred work-from-home era, with people swapping tips for using them on social-media sites Reddit and TikTok. Such gadgets are available on Amazon.com for less than $20.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Wells+Fargo+Fires+Employees+for+Faking+Work+By+Simulating", "id": 706079, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/13/1442205/wells-fargo-fires-employees-for-faking-work-by-simulating-keyboard-activity?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Wells Fargo Fires Employees for Faking Work By Simulating Keyboard Activity", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T14:07:49.988736+00:00", "description": "An anonymous reader quotes a report from The Intercept: The Mozilla Foundation,the entity behind the web browser Firefox, is blocking various censorship circumvention add-ons for its browser, including ones specifically to help those in Russia bypass state censorship. The add-ons were blocked at the request of Russia's federal censorship agency, Roskomnadzor -- the Federal Service for Supervision of Communications, Information Technology, and Mass Media -- according to a statement by Mozilla to The Intercept. \"Following recent regulatory changes in Russia, we received persistent requests from Roskomnadzor demanding that five add-ons be removed from the Mozilla add-on store,\" a Mozilla spokesperson told The Intercept in response to a request for comment. \"After careful consideration, we've temporarily restricted their availability within Russia. Recognizing the implications of these actions, we are closely evaluating our next steps while keeping in mind our local community.\"\n \nDevelope", "id": 705593, "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/13/0333251/firefox-browser-blocks-anti-censorship-add-ons-at-russias-request?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Firefox Browser Blocks Anti-Censorship Add-Ons At Russia's Request", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T14:07:47.824979+00:00", "description": "A former Microsoft employee claims the tech giant dismissed his repeated warnings about a security flaw that was later exploited in the SolarWinds hack, prioritizing business interests over customer safety. Andrew Harris, who worked on Microsoft's cloud security team, says he discovered the weakness in 2016 but was told fixing it could jeopardize a multibillion-dollar government contract and the company's competitive edge, ProPublica reported Thursday. \n\nThe flaw, in a Microsoft product called Active Directory Federation Services, allowed hackers to bypass security measures and access sensitive cloud data. Russian hackers exploited the vulnerability in the 2020 SolarWinds attack, breaching several U.S. agencies. Microsoft continues to deny wrongdoing, insisting customer protection is its top priority. The revelations come at a time when Microsoft is facing increasing scrutiny over its security practices and seeks to expand its government business.<p><div class=\"share_submission\">\n<a c", "id": 705592, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/13/1337214/microsoft-chose-profit-over-security-and-left-us-government-vulnerable-to-russian-hack-whistleblower-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Chose Profit Over Security and Left US Government Vulnerable To Russian Hack, Whistleblower Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T10:43:39.535937+00:00", "description": "Roku TV owners are complaining that motion smoothing is \"suddenly enabled on their TVs with no way to turn it off,\" reports The Verge. From the report: Contributors on Reddit and in Roku's community forum reported seeing the change on TCL TVs running on Roku OS 13, as did a few staffers on The Verge. However, for others who have access to \"Expert\" picture settings, the same update is in place without a change, and the settings to control it are still available. For some people experiencing the problem, they said this is the first time their TV offered Roku's motion smoothing feature at all and that there's nowhere in any menu (either the standard settings or the picture settings available while watching TV) to turn it off. The update notes for Roku OS 13 mention a new \"Roku Smart Picture\" feature that will optimize based on the content being watched, so there may be a bug there. However, people in older threads have reported similar issues with some Roku devices before.\n \nA Roku commu", "id": 704343, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/06/13/0325208/roku-tv-owners-complain-that-motion-smoothing-is-stuck-on-after-an-update?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Roku TV Owners Complain That Motion Smoothing Is Stuck 'On' After an Update", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T07:31:08.262384+00:00", "description": "Kent, Wash.-based Stoke Space successfully completed the first hot-fire test of its reusable Nova launch vehicle's first-stage engine, which reached 350,000 hp in under a second during a two-second test on June 5. GeekWire reports: During the two-second test, the engine ramped up to its target starting power level, producing the equivalent of 350,000 hp in less than a second, and held that power level until shutdown. At full power, the full-flow staged combustion engine is designed to produce over 100,000 pounds of thrust. The rocket engine was designed and manufactured in just 18 months. The medium-lift Nova rocket's first-stage booster will be powered by seven of the engines.\n \nStoke successfully conducted a vertical-takeoff-and-landing test flight of its reusable second stage last September. Since then, the company has been focusing on first-stage development. For the rest of this year, Stoke expects to continue maturing its engine and vehicle design while scaling operations for or", "id": 703542, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/13/0317207/stoke-space-scores-a-success-in-first-test-firing-of-engine-for-reusable-nova-booster?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Stoke Space Scores a Success In First Test Firing of Engine For Reusable Nova Booster", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T06:29:21.679013+00:00", "description": "Intel has begun ferrying around 20 \"super loads\" across Ohio for the construction of its new $28 billion Ohio One Campus. The extensive planning and coordination required for these shipments are expected to cause road closures and delays during the nine days of transport. Tom's Hardware reports: Intel's new campus coming to New Albany, OH, is in heavy construction, and around 20 super loads are being ferried across Ohio's roads by the Ohio Department of Transportation after arriving at a port of the Ohio River via barge. Four of these loads, including the one hitting the road now, weigh around 900,000 pounds -- that's 400 metric tons, or 76 elephants. The super loads were first planned for February but were delayed due to the immense planning workload. Large crowds are estimated to accumulate on the route, potentially slowing it even further.\n \nIntel's 916,000-pound shipment is a \"cold box,\" a self-standing air-processor structure that facilitates the cryogenic technology needed to fa", "id": 702527, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/12/2112246/intel-is-trucking-a-916000-pound-super-load-across-ohio-to-its-new-fab?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Is Trucking a 916,000-Pound 'Super Load' Across Ohio To Its New Fab", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T06:29:19.860043+00:00", "description": "Following in the European Union's footsteps, Japan's parliament has enacted a law on Wednesday that will prohibit big tech from blocking third-party app stores. AppleInsider reports: The intention of the bill is that it will facilitate competition and reduce app prices. Japan's government reportedly believes that Apple and Google are a duopoly, and that they charge developers high fees that are then passed on to users. Big tech companies with App Stores will also prohibit companies from prioritizing their own services. Google is likely to be hit hardest by this. Violators will initially be fined up to 20% of the domestic revenue of the specific service that broke the law. The fee can increase to 30%, if the behavior continues.\n \nThe Japanese government's Fair Trade Commission (FTC) will choose which firms to apply it to. Companies that will be regulated will be required to submit compliance reports annually. While it hasn't been explicitly said that Apple and Google must comply, It se", "id": 702526, "language": "en-us", "link": "https://apple.slashdot.org/story/24/06/12/2149219/japan-enacts-law-forcing-third-party-app-stores-on-apple-and-google?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Japan Enacts Law Forcing Third-Party App Stores On Apple and Google", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T06:29:18.054353+00:00", "description": "Rare Earths Norway has discovered Europe's largest proven deposit of rare earth elements in the Fen Carbonatite Complex, positioning Norway as a key player in Europe's effort to reduce reliance on China's rare earths supply. CNBC reports: Rare Earths Norway said in a June 6 statement that its Fen Carbonatite Complex in the southeast of the country boasts 8.8 million metric tons of total rare earth oxides (TREOs) with a reasonable prospect for economic extraction. Within the TREOs, which are considered vital to the global shift away from fossil fuels, the company says there is an estimated 1.5 million metric tons of magnet-related rare earths which can be used in electric vehicles and wind turbines. The discovery eclipses a massive rare earths deposit found last year in neighboring Sweden.\n \nOne of the aims of the Critical Raw Materials Act is to extract at least 10% of the European Union's annual demand for rare earths by 2030 and Rare Earths Norway says it hopes to contribute to that", "id": 702525, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/12/2220203/norway-discovers-europes-largest-deposit-of-rare-earth-metals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Norway Discovers Europe's Largest Deposit of Rare Earth Metals", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T06:29:16.190661+00:00", "description": "An anonymous reader quotes a report from the New York Times: Chemical and manufacturing groups sued the federal government late Monday (Warning: source paywalled; alternative source) over a landmark drinking-water standard that would require cleanup of so-called forever chemicals linked to cancer and other health risks. The industry groups said that the government was exceeding its authority under the Safe Drinking Water Act by requiring that municipal water systems all but remove six synthetic chemicals, known by the acronym PFAS, that are present in the tap water of hundreds of millions of Americans. The Environmental Protection Agency has said that the new standard, put in place in April, will prevent thousands of deaths and reduce tens of thousands of serious illnesses. The E.P.A.'s cleanup standard was also expected to prompt a wave of litigation against chemical manufacturers by water utilities nationwide trying to recoup their cleanup costs. Utilities have also challenged the s", "id": 702524, "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/12/2213204/chemical-makers-sue-over-rule-to-rid-water-of-forever-chemicals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Chemical Makers Sue Over Rule To Rid Water of 'Forever Chemicals'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-13T06:29:14.392946+00:00", "description": "Mark Gurman, reporting for Bloomberg: When Apple Chief Executive Officer Tim Cook and his top deputies this week unveiled a landmark arrangement with OpenAI to integrate ChatGPT into the iPhone, iPad and Mac, they were mum on the financial terms. Left unanswered on Monday: which company is paying the other as part of a tight collaboration that has potentially lasting monetary benefits for both. But, according to people briefed on the matter, the partnership isn't expected to generate meaningful revenue for either party -- at least at the outset. \n\nThe arrangement includes weaving ChatGPT, a digital assistant that responds in plain terms to information requests, into Apple's Siri and new writing tools. Apple isn't paying OpenAI as part of the partnership, said the people, who asked not to be identified because the deal terms are private. Instead, Apple believes pushing OpenAI's brand and technology to hundreds of millions of its devices is of equal or greater value than monetary paymen", "id": 702523, "language": "en-us", "link": "https://apple.slashdot.org/story/24/06/13/0413229/apple-to-pay-openai-for-chatgpt-through-distribution-not-cash?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple To 'Pay' OpenAI for ChatGPT Through Distribution, Not Cash", "user": null, "vote": 0}]