[{"tags": [], "dead": false, "date_published": "2024-02-29T19:00:32+00:00", "permanent": false, "source_obj__id": 129, "language": null, "page_rating_contents": 0, "comments": [], "age": null, "page_rating_visits": 0, "title": "Nightingale Early Access Review - The Final Verdict", "description": "Developed by Inflexion Games, Nightingale is an ambitious effort. It spans multiple Realms, which players can customize and modify on a whim while setting up an intriguing story about the titular city and those struggling to reach it.\n\nUnfortunately, despite a solid aesthetic and interesting lore, Nightingale falters in several ways. Combat is responsive but simplistic and gets repetitive over time. The procedural generation impresses at first, but it's not long before the same points of interest appear despite different conditions. Then there are the abundant server issues and lack of an offline mode.\n\nNightingale is in early access and will continue to grow, and while there is some fun here, the core systems require several revamps and quality-of-life features to reach their potential.", "page_rating": 0, "bookmarked": false, "album": "", "user": null, "artist": "GamingBolt", "link": "https://www.youtube.com/watch?v=sqcvGm7_H1I", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "thumbnail": "https://i4.ytimg.com/vi/sqcvGm7_H1I/hqdefault.jpg", "vote": 0, "page_rating_votes": 0}, {"tags": [], "dead": false, "date_published": "2024-02-29T19:00:09+00:00", "permanent": false, "source_obj__id": 129, "language": null, "page_rating_contents": 0, "comments": [], "age": null, "page_rating_visits": 0, "title": "Does This Terrifying Driving Survival Sim Deliver The Goods?", "description": "Pacific Drive is an odd mash-up of genres, from driving and survival crafting to rogue-lite and supernatural adventure. However, what's most important is that it works, compelling you to delve deeper into the horrors of the Olympic Exclusion Zone.\n\nAs passersby through the Pacific Northwest, players are suddenly transported into the Zone and acquire a strange station wagon. It becomes their greatest asset as they plan routes, explore different regions and find a way out of the Zone. It's much easier said than done, especially with the Anomalies and Instability running amuck.\n\nStill, even with the odd nagging issue or three, Pacific Drive delivers an addictive gameplay loop, whether you're out scavenging for materials to improve your vehicle or learning more about ARDA and its mishaps.", "page_rating": 0, "bookmarked": false, "album": "", "user": null, "artist": "GamingBolt", "link": "https://www.youtube.com/watch?v=8he-l9AcTvA", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "thumbnail": "https://i1.ytimg.com/vi/8he-l9AcTvA/hqdefault.jpg", "vote": 0, "page_rating_votes": 0}, {"tags": [], "dead": false, "date_published": "2024-02-29T15:45:00+00:00", "permanent": false, "source_obj__id": 129, "language": null, "page_rating_contents": 0, "comments": [], "age": null, "page_rating_visits": 0, "title": "15 NEW And Exciting Games of March 2024 (PS5, Xbox Series X | S, PC)", "description": "With February in the bag, it's time to look forward to March and its releases. There are several high-profile releases, from WWE 2K24 and its new 2K Showcase mode to Team Ninja's Rise of the Ronin as players venture through the Bakumatsu era and become embroiled in the conflict between warring factions. \n\nHi-Fi Rush finally makes its way to the PS5, complete with all the post-launch updates, and survival crafting fans can look forward to Winter Survival and its focus on maintaining one's sanity, while farming-focused players can chill with Lightyear Frontier. \n\nTake a look at some of the biggest releases in March 2024.", "page_rating": 0, "bookmarked": false, "album": "", "user": null, "artist": "GamingBolt", "link": "https://www.youtube.com/watch?v=XAYAIGX9980", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "thumbnail": "https://i1.ytimg.com/vi/XAYAIGX9980/hqdefault.jpg", "vote": 0, "page_rating_votes": 0}, {"tags": [], "dead": false, "date_published": "2024-02-29T06:45:03+00:00", "permanent": false, "source_obj__id": 129, "language": null, "page_rating_contents": 0, "comments": [], "age": null, "page_rating_visits": 0, "title": "15 Things You Shouldn't Be IGNORING In Final Fantasy 7 Rebirth", "description": "Final Fantasy 7 Rebirth is a far bigger game than you most of us could have anticipated. As Cloud and company step out beyond the walls of Midgar and into a wider world, Rebirth adopts a fully open world approach, taking players to a vast variety of locations throughout its journey that are brimming with things to do. \n\nAnd of course, given just how astonishingly full to the brim is the game of content, it’s only natural that there will be some that many players may miss entirely. There are some activities in the game, however, that are rewarding for a number of reasons, whether mechanically or narratively, that we would recommend definitely seeking out. Here, we’re going to talk about a few of them.", "page_rating": 0, "bookmarked": false, "album": "", "user": null, "artist": "GamingBolt", "link": "https://www.youtube.com/watch?v=kMPfXbB5hi8", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "thumbnail": "https://i4.ytimg.com/vi/kMPfXbB5hi8/hqdefault.jpg", "vote": 0, "page_rating_votes": 0}]