[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-20T17:30:06+00:00", "description": "A Quiet Place: The Road Ahead might cater to fans of the movies, from the reference to Day One or the homage to the first film's ending. If you're a horror game enthusiast looking for some substitute for Alien: Isolation or even Amnesia: The Bunker, it may be worth checking out for a discount. However, if anything, it'll only make you appreciate those titles much more.", "id": 1357824, "language": null, "link": "https://www.youtube.com/watch?v=hWIhWfPfQ9A", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/hWIhWfPfQ9A/hqdefault.jpg", "title": "A Quiet Place: The Road Ahead Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-20T15:30:24+00:00", "description": "Dragon Age: The Veilguard is Bioware’s 4th game in the dark fantasy series and releases on October 31st after a decade since its last entry. The Veilguard opts for a far more colorful art style, sporting neon purples and cartoony characters, but it keeps the great character dynamics from classic Bioware systems intact. \n\nThe Lighthouse, for example, serves as the main hub where each party member decorates their abode and furthers their bond with the main character, named Rook. Your decisions impact character dynamics and follow through in gameplay through special party member abilities and combos. \n\nSpeaking of combos, the combat in The Veilguard is more fast-paced and seamless than ever. You can still pause combat with the skill wheel and order party commands and initiate combos, but the game delivers a smooth un-interrupted combat. We’ll see how well The Veilguard honors the classic Bioware series when it comes out late October.", "id": 1357391, "language": null, "link": "https://www.youtube.com/watch?v=h9ojQ8a6lPc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/h9ojQ8a6lPc/hqdefault.jpg", "title": "Can Dragon Age: The Veilguard Be One of the Biggest Games of the Year?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-20T13:30:32+00:00", "description": "Racing games are as old as video games themselves. The genre has grown over the decades to be supremely varied to hard-as-nails simulations with complex setup customisation, from arcade style drifters to crazy go-kart racing – it’s all covered. \n\nIf you can strap an engine to it, you can recreate it in pixels and stick it on a digital racetrack to provide amongst the most thrilling of video game experiences possible. \n\nThis video aims to highlight the best racing games of all time – as frivolous a task as that is. Despite the uphill struggle in finalising a list of just 15, this rundown highlights the breadth of variety racing games provide, with realism and arcade both considered.", "id": 1356920, "language": null, "link": "https://www.youtube.com/watch?v=iE_EnMYkWEc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/iE_EnMYkWEc/hqdefault.jpg", "title": "15 Most Essential Racing Games You Need To Play [2024 Edition]", "vote": 0}]