[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "New Cycle Early Access Review - The Final Verdict", "description": "New Cycle is the latest survival city-builder out now on PC via Steam Early Access. It's a genre best defined by Frostpunk, one where moral decisions play as big of a part as managing resources and ensuring the future of in-game NPCs.\n\nWhile New Cycle purports to offer those dilemmas, it doesn't prompt the same emotional investment. The events where choices could have rippling effects on your burgeoning settlement of survivors also offer little actual choice. That's before getting into the gameplay, with the skewed nature of disasters and the onset of sickness providing tedious difficulty spikes.\n\nEven with all that in mind, New Cycle's current early access state doesn't offer much outside your usual city-builder. It could improve and grow into something more. For now, it leaves you wanting.", "link": "https://www.youtube.com/watch?v=9E-ITq37ax8", "date_published": "2024-01-19T18:00:17+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i2.ytimg.com/vi/9E-ITq37ax8/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Why Final Fantasy 7: Rebirth Is Shaping Up to Be One of the Biggest Games of the Year", "description": "Final Fantasy 7 Remake is a sequel to one of the genre’s most acclaimed games in a long time. \n\nBut looking at the game itself, there’s still a deluge of reasons for why Rebirth is looking as promising as it is, whether that’s its continued insistence on subverting expectations with its setting or the significant expansions it’s making to the structure of its world. Here, we’re going to talk about all of that and more.", "link": "https://www.youtube.com/watch?v=5rg216UMkUw", "date_published": "2024-01-19T14:30:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i2.ytimg.com/vi/5rg216UMkUw/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Indiana Jones And The Great Circle - 10 BRAND NEW Details You Likely Missed", "description": "Three years on from official confirmation that an Indiana Jones game was indeed in the works at MachineGames, it has now been officially showcased. \n\nFrom its first person gameplay to its emphasis on cinematic storytelling, from how its gameplay will blend puzzles with stealth and gritty and grounded combat to what we can expect from its narrative premise, there’s plenty that’s been revealed about Indiana Jones and the Great Circle, and here, we’re going to talk about a few of the most pertinent of those details.", "link": "https://www.youtube.com/watch?v=xnoFAGJ84g8", "date_published": "2024-01-19T09:30:21+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i1.ytimg.com/vi/xnoFAGJ84g8/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]