[{"source": "https://pluralistic.net/feed", "title": "Pluralistic: Kelly and Zach Weinersmith's \"A City On Mars\" (09 Jan 2024)", "description": "Today's links Kelly and Zach Weinersmith's \"A City On Mars\": Life in space sucks, is grotesquely expensive, and produces little useful science. Hey look at this: Delights to delectate. This day in history: 2004, 2009, 2014, 2019 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Kelly and Zach Weinersmith's \"A City On Mars\" (permalink) In A City On Mars, biologist Kelly Weinersmith and cartoonist Zach Weinersmith set out to investigate the governance challenges of the impending space settlements they were told were just over the horizon. Instead, they discovered that humans aren't going to be settling space for a very long time, and so they wrote a book about that instead: https://www.acityonmars.com/ The Weinersmiths make the (convincing) case that ever aspect of space settlement is vastly beyond our current or reasonably foreseeable technical capability. What's more, every argument in favor of pursuing space settlement is errant no", "link": "https://pluralistic.net/2024/01/09/astrobezzle", "date_published": "2024-01-09T16:00:53+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": null, "album": "", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://pluralistic.net/feed", "title": "Pluralistic: Molly McGhee's \"Jonathan Abernathy You Are Kind\" (08 Jan 2024)", "description": "Today's links Molly McGhee's \"Jonathan Abernathy You Are Kind\": A haunting novel of debt, work, dreams, and the capitalist nightmare. Hey look at this: Delights to delectate. This day in history: 2004, 2009, 2014, 2019, 2023 Colophon: Recent publications, upcoming/recent appearances, current writing projects, current reading Molly McGhee's \"Jonathan Abernathy You Are Kind\" (permalink) Jonathan Abernathy You Are Kind is Molly McGhee's debut novel: a dreamlike tale of a public-private partnership that hires the terminally endebted to invade the dreams of white-collar professionals and harvest the anxieties that prevent them from being fully productive members of the American corporate workforce: https://www.penguinrandomhouse.com/books/734829/jonathan-abernathy-you-are-kind-by-molly-mcghee/ Though this is McGhee's first novel, she's already well known in literary circles. Her career has included stints at McSweeney's, where she worked on my book Information Doesn't Want To Be Free: htt", "link": "https://pluralistic.net/2024/01/08/capitalist-surrealism", "date_published": "2024-01-09T00:47:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": null, "album": "", "user": null, "language": "en-US", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]