[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 Little-Known Upcoming Shooters To Keep An Eye On", "description": "From first person to third person, from multiplayer focused to narrative driven, from multiplatform giants to platformer exclusives, the combined category of shooters of all manner is one that the AAA scene in the games industry can never seem to get enough of. \n\nAt the same time, however, there are also plenty of promising shooters in the works that are significantly smaller and not nearly as well known. \n\nHere, we take a look at a few such upcoming lesser known shooters, ranging across a variety of different genres and aesthetics, that have caught our eye with their early showings and shown enough promise that we would recommend keeping an eye on them in the lead up to their respective releases.", "link": "https://www.youtube.com/watch?v=YNaD3wq-EVo", "date_published": "2024-01-09T13:30:22+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i2.ytimg.com/vi/YNaD3wq-EVo/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "20 BIG PS5 Exclusive Games To Look Forward To In 2024 And Beyond", "description": "Marvel's Spider-Man 2 and Final Fantasy 16 dominated headlines last year, while Ragnarok received extensive acclaim for its free Valhalla DLC. Now that we're into 2024, everyone wants to know: What's next for the PS5?\n\nFortunately, the year and beyond are rife with big-name exclusives, whether first-party or published exclusively for Sony's current-gen console. The coming months alone promise big-time exclusives like Rise of the Ronin, Pacific Drive, Helldivers 2 and The Last of Us Part 2 Remastered.\n\nThen there are titles like Death Stranding 2, The Winds Rising, Marvel's Wolverine, Silent Hill 2, Fairgame$, Concord and more, which look enticing despite not having release dates. Let's examine each title and why you should look forward to their releases.", "link": "https://www.youtube.com/watch?v=BEeZdqZwaaY", "date_published": "2024-01-09T09:30:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "", "user": null, "language": null, "thumbnail": "https://i3.ytimg.com/vi/BEeZdqZwaaY/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]