[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T18:30:13+00:00", "description": "Nothing pulls you into a game’s world quite like a carefully crafted story. The fifteen games featuring on this rundown take full advantage of the medium’s interactivity to provide an emotionally captivating, truly memorable experience. \n\nThe other thing these games demonstrate is that great storytelling can occur across numerous genres beyond action RPGs and single player adventures (although these feature heavily too). \n\nHorror games, for instance, deliver emotionally charged payoff by mixing well-conceived characters through a carefully crafted, suitably twisted narrative. It’s not just about creating a good looking environment for them to inhabit, it’s the story which fills the world with soul, and for that reason good story telling sits alongside gameplay as arguably the most important aspect of a great video game.\n\nIntro 0:00\nNumber 1 0:23\nNumber 2 0:46\nNumber 3 1:35\nNumber 4 2:25\nNumber 5 3:26\nNumber 6 3:56\nNumber 7 4:16\nNumber 8 4:45\nNumber 9 5:32\nNumber 10 6:08\nNumber 11 6:46", "id": 1053560, "language": null, "link": "https://www.youtube.com/watch?v=AxI1oFzaNJ0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/AxI1oFzaNJ0/hqdefault.jpg", "title": "15 NEW Story Heavy Games of 2024 And Beyond You Can't Afford To Miss", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T09:30:03+00:00", "description": "After spending a few hours in Game Science's Black Myth: Wukong, it becomes apparent that this isn't a straightforward action RPG. Between the epic set pieces and excellent battles, there are some additional things to discover, leading to secret bosses and areas.\n\nCertain side quests can start simply enough but spiral into battles against multiple secret bosses, to say nothing of locations like Purple Cloud Mountain that would be missed without venturing off the beaten path. Some of these bosses are far from easy, and it can be a big ask to venture off the beaten path.\n\nHowever, besides bonus rewards, items, and equipment, there are crafting materials for stronger weapons to unlock. You may even get a different ending later. Here are 15 things you likely missed in Black Myth: Wukong, where to find them, how to activate them, and much more.", "id": 1052293, "language": null, "link": "https://www.youtube.com/watch?v=A9rmw1Vdkoc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/A9rmw1Vdkoc/hqdefault.jpg", "title": "Black Myth: Wukong - 15 Secrets MANY GAMERS Haven’t Found", "user": null, "vote": 0}]