[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T23:30:20.402303+00:00", "description": "Telegram's billionaire founder/CEO Pavel Durov was arrested Saturday night outside Paris, reports Reuters, citing French TV news stations TF1 TV and BFM TV which attributed the news to unnamed sources:\n\nDurov was travelling aboard his private jet, TF1 said on its website, adding he had been targeted by an arrest warrant in France as part of a preliminary police investigation. TF1 and BFM both said the investigation was focused on a lack of moderators on Telegram, and that police considered that this situation allowed criminal activity to go on undeterred on the messaging app. \n\nThanks to long-time Slashdot reader sinij for sharing the news.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Telegram+CEO+Arested+In+France%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F08%2F24%2F2253249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.co", "id": 1054509, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/24/2253249/telegram-ceo-arested-in-france?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Telegram CEO Arested In France", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T22:25:47.476590+00:00", "description": "Reuters reports that the Iranian hacking team which compromised the campaign of U.S. presidential candidate Donald Trump \"is known for placing surveillance software on the mobile phones of its victims, enabling them to record calls, steal texts and silently turn on cameras and microphones, according to researchers and experts who follow the group.\"\n\n\nKnown as APT42 or CharmingKitten by the cybersecurity research community, the accused Iranian hackers are widely believed to be associated with an intelligence division inside Iran's military, known as the Intelligence Organization of the Islamic Revolutionary Guard Corps or IRGC-IO. Their appearance in the U.S. election is noteworthy, sources told Reuters, because of their invasive espionage approach against high-value targets in Washington and Israel. \"What makes (APT42) incredibly dangerous is this idea that they are an organization that has a history of physically targeting people of interest,\" said John Hultquist, chief analyst with ", "id": 1054178, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/24/210255/invasive-iranian-intelligence-group-believed-to-be-the-ones-who-breached-trumps-campaign?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Invasive' Iranian Intelligence Group Believed to Be The Ones Who Breached Trump's Campaign", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T22:25:45.933586+00:00", "description": "Microsoft will meet with CrowdStrike and other security companies\" on September 10, reports CNBC, to \"discuss ways to evolve\" the industry after a faulty CrowdStrike software update in July caused millions of Windows computers to crash:\n\n\n [An anonymous Microsoft executive] said participants at the Windows Endpoint Security Ecosystem Summit will explore the possibility of having applications rely more on a part of Windows called user mode instead of the more privileged kernel mode... Attendees at Microsoft's September 10 event will also discuss the adoption of eBPF technology, which checks if programs will run without triggering system crashes, and memory-safe programming languages such as Rust, the executive said. \n\nWednesday Crowdstrike argued no cybersecurity vendor could \"technically\" guarantee their software wouldn't cause a similar incident. \n\nOn a possibly related note, long-time Slashdot reader 278MorkandMindy shares their own thoughts:\n\n The \"year of the Linux desktop\" is alw", "id": 1054177, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/24/2216232/how-should-cybersecurity-evolve-after-crowdstrikes-outage?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How Should Cybersecurity Evolve After Crowdstrike's Outage?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T20:25:50.410555+00:00", "description": "The Verge's Adi Robertson reports: An appeals court revived a lawsuit against the anonymous messaging service Yolo, which allegedly broke a promise to unmask bullies on the app. In a ruling (PDF) issued Thursday, the Ninth Circuit Court of Appeals said Section 230 of the Communications Decency Act shouldn't block a claim that Yolo misrepresented its terms of service, overruling a lower court decision. But it determined the app can't be held liable for alleged design defects that allowed harassment, letting a different part of that earlier ruling stand.\n \nYolo was a Snapchat-integrated app that let users send anonymous messages, but in 2021, it was hit with a lawsuit after a teenage user died by suicide. The boy, Carson Bride, had received harassing and sexually explicit messages from anonymized users that -- he believed -- he likely knew. Bride and his family attempted to contact Yolo for help, but Yolo allegedly never answered, and in some cases, emails to the company simply bounced.", "id": 1053220, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/24/0019232/families-can-sue-app-developer-for-breaking-its-anti-bullying-pledge-says-court?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Families Can Sue App Developer For Breaking Its Anti-Bullying Pledge, Says Court", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T20:25:47.786170+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Volkswagen will wait to see what electric car demand is like before building out all six of its previously planned battery factories. Thomas Schmall, VW's board member in charge of technology, told a German newspaper that \"building battery cell factories is not an end to itself\" and that a goal of 200 GWh of lithium-ion cells by 2030 was not set in stone. [...] For VW, the previous goal of 200 GWh by 2030 from six factories (through a new subsidiary called PowerCo) could now be just 170 GWh capacity from three already-announced plants in Valencia, Spain; Ontario, Canada; and Salzgitter, Germany. If necessary, Schmall said that the Spanish and Canadian battery factories could be expanded to meet additional demand. This battery news follows another sign of slowing confidence in EVs at VW. Last week, it emerged that the company has pushed back plans for the ID.4's successor, which now may not see showrooms until 2032.<p><div class=\"s", "id": 1053219, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/24/0025240/as-ev-sales-slump-volkswagen-scales-back-battery-factories-buildout?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "As EV Sales Slump, Volkswagen Scales Back Battery Factories Buildout", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T20:25:45.787355+00:00", "description": "Alien: Romulus director Fede &#195;lvarez \"briefly dropped into an Alien franchise subreddit this week to chat with fans about his new sequel,\" reports Deadline. \"But the moderators weren't having it, flagging &#195;lvarez as an imposter in a notice that he is 'permanently banned' from the subreddit.\"\n\nThe moderator shared an update that &#195;lvarez \"was immediately reinstated and had a very friendly conversation with us. Awesome guy.\" They also shared the filmmaker's response. \"I'm sorry, just found it hilarious,\" wrote &#195;lvarez. \"My bad. Not harm done. Thanks again for such great work moderating my favorite subreddit.\" \n\nFangoria notes this might not be the last Alien movie from director Alvarez:\nTalking with The Hollywood Reporter earlier this week, the Evil Dead and Don't Breathe director teased that ideas are in the pipeline for an Alien: Romulus sequel, which would &mdash; if it comes to fruition &mdash; be the eighth instalment in the legendary sci-fi horror franchise.\" \nT", "id": 1053218, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/08/24/0314201/alien-romulus-director-unbanned-from-subreddit-after-erroneous-accusations-he-was-impersonating-himself?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Alien: Romulus' Director Unbanned from Subreddit After Erroneous Accusations He Was Impersonating... Himself", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T20:25:43.727318+00:00", "description": "Monday brought spectacular footage of an explosion at a UK rocket test site after an engine test went awry. The plan had been to test-fire all of a rocket stage's nine engines at the same time &mdash; they've successfully ignited the mores more than a hundred times &mdash; but this time one of the first eight had an \"unusual\" anomaly &mdash; \"most likely a fire in the oxygen pump,\" according to a video posted by space company RFA on X.com. \n\nThe trouble \"spread onto neighboring engines,\" eventually leading to a billowing jet of fire from the side of the vehicle. (\"The engine-propellant manifold system was damaged to such a great extent that kerosene kept fueling the fire.\") \n\n\n\nSlashdot reader AleRunner writes:\n\nA rocket company has vowed to return to regular operations \"as soon as possible\" after an explosion during a test at the UK's new spaceport in Shetland. The explosion happened after \"an \"anomaly\" had led to \"the loss of the stage\" &mdash; but there were no injuries according t", "id": 1053217, "language": "en-us", "link": "https://news.slashdot.org/story/24/08/24/068205/rfa-explains-how-its-uk-rocket-engine-test-led-to-mondays-spectacular-explosion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "RFA Explains How Its UK Rocket Engine Test Led to Monday's Spectacular Explosion", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T20:25:41.738147+00:00", "description": "Under the streets of New York City, they're testing a \"quantum network,\" reports Phys.org &mdash; where engineers from a Brooklyn company named Qunnect Inc are taking steps to \"overcome the fragility of entangled states in a fiber cable and ensure the efficiency of signal delivery.\"\n\nFor their prototype network, the Qunnect researchers used a leased 34-kilometer-long fiber circuit they called the GothamQ loop. Using polarization-entangled photons, they operated the loop for 15 continuous days, achieving an uptime of 99.84% and a compensation fidelity of 99% for entangled photon pairs transmitted at a rate of about 20,000 per second. At a half-million entangled photon pairs per second, the fidelity was still nearly 90%... \nThey sent 1,324 nm polarization-entangled photon pairs in quantum superpositions through the fiber, one state with both polarizations horizontal and the other with both vertical &mdash; a two-qubit configuration more generally known as a Bell state. In such a superpo", "id": 1053216, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/24/1618227/quantum-internet-prototype-runs-for-15-days-under-new-york-city?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Quantum Internet Prototype Runs For 15 Days Under New York City", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T20:25:39.875063+00:00", "description": "NASA's 2022 DART mission \"successfully demonstrated how a fast-moving spacecraft could change an asteroid's trajectory by crashing into it,\" remembers Gizmodo, \"potentially providing a way to defend Earth &mdash; though the asteroid in this test was never a real threat.\" \n\nBut a followup study suggests debris from that 525-foot (160-meter) asteroid \"could actually strike back,\" they add, \"though we're not in any danger.\"\n\n\nThe [DART] team posits that the collision produced a field of rocky ejecta that could reach Earth within 10 years... [Various aerospace scientists] studied data collected by the Light Italian CubeSat for Imaging of Asteroids, or LICIACube, which observed DART's impact of Dimorphos up close. Then, they fed LICIACube's data into supercomputers at NASA's Navigation and Ancillary Information Facility to simulate how the debris from the asteroid &mdash; basically dust and rock &mdash; may have disseminated into space. The simulations tracked about 3 million particles kic", "id": 1053215, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/24/0517222/nasa-smashed-into-an-asteroid-in-2022-the-debris-could-end-up-reaching-earth?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA Smashed into an Asteroid in 2022. The Debris Could End Up Reaching Earth", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T20:25:37.877129+00:00", "description": "He was employee #13 at Apple Computers &mdash; after impressing Steve Wozniak and Steve Jobs with his \"blue box\" phone-phreaking technique. Now 81-year-old John \"Captain Crunch\" Draper has launched a new YouTube channel and web site. \n\n\"I spent decades exploring the depths of communication technology,\" Draper says in a recent video, \"always pushing the boundaries of what's possible, and challenging the status quo.\" The video is embedded at the top of the new web site, welcoming visitors to \"your gateway to my world, where I share everything from my secrets the early phone freaking days to the latest in emergency communication systems that could one day save your life.\"\n\n\"Here you'll find insights into my current projects including advanced uses of artificial intelligence, emergency communication preparedness, and much more. Whether you're a technology enthusiast, a fellow veteran, or someone curious about the unseen forces that connect our world, here's something for you.\" \nAnd clicki", "id": 1053214, "language": "en-us", "link": "https://apple.slashdot.org/story/24/08/24/1816206/whats-81-year-old-john-captain-crunch-draper-doing-now?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "What's 81-Year-Old John 'Captain Crunch' Draper Doing Now?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T20:25:35.729680+00:00", "description": "Boeing \"will return its Starliner capsule from the International Space Station without the NASA astronauts,\" reports CNBC. Though they've been on the space station since early June, the plan is to have them stay \"for about six more months before flying home in February on SpaceX's Crew-9 vehicle. \n\"The test flight was originally intended to last about nine days.\"\n\nThe decision to bring Starliner back from the ISS empty marks a dramatic about-face for NASA and Boeing, as the organizations were previously adamant that the capsule was the primary choice for returning the crew. But Starliner's crew flight test, which had been seen as the final major milestone in the spacecraft's development, faced problems &mdash; most notably with its propulsion system. \n\n\"Boeing has worked very hard with NASA to get the necessary data to make this decision,\" NASA Administrator Bill Nelson said during a press conference with top NASA officials at Johnson Space Center in Houston on Saturday. \"We want to f", "id": 1053213, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/24/1919225/nasa-says-spacex-will-bring-boeings-starliner-astronauts-back-to-earth---in-february?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA Says SpaceX Will Bring Boeing's Starliner Astronauts Back to Earth - in February", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T08:08:54.456712+00:00", "description": "Chinese scientists have developed a new method to produce significant quantities of water from lunar soil brought back by the Chang'e-5 mission in 2020, state broadcaster CCTV reported. The \"brand-new method\" involves heating moon minerals containing hydrogen to generate water vapor, which could be crucial for future lunar research stations and space exploration. Reuters reports: \"After three years of in-depth research and repeated verification, a brand-new method of using lunar soil to produce large amounts of water was discovered, which is expected to provide important design basis for the construction of future lunar scientific research stations and space stations,\" said CCTV. The discovery could have important implications for China's decades-long project of building a permanent lunar outpost amid a U.S.-China race to find and mine the moon's resources.\n \nUsing the new method, one tonne of lunar soil will be able to produce about 51-76 kg of water, equivalent to more than a hundre", "id": 1051945, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/23/2343202/chinese-scientists-use-lunar-soil-to-produce-water-state-media-reports?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Chinese Scientists Use Lunar Soil To Produce Water, State Media Reports", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T05:00:56.143710+00:00", "description": "An anonymous reader shares a report: Language models generate text based on statistical probabilities. This led to serious false accusations against a veteran court reporter by Microsoft's Copilot. German journalist Martin Bernklau typed his name and location into Microsoft's Copilot to see how his culture blog articles would be picked up by the chatbot, according to German public broadcaster SWR. The answers shocked Bernklau. Copilot falsely claimed Bernklau had been charged with and convicted of child abuse and exploiting dependents. It also claimed that he had been involved in a dramatic escape from a psychiatric hospital and had exploited grieving women as an unethical mortician. \n\nCopilot even went so far as to claim that it was \"unfortunate\" that someone with such a criminal past had a family and, according to SWR, provided Bernklau's full address with phone number and route planner. I asked Copilot today who Martin Bernklau from Germany is, and the system answered, based on the", "id": 1051166, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/23/1931257/microsofts-copilot-falsely-accuses-court-reporter-of-crimes-he-covered?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft's Copilot Falsely Accuses Court Reporter of Crimes He Covered", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T05:00:54.593797+00:00", "description": "An anonymous reader quotes a report from the Financial Post: You may find yourself smelling crayons in the aisles of stores soon -- if Crayola's chief executive Pete Ruggiero has his way. In July, the U.S. Patent and Trademark Office issued a trademark to the arts and crafts giant for the smell of its crayons -- that waxy scent of a childhood spent trying to color within the lines. While it's too soon for this back-to-school season, Ruggiero imagines one day pumping it through the aisles of retailers, triggering nostalgia while shoppers are browsing and hopefully buying more crayons.\n \nCrayola, a unit of Hallmark, first applied for the trademark in 2018 and was initially turned down less than a year later, but won its bid on appeal. During the process, the company shared examples of its own crayons as well as competitors to verify the distinctiveness. It's a \"slightly earthy soap with pungent, leather-like clay undertones,\" according to the trademark documents. \"We've been talking abo", "id": 1051165, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/23/203220/crayola-trademarks-the-smell-of-its-crayons?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Crayola Trademarks the Smell of Its Crayons", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T05:00:53.038727+00:00", "description": "Wyoming is pioneering the next phase of crypto growth by creating its own U.S. dollar-backed stablecoin, the Wyoming stable token. The state aims for an early 2025 launch and have it serve as a model for a digitized dollar at the federal level, while also using the token's reserves to fund public schools. CNBC reports: Wyoming is currently vetting potential partners and vendors with more tech expertise to help build the stable token. It will require an exchange and wallet providers -- Coinbase and Kraken, for example, offer both -- to purchase and hold the token. The state plans to issue the token to an exchange so the exchange can issue it to the retail user. From there, it should be just another payment method for everyday things, said Flavia Naves, a commissioner at the Wyoming Stable Token Commission. \"When you walk into Cowboy Coffee in Jackson, Wyoming, and you want to buy your latte, there's going to be their wallet there in Solana that you can use to buy your coffee with the W", "id": 1051164, "language": "en-us", "link": "https://slashdot.org/story/24/08/23/2012238/wyoming-is-pushing-crypto-payments-trying-to-beat-the-fed-to-a-digital-dollar?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Wyoming Is Pushing Crypto Payments, Trying To Beat the Fed To a Digital Dollar", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T05:00:51.007461+00:00", "description": "The Register's Connor Jones reports: The U.S. is suing one of its leading research universities over a litany of alleged failures to meet cybersecurity standards set by the Department of Defense (DoD) for contract awardees. Georgia Institute of Technology (GIT), commonly referred to as Georgia Tech, and its contracting entity, Georgia Tech Research Corporation (GTRC), are being investigated following whistleblower reports from insiders Christopher Craig and Kyle Koza about alleged (PDF) failures to protect controlled unclassified information (CUI). The series of allegations date back to 2019 and continued for years after, although Koza was said to have identified the issues as early as 2018.\n \nAmong the allegations is the suggestion that between May 2019 and February 2020, Georgia Tech's Astrolavos Lab -- ironically a group that focuses on cybersecurity issues affecting national security -- failed to develop and implement a cybersecurity plan that complied with DoD standards (NIST 800", "id": 1051163, "language": "en-us", "link": "https://yro.slashdot.org/story/24/08/23/2039232/us-sues-georgia-tech-over-alleged-cybersecurity-failings-as-a-pentagon-contractor?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Sues Georgia Tech Over Alleged Cybersecurity Failings As a Pentagon Contractor", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T05:00:49.408742+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Amazon may be forced to meet some unionized delivery drivers at the bargaining table after a regional National Labor Relations Board (NLRB) director determined Thursday that Amazon is a joint employer of contractors hired to ensure the e-commerce giant delivers its packages when promised. This seems like a potentially big loss for Amazon, which had long argued that delivery service partners (DSPs) exclusively employed the delivery drivers, not Amazon. By rejecting its employer status, Amazon had previously argued that it had no duty to bargain with driver unions and no responsibility for alleged union busting, The Washington Post reported.\n \nBut now, after a yearlong investigation, the NLRB has issued what Amazon delivery drivers' union has claimed was \"a groundbreaking decision that sets the stage for Amazon delivery drivers across the country to organize with the Teamsters.\" In a press release reviewed by Ars, the NLRB regional ", "id": 1051162, "language": "en-us", "link": "https://slashdot.org/story/24/08/23/2048251/labor-board-confirms-amazon-drivers-are-employees-in-finding-hailed-by-union?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Labor Board Confirms Amazon Drivers Are Employees, In Finding Hailed By Union", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T05:00:47.848703+00:00", "description": "After a couple of years of regular use, Samsung's $400 Galaxy Ring will end up contributing to the growing e-waste problem. \"The Galaxy Ring -- and all smart rings like it -- comes with a huge string attached,\" writes iFixit in a blog post. \"It's 100% disposable, just like the AirPod-style Buds3 that Samsung just released. The culprit? The lithium ion batteries.\" ZDNet reports: The problem is the battery, and how they have a finite lifespan. Usually that's about 400 recharge cycles, and after that the batteries are finished. And if you can't replace it, then it's the end of the line for the gadget, and it's tossed onto the e-waste pile. [...]\n \niFixit is damning about this sort of tech. \"There's nothing wrong with simple but there is something wrong with unrepairable. Just like the Galaxy Buds3, the Galaxy Ring is a disposable tech accessory that isn't designed to last more than two years.\" And the bottom line is simple: \"We can't recommend buying disposable tech like this.\" Here's wh", "id": 1051161, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/08/23/215208/ifixit-the-samsung-galaxy-ring-is-400-of-disposable-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "iFixit: The Samsung Galaxy Ring Is $400 of 'Disposable Tech'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T05:00:46.283224+00:00", "description": "Nearly 200 Google DeepMind workers signed a letter urging Google to cease its military contracts, expressing concerns that the AI technology they develop is being used in warfare, which they believe violates Google's own AI ethics principles. \"The letter is a sign of a growing dispute within Google between at least some workers in its AI division -- which has pledged to never work on military technology -- and its Cloud business, which has contracts to sell Google services, including AI developed inside DeepMind, to several governments and militaries including those of Israel and the United States,\" reports TIME Magazine. \"The signatures represent some 5% of DeepMind's overall headcount -- a small portion to be sure, but a significant level of worker unease for an industry where top machine learning talent is in high demand.\" From the report: The DeepMind letter, dated May 16 of this year, begins by stating that workers are \"concerned by recent reports of Google's contracts with milit", "id": 1051160, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/23/2117212/workers-at-google-deepmind-push-company-to-drop-military-contracts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Workers at Google DeepMind Push Company to Drop Military Contracts", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-24T05:00:44.714815+00:00", "description": "An anonymous reader quotes a report from The Guardian: Just under a year ago, the east coast of Greenland was hit by a megatsunami. Triggered by a large landslide entering the uninhabited Dickson Fjord, the resulting tsunami was 200 meters high -- equivalent to more than 40 double-decker buses. Luckily no one was hurt, though a military base was obliterated. Now analysis of the seismic data associated with the event has revealed that the tsunami was followed by a standing wave, which continued to slosh back and forth within the narrow fjord for many days.\n \nAngela Carrillo Ponce from the German Research Centre for Geosciences in Potsdam, analyzed the seismic data, recorded at earthquake monitoring stations more than 3,000 miles (5,000km) away, and found signals persisting long after the 16 September 2023 landslide event. Using satellite images and computer modeling, Ponce and her colleagues were able to confirm the presence of a standing wave of about 1 meter in height which lasted fo", "id": 1051159, "language": "en-us", "link": "https://news.slashdot.org/story/24/08/23/2337203/megatsunami-risk-on-the-rise-as-glacial-melt-drives-landslides?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Megatsunami Risk On the Rise As Glacial Melt Drives Landslides", "user": null, "vote": 0}]