[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-02T16:30:21+00:00",
        "description": "S.T.A.L.K.E.R. 2: Heart of Chornobyl is a gigantic game, with a winding rollercoaster of a story that takes its sweet time to get going, goes through a multitude of ups and downs, and ends in dramatic fashion. \n\nOf course, that ending changes based on key decisions made by players at specific junctures in the story, but regardless which of the game’s four endings you get, there’s a whole lot to digest. \n\nWith GSC Game World having confirmed that S.T.A.L.K.E.R. 2 will receive two post-launch expansions and with the possibility of STALKER 3 very much open, there will be many who’ll be looking at the game’s ending to see how it sets things up for the future. That, in fact, is exactly what we discuss here- because there sure is a lot to unpack.",
        "id": 1627725,
        "language": null,
        "link": "https://www.youtube.com/watch?v=u08ySalYje8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/u08ySalYje8/hqdefault.jpg",
        "title": "STALKER 2 Ending Explained, And How It Sets Up STALKER 3 And Future Expansions",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-02T13:30:15+00:00",
        "description": "Warhammer 40,000: Darktide was originally released on PC before eventually making its way on to Xbox Series X/S, and now, on PS5. Thanks to two years' worth of updates that have overhauled just about every aspect of the game, Darktide is in a great state compared to its launch version. \n\nThe co-op title has four players take on the role of different classes as they are thrown into the midst of an enemy incursion. Along the way, the players will also solve a mystery and kill enough insurgents to fill their armories with a host of different weapons and outfits.",
        "id": 1626784,
        "language": null,
        "link": "https://www.youtube.com/watch?v=EQdGn6uVaL4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/EQdGn6uVaL4/hqdefault.jpg",
        "title": "Warhammer 40,000: Darktide PS5 Review - Everything You Need To Know BEFORE YOU PURCHASE",
        "vote": 0
    }
]