[
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T16:36:39+00:00",
        "description": "Watch the launch trailer for Marvel Rivals, a free-to-play team-based PvP shooter developer by NetEase Games. Players will face off against other Marvel heroes in intense battles to claim victory. Use strategic abilities and combine Team-Up Skills to gain the edge against the opposition in this all-out battle within the Marvel Universe. Marvel Rivals is launching on December 6 for PlayStation 5 (PS5), Xbox Series X|S, and PC (Steam and Epic Games Store).\n\n#MarvelRivals #Gaming #IGN",
        "id": 1616563,
        "language": null,
        "link": "https://www.youtube.com/watch?v=SQCw1aXnmKc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/SQCw1aXnmKc/hqdefault.jpg",
        "title": "Marvel Rivals - Official 'Til The End' Launch Trailer",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T16:00:06+00:00",
        "description": "Here are the best PlayStation games of all time! Over its 30-year history, it's fair to say that a lot of incredible games have graced PlayStation consoles, but what are the best games on PlayStation?\n\nAcross five generations of consoles (PS1, PS2, PS3, PS4, PS5), two handhelds (PSP, PS Vita), and toes dipped into the VR gaming waters, there is a lot to choose from, but we’ve put our heads together to narrow it down to the 100 best PlayStation games ever. These aren't necessarily the best games 2024 to play right now, and certainly not just the best PS5 games, but ones that have cemented their legacy in PlayStation history and paved the way for what was to come.\n\nWhat games do you see when you close your eyes and hear the word PlayStation? While we’ve got a good amount of PlayStation exclusives on this list such as Uncharted, God of War, The Last of Us, and more, we also have included a fair few multiplatform classic games like GTA. Our rule of thumb for those is, when you think of t",
        "id": 1616564,
        "language": null,
        "link": "https://www.youtube.com/watch?v=eQTbU716xS0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/eQTbU716xS0/hqdefault.jpg",
        "title": "The 100 Best PlayStation Games of All Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "IGN",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T15:00:19+00:00",
        "description": "Watch the latest clip for Star Wars: Skeleton Crew, the upcoming Star Wars show. The series will star Jude Law, Ravi Cabot-Conyers, Ryan Kiera Armstrong, Kyriana Kratter, Robert Timothy Smith, Tunde Adebimpe, Kerry Condon, and Nick Frost.\n\nSkeleton Crew follows the journey of four kids who make a mysterious discovery on their seemingly safe home planet, then get lost in a strange and dangerous galaxy, crossing paths with the likes of Jod Na Nawood, the mysterious character played by Law. Finding their way home—and meeting unlikely allies and enemies—will be a greater adventure than they ever imagined.\n\nStar Wars: Skeleton Crew executive producers are Christopher Ford, Jon Watts, Jon Favreau, Dave Filoni, Kathleen Kennedy, and Colin Wilson and the co-executive producers are Chris Buongiorno, Karen Gilchrist, and Carrie Beck.\n\nThe two-episode Skeleton Crew premiere is coming to Disney+ on December 3, 2024.\n\n#StarWarsSkeletonCrew #StarWars #Clip",
        "id": 1616565,
        "language": null,
        "link": "https://www.youtube.com/watch?v=2P3hlQo3C9w",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 149,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/2P3hlQo3C9w/hqdefault.jpg",
        "title": "Star Wars: Skeleton Crew - Official Clip (2024) Jude Law, Kyriana Kratter, Kerry Condon",
        "vote": 0
    }
]