[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T23:27:11.045118+00:00",
        "description": "\"Polar oceans constitute emission hotspots during the summer,\" according to a new paper published in the peer-reviewed scientific journal Science Advances. \"And including those sea-to-air fluxes in an atmospheric chemistry-climate model \"results in a net radiative effect that has far-reaching implications.\" \n\nThe research was led by a team of scientists from Spain's Institute of Marine Sciences and the Blas Cabrera Institute of Physical Chemistry, according to an announcement from the UK's University of East Anglia:\n\nResearchers have quantified for the first time the global emissions of a sulfur gas produced by marine life, revealing it cools the climate more than previously thought, especially over the Southern Ocean. The study, published in the journal Science Advances, shows that the oceans not only capture and redistribute the sun's heat, but produce gases that make particles with immediate climatic effects, for example through the brightening of clouds that reflect this heat. \n\n",
        "id": 1618174,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/30/2320206/oceans-cool-the-climate-more-than-we-thought-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Oceans Cool the Climate More Than We Thought, Study Finds",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T22:21:24.625805+00:00",
        "description": "November 5: Bitcoin's price reaches an all-time high of $74,200. \nNovember 11: Bitcoin sets a new record of $84,000. \nNovember 12: Bitcoin pushes past $90,000.\nAnd Friday, CNBC reported:\n\nBitcoin is on pace to post a 38% gain for November, according to Coin Metrics, which would make the month its best since February, when it gained 45% following the launch of spot bitcoin ETFs... Bulls expect bitcoin's price to reach $100,000 by the end of 2024 and potentially double by the end of 2025.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bitcoin+Heads+for+Nearly+40%25+November+Gain%2C+Edging+Closer+to+%24100%2C000%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F30%2F2120207%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F30%2F2120207%2Fbitcoin-hea",
        "id": 1617968,
        "language": null,
        "link": "https://slashdot.org/story/24/11/30/2120207/bitcoin-heads-for-nearly-40-november-gain-edging-closer-to-100000?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Bitcoin Heads for Nearly 40% November Gain, Edging Closer to $100,000",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T21:16:16.284477+00:00",
        "description": "To explain the origins of dark market, a new model of the universe has been proposed by researchers, reports Phys.org. \n\n\"Their idea is that dark matter would be produced during a infinitesimally short inflationary phase when the size of the universe quickly expanded exponentially...\"\n\n\nAlthough inflation is mostly accepted by cosmologists as part of the Big Bang picture based on some evidence (though there is meaningful dissent), the driver of inflation is still unknown... [T]o-date research has not considered the possibility that a significant [amount] of dark matter could be produced during the inflationary expansion and not be diluted away. In the paper's WIFI model &mdash; Warm Inflation via ultraviolet Freeze-In &mdash; dark matter is created through small and rare interactions with particles in a hot, energetic environment. It contains a new mechanism where this production occurs just before the Big Bang, during cosmic inflation, leading to dark matter being formed much earlie",
        "id": 1617694,
        "language": null,
        "link": "https://science.slashdot.org/story/24/11/30/2048251/new-cosmological-model-proposes-dark-matter-production-during-pre-big-bang-inflation?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "New Cosmological Model Proposes Dark Matter Production During Pre-Big Bang Inflation",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T20:11:34.345371+00:00",
        "description": "\"A flaw in a WordPress anti-spam plugin with over 200,000 installations allows rogue plugins to be installed on affected websites,\" reports Search Engine Journal. \n\nThe authentication bypass vulnerability lets attackers gain full access to websites without a username or password, according to the article, and \"Security researchers rated the vulnerability 9.8 out of 10, reflecting the high level of severity...\"\n\n\nThe flaw in the Spam protection, Anti-Spam, FireWall by CleanTalk plugin, was pinpointed by security researchers at Wordfence as caused by reverse DNS spoofing... [T]he attackers can trick the Ant-Spam plugin that the malicious request is coming from the website itself and because that plugin doesn't have a check for that the attackers gain unauthorized access... Wordfence recommends users of the affected plugin to update to version 6.44 or higher.\n \n\nThanks to Slashdot reader bleedingobvious for sharing the news.\n<p><div class=\"share_submission\" style=\"position:relative;\">\n<",
        "id": 1617407,
        "language": null,
        "link": "https://it.slashdot.org/story/24/11/30/1830222/wordpress-anti-spam-plugin-vulnerability-exposes-200000-sites-to-rce-attacks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "WordPress Anti-Spam Plugin Vulnerability Exposes 200,000 Sites to RCE Attacks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T18:53:42.563503+00:00",
        "description": "The New York Post writes that \"After the COVID-19 pandemic upended mom-and-pops around the city and resulted in thousands shuttering for good, it is important &mdash; now more than ever &mdash; to shop local.\" \n\nAmerica's Small Business Administration issued their own statement urging shoppers to \"champion small businesses nationwide and #ShopSmall on Saturday, linking to a site mapping small businesses in your area. (And there's also a directory listing online small businesses.)\n\nSmall Business Saturday was founded by American Express in 2010 and officially cosponsored by the U.S. Small Business Administration since 2011. It is an important part of small businesses' busiest shopping season. \n\n\n\n- In 2023, the reported projected spending in the U.S. from those who shopped at small businesses on Small Business Saturday was around $17 billion \n- Since 2010, the total reported U.S. spending at small businesses during the annual Small Business Saturday is an estimated $201 billion\n\n \n \"L",
        "id": 1616776,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/30/0444209/to-urge-local-shopping-america-celebrates-15th-annual-small-business-saturday?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "To Urge Local Shopping, America Celebrates 15th Annual 'Small Business Saturday'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T18:53:42.478597+00:00",
        "description": "From a new web project called IMG_0001:\n\nBetween 2009 and 2012, iPhones had a built-in \"Send to YouTube\" button in the Photos app. Many of these uploads kept their default IMG_XXXX filenames, creating a time capsule of raw, unedited moments from random lives. Inspired by Ben Wallace, I made a bot that crawled YouTube and found 5 million of these videos! Watch them below, ordered randomly.\n \n\nThe Washington Post reports that it's the same 22-year-old software engineer who created Bop Spotter &mdash; that phone on a telephone pole using the Shazam app to identify songs people play in public. \n\nAnd his new site includes only videos \"posted before 2015, with fewer than 150 views each and durations shorter than 150 seconds.\"\n\n\n\nIn about 12 hours total, Walz said, he coded a website that takes millions of these unedited, raw videos from more than nine years ago and serves them to viewers at random. The resulting project, titled IMG_0001 and hosted on his personal website, plays out like a ",
        "id": 1616775,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/30/0411217/youtube-is-full-of-old-unseen-home-videos-now-you-can-watch-them-at-random?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "YouTube is Full of Old, Unseen Home Videos.  Now You Can Watch Them at Random",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T18:53:42.393382+00:00",
        "description": "At the start of November Threads had 275 million members. But in 30 days it's apparently increased another 12%, reports The Verge:\n\n\nThreads has accrued over 35 million signups so far in November and is \"going on three months with more than a million signups a day,\" Meta spokesperson Alec Booker told The Verge in an email today. 20 million of those signups have come since November 14th, as Axios notes... \n\nAt the same time, Bluesky has seen a surge of interest. The platform grew to 15 million users earlier this month and continued to add about a million signups per day for several days. It now sits at over 22 million users. \n\n\nDave Earley, audience editor at Guardian Australia, says that traffic to TheGuardian.com from BlueSky \"is already 2x that of Threads.\"\n[T]hat's on a straight threads.net vs bsky.app referral comparison. BUT! 75-80% of tracked referral from owned Bluesky account posts is NOT being attributed to bsky.app, so I'm certain organic traffic would be undercounting by t",
        "id": 1616774,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/11/30/0536237/threads-adds-35-million-more-members-in-november---but-blueskys-traffic-is-surging?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Threads Adds 35 Million More Members in November - But Bluesky's Traffic is Surging",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T18:53:42.307427+00:00",
        "description": "The Washington Post reports on tens of thousands of Americans \"forced to pay for medication\" to prevent the HIV infections, \"despite federal requirements guaranteeing free access to treatment...according to multiple studies and interviews with medical professionals, activists and patients.\"\n\n\nInsurance companies are skirting rules compelling them to pay for pre-exposure prophylaxis treatment, known as PrEP, researchers and HIV advocacy organizations say &mdash; leaving patients to shell out hundreds of dollars each year for medication co-pays, doctor visits and screenings required to stay on drugs that reduce the risk of contracting HIV through sex by 99 percent. \n\nUnder the Affordable Care Act, commercial insurers must cover certain preventive health services. This is supposed to include at least one form of oral PrEP and related health services, such as regular testing for HIV and other sexually transmitted diseases, for people at increased risk of contracting HIV, according to 202",
        "id": 1616773,
        "language": null,
        "link": "https://science.slashdot.org/story/24/11/30/0614247/us-insurers-are-still-charging-for-hiv-prevention-pills-that-should-be-free?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Insurers Are Still Charging for HIV Prevention Pills That Should Be Free",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T13:08:07.322130+00:00",
        "description": "Transport for London (TfL) has dropped its investigation into how it could introduce driverless trains on the London Underground. From a report: One of the many conditions imposed on TfL during the pandemic to keep services running when most of us were stuck at home was that it would investigate how it could introduce driverless trains on the Underground. TfL was required to produce a business case for converting the Waterloo &amp; City line and Piccadilly line to a DLR-style operation, and in September 2021, it advertised for consultancy work on the project. \n\nIt's now been confirmed that the study reached the same conclusion that every other study into the issue has already reported -- it'll cost an awful lot of money for very little benefit. Despite the claims that it would prevent strikes on the tube, the reality is that it wouldn't, as driverless trains would still have staff on board, just as the DLR does, and the DLR still has strikes.<p><div class=\"share_submission\" style=\"po",
        "id": 1615743,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/30/0113236/tfl-abandons-plans-for-driverless-tube-trains?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "TfL Abandons Plans For Driverless Tube Trains",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T09:52:31.920594+00:00",
        "description": "Performance improvement plans, a controversial corporate tool for managing underperforming employees, are becoming increasingly prevalent in U.S. workplaces. HR Acuity data shows workers subject to performance actions rose from 33.4 per 1,000 in 2020 to 43.6 per 1,000 in 2023. \n\nWhile companies maintain PIPs offer a path to improvement, WSJ -- citing HR executives and former employees -- describes them as primarily providing legal protection against wrongful termination lawsuits and an alternative to formal layoffs. Only 10-25% of employees survive the 30-90 day improvement plans, with most either being terminated or leaving voluntarily.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Performance+Improvement+Plans+Surge+in+US+as+Companies+Seek+Stealth+Job+Cuts%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F30%2F0023227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_",
        "id": 1614995,
        "language": null,
        "link": "https://slashdot.org/story/24/11/30/0023227/performance-improvement-plans-surge-in-us-as-companies-seek-stealth-job-cuts?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Performance Improvement Plans Surge in US as Companies Seek Stealth Job Cuts",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T06:37:36.638850+00:00",
        "description": "An anonymous reader shares a report: Google Cloud dangled hundreds of million of euros worth of financial incentives to ally itself with an association of European cloud providers that had lodged a complaint against Microsoft, according to confidential documents seen by The Register. \n\nAmit Zavery, the former Vice President of Google Cloud Platform, presented to a selection of members of the Cloud Infrastructure Service Providers in Europe (CISPE) trade body, then to the board and finally to the entire organization, according to sources that asked to remain anonymous. \n\nIn the presentation, seen by us, Zavery offered to provide a Members Innovation Fund of $4.2 million, which Google described as $105,000 per member to be used as \"immediate funding for projects and license fees of CISPE members to support innovation in open cloud ecosystems.\" CISPE actually has 36 members now, including Oxya, Leaseweb, UpCloud and AWS -- the latter being the only non-European participant. The number h",
        "id": 1614490,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/11/30/0014255/google-offered-millions-to-ally-itself-with-trade-body-fighting-microsoft?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Offered Millions To Ally Itself With Trade Body Fighting Microsoft",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T04:27:22.292343+00:00",
        "description": "SpzToid writes: A Chinese commercial vessel that has been surrounded by European warships in international waters for a week is central to an investigation of suspected sabotage that threatens to test the limits of maritime law -- and heighten tensions between Beijing and European capitals. \n\nInvestigators suspect that the crew of the Yi Peng 3 bulk carrier -- 225 meters long, 32 meters wide and loaded with Russian fertilizer -- deliberately severed two critical data cables last week as its anchor was dragged along the Baltic seabed for over 100 miles. \n\nTheir probe now centers on whether the captain of the Chinese-owned ship, which departed the Russian Baltic port of Ust-Luga on Nov. 15, was induced by Russian intelligence to carry out the sabotage. It would be the latest in a series of attacks on Europe's critical infrastructure that law-enforcement and intelligence officials say have been orchestrated by Russia.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=",
        "id": 1614212,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/11/29/2335259/ships-crew-suspected-of-deliberately-dragging-anchor-for-100-miles-to-cut-baltic-cables?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ship's Crew Suspected of Deliberately Dragging Anchor for 100 Miles To Cut Baltic Cables",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T01:06:06.679928+00:00",
        "description": "Riot Games has announced sweeping changes to its terms of service, expanding penalties for player misconduct beyond in-game behavior to include content creation and social media activities. \n\nThe new rules, Engadget reports, enable \"Riot-wide bans\" for violations across platforms where players discuss or stream Riot games. The company will not actively monitor social media but will respond to reported violations, particularly during game livestreams.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Riot+Games+is+Cracking+Down+on+Players'+Off-Platform+Conduct%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F11%2F29%2F2346212%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F11%2F29%2F2346212%2Friot-games-is-cracking-down-on-players-off-platform-co",
        "id": 1613695,
        "language": null,
        "link": "https://games.slashdot.org/story/24/11/29/2346212/riot-games-is-cracking-down-on-players-off-platform-conduct?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Riot Games is Cracking Down on Players' Off-Platform Conduct",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T01:06:01.810999+00:00",
        "description": "British members of parliament have voted to legalize assisted dying, approving a contentious proposal that would make the United Kingdom one of a small handful of nations to allow terminally ill people to end their lives. From a report: Lawmakers in the House of Commons voted by 330 to 275 to support the bill, after an hours-long debate in the chamber and a years-long campaign by high-profile figures that drew on emotional first-hand testimony. \n\nBritain is now set to join a small club of nations to have legalized the process, and one of the largest by population to allow it. The bill must still clear the House of Lords and parliamentary committees, but Friday's vote marked the most important hurdle. \n\nIt allows people with a terminal condition and less than six months to live to take a substance to end their lives, as long as they are capable of making the decision themselves. Two doctors, and then a High Court judge, would need to sign off on the choice. Canada, New Zealand, Spain ",
        "id": 1613694,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/29/2351208/uk-lawmakers-vote-in-support-of-assisted-dying?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "UK Lawmakers Vote in Support of Assisted Dying",
        "vote": 0
    }
]