[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T17:30:04+00:00",
        "description": "Between the big-budget action-adventure titles, yearly sports games, massive open worlds with extensive content, and so on, there's a craving for games that don't really demand much time or extended gaming sessions. Of course, we're not only referring to shorter experiences but those which cut out a lot of the fluff and get straight to the action.\n\nThe sheer number of titles to facilitate is surprisingly deep, from Hotline Miami and its overarching loop of wiping out everything in your path without dying to the Outer Wilds and its complex yet astonishingly addictive exploration. Even compilations like UFO 50 get to the meat of the matter with each of their games, while the likes of Journey and The Short Hike can offer emotional experiences in their short runtimes.\n\nCheck out our picks for the 15 best \"all killer, no filler\" games. Who knows? They may offer some nice downtime, a cleansing of the palate, before that next big triple-A title.",
        "id": 1616841,
        "language": null,
        "link": "https://www.youtube.com/watch?v=VwCwxG2PNvk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/VwCwxG2PNvk/hqdefault.jpg",
        "title": "15 Best “ALL KILLER, NO FILLER” Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T13:30:07+00:00",
        "description": "Red Candle Games has released one of the best platforming games of the year with Nine Sols. Though it somewhat flew under the radar at launch, it's since built-up momentum and launched for consoles.\n\nPart side-scrolling action game, part Sekiro-like parry-heavy title, Nine Sols balances challenging combat with excellent environmental design, organic exploration, and incredible boss battles. The story revolves around Yi, a warrior seeking revenge after the Tiandao Council leaves him for dead. It's a task that's easier said than done, especially with all the powerful threats in New Kunlun.\n\nThe hand-drawn visuals and animation are a delight to witness, accompanied by a stellar soundtrack and presentation, resulting in a gameplay experience that's as punishing as sublime. Despite the punishing nature of combat and how some environments feel deceptively large, Nine Sols is a simply stellar title that you shouldn't miss.",
        "id": 1616018,
        "language": null,
        "link": "https://www.youtube.com/watch?v=5jUlSJJugB0",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/5jUlSJJugB0/hqdefault.jpg",
        "title": "Nine Sols PS5 Review - One of the Best Games of 2024 You Are NOT Playing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-30T09:30:02+00:00",
        "description": "Given the run that Resident Evil has been on until Resident Evil 8: Village, it’s no surprise that interest in whatever the franchise will do next is always as high as it is. Right now, of course, the answer to that question isn’t too defined, owing to the fact that in spite of Resident Evil Village now being over three years old, the developer has yet to officially announce Resident Evil 9, much less say anything else about it. \n\nWhat we do have, however, is a bunch of leaks that claim to have details about the next instalment in the horror series, spanning everything from its story to its setting to the characters it will star. We don’t yet know how accurate these rumours will turn out to be, but here, we speak about some in particular whose contents have caught our eye.",
        "id": 1615019,
        "language": null,
        "link": "https://www.youtube.com/watch?v=3vlmcYMbctU",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/3vlmcYMbctU/hqdefault.jpg",
        "title": "10 BIGGEST Resident Evil 9 Rumors That May Be True",
        "vote": 0
    }
]