[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-13T17:01:00+00:00", "description": "Download the AI model guide to learn more → https://ibm.biz/BdaVJc\nLearn more about AI solutions → https://ibm.biz/BdaVuK\n\nWhen it comes to optimizing Large Language Models (LLMs) for business success, two approaches often come into play: context optimization and LLM optimization. But what's the difference between these two techniques, and how can you choose the right one for your use case? Avinash Asthana, explores the fundamentals of context optimization and LLM optimization, and discuss how to use each approach to improve accuracy, reduce hallucinations, and increase efficiency. Whether you're a seasoned AI practitioner or just starting out, you'll be better equipped to make informed decisions about how to optimize your LLMs for improved performance.\n\n(AI) AI news moves fast. Sign up for a monthly newsletter for AI updates from IBM → https://ibm.biz/BdaVue", "id": 1509373, "language": null, "link": "https://www.youtube.com/watch?v=pZjpNS9YeVA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 432, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKWaEZ-_VweaEx1j62do_vQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/pZjpNS9YeVA/hqdefault.jpg", "title": "Context Optimization vs LLM Optimization: Choosing the Right Approach", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-13T12:01:19+00:00", "description": "Learn more about the IBM and Palo Alto Networks partnership →  https://ibm.biz/BdauVK\n\nIn this episode of Smart Talks with IBM, Malcolm Gladwell speaks with Jason Kelley, GM, Strategic Partners and Ecosystems at IBM, and Kristy Friedrichs, SVP and Chief Partnership Officer at Palo Alto Networks. They discuss the challenges and opportunities that the rapid development of AI brings to the cybersecurity space. Jason and Kristy also underscore how implementing a zero trust strategy can help enterprises enhance cyber resiliency and simplify operations. Together, IBM and Palo Alto Networks are delivering fully integrated, open, end-to-end security solutions to enterprises.                                                         \n\nAI news moves fast. Sign up for a monthly newsletter for AI updates from IBM.→ https://ibm.biz/BdauVa\n\nThis is a paid advertisement from IBM. The conversations on this podcast don't necessarily represent IBM's positions, strategies or opinions.", "id": 1506917, "language": null, "link": "https://www.youtube.com/watch?v=utcYsBKL7e8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 432, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKWaEZ-_VweaEx1j62do_vQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/utcYsBKL7e8/hqdefault.jpg", "title": "How AI Can Accelerate Cybersecurity", "vote": 0}]