[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-13T17:45:00+00:00", "description": "Four years isn't just the period that the Xbox Series X/S has been on the market. It also marks how long Sony's PlayStation 5 has been around. Even with such astounding success, shipping over 65 million units since launch, there have been some notable highs and lows.\n\nFrom layoffs and project cancellations to the underperforming PlayStation VR2 and the failure of Concord, the PS5 has been through a lot in the past year alone. Nevertheless, it's delivered a hefty helping of top-notch exclusives, from open-world titles like Horizon Forbidden West to excellent platformers like Astro Bot. We've also seen some excellent third-party titles, like Final Fantasy 7 Rebirth, Black Myth: Wukong and Silent Hill 2 remake.\n\nWhether you own another platform or not, it's hard not to recommend it, especially with so many other excellent titles coming up. Even if we're already four years into its lifespan, the PS5 is a worthwhile console.", "id": 1509079, "language": null, "link": "https://www.youtube.com/watch?v=4PoseZYct1E", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/4PoseZYct1E/hqdefault.jpg", "title": "Four Years Later, Is The PS5 Worth It?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-13T15:00:07+00:00", "description": "Before Final Fantasy, the popularity of role-playing games in Japan was dictated by one franchise - Dragon Quest. The long-running turn-based RPG rose to such heights that it could sometimes disrupt society, and perhaps the most beloved title of that era is Dragon Quest 3: The Seeds of Salvation.\n\nOver 26 years after it launched, the classic is back with Dragon Quest 3 HD-2D Remake. Featuring gorgeous visuals combining the best of 2D sprite work with detailed 3D environments, it follows Erdrick as they embark on a journey to take down the Archfiend Baramos. While the quality of life features and presentation are top-notch, much of the game's strengths lay in the original's foundations.\n\nDragon Quest 3 HD-2D Remake doesn't try to overshadow or significantly alter that vision, instead accentuating it for a contemporary audience. The result is the best representation of the classic and a worthwhile RPG to get lost in.", "id": 1507984, "language": null, "link": "https://www.youtube.com/watch?v=48EIlwtQp-k", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/48EIlwtQp-k/hqdefault.jpg", "title": "Dragon Quest 3 HD-2D Remake Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-13T11:01:09+00:00", "description": "Sony and Guerrilla’s decision to expand the reach of the Horizon IP has led to LEGO Horizon Adventures, and though it wasn’t a game that many would have ever expected to see, it’s one that we’re certainly glad does exist. In addition to being a surprisingly good (if heavily abridged) take on Guerrilla’s post- apocalyptic universe, LEGO Horizon Adventures is also a fun game in its own right. \n\nIt takes several elements from the mainline series and blends it with the structure and core loop of LEGO games, and in doing so delivers a game that will not only appeal to existing Horizon fans, but also likely create many new and much younger ones, as well. Though obviously not on the same level of quality as the mainline series, LEGO Horizon Adventures is a game well worth checking out nonetheless.", "id": 1506007, "language": null, "link": "https://www.youtube.com/watch?v=sP1OQMEqpaA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/sP1OQMEqpaA/hqdefault.jpg", "title": "LEGO Horizon Adventures Review - The Final Verdict", "vote": 0}]