[{"source": "https://www.theguardian.com/rss", "title": "Kidnappers free two of three journalists taken in Mexico, group says", "description": "<p>Silvia Arce and Alberto Sánchez, who were kidnapped on Wednesday, freed unharmed</p><p>Two of three journalists recently kidnapped in southern Mexico have been freed unharmed, the journalists’ international free-speech group Article 19 said in a statement on Saturday.</p><p>Silvia Arce and Alberto Sánchez, who lead the digital RedSiete platform, were released during the early hours of the morning, the organisation said.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/kidnappers-free-two-of-three-journalists-taken-in-mexico-group-says\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/kidnappers-free-two-of-three-journalists-taken-in-mexico-group-says", "date_published": "2023-11-25T23:17:58+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Manchester United face crunch week on road that could define their season", "description": "<p>Crucial games in the Premier and Champions League await but injuries and a lack of bite going forward are cause for concern</p><p>Manchester United face three crucial away games in a little more than six days that could define their season: by 10pm next Saturday they could be out of the Champions League and eight points off fourth place in the Premier League, should Spurs beat Aston Villa on Sunday. But despite being a long way from their best form, they can still produce when it matters.</p><p>Erik ten Hag’s side will face hostile atmospheres at Everton, Galatasaray and Newcastle as he aims to keep everything on a fragile track. United have won four of their past five league games, although have rarely looked convincing, but victories breed confidence and they have found a way to grind out results in a top-flight campaign where they have scored 13 goals in 12 matches.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/manchester-united-face-crunch-week-on-road-that-cou", "link": "https://www.theguardian.com/football/2023/nov/25/manchester-united-face-crunch-week-on-road-that-could-define-their-season", "date_published": "2023-11-25T22:30:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Lockerbie review – a masterclass in moving, urgent TV", "description": "<p>This documentary on the 80s air disaster is a multi-layered, compelling watch. It’s a gripping detective story and a beautifully-made, sensitive portrait of grief</p><p>The four-part series Lockerbie is a masterly example of a true-crime documentary put together with great care and compassion, which offers compelling insights into a familiar story. The first episode sensitively recalls the disaster that took place over, in and around the Scottish town on 21 December 1988, when Pan Am 103, on its way from Frankfurt and then London to Detroit, via New York City, exploded mid-air, killing all 243 passengers and 16 crew on board, as well as 11 people on the ground. At first, it was called Britain’s worst ever air crash. Soon, it would also become known as the deadliest terror attack in US history, at that point.</p><p>There are plenty of ways to tell the story, and many have been attempted before, but this series takes a multilayered approach, through an extensive, substantial and wid", "link": "https://www.theguardian.com/tv-and-radio/2023/nov/25/sky-now-tv-lockerbie-review-a-masterclass-in-creating-moving-urgent-tv", "date_published": "2023-11-25T22:00:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Arrests after alleged misogynistic chanting to referee at Birmingham", "description": "<ul><li>Two teenagers held over alleged abuse of official Rebecca Welch</li><li>Club had warned fans after reports of previous abuse of Welch</li></ul><p>Two football fans were arrested during Birmingham’s home match with Sheffield Wednesday for alleged misogynistic chanting towards referee Rebecca Welch.</p><p>Birmingham won the Championship fixture 2-1, which earned new manager Wayne Rooney his maiden victory in charge of the club.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/arrests-after-alleged-misogynistic-chanting-to-referee-at-birmingham\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/arrests-after-alleged-misogynistic-chanting-to-referee-at-birmingham", "date_published": "2023-11-25T21:57:28+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "F1’s next generation: the six fastest young drivers pushing for a place", "description": "<p>A pair of 18-year-old British prospects and the Ferrari reserve who ran Carlos Sainz close are among the sport’s rising stars</p><p><strong>Frederik Vesti, Mercedes</strong></p><p>The 21-year-old Dane is second in the F2 championship that will be decided in Abu Dhabi. In his second season in the series he trails Théo Pourchaire by 16 points with 39 still on the table after a strong season during which he has won six races, including a superb victory in the sprint race on Saturday . Vesti was signed to the Mercedes junior programme in 2021 and concluded a full young driver test for them in Abu Dhabi in 2022. He made his debut on a full grand prix weekend at Mexico this season when he completed the low-speed run over 26 laps and finished 19th, which the team principal, Toto Wolff, admitted was not the ideal chance to assess the youngster’s talents. On Friday, he had a better shot, took over Lewis Hamilton’s car and stayed within seven-tenths of George Russell.</p> <a href=\"https://w", "link": "https://www.theguardian.com/sport/2023/nov/25/f1s-next-generation-the-six-fastest-young-drivers-pushing-for-a-place", "date_published": "2023-11-25T20:00:04+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Ethnic and gender diversity targets are only first step on road to fairer football | Tony Burnett", "description": "<p>Opportunity – unlike talent – is not distributed evenly at all levels of the game and only sanctions can make that happen</p><p>The results from the Football Leadership Diversity Code (FLDC) show that the sport’s bodies are not yet equipped to make systemic changes when it comes to representation. The code – a voluntary agreement established by the Football Association and signed up to by 56 clubs – was set up in 2020 to try to improve diversity across the game in coaching and leadership positions, and was a sign of positive intent.</p><p>Despite encouraging results inside the FA, Premier League and English Football League, the clubs have let the side down again by failing to meet their targets. This is not wholly unexpected given how the code was created in the first place.</p> <a href=\"https://www.theguardian.com/football/blog/2023/nov/25/ethnic-and-gender-diversity-targets-are-only-first-step-on-road-to-fairer-football\">Continue reading...</a>", "link": "https://www.theguardian.com/football/blog/2023/nov/25/ethnic-and-gender-diversity-targets-are-only-first-step-on-road-to-fairer-football", "date_published": "2023-11-25T20:00:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "It’s aggrieved Everton against the world and that may not be such a bad thing | Jonathan Wilson", "description": "<p>This is far from the worst season to be docked 10 points and facing Manchester United can jolt the Goodison club into life</p><p>Goodison Park is always noisy, it’s just that sometimes that noise is roars and sometimes it’s boos. When Everton kick off against Manchester United on Sunday, it’s safe to say the mood will be fervently supportive. The annual putting aside of differences to rally behind the flag and fight relegation will come early this season: there’s nothing like the sense of a common enemy to pull people together.</p><p>The enemy here is legion. It’s the shambolic leadership of their own club, it’s the Premier League for bringing charges and pushing for a <a href=\"https://www.theguardian.com/football/2023/nov/17/everton-deducted-10-points-premier-league-guilty-financial-fair-play-breach\">10-point deduction</a> and it’s the independent panel for finding them guilty and imposing the sanction.</p> <a href=\"https://www.theguardian.com/football/blog/2023/nov/25/its-aggrie", "link": "https://www.theguardian.com/football/blog/2023/nov/25/its-aggrieved-everton-against-the-world-and-that-may-not-be-such-a-bad-thing", "date_published": "2023-11-25T20:00:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Italy into Davis Cup final after Sinner’s stunning comeback sees off Djokovic", "description": "<ul><li>Serbia lose 2-1 after Sinner beats world No 1 6-2, 2-6, 7-5</li><li>Djokovic loses from triple match point up for first time</li></ul><p>The Davis Cup has a way of marking pivotal moments in a player’s career, unlocking qualities that can sometimes only be accessed while enduring the pressure of carrying the hopes of an entire team, not merely your own. As a raucous crowd inside Málaga’s Palacio de los Deportes chanted his name, Jannik Sinner seemed to take a significant step forward as he led Italy to a 2-1 win over Serbia and into a Davis Cup final for the first time since 1998.</p><p>In his third battle in 11 days with the best male player of all-time, Sinner trailed Novak Djokovic 4-5, 0-40 on his serve, triple match point down in the final set of an incredible tussle. Somehow, impossibly, he recovered to defeat the world No 1 6-2, 2-6, 7-5. He then returned for the decisive doubles alongside Lorenzo Sonego and the pair defeated Djokovic and Miomir Kecmanovic 6-3, 6-4 to ", "link": "https://www.theguardian.com/sport/2023/nov/25/italy-into-davis-cup-final-after-sinners-stunning-comeback-sees-off-djokovic", "date_published": "2023-11-25T19:50:54+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Kai Havertz springs to life and floors Brentford to send Arsenal top", "description": "<p>Whatever happens to Arsenal this season, Mikel Arteta will know that this victory courtesy of substitute Kai Havertz’s late header could be priceless.</p><p>A lacklustre display against a committed Brentford that had seen Aaron Ramsdale endure a shaky return between the posts looked like ending in disappointment as the game ticked into the 89th minute. But after a testing start to his career in north London, Havertz ensured his place in Arsenal folklore when he ghosted in at the far post to steer home Bukayo Saka’s cross. The victory means Arteta’s side go top of the table for the first time this season, with the manager pumping his fist at the final whistle after a testing evening that had frayed the nerves of his goalkeeper in particular.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/brentford-arsenal-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/brentford-arsenal-premier-league-match-report", "date_published": "2023-11-25T19:42:04+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Geert Wilders vows to become Dutch PM by compromising with other parties", "description": "<p>Anti-Islam MP who won recent election says he will ‘continue to moderate’ his positions to gain power</p><p>Veteran Dutch anti-Islam politician Geert Wilders on Saturday vowed to be prime minister of the Netherlands, after an election in which his party won the most seats.</p><p>In a long post on X, formerly Twitter, that expressed frustration at other parties for their apparent unwillingness to cooperate with his Freedom party (PVV), Wilders said he would “continue to moderate” his positions if necessary to gain power.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/geert-wilders-vows-to-become-dutch-pm-by-compromising-with-other-parties\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/geert-wilders-vows-to-become-dutch-pm-by-compromising-with-other-parties", "date_published": "2023-11-25T19:40:20+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Hair, makeup and hopefully a sister back home: Palestinians await prisoner release", "description": "<p>With 42 women and children set to be released under the ceasefire deal, hopes for family reunions are running high in the West Bank </p><p>The daughters of the Awad family were busy dressing up at their home in Qalandiya, on the West Bank side of the notorious checkpoint, on Saturday evening. Hair was curled and eyeliner applied; all four chose outfits in black and white to match their Palestinian <em>keffiyeh </em>scarves. The celebration was to mark the unexpected release of their big sister, Noorhan, 24, from prison in Israel. She was jailed eight years ago; the youngest, 10-year-old Mayar, does not remember her.</p><p>Their community centre was decked out with Palestinian flags and posters of Noorhan and two other young people from the neighbourhood. “So much has changed since Noorhan was home last,” said her mother Sumaya. “We are so excited. I don’t want to hope too much.”</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/palestinians-prisoner-release-west-bank-wome", "link": "https://www.theguardian.com/world/2023/nov/25/palestinians-prisoner-release-west-bank-women-children", "date_published": "2023-11-25T19:39:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Doctor Who: The Star Beast review – David Tennant and Catherine Tate have got this show flying again", "description": "<p>Fun, light and fast – the first of Russell T Davies’s festive specials puts this series exhilaratingly back on track. The comic chemistry of its two stars is absolutely faultless</p><p>Doctor Who feels like it has infinite reasons to celebrate. It is 60 years old this month, it has a flash new sugar daddy thanks to an international deal with Disney+, and it has moved on emphatically from the era of star Jodie Whittaker and writer Chris Chibnall, during which the show seemed to become smaller, looking inward when it should explode authoritatively in all directions. The most beloved showrunner of its modern era, Russell T Davies, is back – and his long-term choice for a new Doctor, Ncuti Gatwa, smacks of hope and progression, a fresh start.</p><p>Before Gatwa arrives on 25 December, however, there is an extra set of gifts, like an Advent calendar that’s just as plush as your big Christmas present. Three special episodes temporarily re-introduce David Tennant as the Doctor and Cather", "link": "https://www.theguardian.com/tv-and-radio/2023/nov/25/doctor-who-festive-special-bbc-the-star-beast-review-david-tennant-catherine-tate", "date_published": "2023-11-25T19:30:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "No bounce for the Tories after tax-cutting budget, poll shows", "description": "<p>Opinium poll for the Observer reveals the public is unimpressed with Jeremy Hunt’s attempt to woo them by trimming national insurance </p><p>Rishi Sunak has received no poll bounce after cutting taxes in last week’s autumn statement, according to the latest Opinium poll for the <em>Observer</em>.</p><p>Following a week in which the chancellor, Jeremy Hunt, described a reduction in national insurance as “the biggest tax cut on work since the 1980s” Labour’s lead has increased to 16 percentage points over the Tories.</p> <a href=\"https://www.theguardian.com/politics/2023/nov/25/no-bounce-for-the-tories-after-tax-cutting-budget-poll-shows\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2023/nov/25/no-bounce-for-the-tories-after-tax-cutting-budget-poll-shows", "date_published": "2023-11-25T19:27:26+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Curbs on migrant workers would be ‘dangerous’ for social care, warns government adviser", "description": "<p>Proposals to stop workers bringing dependants should be halted unless jobs are made more appealing to Britons, expert says</p><p>Read more: <a href=\"https://www.theguardian.com/uk-news/2023/nov/25/care-homes-foreign-workers-tories-plans-limit-immigration\">Fears over Tories’ plans to limit immigration</a></p><p>The government’s top immigration adviser has attacked plans to prevent overseas care workers from bringing family members to the UK, warning that to do so could be “very dangerous” for the social care sector.</p><p>Prof Brian Bell, who chairs the Migration Advisory Committee, said policies being pushed by immigration minister Robert Jenrick, which also include a cap on overseas care worker numbers, risked worsening the chronic staffing shortage. The end result, he warned, could be “lots of people won’t get care”.</p> <a href=\"https://www.theguardian.com/society/2023/nov/25/curbs-on-migrant-workers-would-be-dangerous-for-social-care-warns-government-adviser\">Continue reading.", "link": "https://www.theguardian.com/society/2023/nov/25/curbs-on-migrant-workers-would-be-dangerous-for-social-care-warns-government-adviser", "date_published": "2023-11-25T19:25:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Four dead and dozens injured in crowd crush at university in south India", "description": "<p>Incident took place at outdoor auditorium in southwest Kerala state where a concert was planned </p><p>At least four people were killed and dozens injured on Saturday evening in a crowd crush at a university in southern India, local officials and media reported.</p><p>The crush occurred at an outdoor auditorium in the Cochin University of Science and Technology (CUSAT) in south-west Kerala state, where a concert had been planned.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/four-dead-and-dozens-injured-in-stampede-at-university-in-south-india\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/four-dead-and-dozens-injured-in-stampede-at-university-in-south-india", "date_published": "2023-11-25T19:22:53+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Strictly Come Dancing: week ten – live", "description": "<p>Only six couples remain, bidding to make it through to the musicals-themed quarter-final. Ellie Leach dances an Argentine tango to Destiny’s Child, while Angela Scanlon cha-chas to Gloria Gaynor. But will they survive?</p><p>Tick it off when it happens on-screen! Take a drink for each you spot! Wake up tomorrow with a vague sense of dread and regret! Here’s your 10-point spotter’s guide:</p><p>Over-excited pros chant “40! 40!” after Layton or Ellie’s dance</p><p>Claudia lures the adorable Vito Coppola into one of his trademark babbling speeches on the balcony</p><p>Shot of Bobby’s dad Jeff Brazier blubbing in the studio audience</p><p>Pantomime boos whenever Craig raises his “9” paddle</p><p>Annabel Croft pays fond tribute to Jojo, who has something in his eye</p><p>Nigel Harman gets compared to Patrick Swayze</p><p>Angela S looks coolly deadpan as Carlos Gu comes over all weepy</p><p>Layton gets told off for his ballroom footwork</p><p>Craig mentions “Spanish line” or “spatulisti", "link": "https://www.theguardian.com/tv-and-radio/live/2023/nov/25/strictly-come-dancing-week-ten-live", "date_published": "2023-11-25T19:12:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Kosovo zoo rescue lion and bears come out to play in winter snow", "description": "<p>Sanctuary sets up heaters to take chill off rescue animals that have lost habit of entering full hibernation</p><p>Workers at a bear sanctuary in Pristina are working hard to look after a lion that wants to play in the snow and bears who were removed from their natural habitat when they were cubs and also enjoy the snowy conditions because they do not hibernate any more.</p><p>As the winter’s first snowfall covered <a href=\"https://www.bearsanctuary-prishtina.org/\">Bear Sanctuary Prishtina</a> in the Kosovan capital, visitors enjoyed the sight of a lion playing before quickly taking shelter indoors where a heater was installed to fend off temperatures which fell below freezing.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/kosovo-zoo-rescue-lion-and-bears-come-out-to-play-in-winter-snow\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/kosovo-zoo-rescue-lion-and-bears-come-out-to-play-in-winter-snow", "date_published": "2023-11-25T19:03:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Could there finally be an answer to sport’s big broadcasting problem? | Jack Snape", "description": "<p>Streaming has fragmented and transformed the once simple past-time of watching sport. Now the race is on to glue it back together</p><p>Sporting administrators and technology companies are in agreement: streaming has gone too far. Now, the race is on to glue the splintering parts of sports broadcasting back together.</p><p>“Aggregation” of services and rights is set to be the dominant trend in coming years, on smart TVs, and in boardrooms of sporting organisations sympathetic to their keenest supporters.</p> <a href=\"https://www.theguardian.com/sport/2023/nov/26/could-there-finally-be-an-answer-to-sports-big-broadcasting-problem\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2023/nov/26/could-there-finally-be-an-answer-to-sports-big-broadcasting-problem", "date_published": "2023-11-25T19:00:04+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Britain needs a growth plan, not magical thinking | Observer editorial", "description": "The chancellor’s tax giveaway will simply load even more painful spending cuts on to an inflation-devastated public sector<p>Jam today, austerity after the next election – that was the thrust of the chancellor’s heavily trailed autumn statement last week. As expected, Jeremy Hunt announced tax cuts that the country can ill afford. But despite his claims to be <a href=\"https://www.thetimes.co.uk/article/jeremy-hunt-tells-cbi-i-can-now-focus-on-long-term-uk-growth-c2bfmqfrq\" title=\"\">focused on the long term</a>, he is paying for these cuts by raiding the money that should be reserved for public services after the next election to help them cope with rising inflation.</p><p>If this further round of spending cuts is imposed, it will blight the lives of the people who disproportionately rely on Britain’s public infrastructure – children from disadvantaged backgrounds, older people with care needs, women suffering domestic abuse. It will also continue to suppress the country’s future grow", "link": "https://www.theguardian.com/commentisfree/2023/nov/25/the-observer-view-on-the-magical-thinking-behind-jeremy-hunts-autumn-statement", "date_published": "2023-11-25T19:00:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Keir Starmer open to return of Parthenon marbles, reports say", "description": "<p>Labour leader gives strongest hint yet of support for loan deal with Greece if his party wins next election</p><p>The Greek government has been assured by Keir Starmer, the leader of the Labour party, that in the event of electoral victory next year he will not block a prospective arrangement to return the <a href=\"https://www.theguardian.com/artanddesign/parthenon-marbles\">Parthenon marbles</a> to Athens.</p><p>Speaking through aides before talks in London with the Greek prime minister Kyriakos Mitsotakis, Starmer gave his strongest hint yet of his support for a loan deal that would see the antiquities <a href=\"https://www.theguardian.com/artanddesign/2022/jun/18/parthenon-marbles-must-return-to-greece-british-mps-and-peers-write\">return</a> to the country where they were carved 2,500 years ago.</p> <a href=\"https://www.theguardian.com/artanddesign/2023/nov/25/keir-starmer-open-to-return-of-parthenon-marbles-reports-say\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2023/nov/25/keir-starmer-open-to-return-of-parthenon-marbles-reports-say", "date_published": "2023-11-25T18:33:30+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Victims of deadly landslide in Alaska include five members of same family", "description": "<p>The Heller family was at home when the rockslide buried their home on Friday; neighbor Otto Florschutz was also killed</p><p><a href=\"https://www.theguardian.com/world/2023/nov/21/alaska-landslide-dead-missing\">The deadly landslide</a> in south-east Alaska early this week killed five family members and their neighbor, a commercial fisher who made a longshot bid for the state’s lone seat in the US House last year, authorities said on Friday.</p><p>Timothy Heller, 44, and Beth Heller, 36 – plus their children Mara, 16; Derek, 12; and Kara, 11 – were at home on Monday night when the landslide struck near the island community of Wrangell. Search crews found the bodies of the parents and the oldest child late on Monday or early Tuesday; the younger children remain missing, as does neighbor Otto Florschutz, 65, the Alaska public safety department said in a statement that identified the victims of the disaster.</p> <a href=\"https://www.theguardian.com/us-news/2023/nov/25/wrangell-alaska-", "link": "https://www.theguardian.com/us-news/2023/nov/25/wrangell-alaska-deadly-landslide-victims-identified", "date_published": "2023-11-25T18:30:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Championship roundup: Jamie Vardy double puts Leicester back on track", "description": "<ul><li>Substitute Vardy scores both against Watford in 2-0 victory </li><li>Birmingham sink Sheffield Wednesday 2-1 for Rooney’s first win</li></ul><p>Jamie Vardy came off the bench for <strong>Leicester</strong> to earn the leaders their first victory in three matches, scoring both goals in a 2-0 home win against <strong>Watford</strong>.</p><p>It had looked like being a half of frustration for the former Premier League Golden Boot winner, after he somehow missed an open goal from four yards out in the 74th minute. But he was in the right spot two minutes later to score from close range after Jannik Vestergaard’s header had been parried by Daniel Bachmann in Watford’s goal.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/championship-roundup-jamie-vardy-leicester-watford\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/championship-roundup-jamie-vardy-leicester-watford", "date_published": "2023-11-25T18:15:58+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "The zombie Tory government staggers on – cartoon", "description": "<p>Jeremy Hunt promised us a magical future in his autumn statement. Do you believe him?</p><p>• <a href=\"https://guardianprintshop.com/collections/chris-riddell-1/products/26-november-2023\">You can order your own copy of this cartoon</a></p> <a href=\"https://www.theguardian.com/commentisfree/picture/2023/nov/25/the-zombie-tory-government-staggers-on-cartoon\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/picture/2023/nov/25/the-zombie-tory-government-staggers-on-cartoon", "date_published": "2023-11-25T18:00:02+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Alice Winn: ‘We live in the fossilised wreckage of world war one’", "description": "<p>The author of In Memoriam, a contender for Waterstones book of the year, on borrowing first-hand accounts of combat, running sex scenes past her gay friends and the eternal impact of the great war</p> <a href=\"https://www.theguardian.com/books/2023/nov/25/alice-winn-we-live-in-the-fossilised-wreckage-of-world-war-one-in-memoriam-interview\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2023/nov/25/alice-winn-we-live-in-the-fossilised-wreckage-of-world-war-one-in-memoriam-interview", "date_published": "2023-11-25T18:00:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Former UK health secretary Matt Hancock’s early Covid warnings were ignored by No 10, say allies", "description": "<p>Ex-cabinet minister set to hit back at inquiry after being made a scapegoat for government failings</p><p>Matt Hancock and his officials bombarded Downing Street with early warnings about Covid-19 but were treated with ridicule and contempt, according to senior Whitehall figures, who believe that the former health secretary is unfairly being made a scapegoat by civil servants and scientists during the official inquiry into the pandemic.</p><p>Attempts by the Department of Health, in mid to late January 2020, to raise the alarm were dismissed out of hand by senior staff working for the then prime minister, Boris Johnson, because they believed Hancock was mainly seeking publicity and exaggerating the dangers, the insiders say.</p> <a href=\"https://www.theguardian.com/uk-news/2023/nov/25/former-uk-health-secretary-matt-hancocks-early-covid-warnings-were-ignored-by-no-10-say-allies\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2023/nov/25/former-uk-health-secretary-matt-hancocks-early-covid-warnings-were-ignored-by-no-10-say-allies", "date_published": "2023-11-25T18:00:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Suffolk holiday park evacuated after road collapse at beach", "description": "<p>High tides and winds leave caravans ‘dangerously close to edge’ as area in Lowestoft declared unsafe</p><p>People have been evacuated from a Suffolk holiday park after part of a road collapsed and left some of the caravans “dangerously close to the edge”.</p><p>The coastguard was called to Pakefield Holiday Park in Lowestoft after high tides and wind eroded part of the beach.</p> <a href=\"https://www.theguardian.com/uk-news/2023/nov/25/suffolk-holiday-park-evacuated-after-road-collapse-at-beach\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2023/nov/25/suffolk-holiday-park-evacuated-after-road-collapse-at-beach", "date_published": "2023-11-25T17:53:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Pep Guardiola questions decision to deny Manchester City second goal", "description": "<ul><li>Dias effort ruled out for foul on Liverpool’s Alisson</li><li>Alexander-Arnold later equalised in 1-1 draw</li></ul><p>Pep Guardiola questioned the disallowing of Rúben Dias’s goal that would have given Manchester City a 2-0 lead over Liverpool by referring to the controversial “Newcastle-Arsenal action” when a Joelinton shove on Gabriel was allowed before <a href=\"https://www.theguardian.com/football/2023/nov/04/newcastle-arsenal-premier-league-match-report\" title=\"\">Anthony Gordon’s winner</a> at the start of this month.</p><p>Dias’s 67th-minute attempt featured a similar moment when Manuel Akanji rose to challenge Alisson, who dropped the ball and the Portuguese put it into the net only to see the goal ruled out by the referee, Chris Kavanagh, with no intervention by the VAR official.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/pep-guardiola-questions-decision-to-deny-manchester-city-second-goal\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/pep-guardiola-questions-decision-to-deny-manchester-city-second-goal", "date_published": "2023-11-25T17:45:46+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Saracens and Alex Lewington turn screw to extend Bristol’s winless run", "description": "<ul><li>Saracens 39-31 Bristol</li><li>Hosts sit second in table and three points off leaders Sale</li></ul><p>This will go down as one of those beloved of champions, the kind won when not playing well. Saracens never quite found their rhythm, but a seven-try win over anyone must be accounted a decent result. All the more so, given the captain and lodestar, Owen Farrell, left 13 points out there, landing just the two kicks from the tee – two out of eight.</p><p>That will not happen often, so Bristol may feel they missed a chance here. The days of their superstar line-ups seem passed for now, with Charles Piutau and Semi Radradra now moved on, but they boast two England props who proved the foundation of their best bits, most based around the set piece. Calum Sheedy did not miss from the tee, five from five, and his conversions were the difference at half-time, which saw Bristol 21-15 ahead.</p> <a href=\"https://www.theguardian.com/sport/2023/nov/25/saracens-bristol-premiership-rugby-", "link": "https://www.theguardian.com/sport/2023/nov/25/saracens-bristol-premiership-rugby-union-match-report", "date_published": "2023-11-25T17:41:45+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Obika’s header earns Motherwell point amid late drama at Celtic", "description": "<p>Jonathan Obika headed an equaliser amid more late drama between Motherwell and Celtic as the champions were held to a 1-1 home draw.</p><p>Substitute David Turnbull opened the scoring for the Premiership leaders with an 86th-minute penalty, but the visitors stunned Celtic Park in the 90th minute when Obika glanced home a Blair Spittal corner.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/celtic-motherwell-scottish-premiership-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/celtic-motherwell-scottish-premiership-match-report", "date_published": "2023-11-25T17:38:35+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Brighton’s resist Nottingham Forest’s fightback after Lewis Dunk’s red card", "description": "<p>Apart from goals, no-one knows what to expect when Brighton &amp; Hove Albion play. With three more players dropping down injured as they went behind to Anthony Elanga’s early goal, few would have anticipated what followed, as João Pedro’s brace enabled them to survive Lewis Dunk’s red card to win for the first time in seven Premier League matches and so end Nottingham Forest’s long unbeaten home run.</p><p>In a frenzied final half hour – including 10 added minutes – Forest pulled a goal back through Morgan Gibbs-White’s penalty, survived a potential red-card offence for Murillo but saw Ryan Yates’s late point-blank header brilliantly saved by Bart Verbruggen.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/nottingham-forest-brighton-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/nottingham-forest-brighton-premier-league-match-report", "date_published": "2023-11-25T17:21:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Gordon caps Newcastle’s rampant win as James red adds to Chelsea misery", "description": "<p>Long before the final whistle one thing was crystal clear; Newcastle’s players are prepared to jump through hoops of metaphorical fire for Eddie Howe. Despite being ravaged by a litany of injuries, Howe’s team summoned up frankly awe-inducing reserves of energy to ultimately steamroller a hitherto supposedly renascent Chelsea into submission.</p><p>Admittedly Reece James was sent off for collecting a second yellow card in the 73rd minute but by then Newcastle were so firmly in control that the recent talk of Mauricio Pochettino presiding over a serious challenge for Champions League qualification at Stamford Bridge seemed fanciful in the extreme.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/newcastle-chelsea-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/newcastle-chelsea-premier-league-match-report", "date_published": "2023-11-25T17:12:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Tomas Soucek steals points for West Ham and sends Burnley to new lows", "description": "<p>When Vincent Kompany and Burnley won the Championship with 101 points and followed it with a summer of spending more than £90m on players, few in Lancashire could have anticipated the club having something in common with the 1970-71 Newport team of the fourth division but after seven straight home defeats to the start of the season they certainly do as they match the Welsh club’s record for the worst start to an English league season.</p><p>Burnley’s appalling form at Turf Moor continued with defeat to West Ham despite leading until the 86th minute but a Dara O’Shea own goal and Tomas Soucek’s volley settled the match late on. Jay Rodriguez had scored from the spot to put the hosts ahead after Luca Koleosho was brought down in the box, some would argue for a second time, to give the fans hope of witnessing a first Turf Moor victory of the season.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/burnley-west-ham-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/burnley-west-ham-premier-league-match-report", "date_published": "2023-11-25T17:10:05+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Brentford v Arsenal: Premier League – live", "description": "<ul><li>Updates from the 5.30pm GMT kick-off</li><li>Want to share your thoughts? <a href=\"mailto:scott.murray@theguardian.com\">Send an email to Scott</a></li></ul><p><strong>At stake tonight:</strong> The early 1-1 draw between Manchester City and Liverpool means Arsenal can go top with a win this evening …</p><p>… while Chelsea’s 4-1 hammering at the hands of Newcastle gives Brentford the opportunity to climb into the top half of the table.</p> <a href=\"https://www.theguardian.com/football/live/2023/nov/25/brentford-v-arsenal-premier-league-live\">Continue reading...</a>", "link": "https://www.theguardian.com/football/live/2023/nov/25/brentford-v-arsenal-premier-league-live", "date_published": "2023-11-25T17:02:36+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Dominic West, don’t be snooty about hit West End shows, they keep serious theatre alive | David Benedict", "description": "In dismissing such plays as the preserve of inattentive tourists he ignores the fragile ecology of the industry<p>High-profile screen actors have suddenly been popping up in unlikely places. There’s a reason: the long-running, only recently resolved strikes by <a href=\"https://www.theguardian.com/culture/2023/nov/08/hollywood-actors-strike-ends-sag-aftra\" title=\"\">Hollywood’s actors’</a> and <a href=\"https://www.theguardian.com/culture/2023/sep/26/hollywood-writers-strike-ends-studio-deal\" title=\"\">writers’</a> unions. With nothing being made, screen performers have been unable to work. As the months ground on, they understandably began asking themselves what they could do with time on their hands and no income. Why not go back to theatre?</p><p>That’s why Freddie Fox is spending Christmas in <a href=\"https://www.theguardian.com/stage/2023/nov/23/she-stoops-to-conquer-review-the-orange-theatre-london\" title=\"\">a smart update</a> of Oliver Goldsmith’s comedy <em>She Stoops to Conquer<", "link": "https://www.theguardian.com/commentisfree/2023/nov/25/dominic-west-tourists-west-end-stage", "date_published": "2023-11-25T17:00:55+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Tiger Stripes: Malaysia’s censors have ‘removed the essence’ of my film, says director", "description": "<p>Amanda Nell Eu’s drama is up for an Oscar but conservatism means viewers in her own country will see a version she disowns</p><p>It should be a moment of celebration for Malaysian cinema. Amanda Nell Eu’s <em><a href=\"https://www.theguardian.com/film/2023/may/17/tiger-stripes-review-coming-of-age-body-horror-releases-the-monster-inside\" title=\"\">Tiger Stripes</a></em> became the country’s first film to win the prize for best feature at Cannes’ critics week this year, was selected as the country’s official entry to the next Academy Awards and praised by ministers.</p><p>But, if you’re in Malaysia, you won’t be able to watch the real version.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/tiger-stripes-malaysias-censors-have-removed-the-essence-of-my-film-says-director\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/tiger-stripes-malaysias-censors-have-removed-the-essence-of-my-film-says-director", "date_published": "2023-11-25T17:00:55+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Striking smartphone portraits from Ghana – in pictures", "description": "<p>After graduating secondary school in 2019, <a href=\"https://www.thebridgegallery.xyz/sarfo-emmanuel-annor\">Sarfo Emmanuel Annor</a> was given a smartphone by his sister. His niece was his first model; since then, he has been capturing life in his native Koforidua, Ghana. “I strive to push the boundaries of African portraits by playing with colour to share the daily life, dreams and stories of Ghanaian youth,” he says of his Life in Colour series. The visual artist’s interest in fashion, partly inspired by his mother’s secondhand clothes shop, deepened after he undertook a tailoring apprenticeship. “Fashion has been an intrinsic part of my journey since childhood. The bold and vibrant colours are not just a palette; they are a language through which I communicate a range of positive emotions.”</p><ul><li><a href=\"https://www.instagram.com/sarfogh_/?hl=en\">See more of Annor’s work on Instagram</a></li></ul> <a href=\"https://www.theguardian.com/artanddesign/gallery/2023/nov/25/striki", "link": "https://www.theguardian.com/artanddesign/gallery/2023/nov/25/striking-smartphone-portraits-from-ghana-sarfo-emmanuel-annor-in-pictures", "date_published": "2023-11-25T17:00:54+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "The week in audio: Lights Out: Dust; The Bakersfield Three; Heirs of Enslavement – review", "description": "<p>Can it be true that Radio 4 is axing the brilliant Lights Out? Elsewhere, Olivia LaVoice joins the dots between three murders in a gripping true crime podcast. Plus, a hit-and-miss look at the legacy of slavery</p><p><strong>Lights Out: Dust</strong> (Radio 4) | <a href=\"https://www.bbc.co.uk/sounds/play/m001sltt\">BBC Sounds</a> <br /><strong><a href=\"https://casefilepresents.com/the-bakersfield-three/\">The Bakersfield Three</a></strong> (Casefile Presents)<br /><strong><a href=\"https://www.persephonica.com/shows/heirs-of-enslavement\">Heirs of Enslavement</a></strong> (Persephonica)</p><p>About halfway through <strong><a href=\"https://www.bbc.co.uk/sounds/play/m001sltt\">Dust</a></strong>, the final episode in this series of <em><a href=\"https://www.bbc.co.uk/programmes/m000176d\">Lights Out</a></em>, writer <a href=\"https://www.theguardian.com/commentisfree/2019/aug/14/glaciers-iceland-country-loss-plaque-climate-crisis\">Andri Snær Magnason </a>says this. “In the year 2100, we expe", "link": "https://www.theguardian.com/tv-and-radio/2023/nov/25/lights-out-dust-radio-4-falling-tree-review-the-bakersfield-three-olivia-lavoice-heirs-of-slavery-laura-trevelyan-clive-lewis-mp", "date_published": "2023-11-25T17:00:54+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Frequent flyers are rewarded for polluting. Let them pay the full price | Martha Gill", "description": "A progressive carbon tax on flying would protect poor people far more than simply abandoning green policies<p>Is net zero a “luxury belief”? A strange assumption seems to have become knitted into the climate debate: that the burden of cutting carbon emissions will – must, inevitably – fall hardest on the poor.</p><p>This is the logic by which climate activists are sometimes deemed snobby, classist virtue-signallers – and the principle on which, earlier this year, Rishi Sunak signalled a <a href=\"https://www.gov.uk/government/speeches/pm-speech-on-net-zero-20-september-2023#\" title=\"\">tactical retreat</a> on green policies. “It cannot be right for Westminster to impose such significant costs on working people,” the prime minister said. Because, of course, this is the group such policies would hurt the most.</p> <a href=\"https://www.theguardian.com/commentisfree/2023/nov/25/poor-pay-net-zero-rishi-sunak-carbon-tax\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2023/nov/25/poor-pay-net-zero-rishi-sunak-carbon-tax", "date_published": "2023-11-25T16:43:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘We have to work urgently’: Mexican ecologists start campaign to save axolotl", "description": "<p>Pollution has tamped population density by 99.5%, but scientists think cultural icon could aid in tissue repair and cancer recovery</p><p>Ecologists from <a href=\"https://www.theguardian.com/world/mexico\">Mexico</a>’s National Autonomous University on Friday relaunched a fundraising campaign to bolster conservation efforts for axolotls, a native, endangered fish-like type of salamander.</p><p>The campaign, called Adoptaxolotl, asks people for as little as 600 pesos (about $35) to virtually adopt one of the tiny “water monsters”. Virtual adoption comes with live updates on your axolotl’s health. For less money, donors can buy a virtual dinner for one of the creatures, which are relatively popular <a href=\"https://a-z-animals.com/blog/axolotl-as-a-pet-the-ultimate-guide-to-caring-for-your-axolotl/\">pets</a> in the US.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/axolotl-mexico-ecology-pollution-campaign\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/axolotl-mexico-ecology-pollution-campaign", "date_published": "2023-11-25T16:36:32+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Almost £300,000 raised for delivery driver who intervened in Dublin attack", "description": "<p>Brazilian Deliveroo worker Caio Benicio used motorbike helmet to hit assailant who was attacking children outside a school </p><p>Almost £300,000 has been raised for a delivery driver who intervened in an attack by a man suspected of attacking children outside a school in Dublin.</p><p>Caio Benicio was on his motorbike in Dublin city centre when he spotted the attack on Thursday. He said he used his helmet to hit the assailant “with all my power”.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/money-raised-caio-benicio-delivery-driver-intervened-dublin-attack\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/money-raised-caio-benicio-delivery-driver-intervened-dublin-attack", "date_published": "2023-11-25T16:07:25+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Critics of Napoleon epic have fallen for emperor’s fibs, says film’s military expert", "description": "<p>The ex-para who advised Ridley Scott on the new movie’s battle scenes claims historians who attacked it have fallen for Bonaparte’s own hype</p><p>Critics of the “damaging” and “inaccurate” portrayal of Napoleon Bonaparte in <a href=\"https://www.theguardian.com/film/2023/nov/19/napoleon-review-ridley-scott-joaquin-phoenix-vanessa-kirby-josephine-bonaparte\" title=\"\">Ridley Scott’s new cinematic epic </a><em><a href=\"https://www.theguardian.com/film/2023/nov/19/napoleon-review-ridley-scott-joaquin-phoenix-vanessa-kirby-josephine-bonaparte\" title=\"\">Napoleon</a></em> are just victims of the French emperor’s enduring propaganda, according to the military adviser behind the film’s vast battle scenes.</p><p>Paul Biddiss claims that “Old Boney”, as he was known to the Duke of Wellington’s British troops, was promoted largely because he elaborated on his own successes. Bonaparte’s fibs impressed all France and intimidated his enemies – until, that is, he met his Waterloo in 1815.</p> <a h", "link": "https://www.theguardian.com/world/2023/nov/25/napoleon-film-ridley-scott-critics-miitary-expert-battle-scenes", "date_published": "2023-11-25T16:00:54+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘No no no. Avoid them all’: anti-vaccine conspiracies spread as UK cases of measles increase", "description": "<p>Online anti-vaxxers, conflating Covid and MMR theories, are convincing parents against immunising their children</p><p>In a Facebook group for parents, a mother asks for advice following the recent rise in measles cases.</p><p>She’s received a letter from the NHS asking her to take her young daughter for the <a href=\"https://www.theguardian.com/society/mmr\" title=\"\">MMR vaccine</a>, which protects against measles, mumps and rubella, as it’s “dangerous not to have it”.</p> <a href=\"https://www.theguardian.com/society/2023/nov/25/no-no-no-avoid-them-all-anti-vaccine-conspiracies-spread-as-uk-cases-of-measles-increase\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2023/nov/25/no-no-no-avoid-them-all-anti-vaccine-conspiracies-spread-as-uk-cases-of-measles-increase", "date_published": "2023-11-25T16:00:54+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Isaiah Collier: Parallel Universe review – an inspired homage to the giants of jazz and soul", "description": "<p>(Night Dreamer)<br />Recorded in single-take live performances, the Chicago multi-instrumentalist deftly throws funk, gospel, soul and his own fine voice into the mix</p><p>Isaiah Collier is keen on “the ancestors”. Opening this, his fourth album, the young Chicagoan pays fulsome vocal tribute to bygone jazz giants and soul stars, while his previous record, 2021’s <em>Cosmic Transitions</em>, was a handsome homage to John Coltrane’s masterpiece <em>A Love Supreme</em>. It consolidated Collier’s reputation as a shamanic saxophone prodigy (he’s also an adept multi-instrumentalist with a fine voice), and showed that his admiration for the spiritual jazz of Coltrane, Sun Ra and <a href=\"https://www.theguardian.com/music/2022/sep/27/pharoah-sanders-obituary\">Pharoah Sanders</a> is about inspiration rather than imitation.</p><p><em><a href=\"https://isaiahcollier.bandcamp.com/album/parallel-universe\">Parallel Universe</a></em> is a different creature, the latest direct-to-disc recording ", "link": "https://www.theguardian.com/music/2023/nov/25/isaiah-collier-parallel-universe-review-an-inspired-homage-to-the-giants-of-jazz-and-soul", "date_published": "2023-11-25T16:00:53+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Preserving our digital content is vital. But paying $38,000 for the privilege is not | John Naughton", "description": "<p>Storing online data in perpetuity is not just about photos and texts but thoughts and ideas. Platforms such as WordPress are starting to act, but it must be at a realistic price</p><p>Way back in 2004 the two founders of Google, Larry Page and Sergey Brin, thought that it would be a cool idea to scan all the printed <a href=\"https://en.wikipedia.org/wiki/Google_Books\">books in the world</a> and make them available online. This was at the time when their company’s motto (apart from the guff about not being evil) was to “organise all the world’s information”. Given that the obvious places to look for large collections of books are university libraries, they decided to start there, so they set out to persuade university librarians to let them scan their holdings.</p><p>One of the first institutions they approached was a very large American university: they went to visit its librarian and found him very supportive of their ambitious project. Accordingly, the deal was easily sealed. Af", "link": "https://www.theguardian.com/commentisfree/2023/nov/25/wordpress-preserve-digital-content-100-years", "date_published": "2023-11-25T16:00:53+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Israeli boy embraces family members in hospital corridor after hostage release", "description": "<p>Video shows Ohad Munder, 9, running into father’s arms as total of 24 people freed by Hamas in prisoner exchange</p><ul><li><a href=\"https://www.theguardian.com/world/live/2023/nov/25/israel-hamas-war-live-hamas-set-to-release-fresh-wave-of-hostages-reports-say-as-ceasefire-continues\">Israel-Hamas war – live updates</a></li></ul><p>The moment a Rubik’s-cube-loving boy who spent his ninth birthday as a hostage in Gaza was freed from captivity on the first day of a four-day truce and prisoner exchange has been captured on video.</p><p>Footage released by the Schneider children’s medical centre showed Ohad Munder running through a hospital corridor into his father’s arms as the pair were reunited after almost 50 days without any contact.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/israeli-boy-family-members-release-hostages-hamas-gaza\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/israeli-boy-family-members-release-hostages-hamas-gaza", "date_published": "2023-11-25T15:56:24+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘Nuclear tinderbox’: Kim’s threats put North Korea on wrong side of history | Simon Tisdall", "description": "<p>As a distracted world looks elsewhere, US and China have a common interest in halting Asia’s accelerating nuclear arms race</p><p>For western liberals and progressive champions of open, democratic government, a clutch of recalcitrant regimes around the world seems firmly stuck on what Barack Obama once called <a href=\"https://www.cbsnews.com/news/obama-on-ukraine-russia-on-the-wrong-side-of-history/\" title=\"\">“the wrong side of history</a>”. Iran’s misogynistic theocrats and Myanmar’s genocidal generals are among the worst offenders.</p><p>Then there’s Vladimir Putin’s Russia, harking back to largely illusory former glories. Belarus, Syria, Nicaragua, Cambodia and Eritrea meet the regressive criteria, too. What all these regimes have in common is denial of the basic human right to self-determination – the individual’s right to have a say in how society is ordered.</p> <a href=\"https://www.theguardian.com/commentisfree/2023/nov/25/nuclear-tinderbox-kims-threats-put-north-korea-on-w", "link": "https://www.theguardian.com/commentisfree/2023/nov/25/nuclear-tinderbox-kims-threats-put-north-korea-on-wrong-side-of-history", "date_published": "2023-11-25T15:50:13+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Max Verstappen claims superb pole in Abu Dhabi as Lewis Hamilton struggles", "description": "<ul><li>Red Bull driver beats Charles Leclerc to take 14th pole of year</li><li>George Russell is fourth with Mercedes teammate Hamilton 11th</li></ul><p>Max Verstappen claimed pole position for the Abu Dhabi Grand Prix, the final meeting of the 2023 season. The Red Bull driver delivered a superb lap on the Yas Marina Circuit to beat the Ferrari of Charles Leclerc into second and the McLaren of Oscar Piastri into third. Mercedes’ George Russell was fourth and Lando Norris fifth for McLaren. Lewis Hamilton was 11th for Mercedes.</p><p>Ferrari suffered a blow to their hopes in their battle with Mercedes for second in the constructors’ championship when Carlos Sainz could manage only 16th, knocked out in Q1 when he encountered traffic.</p> <a href=\"https://www.theguardian.com/sport/2023/nov/25/max-verstappen-claims-superb-pole-in-abu-dhabi-as-lewis-hamilton-struggles\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2023/nov/25/max-verstappen-claims-superb-pole-in-abu-dhabi-as-lewis-hamilton-struggles", "date_published": "2023-11-25T15:40:07+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Who are the first hostages released from Gaza?", "description": "<p>Hamas released 24 hostages on Friday, including 13 Israelis, one Filipino man and 10 Thai citizens</p><ul><li><a href=\"https://www.theguardian.com/world/live/2023/nov/25/israel-hamas-war-live-hamas-set-to-release-fresh-wave-of-hostages-reports-say-as-ceasefire-continues\">Israel-Hamas war – live updates</a></li></ul><p>The group of hostages driven out of Gaza on the first day of the ceasefire with Israel included 13 Israelis, 10 Thai citizens and one Filipino man.</p><p>The Israeli hostages included four children with female relatives, who were all visiting family at Nir Oz kibbutz when Hamas attacked on 7 October, , and five elderly women, four of them residents of Nir Oz and one from a nearby kibbutz.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/who-are-the-first-hostages-released-from-gaza\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/who-are-the-first-hostages-released-from-gaza", "date_published": "2023-11-25T15:36:12+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "European roundup: Barcelona need own goal to escape from Rayo with a point", "description": "<ul><li>Florian Lejeune’s own goal gives Xavi’s side a 1-1 draw</li><li>Barça third in La liga, three points off surprise leaders Girona</li></ul><p>Barcelona rescued a point with a 1-1 draw away at Rayo Vallecano on Saturday thanks to a late second-half own-goal by defender Florian Lejeune.</p><p>The La Liga champions are third in the standings on 31 points, one behind second-placed Real Madrid and three back from surprise leaders Girona, both of whom have a game in hand.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/european-roundup-barcelona-la-liga-bundesliga-serie-a\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/european-roundup-barcelona-la-liga-bundesliga-serie-a", "date_published": "2023-11-25T15:33:30+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "From carbon capture to King Charles: what to look out for at Cop28", "description": "<p>The big climate conference starts in the UAE on November 30 – who are the key players and what will they be talking about? </p><p>King Charles is one of the world’s most recognised and respected voices on the environment, and was a key figure at the <a href=\"https://www.theguardian.com/environment/2015/jun/02/everything-you-need-to-know-about-the-paris-climate-summit-and-un-talks\" title=\"\">Paris climate summit</a> of 2015 and <a href=\"https://www.theguardian.com/environment/cop26-glasgow-climate-change-conference-2021\" title=\"\">Cop26</a> in Glasgow in 2021. Last year, Downing Street <a href=\"https://www.theguardian.com/uk-news/2022/oct/28/king-charles-will-not-attend-cop27-in-egypt-no-10-confirms\" title=\"\">prevented him from attending Cop27</a> in Egypt. Now he is back, at the request of the ruling family of the United Arab Emirates, who enjoyed a cordial horseracing relationship with the late Queen. Listeners will be able to contrast his <a href=\"https://www.theguardian.com/envir", "link": "https://www.theguardian.com/environment/2023/nov/25/from-carbon-capture-to-king-charles-what-to-look-out-for-at-cop28", "date_published": "2023-11-25T15:32:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Tiffany Haddish arrested for driving under the influence in Los Angeles", "description": "<p>Police said the entertainer was slumped over the steering wheel of a car stopped in the road at 5.45am on Friday</p><p><a href=\"https://www.theguardian.com/culture/tiffany-haddish\">Tiffany Haddish</a> was jailed early on Friday in Los Angeles on suspicion of driving under the influence, authorities said, marking the second time in less than two years that the actor and comedian has been arrested on such allegations.</p><p>Police in Beverly Hills said they found Haddish, 43, while responding to a call to check on a motorist who was stopped in the road at about 5.45am. Officers found Haddish appearing to be slumped over the steering wheel of that car, whose engine was still running.</p> <a href=\"https://www.theguardian.com/culture/2023/nov/25/tiffany-haddish-arrested-dui-los-angeles\">Continue reading...</a>", "link": "https://www.theguardian.com/culture/2023/nov/25/tiffany-haddish-arrested-dui-los-angeles", "date_published": "2023-11-25T15:24:37+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "US-Canada border explosion may have been a medical or mechanical episode, cops say", "description": "<p>Kurt P Villani and Monica Villani of Buffalo, New York, died when their Bentley  flew through air and exploded into flames</p><p>The investigation of a car crash and explosion at a Niagara Falls, New York, border checkpoint on Wednesday – which killed the married couple inside the vehicle – is examining whether mechanical or medical issues were to blame, <a href=\"https://www.theguardian.com/us-news/2023/nov/23/us-canada-border-vehicle-crash-explosion\">according to reports</a>.</p><p>That detail surfaced as<a href=\"https://www.theguardian.com/us-news/2023/nov/23/us-canada-border-vehicle-crash-explosion\"> officials identified</a> the Rainbow Bridge crash victims as Kurt P Villani and Monica Villani, both 53. The Villani family owns several hardware stores as well as a lumber business around the Buffalo, New York, region.</p> <a href=\"https://www.theguardian.com/us-news/2023/nov/25/us-canada-border-car-explosion-police-investigate\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2023/nov/25/us-canada-border-car-explosion-police-investigate", "date_published": "2023-11-25T15:20:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘They feel they are being neglected’: why voters turned to ‘Dutch Trump’ Geert Wilders", "description": "<p>In a pretty waterside town, residents applaud the veteran rightwinger’s stance on immigration, calling his success a ‘vote against the established order’</p><p>In a shopping centre in Volendam, a fishing port north of Amsterdam, on Friday, there was satisfaction about <a href=\"https://www.theguardian.com/us-news/2023/nov/23/first-thing-dutch-election-results-put-geert-wilders-far-right-party-in-lead\" title=\"\">far-right politician Geert Wilders having dominated last Wednesday’s Dutch elections</a>. “It’s a really good thing,” said Pieter, who didn’t want to give a last name. “There’s a shortage of <a href=\"https://www.dutchnews.nl/2023/11/whats-all-the-fuss-about-housing-in-the-netherlands/\" title=\"\">houses</a>, people are still coming. The borders have to shut.”</p><p>In Volendam, long a Wilders stronghold, the Party for Freedom (PVV) won 18.6% of votes. The jaws of politicians, political scientists and Wilders himself dropped open when <a href=\"https://www.theguardian.com/world/2", "link": "https://www.theguardian.com/world/2023/nov/25/they-feel-they-are-being-neglected-why-voters-turned-to-dutch-trump-geert-wilders", "date_published": "2023-11-25T15:12:17+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Maybe shipworms will be the next calamari, but all the same, I’ll pass | Kathryn Bromwich", "description": "News that scientists are setting up a ‘naked clam’ farm is wonderful. If only they didn’t look so unpalatable<p>A team of scientists at Plymouth University is hoping to set up the <a href=\"https://www.bbc.co.uk/news/articles/cn4prrgqd68o\" title=\"\">world’s first shipworm farm</a>. The marine pests, which they have renamed “naked clams”, are nutritious, high in vitamin B12, and require only wood and water to grow.</p><p>It’s wonderful news. We desperately need sustainable sources of protein: meat is responsible for <a href=\"https://www.theguardian.com/environment/2021/sep/13/meat-greenhouses-gases-food-production-study\" title=\"\">nearly 60% of greenhouse gases</a> from food production, while industrial fish farming has <a href=\"https://www.theguardian.com/news/2020/sep/15/net-loss-the-high-price-of-salmon-farming\" title=\"\">huge environmental costs</a>.</p> <a href=\"https://www.theguardian.com/commentisfree/2023/nov/25/maybe-shipworms-will-be-the-next-calamari-but-all-the-same-ill-pass\">", "link": "https://www.theguardian.com/commentisfree/2023/nov/25/maybe-shipworms-will-be-the-next-calamari-but-all-the-same-ill-pass", "date_published": "2023-11-25T15:00:52+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "On my radar: Chris Bush’s cultural highlights", "description": "<p>The award-winning playwright on one of pop’s most extraordinary voices, role-playing drag queens and the scathing wit of her favourite foodie website</p><p>Playwright Chris Bush was born in Sheffield in 1986. In 2007, her first play, <em>Tony! The Blair Musical</em>, was premiered at York Theatre Royal. Since then her productions have included <em><a href=\"https://www.theguardian.com/stage/2017/oct/11/theatre-to-stage-musical-based-on-imaginary-death-of-katie-hopkins\">The Assassination of Katie Hopkins</a></em> at Theatr Clwyd, <em><a href=\"https://www.theguardian.com/stage/2018/sep/02/tamburlaine-swan-stratford-upon-avon-pericles-olivier-national-reviews\">Pericles</a></em> at the National Theatre and the Olivier award-winning <em><a href=\"https://www.theguardian.com/stage/2019/mar/23/standing-at-the-skys-edge-review-crucible-downstate-national-richard-iii-alexandra-palace\">Standing at the Sky’s Edge</a></em>, with music and lyrics by Richard Hawley, which <a href=\"https://www.sky", "link": "https://www.theguardian.com/culture/2023/nov/25/on-my-radar-chris-bush-cultural-highlights", "date_published": "2023-11-25T15:00:52+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "The Eternal Daughter review – two parts Hammer, one part Tales of the Unexpected", "description": "<p>Tilda Swinton plays both mother and daughter in Joanna Hogg’s follow-up to The Souvenir, in which memories haunt their weekend break to a gothic mansion</p><p>The threads that bind this atmospheric drama from <a href=\"https://www.theguardian.com/film/2023/nov/18/joanna-hogg-eternal-daughter-interview\">Joanna Hogg</a> to her previous two films might not be as tightly woven as those that link the two chapters of <em><a href=\"https://www.theguardian.com/film/2019/sep/01/the-souvenir-review-joanna-hogg-tom-burke-honor-swinton-byrne-tilda-swinton\">The Souvenir</a></em>, but they are there nonetheless. Tilda Swinton plays two characters. She reprises her role from <em>The Souvenir</em>: Rosalind, the mother of aspiring film-maker Julie (played in <em>The Souvenir</em> by Swinton’s daughter, Honor Swinton Byrne). She also takes on the role of Julie, now in late middle age and fluttering breathlessly around her frail, elderly mother during a weekend break to a seemingly deserted country h", "link": "https://www.theguardian.com/film/2023/nov/25/the-eternal-daughter-review-joanna-hogg-tilda-swinton-the-souvenir", "date_published": "2023-11-25T15:00:52+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘What can I say?’: Nicky Henderson left in shock by Shishkin’s refusal to run", "description": "<ul><li>De Boinville’s favourite stops at start of Nirvana Spa 1965 Chase</li><li>Paul Nicholls’ Pic D’Orhy takes the victory at Ascot</li></ul><p>Shishkin stunned onlookers at Ascot when refusing to start in the Nirvana Spa 1965 Chase, which went the way of Paul Nicholls’ Pic D’Orhy.</p><p>Nicky Henderson’s top-class chaser was returning to action in the Grade Two contest, which attracted only four runners. Nico de Boinville was partnering the gelding, who was the short-priced favourite, but at the tapes he did not budge and the race went ahead without him.</p> <a href=\"https://www.theguardian.com/sport/2023/nov/25/horse-racing-ascot-haydock-shiskinh\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2023/nov/25/horse-racing-ascot-haydock-shiskinh", "date_published": "2023-11-25T14:57:29+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Trent Alexander-Arnold strikes to earn Liverpool vital point at Manchester City", "description": "<p>Trent Alexander-Arnold cancelled out Erling Haaland’s 50th Premier League goal as Liverpool grabbed a point against champions and title rivals Manchester City. The England international struck 10 minutes from the end of a tight encounter at the Etihad Stadium after Haaland’s landmark strike looked like extending City’s record home winning run.</p><p>City had won their previous 23 games on home turf in all competitions, a running dating back to a visit from Everton on New Year’s Eve last December. Alexander-Arnold’s late equaliser also spared the blushes of goalkeeper Alisson, who had a day to forget having gifted Haaland his opener and committed several other errors.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/manchester-city-liverpool-premier-league-match-report\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/manchester-city-liverpool-premier-league-match-report", "date_published": "2023-11-25T14:47:28+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "UK’s flagship post-Brexit trade deal worth even less than previously thought, OBR says", "description": "<p>Office for Budget Responsibility says UK entry into the Indo-Pacific agreement will add just 0.04% to GDP in the long run</p><p>The UK’s flagship transatlantic trade deal, which was presented as a cornerstone of post-Brexit “global Britain”, will deliver even less benefit to the economy than the tiny uplift that was previously predicted, according to the Office for Budget Responsibility.</p><p>In a report accompanying last week’s <a href=\"https://www.theguardian.com/uk-news/2023/nov/22/autumn-statement-2023-incomes-tax-ni-benefits\" title=\"\">autumn statement</a>, the OBR said the UK’s entry into the <a href=\"https://www.theguardian.com/politics/2023/jul/16/kemi-badenoch-signs-treaty-for-uk-to-join-indo-pacific-trade-bloc-cptpp-uk-economy\" title=\"\">Comprehensive and Progressive Agreement for Trans-Pacific Partnership (CPTPP)</a> would add just 0.04% to GDP in the “long run”, which it defines as after 15 years of membership.</p> <a href=\"https://www.theguardian.com/politics/2023/nov/", "link": "https://www.theguardian.com/politics/2023/nov/25/uks-flagship-post-brexit-trade-deal-worth-even-less-than-previously-thought-obr-says", "date_published": "2023-11-25T14:02:56+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Ken Follett: ‘You don’t have to wear a hairshirt to be in the Labour party’", "description": "The writer, 74, on Bollinger Bolsheviks, champagne socialism, the power of public libraries and how he came to write the first of his 36 novels<p><strong>I was launched</strong> into the literary world by a garage bill. I was working on the <em>Evening News </em>and needed £200 to fix my old Vauxhall Ventura, which I couldn’t afford. Another reporter had written a thriller and said the publisher paid him £200. That little coincidence made me think I could try it, too.</p><p><strong>I wasn’t allowed </strong>to watch TV or films by my <a href=\"https://www.plymouthbrethrenchristianchurch.org/\" title=\"\">Plymouth Brethren</a> parents. I don’t think it did me any harm, but at the time I was furious about being denied. All my friends went to Saturday morning pictures and were talking about these superheroes and cowboys they’d seen. Whereas I read so much, I was considered a bit odd. More than once, I was asked in a worried tone, “You do go out to play sometimes, don’t you?”</p> <a href=\"ht", "link": "https://www.theguardian.com/books/2023/nov/25/this-much-i-know-ken-follett-you-dont-have-to-wear-a-hairshirt-in-the-labour-party", "date_published": "2023-11-25T14:00:52+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘Students are hurting’: how can we heal the political rift at America’s universities?", "description": "<p>As divisions over the Israel-Hamas war deepen, some say it’s time to ‘saturate campus with conversation’</p><p>Since the Israel-Hamas war broke out, a campus bridge at the University of Indiana-Bloomington has become a de facto protest site. On 21 October, a student painted “Free Palestine. Educate yourself. End the Occupation” on one side of the structure. Less than a day later, someone else painted over the original message with stars of David, a smiley face and the words “from Hamas”. After this, other students painted prayers for peace in Hebrew and a message to “support survivors”. Then a fourth group painted over these words with the phrases “pray 4 peace”, “free us” and “stop the genocide”.</p><p>What began as a genuinely felt act of civil disobedience – a way for some students to be heard when they felt no one was listening – devolved into a passive-aggressive symbol of pent-up frustration.</p> <a href=\"https://www.theguardian.com/us-news/2023/nov/25/us-students-colleges-u", "link": "https://www.theguardian.com/us-news/2023/nov/25/us-students-colleges-universities-israel-hamas-gaza", "date_published": "2023-11-25T14:00:52+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘If James Cleverly thinks Stockton’s a shit-hole, why not do something about it?’", "description": "<p>People in the Teesside town say the home secretary should help to rally an area that has endured chronic political neglect rather than badmouth it</p><p>On Thursday afternoon, the good people of Stockton-on-Tees were preparing for Stockton Sparkles, an annual festive event that promises to transform its commanding high street – known as the widest in the UK – into a “winter wonderland”.</p><p>But wonderland was not the word on everyone’s lips. Instead, it was the description of the place allegedly employed by the home secretary, <a href=\"https://www.theguardian.com/politics/james-cleverly\" title=\"\">James Cleverly</a>, during prime minister’s questions on Wednesday. Alex Cunningham, Labour MP for Stockton North, said Cleverly had uttered the phrase when he asked Rishi Sunak: “Why are 34% of children in my constituency living in poverty?”</p> <a href=\"https://www.theguardian.com/politics/2023/nov/25/if-james-cleverly-thinks-stocktons-a-shit-hole-why-not-do-something-about-it\">Contin", "link": "https://www.theguardian.com/politics/2023/nov/25/if-james-cleverly-thinks-stocktons-a-shit-hole-why-not-do-something-about-it", "date_published": "2023-11-25T14:00:51+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘Rizz-first’ Tinder painfully desperate to woo young people seeking dates | Arwa Mahdawi", "description": "<p>The leading dating app’s response to news that online dating is declining is a redesign wrapped in cringeworthy corporate slang</p><p>I met my wife the old-fashioned way: on a dating app. When our now-toddler is older we’ll tell her this story and she’ll look at us like we’re embarrassing dinosaurs and say ‘mums, what’s a dating app?’</p> <a href=\"https://www.theguardian.com/commentisfree/2023/nov/25/tinder-dating-apps-redesign\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2023/nov/25/tinder-dating-apps-redesign", "date_published": "2023-11-25T14:00:51+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "CMAT review – every song is like an encore in this fizzing, sad-happy show", "description": "<p><strong>Leeds Stylus</strong><br />Touring her masterly new album, one of the best of this year, Irish country-pop auteur Ciara Mary-Alice Thompson brings unruly energy, wit and guitar heroics to her searing tales of heartbreak</p><p>CMAT – Irish country-pop singer <a href=\"https://www.theguardian.com/music/2023/jul/13/cmat-ciara-mary-alice-thompson-irish-singer-crazymad-for-me\">Ciara Mary-Alice Thompson</a> – writes funny, bone-deep songs about love and other horrors. She also plays her white acoustic guitar like an axe hero. Not for Thompson the smiley, rhinestone strum of the classic Nashville artist. She kicks out, flings her hair, drops into deep lunges, exuding all the energy of a final encore. It’s only the first song.</p><p>The slinky <a href=\"https://www.youtube.com/watch?v=NxB2_CtUIy4\">California</a> (which rhymes with “don’t say I didn’t warn you”) opens her latest album, <em><a href=\"https://www.theguardian.com/music/2023/oct/15/cmat-crazymad-for-me-review-irish-award-", "link": "https://www.theguardian.com/music/2023/nov/25/cmat-leeds-university-stylus-live-review-crazymad-for-me-rhinestone-reflections-of-a-happy-sad-song-machine", "date_published": "2023-11-25T14:00:50+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Banner urging UAE to release activist flown at Manchester City v Liverpool", "description": "<ul><li>Ahmed Mansoor has been imprisoned since 2017</li><li>City are owned by a member of Abu Dhabi royal family</li></ul><p>Manchester City’s top-of-the-table Premier League encounter with Liverpool was the subject of an aerial protest on Saturday, with a banner flown over the Etihad Stadium calling for the release of an activist from prison in Abu Dhabi.</p><p>The banner, trailed by a chartered plane, read: “UAE: Free Ahmed Mansoor!” Mansoor is a poet and blogger who has been imprisoned since 2017 after a court in the United Arab Emirates found him guilty of “insulting the status and prestige of the UAE and its symbols” and “publishing false information to damage the UAE’s reputation abroad”.</p> <a href=\"https://www.theguardian.com/football/2023/nov/25/banner-urging-uae-to-release-activist-flown-at-manchester-city-v-liverpool\">Continue reading...</a>", "link": "https://www.theguardian.com/football/2023/nov/25/banner-urging-uae-to-release-activist-flown-at-manchester-city-v-liverpool", "date_published": "2023-11-25T13:49:33+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Newcastle v Chelsea, Burnley v West Ham: Premier League football and more – live", "description": "<ul><li>Updates from the afternoon kick-offs across the UK and Europe</li><li><a href=\"https://www.theguardian.com/football/live\">Live scoreboard</a> | <a href=\"mailto:taha.hashim.casual@guardian.co.uk\">Share your thoughts with Taha by mail</a></li></ul><p>Over in Spain, <strong>Barcelona</strong> are trailing against <strong>Rayo Vallecano</strong> – <strong>Unai Lopez</strong> has opened the scoring with a staggering strike from well outside the box, latching onto a bouncing ball and sending it into the bottom right corner. What a hit, my son. Nearly half-time in that one.</p><p><strong>Barry Glendenning’s keeping tabs on all the action at the Etihad.</strong> Liverpool are pressing hard for an equaliser, and Pep’s starting to look a bit nervy.</p> <a href=\"https://www.theguardian.com/football/live/2023/nov/25/newcastle-v-chelsea-burnley-v-west-ham-premier-league-football-and-more-live\">Continue reading...</a>", "link": "https://www.theguardian.com/football/live/2023/nov/25/newcastle-v-chelsea-burnley-v-west-ham-premier-league-football-and-more-live", "date_published": "2023-11-25T13:43:11+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘It’s like buying an iPhone and not having a cable’: UK’s bid for net zero in the balance due to grid ‘blind spot’", "description": "<p>As well as more clean energy, Britain needs miles of extra cable to carry it. But a global shortage of components and skills means efforts to meet climate targets will go down to the wire</p><p>From next year, engineers will need to roll out more than 100km (62 miles) of electric cabling every day until 2040 if the government hopes to power the UK towards its climate goals, according to new data.</p><p>Analysis of Britain’s existing power grids and the country’s predicted electricity demand reveals that within the next 17 years, more than 600,000km of electric lines will need to be either added or upgraded across the UK.</p> <a href=\"https://www.theguardian.com/business/2023/nov/25/race-to-get-uk-electricity-grid-ready-for-net-zero\">Continue reading...</a>", "link": "https://www.theguardian.com/business/2023/nov/25/race-to-get-uk-electricity-grid-ready-for-net-zero", "date_published": "2023-11-25T13:00:49+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘A disgrace’: headteachers attack Hunt’s failure to provide money for schools in autumn statement", "description": "<p>No new investment in staffing and buildings in England and Wales, despite Rishi Sunak’s funding pledge</p><p>Headteachers have called the government’s failure to invest in school staff and crumbling buildings in the autumn statement “an absolute disgrace”.</p><p>Unions said this weekend that the government had now lost any vestiges of credibility among teachers after the chancellor, Jeremy Hunt, failed to announce any new investment for schools on Wednesday – despite <a href=\"https://www.theguardian.com/education/2023/oct/08/unions-and-teachers-call-rishi-sunaks-new-education-plan-a-misdirected-fantasy\">Rishi Sunak’s pledge</a> at last month’s Conservative party conference that education would be his “main funding priority”.</p> <a href=\"https://www.theguardian.com/education/2023/nov/25/a-disgrace-headteachers-attack-hunts-failure-to-provide-money-for-schools-in-autumn-statement\">Continue reading...</a>", "link": "https://www.theguardian.com/education/2023/nov/25/a-disgrace-headteachers-attack-hunts-failure-to-provide-money-for-schools-in-autumn-statement", "date_published": "2023-11-25T13:00:48+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Tory donor Richard Desmond revives controversial east London housing development", "description": "<p>Billionaire submits proposals for scheme that government minister Robert Jenrick pushed in 2020, with nearly twice the number of properties of original plans</p><p>A Tory donor is drawing up fresh plans for a controversial property scheme that was at the heart of a lobbying row involving a senior minister.</p><p>Richard Desmond, the billionaire former owner of the <em>Daily Express</em>, has submitted new proposals for a huge housing project in east London, with almost twice the amount of housing envisaged under the original plans.</p> <a href=\"https://www.theguardian.com/media/2023/nov/25/tory-donor-richard-desmond-revives-controversial-east-london-housing-development\">Continue reading...</a>", "link": "https://www.theguardian.com/media/2023/nov/25/tory-donor-richard-desmond-revives-controversial-east-london-housing-development", "date_published": "2023-11-25T12:59:41+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘Scarred for life’: the families still seeking dead amid Gaza rubble", "description": "<p>Thousands of Palestinians remain buried under crumbling concrete and twisted metal. Recovering them is a grim task – even with the truce</p><p>On the 45th day of the bombing of Gaza, eight-year-old Waseem Abedrabou and his father Husam, left the family home for a night to stay with Husam’s mother.</p><p>“[His mother Abeer] doesn’t let Waseem sleep a metre away from her, but she let him sleep in that house that day,” said Dina Safi, Waseem’s aunt. “Husam wanted to see his family and Waseem wanted to see his grandma.”</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/scarred-for-life-the-families-still-seeking-dead-amid-gaza-rubble\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/scarred-for-life-the-families-still-seeking-dead-amid-gaza-rubble", "date_published": "2023-11-25T12:29:48+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Pope hit by ‘light flu symptoms’ week before key climate address", "description": "<p>Vatican says in brief statement that audiences Francis had planned for Saturday have been cancelled</p><p>Pope Francis has cancelled his scheduled activities for Saturday due to “light flu symptoms” a week before a key climate address he is due to make in Dubai.</p><p>“The audiences of the Holy Father planned for this morning have been cancelled as a result of light flu symptoms,” the Vatican said in a brief statement.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/pope-hit-by-light-flu-symptoms-week-before-key-climate-address-vatican\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/pope-hit-by-light-flu-symptoms-week-before-key-climate-address-vatican", "date_published": "2023-11-25T12:24:45+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Rejuvenated Martha Thomas ‘on a roll’ and savouring life at Tottenham", "description": "<p>The forward, an infrequent starter at Manchester United, has seen her form rewarded with a WSL player of the month award</p><p>When in July 2021 Martha Thomas joined Manchester United from West Ham, it’s fair to say that her new club’s fan base was underwhelmed by the signing. They did not have a problem with Thomas, but she was part of a cohort that were not considered the world-class talent needed to boost their bid for Champions League football, unlike the exiting Tobin Heath and Christen Press.</p><p>It was somewhat inevitable that the now Tottenham striker would underwhelm in Manchester – not because it was expected, how she would fit in was unknown, but because she was not really given a chance to flourish. The Scotland forward made 38 league appearances and scored six goals in her two seasons under Marc Skinner but started just nine games in her first season and once in her second. Unable to build any consistency, she struggled.</p> <a href=\"https://www.theguardian.com/foot", "link": "https://www.theguardian.com/football/2023/nov/25/martha-thomas-profile-tottenham-wsl-football", "date_published": "2023-11-25T12:01:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Meera Sodha’s vegan recipe for three-treasures soup | The new vegan", "description": "<p>A Chinese-style winter warmer of tofu, cabbage and spring onions</p><p>I have always loved the vivid language used to describe Chinese food, from the bewitching “ants climbing a tree” (a mince and noodle dish) to “Buddha jumps over the wall” – a dish that’s reportedly so delicious that Buddha apparently would. There are many dishes called “treasure” dishes, from four-treasure duck to eight-treasures soup, and I’m often struck by how everyday some of the ingredients in them are, though they may perhaps have been more celebrated centuries ago. This soup is my own attempt to celebrate the three main ingredients in the dish, all of them simple, but all much treasured in my kitchen: tofu, cabbage and spring onions.</p> <a href=\"https://www.theguardian.com/food/2023/nov/25/chinese-three-treasures-soup-recipe-meera-sodha\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2023/nov/25/chinese-three-treasures-soup-recipe-meera-sodha", "date_published": "2023-11-25T12:00:49+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Prenatal exposure to air pollution may hurt reproductive health in adult men, study finds", "description": "<p>Ingestion of particulate matter may shorten distance between anus and genitals in the womb, a sign of lower testosterone activity</p><p>In-utero exposure to common air pollutants may lower semen quality and increase the risk of reproductive system disease in men, new research finds.</p><p>The peer-reviewed Rutgers University study looked at whether exposure to particulate matter called 2.5 (PM2.5) and nitrogen oxide may shorten the distance between the anus and genitals, or the anogenital distance, in developing fetuses and newborns.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2023/nov/25/air-pollution-impacting-pregnancy-mens-reproductive-health\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2023/nov/25/air-pollution-impacting-pregnancy-mens-reproductive-health", "date_published": "2023-11-25T12:00:49+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "This is how we do it: ‘Sometimes we go to cinemas and have sex in the back row’", "description": "<p>Helena and Noel met on a swingers site for married couples but they’ve made a deep connection. So what’s next?</p><p><strong><a href=\"https://www.theguardian.com/lifeandstyle/2022/sep/08/would-you-and-your-sexual-partner-like-to-share-the-story-of-what-you-get-up-to-in-the-bedroom\">How do you do it? Share the story of your sex life, anonymously</a></strong></p><p>When Noel began to touch me I could sense him watching and listening, trying to work out precisely what gave me pleasure</p><p>I tell my wife I’m at the office and my employer thinks I’m working from home</p> <a href=\"https://www.theguardian.com/lifeandstyle/2023/nov/25/this-is-how-we-do-it-sometimes-we-go-to-cinemas-and-have-sex-in-the-back-row\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2023/nov/25/this-is-how-we-do-it-sometimes-we-go-to-cinemas-and-have-sex-in-the-back-row", "date_published": "2023-11-25T12:00:49+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "From Bob Chilcott to the Chapel Royal: the best classical Christmas albums of 2023", "description": "<p>Winter’s the watchword, from Lassus and Byrd to radiant new works and that rare thing – an opera star who resists the sleigh bells</p><p>Why buy a Christmas CD given you can now get any traditional carol online at a click? The challenge for any choir making a seasonal album – the trend now is for a more generic “winter” title – is to delve into the past or explore the new. In <strong><a href=\"https://www.resonusclassics.com/products/a-winter-breviary-music-for-christmas?pr_prod_strat=copurchase&amp;pr_rec_id=9653f8760&amp;pr_rec_pid=8303154168038&amp;pr_ref_pid=8302477344998&amp;pr_seq=uniform\">A Winter Breviary</a></strong><strong> </strong>(Resonus Classics), <strong>St Martin’s Voices</strong>, directed by Andrew Earis, perform 21 tracks by 10 living composers, all premiere recordings. The range suits this elite small ensemble: from the near stillness of Sarah MacDonald’s Like the Snow in Winter to the catchy alleluias of Lucy Walker’s The Angels’ Song or the beguiling inventio", "link": "https://www.theguardian.com/music/2023/nov/25/best-classical-christmas-albums-2023-a-winter-breviary-st-martins-voices-bob-chilcott-christmas-oratorio-merton-college-oxford-gesualdo-six-morning-star-christmas-from-the-chapel-royal-lise-davidsen-christmas-from-norway", "date_published": "2023-11-25T12:00:48+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘The poison continues to spread’: legal losses fail to quell election denial hotbed", "description": "<p>Cochise county, Arizona, has been convulsed by the actions of two Republican supervisors who questioned the integrity of elections and faces huge legal costs</p><p>In the year since two elected officials in rural Arizona <a href=\"https://www.theguardian.com/us-news/2023/mar/16/arizona-cochise-county-republican-election-denialism\">tried</a> to hand-count ballots then refused to certify an election, the consequences have started to trickle in.</p><p>Peggy Judd and Tom Crosby, the two Republican supervisors in Cochise county who led these efforts, were recently subpoenaed as part of an investigation by the state’s attorney general.</p> <a href=\"https://www.theguardian.com/us-news/2023/nov/25/cochise-county-arizona-election-denial\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2023/nov/25/cochise-county-arizona-election-denial", "date_published": "2023-11-25T12:00:48+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Motorised mice and hideous death masks: bringing The Witches to life on stage", "description": "<p>From mixing 20 shades of pink to not making the witch heads too scary, a behind-the-scenes tour of the National Theatre’s new production reveals the craft that goes into bringing Roald Dahl’s children’s classic to the stage</p><p>Across the hidden hallways, humming workshops and bustling backstage spaces at the National Theatre, preparation is well under way for a musical version of Roald Dahl’s The Witches. Everyone is busy. Very busy. The wham (wigs, hair and makeup) team are working at full capacity on more than 50 wigs, including a fair few that emit smoke on cue. The armoury department has been tackling robotic mice and runaway chefs’ hats for nine long months, the costume department is handling its largest workload in 10 years (300 costumes and counting) and, over in scenic design, the painters have been sampling colours – including 20 different types of pink – since early summer.</p><p>(Clockwise from top left) Johanna Coe, costume designer; Kim Kasim, wig maker; Grace Cowi", "link": "https://www.theguardian.com/artanddesign/2023/nov/25/behind-the-scenes-national-theatre-roald-dahl-the-witches", "date_published": "2023-11-25T11:55:48+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Manchester City v Liverpool: Premier League – live", "description": "<ul><li>Updates from the 12.30pm GMT kick-off at the Etihad Stadium</li><li>Want to share your thoughts? <a href=\"mailto:batty.glendenning@theguardian.com\">Send them to Barry</a></li></ul><p><strong>Manchester City:</strong> Ederson, Walker, Akanji, Dias, Ake, Rodri, Bernardo, Doku, Foden, Alvarez, Haaland</p><p><strong>Subs: </strong>Ortega, Carson, Phillips, Stones, Gomez, Gvardiol, Bobb, Lewis</p><p><strong>Referee:</strong> Simon Hooper</p><p><strong>Referee’s assistants:</strong> Adrian Holmes and Simon Long</p><p><strong>Fourth official:</strong> Graham Scott</p><p><strong>VAR:</strong> John Brooks</p> <a href=\"https://www.theguardian.com/football/live/2023/nov/25/manchester-city-v-liverpool-premier-league-live\">Continue reading...</a>", "link": "https://www.theguardian.com/football/live/2023/nov/25/manchester-city-v-liverpool-premier-league-live", "date_published": "2023-11-25T11:32:27+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Indian rescue workers try new shaft after drilling stalls near trapped men", "description": "<p>Efforts to free 41 workers stuck in tunnel for almost two weeks hit another setback as earth-boring machine breaks down</p><p>Indian rescue workers have brought in a new digging machine to open a vertical shaft to free 41 men trapped inside a collapsed road tunnel, after efforts via another route hit a snag metres away from them.</p><p>In the latest setback in attempts to rescue the increasingly desperate workers, who have been trapped for almost two weeks, engineers driving a metal pipe through 57 metres (187ft) of rock and concrete ran into metal rods and construction vehicles buried in the earth.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/indian-tunnel-collapse-rescue-workers-drilling-stalls-trapped-men\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/indian-tunnel-collapse-rescue-workers-drilling-stalls-trapped-men", "date_published": "2023-11-25T11:29:14+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "UAE-backed bid for Telegraph raises fears of Gulf ‘newswashing’", "description": "<p>Deal could be referred to Ofcom but some analysts say concerns about foreign influence may be overstated</p><p>Shortly after midday on Monday, an email arrived in the inbox of staff at the Daily Telegraph from their editor. “Over the weekend a number of you have asked me questions about the future ownership of the Telegraph,” Chris Evans wrote. “You’ve been asking me how we can be confident that editorial independence would be protected. At the moment I know no more than you will have read.”</p><p>After a turbulent week at one the UK’s biggest and most influential newspapers, the staff of the broadsheet are not the only ones to be concerned.</p> <a href=\"https://www.theguardian.com/media/2023/nov/25/uae-backed-bid-for-telegraph-raises-fears-of-gulf-newswashing\">Continue reading...</a>", "link": "https://www.theguardian.com/media/2023/nov/25/uae-backed-bid-for-telegraph-raises-fears-of-gulf-newswashing", "date_published": "2023-11-25T11:00:48+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Young country diary: I couldn’t believe my eyes – a white deer | Rufus", "description": "<p><strong>South Wales:</strong> It lives in the woods and I’d like to see it up close, but it always jumps over the fence whenever we get near</p><p>I live on a farm. We have cows, we have sheep, we have chickens, and we have dogs and a rabbit. And in the woods, we have some deer. One day I was in my dad’s Land Rover and we were driving around the fields to check the sheep, and we saw a head pop out of the trees. At&nbsp;first I didn’t recognise it.</p><p>As we got closer, we saw it was a deer with a white face and white body. My dad said it was a white hart. He told me how rare it was to see one. I realised that I had just seen something that most people don’t get to see in their lives. The sight was so beautiful. It was just standing there, completely still, with beautiful long antlers sticking&nbsp;out of its head.</p> <a href=\"https://www.theguardian.com/environment/2023/nov/25/young-country-diary-i-couldnt-believe-my-eyes-a-white-deer\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2023/nov/25/young-country-diary-i-couldnt-believe-my-eyes-a-white-deer", "date_published": "2023-11-25T11:00:48+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Headaches at Fox as Lachlan Murdoch takes reins from father Rupert", "description": "<p>Tycoon’s eldest son promises ‘no change’ in Fox News strategy but suite of legal claims threaten to derail family empire</p><p>Lachlan Murdoch has been chairman of News Corporation and Fox Corporation, the parent company of Fox News, for more than a week now after his father Rupert finally officially handed the reins to him.</p><p>Beyond the titular changes, how much of a transition is in fact being made is open to question. “I hope to continue an active role in the company,” the elder Murdoch, 92, remarked during the company’s most recent annual shareholders meeting.</p> <a href=\"https://www.theguardian.com/media/2023/nov/25/lachlan-rupert-murdoch-fox-news\">Continue reading...</a>", "link": "https://www.theguardian.com/media/2023/nov/25/lachlan-rupert-murdoch-fox-news", "date_published": "2023-11-25T11:00:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "In the dog house: why are so many of Britain’s dogs behaving badly?", "description": "<p>Sophie was too scared to go outside; Hendrix will chew anything when left alone. As the number of dogs in the UK has exploded, so has the number of unruly pooches</p><p>Hendrix is absolutely not a bad dog. A sweet-faced black cockapoo, he is a beloved family pet and devoted to his owners. But in a sense, that’s the problem. He gets so anxious if left alone that he once chewed a door frame right through to the plaster, and has gouged floorboards. Left in the car once for a few minutes while his owner nipped to the shop, he shredded a seatbelt.</p><p>His owner, Naz Karim, a 45-year-old software developer from Leigh-on-Sea in Essex, now works from home full-time, which has helped. But the minute he or his wife and two teenage children pick up their keys to leave the house, Hendrix starts getting nervous.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2023/nov/25/in-the-dog-house-why-are-so-many-of-britains-dogs-behaving-badly\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2023/nov/25/in-the-dog-house-why-are-so-many-of-britains-dogs-behaving-badly", "date_published": "2023-11-25T11:00:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Ottessa Moshfegh: ‘Everyone asked me why I had written such a disgusting female character’", "description": "<p>Before My Year of Rest and Relaxation, the author published Eileen, a dark noir about another disaffected woman. As it comes to the screen, she looks back on the extreme reaction to her complex heroine</p><p>When my 2015 debut novel Eileen made it on to the shortlist for the Man Booker prize, I knew I was in trouble. Up until that point, I had skirted by the mainstream as a writer of experimental literary short fiction. Writing a full-length novel that resembled something I thought a “normal” person might read felt like an outlandish endeavour at the time, but one I undertook with the seriousness of a young writer desperate to make a living doing what she loves.</p><p>I have since published three other novels and a collection of short stories, and at 42 I have been mostly disabused of my innocence. But a decade earlier, writing a novel that followed the conventions of the traditional form was an act of underhanded rebellion. I felt that I was feeding the beast of a capitalist book", "link": "https://www.theguardian.com/books/2023/nov/25/ottessa-moshfegh-everyone-asked-me-why-i-had-written-such-a-disgusting-female-character", "date_published": "2023-11-25T11:00:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘Cultural vandalism’: row as Kew Gardens and Natural History Museum plan to move collections out of London", "description": "<p>Scientific specimens and research facilities set to be rehoused in Reading University science park, alongside British Museum archive</p><p>It is intended to be a world-leading research facility that will house some of the UK’s greatest collections of historical, botanical and zoological samples. Millions of ancient mosaics and pieces of sculpture, rare plant specimens and fossil remnants will be taken from the <a href=\"https://www.theguardian.com/culture/british-museum\" title=\"\">British Museum</a>, the <a href=\"https://www.theguardian.com/science/kew-gardens\" title=\"\">Royal Botanical Gardens at Kew</a> and the<a href=\"https://www.theguardian.com/culture/natural-history-museum\" title=\"\"> Natural History Museum</a> (NHM) in London and rehoused at Reading University’s Thames Valley Science Park in Shinfield, Berkshire.</p><p>London’s ageing buildings, crumbling storage space, and soaring land prices mean a move beyond the M25 is the only realistic way to protect the capital’s swellin", "link": "https://www.theguardian.com/culture/2023/nov/25/cultural-vandalism-row-as-kew-gardens-and-natural-history-museum-plan-to-move-collections-out-of-london", "date_published": "2023-11-25T11:00:17+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "James Cleverly ‘frustrated’ with fixation on government’s Rwanda policy", "description": "<p>Home secretary says policy not ‘be all and end all’ of plans to tackle illegal immigration, in clear break from Braverman</p><p>James Cleverly has said he is frustrated with the fixation on the government’s Rwanda policy, saying it is not the “be all and end all” of plans to tackle illegal immigration.</p><p>The home secretary, who replaced Suella Braverman after she was sacked almost a fortnight ago, <a href=\"https://www.thetimes.co.uk/article/james-cleverly-interview-home-secretary-migrants-rwanda-fb05pxv9b\">told the Times</a> he had become frustrated with the focus on the Rwanda plan.</p> <a href=\"https://www.theguardian.com/politics/2023/nov/25/james-cleverly-frustrated-with-fixation-government-rwanda-immigration-policy\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2023/nov/25/james-cleverly-frustrated-with-fixation-government-rwanda-immigration-policy", "date_published": "2023-11-25T10:58:10+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Pakistan: shopping mall fire in Karachi kills at least 11 people", "description": "<p>Deadly blaze that began on fourth floor of six-storey building in southern port city leaves another 35 people injured</p><p>At least 11 people have been killed and 35 injured by a fire at a shopping mall in Pakistan’s commercial capital of Karachi, officials said.</p><p>More than 60 people were inside the mall when the fire broke out on the fourth floor of the six-storey building in the southern port city.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/pakistan-shopping-mall-fire-karachi-deaths\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/pakistan-shopping-mall-fire-karachi-deaths", "date_published": "2023-11-25T10:31:32+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Rock climbers like to connect with nature – but are they also destroying it?", "description": "<p>Outdoor climbing has boomed in popularity worldwide but some experts say the pursuit can push vulnerable cliff-dwelling species to the brink</p><p>When Laura Boggess first visited the cliff face in Boone, North Carolina, she admired the colourful rock tripe covering the vertical surface, and the green moss mats perched on top.</p><p>The crag was part of a rolling, mountainous landscape, sheer cliffs jutting above an enormous valley filled with trees of varying shades of green. It showcased the pristine, usually inaccessible natural beauty that draws so many climbers to the sport.</p> <a href=\"https://www.theguardian.com/environment/2023/nov/25/rock-climbing-damage-cliff-ecosystems-aoe\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2023/nov/25/rock-climbing-damage-cliff-ecosystems-aoe", "date_published": "2023-11-25T10:00:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Sacking, revolt, return: how crisis at OpenAI over Sam Altman unfolded", "description": "<p>Firing of the CEO behind ChatGPT company sent shock waves through Silicon Valley – only for him to be reinstated days later</p><p>When Sam Altman, the chief executive of OpenAI, took to the stage in San Francisco nine days ago he hinted at another significant development in the world of artificial intelligence.</p><p>“Four times now in the history of OpenAI, the most recent time was just in the last couple weeks, I’ve gotten to be in the room, when we sort of push the veil of ignorance back and the frontier of discovery forward, and getting to do that is the professional honour of a lifetime,” he told the Asia-Pacific Economic Cooperation (Apec) summit.</p> <a href=\"https://www.theguardian.com/technology/2023/nov/25/how-crisis-openai-sam-altman-unfolded\">Continue reading...</a>", "link": "https://www.theguardian.com/technology/2023/nov/25/how-crisis-openai-sam-altman-unfolded", "date_published": "2023-11-25T10:00:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "King’s estate to transfer £100m into ethical funds after bona vacantia revelations", "description": "<p>Exclusive: Duchy of Lancaster changes investment policy amid questions over how money collected from dead people is used </p><p>King Charles’s estate has announced it is transferring more than £100m, including funds collected from dead people under the archaic system of <em>bona vacantia</em>, into ethical investment funds after an investigation by the Guardian.</p><p>The surprise announcement comes amid growing pressure on the king over the Duchy of Lancaster’s use of funds collected from people who die in the north-west of England with no will or next of kin.</p> <a href=\"https://www.theguardian.com/uk-news/2023/nov/25/kings-estate-transfer-cash-ethical-funds-bona-vacantia-revelations\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2023/nov/25/kings-estate-transfer-cash-ethical-funds-bona-vacantia-revelations", "date_published": "2023-11-25T10:00:46+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "My doctor diagnosed me with ADHD – so how did my phone find out? | Sarah Marsh", "description": "<p>At my most vulnerable, targeted ads started selling me services that could help manage my symptoms – for a price. The law must offer more protection</p><p>After I was diagnosed with attention deficit hyperactivity disorder (ADHD) in 2022, I started following Instagram accounts that could help me understand the condition. Reels and memes about being neurodivergent started to fill my feed, along with tips on how to manage ADHD in a relationship and other helpful advice. But within days, something else happened: my phone found out about my diagnosis.</p><p>All of a sudden, I was being served with ads for apps that claimed they could help me to manage my symptoms. There were quizzes to determine what type of ADHD I had: was I predominantly inattentive or impulsive, one asked. Did I definitely have it? Find out by taking this diagnostic test, another promised.</p><p>Sarah Marsh is a Guardian news reporter</p> <a href=\"https://www.theguardian.com/commentisfree/2023/nov/25/doctor-diagnos", "link": "https://www.theguardian.com/commentisfree/2023/nov/25/doctor-diagnosed-adhd-phone-targeted-ads", "date_published": "2023-11-25T10:00:46+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘Even without seeing their faces, it’s storytelling’: Akbar Mehrinezhad’s best phone picture", "description": "<p>The Iranian photographer, in his hometown, flashed back to his youth</p><p><strong> </strong></p><p>In Ahmad Abad, a suburb of the Iranian city of Tabriz, a gaggle of children were playing on a gas pipe. Akbar Mehrinezhad often took photographs here, on the edge of the city, drawn to the subjects he found. When he saw these children some way off in the distance, he had to move quickly. “I ran to capture it. Even without seeing their faces, it’s storytelling,” he says of his choice to focus on their shadows, and one pair of dangling feet.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2023/nov/25/akbar-mehrinezhad-best-phone-picture\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2023/nov/25/akbar-mehrinezhad-best-phone-picture", "date_published": "2023-11-25T10:00:46+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Tom Allen: ‘At an early corporate gig, they opened the buffet in the middle of my set – everybody left’", "description": "<p>The comedian on a grim festive job playing Bing Crosby, an air-kiss from Joanna Lumley, and his love of bread and wine</p><p>Born in London, Tom Allen, 40, left school at 18 and pursued a career in comedy. In 2005, he won the So You Think You’re Funny standup competition and the BBC New Comedy award. In 2020, he published a bestselling memoir, <a href=\"https://guardianbookshop.com/no-shame-9781529348941\" title=\"\">No Shame</a>, followed by <a href=\"https://www.theguardian.com/books/2022/dec/08/too-much-by-tom-allen-review-life-after-losing-dad\" title=\"\">Too Much</a> in 2022. On television he presents The Apprentice: You’re Fired and co-hosts Cooking with the Stars. Since 2018, he has been a presenter on Channel 4’s The Great British Bake Off: An Extra Slice. His show Completely is on tour nationwide until June 2024. He lives in London.</p><p><strong>When were you happiest?</strong><br />On holiday in Spain with my family about 20 years ago. Sad, but true.</p> <a href=\"https://www.t", "link": "https://www.theguardian.com/culture/2023/nov/25/tom-allen-interview", "date_published": "2023-11-25T09:30:45+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Russian mass drone attack injures five in Kyiv", "description": "<p>Buildings across Ukrainian capital damaged in what officials say was largest drone attack of war so far</p><p>• <a href=\"https://www.theguardian.com/world/live/2023/nov/25/russia-ukraine-war-kyiv-drone-attack-putin-zelenskiy-latest-news\">Russia-Ukraine war – latest news updates</a></p><p>• <a href=\"https://www.theguardian.com/world/2023/nov/25/what-happened-in-the-russia-ukraine-war-this-week-catch-up-with-the-must-read-news-and-analysis\">What happened in the war this week?</a></p><p>Five people have been injured after Russia struck the Ukrainian capital of Kyiv in what officials said was its largest drone attack of the war to date.</p><p>The attack began hitting different districts of Kyiv in the early hours of Saturday, with more waves coming at sunrise. The air raid warning lasted six hours.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/russian-mass-drone-attack-injures-five-in-kyiv\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/russian-mass-drone-attack-injures-five-in-kyiv", "date_published": "2023-11-25T09:09:14+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Where are all the ‘godmothers’ of AI? Women’s voices are not being heard", "description": "<p>Amid the coverage of Sam Altman returning to the helm of OpenAI, women are being written out of the future of AI</p><p>‘We are heading toward the best world ever,” said Sam Altman in an interview earlier this month, just before the saga of his firing and rehiring as OpenAI’s chief executive. As an expert on gender equity in news, this statement made me wonder: whose world was heading towards being the best ever?</p><p>As it turns out, the one the Altman team is crafting is largely devoid of women. My analysis amid the <a href=\"https://www.theguardian.com/technology/2023/nov/22/sam-altman-openai-ceo-return-board-chatgpt\">furore around his dismissal</a> revealed fascinating insights: for example, of the 702 (out of 750) employees who signed the letter demanding Altman’s reinstatement more than 75% were men, a gender imbalance that matches that identified in AI teams in McKinsey’s <a href=\"https://www.mckinsey.com/~/media/mckinsey/business%20functions/quantumblack/our%20insights/the%", "link": "https://www.theguardian.com/global-development/2023/nov/25/where-are-godmothers-of-ai-womens-voices-not-heard-in-tech-sam-altman-openai", "date_published": "2023-11-25T09:00:47+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "The Christmas gift guide: 201 great gift ideas for £50 and under", "description": "<p>From kids and cats to outdoor types, fashion fans and foodies, find something sustainable, ethical and special for everyone</p><p><em>Christmas morning marvels for under £20</em></p> <a href=\"https://www.theguardian.com/lifeandstyle/2023/nov/25/the-christmas-gift-guide-201-great-gift-ideas-for-50-and-under\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2023/nov/25/the-christmas-gift-guide-201-great-gift-ideas-for-50-and-under", "date_published": "2023-11-25T09:00:45+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘We will coup whoever we want!’: the unbearable hubris of Musk and the billionaire tech bros", "description": "<p>Challenging each other to cage fights, building apocalypse bunkers – the behaviour of today’s mega-moguls is becoming increasingly outlandish and imperial</p><p>Even their downfalls are spectacular. Like a latter-day Icarus flying too close to the sun, disgraced crypto-god Sam Bankman-Fried crashed and burned this month, recasting Michael Lewis’s exuberant biography of the convicted fraudster – <a href=\"https://www.theguardian.com/books/2023/oct/25/going-infinite-by-michael-lewis-review-falling-for-the-antihero\" title=\"\">Going Infinite</a> – into the story of a supervillain. Even his potential sentence of up to 115 years in prison seems more suitable for a larger-than-life comic book character – the Joker being carted off to Arkham Asylum – than a nerdy, crooked currency trader.</p><p>But that’s the way this generation of tech billionaires rolls. The Elon Musk we meet in <a href=\"https://www.theguardian.com/books/2023/sep/13/elon-musk-by-walter-isaacson-review-arrested-development", "link": "https://www.theguardian.com/books/2023/nov/25/we-will-coup-whoever-we-want-the-unbearable-hubris-of-musk-and-the-billionaire-tech-bros", "date_published": "2023-11-25T09:00:45+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "How the Daily Mail became the Boris and Dorries show – and left middle England behind | Archie Bland", "description": "<p>Its new star columnists are symptoms, but not the cause, of the newspaper no longer being quite sure what it stands for</p><p>As the Conservative party stares down the barrel of a likely general election defeat, it’s hardly surprising if it can’t work out what its future might look like. The weirder thing is that the Daily Mail can’t, either.</p><p>Never as slavishly loyal to the Tory establishment as its less attentive critics believe, the paper has always had a sharp vision of where the right is heading next – a vision influential enough on government policy for the last 13 years to matter to everyone, not just the party faithful. Today, the choices on the table seem reasonably clear.</p><p>Archie Bland is the editor of the Guardian’s <a href=\"https://www.theguardian.com/global/2022/sep/20/sign-up-for-the-first-edition-newsletter-our-free-news-email\">First Edition</a> newsletter. He will be writing a new monthly column on media, culture and technology</p> <a href=\"https://www.th", "link": "https://www.theguardian.com/commentisfree/2023/nov/25/daily-mail-middle-england-boris-johnson-nadine-dorries", "date_published": "2023-11-25T09:00:44+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Russia-Ukraine war live: Kyiv hit by ‘largest drone attack’ of war, officials say", "description": "<p>Ukrainian president says most of the drones were shot down</p><ul><li><a href=\"https://www.theguardian.com/world/2023/nov/25/russia-ukraine-war-at-a-glance-what-we-know-on-day-640\">What we know on day 640 of the invasion</a></li></ul><p>President Volodymyr Zelenskiy on Friday said that Ukraine needed to secure three key “victories” abroad, including the approval of major aid packages from the US Congress and the European Union, and a formal start of accession talks to join the EU.</p><p>Zelenskiy also announced the latest dismissals in the military, four deputy commanders in the national guard, but gave no reasons for their removal. The president and other officials have vowed to make the military’s operations more efficient and responsive to the needs of servicemen.</p> <a href=\"https://www.theguardian.com/world/live/2023/nov/25/russia-ukraine-war-kyiv-drone-attack-putin-zelenskiy-latest-news\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2023/nov/25/russia-ukraine-war-kyiv-drone-attack-putin-zelenskiy-latest-news", "date_published": "2023-11-25T08:24:09+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Pilchards, Urchins and the Clockwork Cheese: hunting sport’s quirkiest nicknames", "description": "<p>Amid the Hippos and the Mintcakes, the Turbines and the Iron, there is a rich well of geography, history and local lore</p><p>Four years ago one journalist, who enjoys going to obscure non-league football matches on wintry evenings, emailed another journalist, who enjoys quirky facts, to inform him that the Cornish team Perranporth, who play in the <a href=\"https://fulltime.thefa.com/table.html?league=656725252&amp;selectedSeason=762239858&amp;selectedDivision=356705064&amp;selectedCompetition=0&amp;selectedFixtureGroupKey=1_419873399%20#tab-2\">St Piran League Division 4 West</a>, were known as the Pilchards. Also that their manager had once been quoted as saying: “I’m gutted.”</p><p>Thus began an intermittent correspondence where we regaled each other with new revelations about nicknames from the lesser known tiers of English football. We discovered the Highwaymen, the Peppermints, the Jam Boys and the Dabbers. Muscular names like the Nailers, the Lockmen, the Turbines and the Ir", "link": "https://www.theguardian.com/football/2023/nov/25/pilchards-urchins-and-the-clockwork-cheese-hunting-sports-quirkiest-nicknames", "date_published": "2023-11-25T08:10:19+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "While the world has abandoned Gaza, its doctors have done the opposite. They are our heroes | Ghada Ageel", "description": "<p>The destruction of Palestinian hospitals adds to the trauma for the medics – whose life’s purpose is to heal</p><p>In the movie Any Given Sunday, Al Pacino plays a highly strung football coach. In a key scene, he gives a speech about how “life is a game of inches” and how when “you add up all those inches that’s gonna make the difference between livin’ and dyin’”.</p><p>For Pacino, the rousing words are a figure of speech. For the people of Gaza – particularly its doctors, nurses and medical staff – these words are a matter of fact. A single step, a single decision, can mean the difference between life and death. After 48 days of war, Israel and Hamas have agreed to a truce for four days. But given the immense devastation of their civilian infrastructure, particularly the hospitals, this “respite” will be nothing of the sort for the people of Gaza.</p> <a href=\"https://www.theguardian.com/commentisfree/2023/nov/25/world-abandoned-gaza-doctors-heroes-palestinian-hospitals\">Continue", "link": "https://www.theguardian.com/commentisfree/2023/nov/25/world-abandoned-gaza-doctors-heroes-palestinian-hospitals", "date_published": "2023-11-25T08:00:44+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Braised tofu, sea bass and pasta: Yotam Ottolenghi’s recipes for weeknight meals", "description": "<p>Persian-style braised tofu with sour yoghurt and spinach, a pleasingly simple cabbage and poppy seed pasta, and steamed fish with cumin and tomato oil</p><p>The perennial question for weeknight meals is, what are the rules? For me, for now, and whenever I can, it’s essentially a 30-minute window, give or take, from when I start chopping to dishing up, and pretty much serve straight from the pan, too. It’s very often pasta for comfort, or steamed fish for speed. Of course, swaps are made and shortcuts taken, but these are my speedy solutions for when it’s 8pm and I’m starving.</p> <a href=\"https://www.theguardian.com/food/2023/nov/25/braised-tofu-sea-bass-tofu-cabbage-poppy-pasta-yotam-ottolenghi-weeknight-meals-recipes\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2023/nov/25/braised-tofu-sea-bass-tofu-cabbage-poppy-pasta-yotam-ottolenghi-weeknight-meals-recipes", "date_published": "2023-11-25T08:00:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Katie Taylor faces Cameron rematch knowing defeat could spell the end", "description": "<p>‘I’m like a woman possessed,’ says Ireland’s superstar as she fights against an undefeated opponent and the passage of time</p><p>“I hate all the talk,” Katie Taylor says as she sets aside her usual polite patience and shows how much she needs to win her world title rematch against Chantelle Cameron in Dublin on Saturday night. Taylor lost her long unbeaten record as the dominant force in women’s boxing when she was outpointed by Cameron six months ago. The pain she has been through can be heard in her blunt dismissal of the fripperies surrounding a fight which could have stark consequences for her career.</p><p>“I hate all these press conferences, there’s nothing to say,” Taylor says. “The only people I listen to are my team, my family, the people I trust.”</p> <a href=\"https://www.theguardian.com/sport/2023/nov/25/katie-taylor-chantelle-cameron-rematch-boxing-dublin\">Continue reading...</a>", "link": "https://www.theguardian.com/sport/2023/nov/25/katie-taylor-chantelle-cameron-rematch-boxing-dublin", "date_published": "2023-11-25T08:00:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "The Coiled Serpent by Camilla Grudova review – stunning short stories", "description": "<p>There’s a glorious excess to these weirdly baroque tales, which set their sights on exploitation and English exceptionalism</p><p>It has been a banner year for Camilla Grudova. Her excellent debut novel <a href=\"https://www.theguardian.com/books/2022/jul/20/children-of-paradise-by-camilla-grudova-review-loner-life-at-a-crumbling-cinema\" title=\"\">Children of Paradise</a>, about an eclectic group of rebellious cinema ushers, was longlisted for the Women’s prize for fiction. A few months later, she found a well-deserved spot among Granta’s <a href=\"https://www.theguardian.com/books/2023/apr/15/grantas-best-of-young-british-novelists-meet-the-class-of-23\" title=\"\">Best of Young British Novelists</a> class of 2023. The Coiled Serpent is an utterly triumphant way to see it out.</p><p>Through Ceiling and Walls, the first short story in the collection, opens – as many good tales do – with a strange visitor to a strange country. The visitor is an unnamed academic, and the country an island", "link": "https://www.theguardian.com/books/2023/nov/25/the-coiled-serpent-by-camilla-grudova-review-stunning-short-stories", "date_published": "2023-11-25T07:30:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Israel-Hamas war live: Hamas set to release fresh wave of hostages, reports say, as ceasefire continues", "description": "<p>Key mediator Qatar set announce numbers of hostages and prisoners to be freed on Saturday in second swap since four-day ceasefire came into effect</p> <a href=\"https://www.theguardian.com/world/live/2023/nov/25/israel-hamas-war-live-hamas-set-to-release-fresh-wave-of-hostages-reports-say-as-ceasefire-continues\">Continue reading...</a>", "link": "https://www.theguardian.com/world/live/2023/nov/25/israel-hamas-war-live-hamas-set-to-release-fresh-wave-of-hostages-reports-say-as-ceasefire-continues", "date_published": "2023-11-25T07:09:01+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘I recognised him right away’: Thai woman describes joy and relief as her brother is freed by Hamas", "description": "<p>Exclusive: Vetoon Phoome, 33, was taken hostage on 7 October while he was in Israel working on a farm. His sister tells of her happiness at his release</p><ul><li><a href=\"https://www.theguardian.com/world/israel-hamas-war\">Israel-Hamas war: see all of our coverage</a></li></ul><p>Rungarun Wichangern was lying on her bed, staring at her phone and hoping desperately for news, when she spotted the photo. An image had been shared on Facebook, showing 10 Thai workers who had been held hostage in Gaza for seven weeks, <a href=\"https://www.theguardian.com/world/2023/nov/24/thailand-gaza-hostages-hopes-released\">finally being driven to safety</a>.</p><p>She felt sure her younger brother, 33-year-old Vetoon Phoome, who had been working on a farm close to Gaza, and was abducted on 7 October, was among those freed.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/hostage-thai-woman-describes-joy-and-relief-as-her-brother-is-freed-by-hamas\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/hostage-thai-woman-describes-joy-and-relief-as-her-brother-is-freed-by-hamas", "date_published": "2023-11-25T07:04:50+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Two in five adults in England would not ask GP about possible cancer symptoms", "description": "<p>Poll finds more than half of male respondents would not seek doctor’s advice, as NHS England seeks to promote early diagnosis</p><p>Millions of people would not go their GP with possible cancer symptoms, according to new research.</p><p>A poll for NHS England of 2,000 adults found that more than two in five wouldn’t visit their GP if they had possible cancer symptoms. The figure is particular high among men, with more than half saying they wouldn’t speak to their doctor, compared with 35% of women.</p> <a href=\"https://www.theguardian.com/society/2023/nov/25/two-in-five-adults-in-england-would-not-ask-gp-about-possible-cancer-symptoms\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2023/nov/25/two-in-five-adults-in-england-would-not-ask-gp-about-possible-cancer-symptoms", "date_published": "2023-11-25T07:00:44+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "20 of the best UK pubs with bedrooms, for lunch and a winter walk", "description": "<p>What’s better than a winter pub lunch? Staying the night afterwards. Our pick includes coaching inns, a 12th-century abbey and a Game of Thrones hotspot</p><p>Fireside lunches in cheerful pubs are one of the great pleasures of the UK winter, and this score of snug venues all come with somewhere to stay as well as cobweb-clearing walks from the door.</p> <a href=\"https://www.theguardian.com/travel/2023/nov/25/20-of-the-best-uk-pubs-with-rooms-lunch-winter-walk\">Continue reading...</a>", "link": "https://www.theguardian.com/travel/2023/nov/25/20-of-the-best-uk-pubs-with-rooms-lunch-winter-walk", "date_published": "2023-11-25T07:00:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Grenfell Tower inquiry’s final report on cause of disaster delayed again", "description": "<p>Findings may not be released until summer as process of writing to those likely to be criticised ‘proving time-consuming’</p><p>The official findings about what caused the Grenfell Tower disaster have been delayed again and may not be released until the middle of next year – seven years after the council block fire that killed 72 people.</p><p>It was initially hoped that the report would be published this autumn, then it was pushed to early next year. But now it may not be until summer. It means potential criminal prosecutions for manslaughter, fraud and health and safety offences will also be delayed, with any trials unlikely to start until late 2025 or even 2026.</p> <a href=\"https://www.theguardian.com/uk-news/2023/nov/25/grenfell-tower-inquiry-final-report-delayed-again\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2023/nov/25/grenfell-tower-inquiry-final-report-delayed-again", "date_published": "2023-11-25T07:00:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Sex toys, selfishness and why we won’t settle: life as a single woman, across the generations", "description": "<p>Uncoupled doesn’t have to mean incomplete. Eight writers - from their 20s to 90s - celebrate single life as a destination of its own</p><p>When my friend Moya and I got out of the taxi in my home city of Leeds, there was a period pad on the pavement, which set the tone for the night out we ended up having. I wanted to get with someone, and I knew it would happen because I tend to have a lot more success in Leeds than I do in London – up there, guys like girls in fake eyelashes who ignore the rule: “If you have your legs out you can’t show your cleavage.” I thought I’d found him at the first bar, when this guy introduced himself to me. He had curtains and a cheeky smile, was big and broad. Nice, I thought, here we go.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2023/nov/25/women-writers-on-being-single-annie-lord-al-kennedy-joan-bakewell\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2023/nov/25/women-writers-on-being-single-annie-lord-al-kennedy-joan-bakewell", "date_published": "2023-11-25T07:00:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Isas: UK savers to get freedom to chase better deals as rules change", "description": "<p>Shake-up will mean people can pay into more than one Isa of the same type, but experts say £20,000 limit should also rise</p><p>Getting the best out of Isas should become easier for UK savers after the government announced a shake-up that will let them hop on to higher-paying accounts if they become available.</p><p>The <a href=\"https://assets.publishing.service.gov.uk/media/655e107697196d000d985d6b/E02982473_Autumn_Statement_Nov_23_Accessible_v3.pdf\" title=\"\">autumn statement documents</a> revealed ministers are making a series of changes to “simplify” Isas. As well as giving people more choice, these will reduce the risk of people accidentally breaking the rules. But some commentators argued that the various changes made the system more complicated, not less.</p> <a href=\"https://www.theguardian.com/money/2023/nov/25/isas-uk-savers-to-get-freedom-to-chase-better-deals-as-rules-change\">Continue reading...</a>", "link": "https://www.theguardian.com/money/2023/nov/25/isas-uk-savers-to-get-freedom-to-chase-better-deals-as-rules-change", "date_published": "2023-11-25T07:00:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Slow Horses: it’s wild how good Gary Oldman’s spy thriller is", "description": "<p>From its cast of acting royalty – Kristin Scott Thomas! – to the excellent dialogue, this drama just whizzes by. It’s a hugely fun, totally charming watch that gets everything right</p><p>There are a few no-miss TV pitches, shows that will be commissioned again and again until the light fades out of the sky: “coppers – what if there was a good one?”; “genius detective investigates a murder despite not quite being over their dead kid”; “we’ll never work out as a couple … unless?”; and, of course, “I’m a spy, but get this: one who breaks all the rules”. They won’t stop making them and I won’t stop watching them. And so I gleefully welcome season three of Slow Horses (Apple TV+, from Friday 1 December).</p><p>It’s wild how good <a href=\"https://www.theguardian.com/tv-and-radio/2022/apr/01/slow-horses-review-jaded-spies-gary-oldman-kristen-scott-thomas\">Slow Horses</a> is, actually. We should be talking about it all the time. Gary Oldman is a standout – he looks so deliciously dreadfu", "link": "https://www.theguardian.com/tv-and-radio/2023/nov/25/kristin-scott-thomas-slow-horses-its-wild-how-good-gary-oldmans-spy-thriller-is", "date_published": "2023-11-25T07:00:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "What links UN peacekeepers and the Virgin Mary? The Saturday Quiz", "description": "<p>From Daisy Pulls It Off to Head-Smashed-In Buffalo Jump, test your knowledge with the Saturday quiz</p><p><strong>1</strong> Which former head of state was arrested in London in 1998? <br /><strong>2</strong> Where is Head-Smashed-In Buffalo Jump a world heritage site? <br /><strong>3</strong> What mammals are toothed or baleen? <br /><strong>4</strong> What is the only active volcano on mainland Europe? <br /><strong>5</strong> Which film set did Robin Williams call “Stalag Altman”? <br /><strong>6</strong> Which element is named after Japan in Japanese? <br /><strong>7</strong> In which sport do players warm up in the bullpen? <br /><strong>8</strong> What classical music magazine has been in print since 1923? <br /><strong>What links: <br />9</strong> Peter Taylor; Stuart Pearce; Sam Allardyce? <br /><strong>10</strong> Virgin Mary; Jonathan Buttall; UN peacekeepers; Pontins entertainers? <br /><strong>11</strong> Britain (1812); Mexico (1846); Spain (1898); Germany (1917)? <br", "link": "https://www.theguardian.com/games/2023/nov/25/what-links-un-peacekeepers-and-the-virgin-mary-the-saturday-quiz", "date_published": "2023-11-25T07:00:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Australia and Philippines begin joint patrols in South China Sea as regional tensions rise", "description": "<p>Richard Marles says two countries committed to a peaceful region where ‘sovereignty and agreed rules and norms are respected’</p><p>Australia and the Philippines have begun joint sea and air patrols in the South China Sea as Pacific nations warily eye an increasingly assertive China.</p><p>The three-day exercises follow discussions earlier this year on joint patrols to underscore what the countries say is their commitment to closer cooperation and a rules-based order in the region.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/australia-and-philippines-begin-joint-patrols-in-south-china-sea-as-regional-tensions-rise\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/australia-and-philippines-begin-joint-patrols-in-south-china-sea-as-regional-tensions-rise", "date_published": "2023-11-25T06:28:43+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "How to use up spent stock vegetables – recipe", "description": "<p>Blitz leftover used stock veg into a puree and combine with beans to make this tasty filling for a thrifty, nifty pie</p><p>A good stock needs good vegetables, which are poached in their own juices until very tender, then strained. It has always struck me as a huge waste to compost the spent veg, though, so I always try to find a way to eat them. Mashed up with olive oil or butter, say, they make a lovely side dish, or turn them into curries, soups and stews. Here, I use them up in a comforting pie, fortified with beans for bulk, texture and flavour.</p> <a href=\"https://www.theguardian.com/food/2023/nov/25/how-to-use-up-spent-stock-vegetables-recipe-pie-zero-waste-cooking\">Continue reading...</a>", "link": "https://www.theguardian.com/food/2023/nov/25/how-to-use-up-spent-stock-vegetables-recipe-pie-zero-waste-cooking", "date_published": "2023-11-25T06:00:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Tim Dowling: it’s raining indoors. Someone needs to get up on the roof", "description": "<p>The sudden nature of the cascading water, however, is actually a good sign, says Mark the builder</p><p>The house has sprung a leak. After a third day of rain, water starts running down our bedroom window on the wrong side: the inside. It gathers in a pool on the sill and drips over the edge to the floor.</p><p>“We should prioritise this,” I say, the carpet squelching under my feet. What I mean is: we should move this up the list, ahead of mending the garden wall and installing the new towel rail. We will struggle to appreciate these small improvements, my reasoning goes, for as long as it continues to rain indoors.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2023/nov/25/tim-dowling-its-raining-indoors-someone-needs-to-get-up-on-the-roof\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2023/nov/25/tim-dowling-its-raining-indoors-someone-needs-to-get-up-on-the-roof", "date_published": "2023-11-25T06:00:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "‘My diagnosis is: get a new one’ – Edith Pritchett takes her laptop to be repaired – cartoon", "description": "<a href=\"https://www.theguardian.com/lifeandstyle/picture/2023/nov/25/edith-pritchett-takers-her-laptop-to-be-repaired-cartoon\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/picture/2023/nov/25/edith-pritchett-takers-her-laptop-to-be-repaired-cartoon", "date_published": "2023-11-25T06:00:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Anger across Italy as killing of student highlights country’s femicide rate", "description": "<p>Death of Giulia Cecchettin, 22, allegedly at hands of ex-boyfriend, casts spotlight on violence against women</p><p>Anger and outrage have erupted across Italy following the killing of a university student, allegedly at the hands of her ex-boyfriend, casting a spotlight on violence against women in a country where on average one woman is killed every three days.</p><p>The body of Giulia Cecchettin, 22, an engineering student, was found days before her graduation ceremony in a ditch near a lake north of Venice. She had been wrapped in plastic and reportedly stabbed multiple times.</p> <a href=\"https://www.theguardian.com/world/2023/nov/25/anger-across-italy-as-killing-of-student-highlights-countrys-femicide-rate\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2023/nov/25/anger-across-italy-as-killing-of-student-highlights-countrys-femicide-rate", "date_published": "2023-11-25T06:00:41+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Blind date goes to Amsterdam: ‘He needed a moment to settle. Perhaps he was overwhelmed by my beauty!’", "description": "<p>Blind Date goes to Amsterdam, where Lennard, 38, an artist, meets Sophia, 32, an opera singer and life coach</p><p><strong>What were you hoping for?</strong><br />A nice evening with someone new. I was curious about what the evening would bring.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2023/nov/25/blind-date-goes-to-amsterdam-lennard-sophia\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2023/nov/25/blind-date-goes-to-amsterdam-lennard-sophia", "date_published": "2023-11-25T06:00:41+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "From Napoleon to Doctor Who: a complete guide to this week’s entertainment", "description": "<p>Joaquin Phoenix makes love and war, while the Doctor celebrates six decades of adventures. Doesn’t time fly?</p><p><strong>Napoleon</strong><br /><em>Out now</em><br />Ridley Scott’s Napoleon biopic starring Joaquin Phoenix is less po-faced historical epic than it is deadpan character study. That’s not to say there aren’t plenty of battles and skirmishes – but his love life proves just as lively, with Vanessa Kirby delivering a sultry turn as the defiantly unfaithful Joséphine de Beauharnais.</p> <a href=\"https://www.theguardian.com/culture/2023/nov/25/from-napoleon-to-doctor-who-a-complete-guide-to-this-weeks-entertainment\">Continue reading...</a>", "link": "https://www.theguardian.com/culture/2023/nov/25/from-napoleon-to-doctor-who-a-complete-guide-to-this-weeks-entertainment", "date_published": "2023-11-25T06:00:41+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "TV tonight: David Tennant and Catherine Tate finally reunite in the Tardis", "description": "<p>Doctor Who is back with three special episodes for its 60th anniversary. Plus: devastating new documentary Lockerbie. Here’s what to watch this evening</p> <a href=\"https://www.theguardian.com/tv-and-radio/2023/nov/25/tv-tonight-david-tennant-and-catherine-tate-finally-reunite-in-the-tardis\">Continue reading...</a>", "link": "https://www.theguardian.com/tv-and-radio/2023/nov/25/tv-tonight-david-tennant-and-catherine-tate-finally-reunite-in-the-tardis", "date_published": "2023-11-25T06:00:41+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Weekend podcast: what’s happened to The Crown? Surviving a shipwreck, how Aldi and Lidl changed British shoppers, and Philippa Perry on loneliness", "description": "<p>How The Crown went from prestige drama to TV disaster (1m26s); what happened when one man’s boat sank in the dead of night – and he had to save my seven-year-old son (11m19s); how discount supermarkets changed the way we shop (25m21); and Philippa Perry shares advice on how to overcome loneliness and isolation (40m08s)</p> <a href=\"https://www.theguardian.com/lifeandstyle/audio/2023/nov/25/weekend-podcast-the-crown-surviving-a-shipwreck-how-aldi-and-lidl-changed-british-shoppers-philippa-perry-on-loneliness\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/audio/2023/nov/25/weekend-podcast-the-crown-surviving-a-shipwreck-how-aldi-and-lidl-changed-british-shoppers-philippa-perry-on-loneliness", "date_published": "2023-11-25T05:00:40+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Fivefold rise in number of EU citizens refused entry to UK since Brexit", "description": "<p>Home Office data reveals impact of end of free movement and raises questions over Border Force hostility</p><p>The number of EU citizens refused entry to the UK since Brexit has increased fivefold, Home Office figures show.</p><p>In the first three quarters of 2019 just over 2,200 people from the EU were turned away at the border – compared with 11,600 in the first three quarters of 2023.</p> <a href=\"https://www.theguardian.com/uk-news/2023/nov/25/fivefold-rise-number-eu-citizens-refused-entry-uk-since-brexit\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2023/nov/25/fivefold-rise-number-eu-citizens-refused-entry-uk-since-brexit", "date_published": "2023-11-25T05:00:39+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.theguardian.com/rss", "title": "Derek Chauvin, convicted of George Floyd’s murder, reported to have been stabbed in prison", "description": "<p>It is understood the former police officer was stabbed by an inmate, according to reports citing anonymous sources </p><p>Derek Chauvin, the former Minneapolis police officer <a href=\"https://www.theguardian.com/us-news/2021/jun/25/derek-chauvin-george-floyd-murder-sentencing\">convicted of murdering George Floyd</a>, is reported to have been stabbed by another inmate and seriously injured at a federal prison in Arizona, according to the Associated Press (AP) new agency, which is citing an anonymous source.</p><p>The attack is reported to have happened on Friday at the Federal Correctional Institution, Tucson, a medium-security prison that has been plagued by security lapses and staffing shortages.</p> <a href=\"https://www.theguardian.com/us-news/2023/nov/25/derek-chauvin-convicted-of-george-floyds-reported-to-have-been-stabbed-in-prison\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2023/nov/25/derek-chauvin-convicted-of-george-floyds-reported-to-have-been-stabbed-in-prison", "date_published": "2023-11-25T04:30:12+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "The Guardian", "album": "The Guardian", "user": null, "language": "en-UK", "thumbnail": "https://assets.guim.co.uk/images/guardian-logo-rss.c45beb1bafa34b347ac333af2e6fe23f.png", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]