[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Will GTA 6 Release DAY ONE On PC?", "description": "A major AAA multiplatform release is pretty much almost always guaranteed to hit PC on the day of its release, but Rockstar has frequently been the exception to that rule. \n\nFrom Grand Theft Auto 5 to Red Dead Redemption 2 to many others, the company has a history of not putting its games out on PC until at least several months after they have launched for consoles (while some, like the original Red Dead Redemption, are still not on PC). \n\nWith that in mind, how likely is it that Grand Theft Auto 6 gets a day one PC release? Here, we talk about how likely (or unlikely) that is, and why a lot of it will likely hinge on how the company handles GTA Online.", "link": "https://www.youtube.com/watch?v=hGBqT-4aUq4", "date_published": "2023-11-15T15:30:11+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/hGBqT-4aUq4/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 PS5 Single Player Games We NEED IN OUR LIVES", "description": "The games industry is in a really good place right now. There are plenty of heavy hitters releasing left, right, and center - and plenty of similarly highly anticipated games will be coming to your favorite platform in the near future. \n\nBut we can’t just keep our minds from wondering about the many games that haven’t been announced and maybe don’t even have much of a chance of ever coming out - but we would love to see them make it to the PS5 sometime in the near future. \n\nSony has a vast breadth of abandoned first party third party franchises which we would love to see making a comeback in some shape or form. With this feature, we will be taking a look at 15 single player games that we would love to see on the PS5.", "link": "https://www.youtube.com/watch?v=P2vBLDsr2gc", "date_published": "2023-11-15T13:30:09+00:00", "permanent": false, "bookmarked": false, "dead": null, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/P2vBLDsr2gc/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]