[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-27T15:30:18+00:00", "description": "We didn’t expect another Flight Simulator so soon after 2020’s excellent Microsoft Flight Simulator, but here we are – Microsoft Flight Simulator 2024 is expected on November 19th. \n\nMicrosoft and Asobo Studio’s pledge that 2024’s offering will be “the most ambitious sim ever undertaken” might seem lofty, but there is an unfathomably large amount of content on offer in this latest iteration which aims to satisfy Flight Simulator’s broad audiences, from aviation and flight sim enthusiasts to digital tourists. \n\nPrincipal of this new content is a vast career mode, with numerous branching specialties covering all manner of aviation activities. An in-depth photography mode, covering a bucket list of wildlife, natural, and man-made wonders, will provide an enthralling way to engage with Flight Simulator 2024.", "id": 1396474, "language": null, "link": "https://www.youtube.com/watch?v=Yhxu7c27J9g", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/Yhxu7c27J9g/hqdefault.jpg", "title": "Why Microsoft Flight Simulator 2024 May Be the Biggest Game of the Year", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-27T13:30:27+00:00", "description": "Though Sony did not release any of its typical flagship cinematic single player blockbusters this year, 2024 nonetheless turned out to be a great year for PS5 players who enjoy single player games, with a variety of excellent titles, both big and small, having released for the platform this year on that front. \n\nIn these final weeks of the year, however, there is still plenty of stuff to look forward to for those on the lookout for solo adventures. From remakes and remasters of beloved titles and ports of acclaimed games available on other platforms to major new titles that we have been waiting for literally years and years on end, there’s plenty coming up that PS5 players should keep their eyes on.\n\nNote: This list consists of multiplatform games as well.", "id": 1396475, "language": null, "link": "https://www.youtube.com/watch?v=xx5dtodp_sE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/xx5dtodp_sE/hqdefault.jpg", "title": "10 Amazing Single-Player PS5 Games Still Coming Out This Year", "vote": 0}]