[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-05T20:30:01+00:00", "description": "Ragnarok becomes the next in a lengthy list of PlayStation exclusives coming to PC. The PC port of Ragnarok includes unlimited framerate, 4K resolution, and some upscaled resolution tools that will make the game really pop on high-end PCs. \n\nFor some people, Steam Deck compatibility is the most exciting aspect of Ragnarok’s PC debut. Just imagine clearing off those side quests and collectibles while waiting in the car or while someone else is using your TV.\n\nRagnarok was a clear game of the year finalist when it released in 2022, and its PC arrival could easily make it this year’s best game for those who haven’t experienced it yet. Players will have many reasons to revisit its shimmering shores not to mention the PC bells and whistles make an already excellent game even better.", "id": 1091095, "language": null, "link": "https://www.youtube.com/watch?v=9s0g2zlBLek", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/9s0g2zlBLek/hqdefault.jpg", "title": "God of War Ragnarök PC, Despite Being Two Years Old, Is One of the Biggest Games of 2024", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-05T16:00:00+00:00", "description": "Space Marine 2 will be welcoming in players imminently, and when it does, it is going to have no shortage of things on offer. From a substantial campaign to a dangerously addictive PvE mode in Operations to a full-fledged PvP component dubbed Eternal War, not to mention plans of ongoing live support in the coming months, the new third-person shooter has a lot to offer. \n\nAll of it is, of course, built around a surprisingly dense and immaculately crafted web of combat systems and ancillary mechanics, all of which combine to deliver a truly spectacular action experience. \n\nAs you prepare to dive into its offerings, to help get you to grips with its core combat loop a bit quicker, here, we’ll be going over a few handy pointers that you should keep in mind as you play the game.", "id": 1089324, "language": null, "link": "https://www.youtube.com/watch?v=a4QtbGj92Qc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/a4QtbGj92Qc/hqdefault.jpg", "title": "10 Things Warhammer 40,000: Space Marine 2 DOESN'T TELL YOU", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-05T12:00:00+00:00", "description": "3D platformer fans will find a lot to love in Astro Bot. Astro’s first feature length game instantly propels him to the all-star pantheon of PlayStation platforming greats, joining the company of iconic characters like Crash, Ratchet, Jak, and Sackboy, with the sharp level design and controls of the game guaranteeing it a spot in discussions of the genre’s best. \n\nOn top of that, with a bevy of secrets, references, and even entire levels and abilities inspired by and based on a multitude of PlayStation-related games and things from over the years, Astro Bot also a treat for fans of the platform. \n\nHopefully this is the first in a long line of many high-quality console 3D platformers to come starring the intrepid robot from Team Asobi in the years to come.", "id": 1087304, "language": null, "link": "https://www.youtube.com/watch?v=0VutHSZVHOA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/0VutHSZVHOA/hqdefault.jpg", "title": "Astro Bot PS5 Review - A MUST-PLAY FOR GAMERS", "user": null, "vote": 0}]