[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T23:12:04.698860+00:00", "description": "Ryan Christoffel writes via 9to5Mac: Since the Mac doesn't have the same locked-down app distribution system of iOS and iPadOS, Apple has created other tools meant to protect users. Some of those tools include app signing and notarization. Essentially, these provide a way for Apple to perform a level of vetting for macOS apps, even ones that don't hit the Mac App Store. The intent is to ultimately prevent harmful software from being inadvertently opened by Mac users. Trying to open an app that isn't correctly signed or notarized results in some scary warnings. But until now, power users could bypass those warnings -- and Apple's overall security process -- using a Control-click shortcut. But that shortcut is going away in macOS Sequoia.\n \nAccording to a new post on the Apple Developer site: \"In macOS Sequoia, users will no longer be able to Control-click to override Gatekeeper when opening software that isn't signed correctly or notarized. They'll need to visit System Settings &gt; Pr", "id": 994273, "language": "en-us", "link": "https://apple.slashdot.org/story/24/08/07/2129235/macos-sequoia-makes-it-harder-to-run-apps-that-arent-properly-signed-or-notarized?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "macOS Sequoia Makes It Harder To Run Apps That Aren't Properly Signed or Notarized", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T22:07:37.804599+00:00", "description": "Lenovo's widely used ThinkPad laptop hasn't changed much over the years. Corporate technology leaders say that's why they love it. From a report: \"There's a lot to be said for familiarity and that consistent experience,\" said Ace Hardware Chief Information Officer Rick Williams, whose company uses about 4,000 ThinkPads. The ThinkPad brand of personal computers, originally created by International Business Machines, hit the market in 1992 before Lenovo acquired it, along with IBM's PC division, in 2005. Since then, the boxy design -- originally inspired by the Japanese bento box -- has gotten thinner and lighter, but not much else has changed from a design perspective, Lenovo said. \n\nThe logo is the same, although in 2005 Lenovo did add the red dot over the \"i\" in \"Think\" that remains today. That logo has remained angled at 37 degrees on the device. And on the keyboard the small, red, old-timey trackpoint remains nestled between the \"B,\" \"G\" and \"H\" keys (which Lenovo says some users s", "id": 993954, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/07/1910207/the-business-worlds-favorite-laptop-has-barely-changed-in-30-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Business World's Favorite Laptop Has Barely Changed in 30 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T22:07:36.254231+00:00", "description": "Starting today, Morgan Stanley's advisors are allowed to offer bitcoin ETFs to some clients -- a first among major Wall Street banks. \"Those funds are BlackRock's iShares Bitcoin Trust and Fidelity's Wise Origin Bitcoin Fund,\" reports CNBC. From the report: Morgan Stanley made the move in response to demand from clients and in an attempt to follow an evolving marketplace for digital assets [...].The bank is still striking a note of caution, however, in the rollout: Only clients with a net worth of at least $1.5 million, an aggressive risk tolerance and the desire to make speculative investments are suitable for bitcoin ETF solicitation, said the people. The investments are for taxable brokerage accounts, not retirement accounts, they added. The bank will monitor clients' crypto holdings to make sure they don't end up with excessive exposure to the volatile asset class, according to the sources.\n \nThe only crypto investments approved for solicited purchase at Morgan Stanley are the pai", "id": 993953, "language": "en-us", "link": "https://news.slashdot.org/story/24/08/07/2124230/morgan-stanley-tells-wealth-advisors-they-can-pitch-bitcoin-etfs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Morgan Stanley Tells Wealth Advisors They Can Pitch Bitcoin ETFs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T21:02:35.385150+00:00", "description": "Ocean temperatures in the Great Barrier Reef are now the hottest in at least 400 years and are an \"existential threat\" to the planet's unique natural wonder\n\n, according to new scientific research. From a report: Scientists analysed long-lived corals in and around the reef that keep a record of temperature hidden in their skeleton and matched them to modern observations. The research, published in the journal Nature, used climate models to find the extreme temperatures of recent decades could not have happened without the extra greenhouse gases in the atmosphere caused mostly by burning fossil fuels. \n\nThe \"existential threat\" to the reef from the climate crisis was \"now realised,\" the scientists wrote, and without ambitious and rapid cuts to greenhouse gas emissions \"we will likely be witness to the demise of one of the Earth's natural wonders.\" The research comes two weeks after the World Heritage committee decided not to place the reef, which covers an area larger than Italy, on it", "id": 993532, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/07/1849255/hottest-ocean-temperatures-in-400-years-an-existential-threat-to-the-great-barrier-reef-report-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Hottest Ocean Temperatures in 400 years an 'Existential Threat' To the Great Barrier Reef, Report Finds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T21:02:33.467879+00:00", "description": "An anonymous reader quotes a report from the New York Times: For weeks, NASA has downplayed problems experienced by Starliner, a Boeing spacecraft that took two astronauts to the International Space Station in June. But on Wednesday, NASA officials admitted that the problems with the spacecraft were more serious than first thought and that the astronauts may not travel home on the Boeing vehicle, after all. The agency is exploring a backup option for the astronauts, Suni Wiliams and Butch Wilmore, to hitch a ride back to Earth on a vehicle built by Boeing's competitor SpaceX instead. Their stay in orbit, which was to be as short as eight days, may extend into next year. \"We could take either path,\" Ken Bowersox, NASA's associate administrator for the space operations mission directorate, said during a news conference on Wednesday. \"And reasonable people could pick either path.\"\n \nNASA and Boeing officials had maintained that the crew that launched with Starliner on its first crewed te", "id": 993531, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/07/2040203/nasa-says-boeing-starliner-astronauts-may-fly-home-on-spacex-in-2025?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA Says Boeing Starliner Astronauts May Fly Home On SpaceX In 2025", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T19:57:19.547412+00:00", "description": "Security researchers from SafeBreach have found what they say is a Windows downgrade attack\n that's invisible, persistent, irreversible and maybe even more dangerous than last year's BlackLotus UEFI bootkit. From a report: After seeing the damage that UEFI bootkit could do by bypassing secure boot processes in Windows, SafeBreach's Alon Leviev became curious whether there were any other fundamental Windows components that could be abused in a similar manner. He hit the jackpot in one of the most unlikely places: The Windows update process. \n\n\"I found a way to take over Windows updates to update the system, but with control over all of the actual update contents,\" Leviev told us in an interview ahead of his Black Hat USA conference presentation today detailing his findings. Using his technique, having compromised a machine so that he could get in as a normal user, Leviev was able to control which files get updated, which registry keys are changed, which installers get used, and the lik", "id": 993124, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/07/1845258/your-windows-updates-can-all-be-downgraded-says-security-researcher?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Your Windows Updates Can All Be Downgraded, Says Security Researcher", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T18:52:07.258490+00:00", "description": "Things aren't working out well for Humane, a heavily-funded startup that launched an eponymous AI device earlier this year. Despite significant funding from prominent Silicon Valley figures, the product has been grappling with negative reviews -- and now more pressing issues are emerging. An anonymous reader shares a report: Shortly after Humane released its $699 AI Pin in April, the returns started flowing in. Between May and August, more AI Pins were returned than purchased, according to internal sales data obtained by The Verge. By June, only around 8,000 units hadn't been returned, a source with direct knowledge of sales and return data told me. As of today, the number of units still in customer hands had fallen closer to 7,000, a source with direct knowledge said. \n\nAt launch, the AI Pin was met with overwhelmingly negative reviews. Our own David Pierce said it \"just doesn't work,\" and Marques Brownlee called it \"the worst product\" he's ever reviewed. Now, Humane is attempting to", "id": 992772, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/07/1739206/humanes-daily-returns-are-outpacing-sales?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Humane's Daily Returns Are Outpacing Sales", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T18:52:05.665560+00:00", "description": "For more than 30 years, the world's largest iceberg was stuck in the Antarctic. Five times the size of New York City's land area and more than 1,000 feet deep, the mammoth piece of ice finally became loose in 2020 and began a slow drift toward the Southern Ocean. Now, A23a, as it's known, is spinning in place. From a report: After leaving Antarctic waters, the iceberg got stuck in a vortex over a seamount, or an underwater mountain. Imagine a 1,400-square-mile piece of ice as deep as the Empire State Building spinning slowly but steadily enough to fully rotate it on its head over the course of about 24 days. The iceberg is spinning near the South Orkney Islands, about 375 miles northeast of the Antarctic Peninsula, \"maintaining a chill 15 degree rotation per day,\" the British Antarctic Survey, the United Kingdom's polar research institute, said on social media. \n\n\"It's basically just sitting there, spinning around and it will very slowly melt as long as it stays there,\" said Alex Brea", "id": 992771, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/07/1841259/after-breaking-free-worlds-largest-iceberg-is-stuck-spinning-in-circles?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "After Breaking Free, World's Largest Iceberg Is Stuck Spinning in Circles", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T17:47:33.200523+00:00", "description": "Parody site creator David Senk has rebuffed CrowdStrike's attempt to shut down his \"ClownStrike\" website, which lampoons the cybersecurity firm's role in a recent global IT outage. Senk swiftly contested the Digital Millennium Copyright Act takedown notice, asserting fair use for parody. When hosting provider Cloudflare failed to acknowledge his counter-notice, Senk defiantly relocated the site to a Finnish server beyond U.S. jurisdiction. The IT consultant decried the takedown as \"corporate cyberbullying,\" accusing CrowdStrike of exploiting copyright law to silence criticism. Despite CrowdStrike's subsequent admission that parody sites were not intended targets, Senk is remaining resolute, demanding a public apology and refusing to return to Cloudflare's services.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Parody+Site+ClownStrike+Refused+To+Bow+To+CrowdStrike's+Bogus+DMCA+Takedown%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F08%2F07", "id": 992323, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/07/1650201/parody-site-clownstrike-refused-to-bow-to-crowdstrikes-bogus-dmca-takedown?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Parody Site ClownStrike Refused To Bow To CrowdStrike's Bogus DMCA Takedown", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T17:47:31.157755+00:00", "description": "AI is upending India's technology outsourcing business. The industry is pivoting to adapt, but the changes could cost a large number of coveted jobs. From a report: The country's big outsourcing companies are already using AI and have plans to integrate it throughout their businesses. That might not save the low-end operations that run call centers or do other basic tasks within the so-called business process outsourcing sector.&#194; \n\nAI is threatening to disrupt most businesses around the world, not just India's $250 billion outsourcing industry. The outsourcing boom in India over the past few decades created the \"getting Bangalore-d\" phenomenon in the U.S., often used for Americans who lost their jobs to more affordable Indian talent. AI's impact could have big repercussions as the industry employs 5.4 million people, according to tech-industry body Nasscom, and contributes about 8% of the country's economy. More than 80% of companies in the S&amp;P 500 outsource some operations t", "id": 992322, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/07/1731222/ai-is-coming-for-indias-famous-tech-hub?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Is Coming for India's Famous Tech Hub", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T16:44:57.981153+00:00", "description": "An anonymous reader shares a report: Reddit just wrapped up its second earnings call as a public company and CEO Steve Huffman hinted at some significant changes that could be coming to the platform. During the call, the Reddit co-founder said the company would begin testing AI-powered search results later this year. \"Later this year, we will begin testing new search result pages powered by AI to summarize and recommend content, helping users dive deeper into products, shows, games and discover new communities on Reddit,\" Huffman said. He didn't say when those tests would begin, but said it would use both first-party and third-party models. \n\nHuffman noted that search on Reddit has \"gone unchanged for a long time\" but that it's a significant opportunity to bring in new users. He also said that search could one day be a significant source of advertising revenue for the company. Huffman hinted at other non-advertising sources of revenue as well. He suggested that the company might exper", "id": 991822, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/07/1536235/reddit-ceo-teases-ai-search-features-and-paid-subreddits?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Reddit CEO Teases AI Search Features and Paid Subreddits", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T16:44:55.025568+00:00", "description": "Logitech has quashed its earlier remarks about building a subscription-based mouse, following widespread backlash to comments made by CEO Hanneke Faber. The Swiss-American computer peripherals maker clarified that the \"forever mouse\" concept, mentioned by Faber in a recent podcast interview, was merely speculative internal discussion and not a planned product.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Logitech+Says+the+'Forever+Mouse'+Was+Just+an+Idea%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F08%2F07%2F1541211%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F08%2F07%2F1541211%2Flogitech-says-the-forever-mouse-was-just-an-idea%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a hre", "id": 991821, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/07/1541211/logitech-says-the-forever-mouse-was-just-an-idea?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Logitech Says the 'Forever Mouse' Was Just an Idea", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T15:37:46.549138+00:00", "description": "Disney Plus will soon no longer let you share your password with people outside your household. From a report: During an earnings call on Wednesday, Disney CEO Bob Iger said the crackdown will kick off \"in earnest\" this September. The timeline for Disney's password-sharing crackdown has been a bit confusing so far. In February, Disney announced plans to roll out paid sharing and also began notifying users about the change. It then launched paid sharing in a \"few countries\" in June but provided no information on when it would reach the US.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Disney's+Password-Sharing+Crackdown+Starts+'in+Earnest'+Next+Month%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F08%2F07%2F1352252%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F08%2F07%2F", "id": 991416, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/07/1352252/disneys-password-sharing-crackdown-starts-in-earnest-next-month?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Disney's Password-Sharing Crackdown Starts 'in Earnest' Next Month", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T14:32:46.679670+00:00", "description": "An anonymous reader shares a report: For U.S. chip giant Intel, the darling of the computer age before it fell on harder times in the AI era, things might have been quite different. About seven years ago, the company had the chance to buy a stake in OpenAI, then a fledgling non-profit research organization working in a little-known field called generative AI, four people with direct knowledge of those discussions told Reuters. \n\nOver several months in 2017 and 2018, executives at the two companies discussed various options, including Intel buying a 15% stake for $1 billion in cash, three of the people said. They also discussed Intel taking an additional 15% stake in OpenAI if it made hardware for the startup at cost price, two people said. Intel ultimately decided against a deal, partly because then-CEO Bob Swan did not think generative AI models would make it to market in the near future and thus repay the chipmaker's investment, according to three of the sources, who all requested a", "id": 990897, "language": "en-us", "link": "https://slashdot.org/story/24/08/07/1231243/how-intel-spurned-openai-and-fell-behind-the-times?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How Intel Spurned OpenAI and Fell Behind the Times", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T10:12:27.281115+00:00", "description": "Chinese scientists discovered water molecules in lunar samples brought back by the Chang'e 5 moon probe, marking the first time whole H2O molecules were found in lunar material. The findings have been published in Nature Astronomy. Smithsonian Magazine reports: The team used X-ray diffraction to analyze the grains of moon soil, in which they found a lunar mineral dubbed ULM-1 whose mass is made up of more than 40 percent water and also includes ammonia. \"This is a new form of water stored on the moon,\" Xiaolong Chen, co-author of the study and physics researcher at the Chinese Academy of Sciences, tells New Scientist's Alex Wilkins.\n \nIn the words of CNN's Jessie Yeung, water on the moon is nothing new. Though the samples brought back by the U.S. Apollo missions seemed to show that the moon was dry and lifeless, a recent study suggests that water or hydroxyl may be trapped in glass beads on the moon's surface -- and solar winds could turn the hydroxyl (chemical formula OH) into H2O, a", "id": 989350, "language": "en-us", "link": "https://science.slashdot.org/story/24/08/07/0041230/scientists-find-water-molecules-in-lunar-rock-sample-for-the-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Scientists Find Water Molecules in Lunar Rock Sample for the First Time", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T09:07:32.031162+00:00", "description": "An anonymous reader quotes a report from the Washington Post: For the first time in 40 years, the Environmental Protection Agency has taken emergency action to stop the use of a pesticide (source may be paywalled; alternative source) linked to serious health risks for unborn babies. Tuesday's emergency order applies to dimethyl tetrachloroterephthalate, also known as DCPA, a weedkiller used on crops such as broccoli, Brussels sprouts, cabbage and onions. When pregnant farmworkers and others are exposed to the pesticide, their babies can experience changes to fetal thyroid hormone levels, which are linked to low birth weight, impaired brain development, decreased IQ and impaired motor skills later in life.\n \n\"DCPA is so dangerous that it needs to be removed from the market immediately,\" Michal Freedhoff, assistant administrator for the EPA's Office of Chemical Safety and Pollution Prevention, said in a statement. \"It's EPA's job to protect people from exposure to dangerous chemicals. I", "id": 988781, "language": "en-us", "link": "https://news.slashdot.org/story/24/08/07/005243/epa-takes-emergency-action-to-stop-use-of-dangerous-pesticide?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EPA Takes Emergency Action To Stop Use of Dangerous Pesticide", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T09:07:30.469521+00:00", "description": "According to a recent study, SpaceX's new Starlink direct-to-cell (DTC) satellites are nearly five times brighter than traditional Starlinks due to their lower orbit. While these satellites offer the promise of widespread connectivity, their increased brightness poses challenges for astronomical observations, prompting SpaceX to consider applying brightness mitigation techniques. Space.com reports: The higher luminosity of these DTCs compared to regular Starlinks is partly because they circle Earth at just 217 miles (350 kilometers) above the surface, which is lower than traditional Starlink internet satellites, whose altitude is 340 miles (550 kilometers), the study reported. [...] At the time the study was conducted, SpaceX had not yet applied its routine brightness mitigation techniques to the DTCs, such as adjusting their chassis and solar panels to reduce the portion of spacecraft illuminated by the sun, study lead author Anthony Mallama of the IAU Centre for the Protection of Da", "id": 988780, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/07/0035233/spacexs-new-direct-to-cell-starlink-satellites-are-way-brighter-than-the-originals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "SpaceX's New Direct-To-Cell Starlink Satellites Are Way Brighter Than the Originals", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T02:16:29.136942+00:00", "description": "At the Flash Memory Summit 2024 this week, NVM Express published the NVMe 2.1 specifications, which hope to enhance storage unification across AI, cloud, client, and enterprise. Phoronix's Michael Larabel writes: New NVMe capabilities with the revised specifications include:\n \n- Enabling live migration of PCIe NVMe controllers between NVM subsystems.\n- New host-directed data placement for SSDs that simplifies ecosystem integration and is backwards compatible with previous NVMe specifications.\n- Support for offloading some host processing to NVMe storage devices.\n- A network boot mechanism for NVMe over Fabrics (NVMe-oF).\n- Support for NVMe over Fabrics zoning.\n- Ability to provide host management of encryption keys and highly granular encryption with Key Per I/O.\n- Security enhancements such as support for TLS 1.3, a centralized authentication verification entity for DH-HMAC-CHAP, and post sanitization media verification.\n- Management enhancements including support for high availabili", "id": 988053, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/08/06/2353214/nvme-21-specifications-published-with-new-capabilities?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NVMe 2.1 Specifications Published With New Capabilities", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T02:16:26.234125+00:00", "description": "Mike Masnick, a semi-regular Slashdot contributor and founder of the tech blog Techdirt, is joining the board of Bluesky, where he \"will be providing advice and guidance to the company to help it achieve its vision of a more open, more competitive, more decentralized online world.\" Masnick writes: In the nearly three decades that I've been writing Techdirt I've been writing about what is happening in the world of the internet, but also about how much better the internet can be. That won't change. I will still be writing about what is happening and where I believe we should be going. But given that there are now people trying to turn some of that better vision into a reality, I cannot resist this opportunity to help them achieve that goal. The early internet had tremendous promise as a decentralized system that enabled anyone to build what they wanted on a global open network, opening up all sorts of possibilities for human empowerment and creativity. But over the last couple of decade", "id": 988052, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/06/2334235/techdirts-mike-masnick-joins-the-bluesky-board-to-support-a-more-open-decentralized-internet?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Techdirt's Mike Masnick Joins the Bluesky Board To Support a 'More Open, Decentralized Internet'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T01:11:47.644026+00:00", "description": "An anonymous reader quotes a report from The Register: Before WordPerfect, the most popular work processor was WordStar. Now, the last ever DOS version has been bundled and set free by one of its biggest fans. WordStar 7.0d was the last-ever DOS release of the classic word processor, and it still has admirers today. A notable enthusiast is Canadian SF writer Robert J Sawyer, who wrote the book that became the TV series Flashforward.\n \nThanks to his efforts you can now try out this pinnacle of pre-Windows PC programs for professional prose-smiths. Sawyer has taken the final release, packaged it up along with some useful tools -- including DOS emulators for modern Windows -- and shared the result. Now you, too, can revel in the sheer unbridled power of this powerful app. The download is 680MB, but as well as the app itself, full documentation, and some tools to help translate WordStar documents to more modern formats, it also includes copies of two FOSS tools that will let you run this ", "id": 987813, "language": "en-us", "link": "https://tech.slashdot.org/story/24/08/06/2136259/wordstar-7-the-last-ever-dos-version-is-re-released-for-free?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "WordStar 7, the Last Ever DOS Version, Is Re-Released For Free", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-07T01:11:45.121738+00:00", "description": "Zack Whittaker reports via TechCrunch: A cyberattack on Mobile Guardian, a U.K.-based provider of educational device management software, has sparked outages at schools across the world and has left thousands of students unable to access their files. Mobile Guardian acknowledged the cyberattack in a statement on its website, saying it identified \"unauthorized access to the iOS and ChromeOS devices enrolled to the Mobile Guardian platform.\" The company said the cyberattack \"affected users globally,\" including in North America, Europe and Singapore, and that the incident resulted in an unspecified portion of its userbase having their devices unenrolled from the platform and \"wiped remotely.\" \"Users are not currently able to log in to the Mobile Guardian Platform and students will experience restricted access on their devices,\" the company said.\n \nMobile device management (MDM) software allows businesses and schools to remotely monitor and manage entire fleets of devices used by employee", "id": 987812, "language": "en-us", "link": "https://it.slashdot.org/story/24/08/06/2322210/cyberattack-knocks-mobile-guardian-mdm-offline-wipes-thousands-of-student-devices?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cyberattack Knocks Mobile Guardian MDM Offline, Wipes Thousands of Student Devices", "user": null, "vote": 0}]