[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T17:00:04+00:00", "description": "Despite its gorgeous looks and realistic sounds, Bodycam is still very much a work in progress. Bugs can be quashed, animations polished further, and performance improved. New maps and modes will be added, including a mode where players take on zombies, which could add a fun bent of horror to the realistic gunplay. \n\nWhile the core gameplay is fine, it lacks that special something to really grab you (and the perspective doesn't exactly help those prone to motion sickness). As such, the package needs the most basic of features, a proper competitive multiplayer structure, and actual progression to warrant long-term investment.", "id": 740438, "language": null, "link": "https://www.youtube.com/watch?v=3fi33UJoKK8", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/3fi33UJoKK8/hqdefault.jpg", "title": "Bodycam Early Access Review - Does This Ultra Photorealistic Shooter Deliver?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T14:00:05+00:00", "description": "The history of Redfall is fascinating in retrospect. Launching last year for Xbox Series X/S and PC as Microsoft's first $70 title, it bombed critically and commercially. Long-time fans of Arkane wondered how the studio behind Prey could release such a disappointing mess, rife with technical issues and none of the gameplay charm that defined its earlier releases.\n\nDespite spending a year on the market before Microsoft pulled the plug on future support (barring one last update), Redfall had a purported development of around six years. It was reportedly caught between two worlds - satisfying a broader market while not fully embracing the live-service model, meaning no microtransactions or in-game store.\n\nThough its final update is available and adds some worthwhile features, Redfall's legacy is disappointing. The fact that Arkane Austin shut down before it could return to what it did best makes things even worse.", "id": 739398, "language": null, "link": "https://www.youtube.com/watch?v=7GJnJALihi0", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/7GJnJALihi0/hqdefault.jpg", "title": "Redfall - The Mess, ONE YEAR LATER", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T10:30:28+00:00", "description": "It has been a long, long time coming, but Nintendo has announced a new 2D Legend of Zelda game at long last. More than a decade on from the series’ last 2D outing, the company unveiled The Legend of Zelda: Echoes of Wisdom at its recent Nintendo Direct presentation, announcing it for a September release, and already, quite a few details have been unveiled on the game. \n\nStarring the titular Princess Zelda as the main playable protagonist for the first time in a mainline Zelda game, Echoes of Wisdom is looking like an intriguing new outing for the series, and from its combat to its art style to its core gameplay hook, there’s a lot that has been revealed about it that’s looking quite promising. Here, we are going to go over all of those details and more.", "id": 737992, "language": null, "link": "https://www.youtube.com/watch?v=n-6JS8feczI", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/n-6JS8feczI/hqdefault.jpg", "title": "The Legend of Zelda: Echoes of Wisdom - 10 New Details You NEED TO KNOW", "user": null, "vote": 0}]