[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T21:56:19.584692+00:00", "description": "U.S. companies may need to report cash amounts tied to their software expenditures, more of which would be moved off corporate balance sheets under a forthcoming proposal to update decades-old accounting rules. From a report: The Financial Accounting Standards Board voted Tuesday, 7-0, to propose requiring companies to report cash amounts tied to their software costs and help them determine when to expense or capitalize costs. The proposal is a scaled-back version of rule-making around these expenses. The standard setter wants to require U.S. public and private companies to provide a line item in their cash-flow statement to account for cash spending on software. Rules around software costs have gone largely unchanged since the 1980s and 1990s. \n\nThe proposal would cover use of software ranging from enterprise resource planning systems to hosting services and mobile banking applications, meaning it applies to almost every company. It would exclude development of software licensed to c", "id": 741934, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/19/2149216/plan-for-new-accounting-rules-on-software-costs-moves-forward?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Plan for New Accounting Rules on Software Costs Moves Forward", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T20:50:47.970019+00:00", "description": "The European Union is getting closer to passing new rules that would mandate the bulk scanning of digital messages -- including encrypted ones. On Thursday, EU governments will adopt a position on the proposed legislation, which is aimed at detecting child sexual abuse material (CSAM). The vote will determine whether the proposal has enough support to move forward in the EU's law-making process. From a report: The law, first introduced in 2022, would implement an \"upload moderation\" system that scans all your digital messages, including shared images, videos, and links. Each service required to install this \"vetted\" monitoring technology must also ask permission to scan your messages. If you don't agree, you won't be able to share images or URLs. \n\nAs if this doesn't seem wild enough, the proposed legislation appears to endorse and reject end-to-end encryption at the same time. At first, it highlights how end-to-end encryption \"is a necessary means of protecting fundamental rights\" bu", "id": 741571, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/19/2040238/eu-chat-control-law-proposes-scanning-your-messages---even-encrypted-ones?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EU Chat Control Law Proposes Scanning Your Messages - Even Encrypted Ones", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T18:28:39.782487+00:00", "description": "The U.S. Senate has passed a bill to accelerate the deployment of nuclear energy capacity, including by speeding permitting and creating new incentives for advanced nuclear reactor technologies. From a report: Expanding nuclear power has broad bipartisan support, with Democrats seeing it as critical to decarbonizing the power sector to fight climate change and Republicans viewing it as a way to ensure reliable electricity supply and create jobs. A version of the bill had already passed in the House of Representatives and it will now go to President Joe Biden for a signature to become law. It passed the Senate 88-2 votes. \n\n\"In a major victory for our climate and American energy security, the U.S. Senate has passed the ADVANCE Act with overwhelming, bipartisan support,\" said Senator Tom Carper, a Democrat, who is Chairman of the Senate Environment and Public Works Committee. \"Today, we sent the ADVANCE Act to the president's desk because Congress worked together to recognize the import", "id": 740977, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/19/183238/senate-passes-bill-to-support-advanced-nuclear-energy-deployment?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Senate Passes Bill To Support Advanced Nuclear Energy Deployment", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T18:28:38.201234+00:00", "description": "Ilya Sutskever, co-founder of OpenAI who recently left the startup, has launched a new venture called Safe Superintelligence Inc., aiming to create a powerful AI system within a pure research organization. Sutskever has made AI safety the top priority for his new company. Safe Superintelligence has two more co-founders: investor and former Apple AI lead Daniel Gross, and Daniel Levy, known for training large AI models at OpenAI. From a report: Researchers and intellectuals have contemplated making AI systems safer for decades, but deep engineering around these problems has been in short supply. The current state of the art is to use both humans and AI to steer the software in a direction aligned with humanity's best interests. Exactly how one would stop an AI system from running amok remains a largely philosophical exercise. \n\nSutskever says that he's spent years contemplating the safety problems and that he already has a few approaches in mind. But Safe Superintelligence isn't yet di", "id": 740976, "language": "en-us", "link": "https://slashdot.org/story/24/06/19/1823253/openai-co-founder-ilya-sutskever-launches-venture-for-safe-superintelligence?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Co-Founder Ilya Sutskever Launches Venture For Safe Superintelligence", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T17:23:34.091829+00:00", "description": "Officials are asking if this month's UK hospital hack resulted in fatalities. From a report: As the fallout from a cyberattack affecting hospitals in London enters its third week, doctors have been asked to report any deaths or other serious harms directly linked to the incident. On June 3, a group of ransomware hackers compromised a lab services provider, Synnovis, and locked down the company's systems, triggering major disruptions at hospitals and clinics in South East London. In the first week, doctors delayed 800 planned operations and 700 outpatient appointments and resorted to handwritten records, while a hospital solicited blood from its own clinical workers after the hack. Some of the worst interruptions have been resolved, but many services still haven't been restored. \n\n[...] But amid the recovery, health officials last week circulated a so-called \"harms monitoring\" form to doctors and clinicians, asking them to record the human toll of the cyberattack. The form, which I hav", "id": 740519, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/19/1625240/officials-query-if-any-deaths-directly-linked-to-uk-hospital-hack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Officials Query if Any Deaths Directly Linked To UK Hospital Hack", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T16:19:05.106256+00:00", "description": "Britain's university sector, a key contributor to the country's economy and global standing, is facing an unprecedented crisis that threatens its very existence, according to an analysis by Glen O'Hara, a professor of modern and contemporary history at Oxford Brookes University. Despite collectively generating over $61.1 billion in annual income and $28 billion in export earnings, universities across the UK are grappling with declining funding, widespread cuts, and internal divisions. The sector's annual losses stand at $2.55 billion, with one in four universities in the red. \n\nJob cuts have become a daily occurrence, with institutions such as Coventry, Goldsmith's, Kent, and Lincoln slashing staff numbers. The downsizing is primarily occurring through retirements and voluntary severance schemes, but the long-term outlook remains bleak. Experts cited in an analysis by Prospect magazine warn that without fundamental re-engineering and strategic direction, the sector risks a gradual dec", "id": 740141, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/19/116219/britains-universities-in-existential-crisis?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Britain's Universities in Existential Crisis?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T15:13:59.793103+00:00", "description": "Nvidia has become the U.S.'s most valuable listed company, riding the wave of the AI revolution that brings back memories of one from earlier this century. The last time a big provider of computing infrastructure was the most valuable U.S. company was in March 2000, when networking-equipment company Cisco took that spot at the height of the dot-com boom. \n\nFormer Cisco CEO John Chambers, who led the company during the dot-com boom, said the implications of AI are larger than the internet and cloud computing combined, but the dynamics differ. \"The implications in terms of the size of the market opportunity is that of the internet and cloud computing combined,\" he told WSJ. \"The speed of change is different, the size of the market is different, the stage when the most valuable company was reached is different.\" The story adds: Chambers said [Nvidia CEO] Huang was working from a different playbook than Cisco but was facing some similar challenges. Nvidia has a dominant market share, much", "id": 739800, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/19/1053243/former-cisco-ceo-nvidias-ai-dominance-mirrors-ciscos-internet-boom-but-market-dynamics-differ?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Former Cisco CEO: Nvidia's AI Dominance Mirrors Cisco's Internet Boom, But Market Dynamics Differ", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T14:08:39.840462+00:00", "description": "A researcher has found a bug that allows anyone to impersonate Microsoft corporate email accounts, making phishing attempts look credible and more likely to trick their targets. From a report: As of this writing, the bug has not been patched. To demonstrate the bug, the researcher sent an email to TechCrunch that looked like it was sent from Microsoft's account security team. Last week, Vsevolod Kokorin, also known online as Slonser, wrote on X (formerly Twitter) that he found the email-spoofing bug and reported it to Microsoft, but the company dismissed his report after saying it couldn't reproduce his findings. This prompted Kokorin to publicize the bug on X, without providing technical details that would help others exploit it.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Security+Bug+Allows+Anyone+To+Spoof+Microsoft+Employee+Emails%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F06%2F19%2F1020205%2F%3Futm_source%3Dtwitter%26utm_medium%3", "id": 739327, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/19/1020205/security-bug-allows-anyone-to-spoof-microsoft-employee-emails?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Security Bug Allows Anyone To Spoof Microsoft Employee Emails", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T13:03:46.955373+00:00", "description": "Shubham Sharma reports via VentureBeat: Chinese AI startup DeepSeek, which previously made headlines with a ChatGPT competitor trained on 2 trillion English and Chinese tokens, has announced the release of DeepSeek Coder V2, an open-source mixture of experts (MoE) code language model. Built upon DeepSeek-V2, an MoE model that debuted last month, DeepSeek Coder V2 excels at both coding and math tasks. It supports more than 300 programming languages and outperforms state-of-the-art closed-source models, including GPT-4 Turbo, Claude 3 Opus and Gemini 1.5 Pro. The company claims this is the first time an open model has achieved this feat, sitting way ahead of Llama 3-70B and other models in the category. It also notes that DeepSeek Coder V2 maintains comparable performance in terms of general reasoning and language capabilities.\n \nFounded last year with a mission to \"unravel the mystery of AGI with curiosity,\" DeepSeek has been a notable Chinese player in the AI race, joining the likes o", "id": 738809, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/18/226232/chinas-deepseek-coder-becomes-first-open-source-coding-model-to-beat-gpt-4-turbo?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China's DeepSeek Coder Becomes First Open-Source Coding Model To Beat GPT-4 Turbo", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T11:26:42.820846+00:00", "description": "An anonymous reader quotes a report from Phys.Org: When old satellites fall into Earth's atmosphere and burn up, they leave behind tiny particles of aluminum oxide, which eat away at Earth's protective ozone layer. A new study finds that these oxides have increased 8-fold between 2016 and 2022 and will continue to accumulate as the number of low-Earth-orbit satellites skyrockets. The 1987 Montreal Protocol successfully regulated ozone-damaging CFCs to protect the ozone layer, shrinking the ozone hole over Antarctica with recovery expected within fifty years. But the unanticipated growth of aluminum oxides may push pause on the ozone success story in decades to come. Of the 8,100 objects in low Earth orbit, 6,000 are Starlink satellites launched in the last few years. Demand for global internet coverage is driving a rapid ramp up of launches of small communication satellite swarms. SpaceX is the frontrunner in this enterprise, with permission to launch another 12,000 Starlink satellite", "id": 738313, "language": "en-us", "link": "https://news.slashdot.org/story/24/06/18/2142237/satellite-megaconstellations-may-jeopardize-recovery-of-ozone-hole?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Satellite 'Megaconstellations' May Jeopardize Recovery of Ozone Hole", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T07:41:50.138510+00:00", "description": "Astronomers are observing the sudden awakening of a giant black hole in the constellation of Virgo. \"Decades of observations found nothing remarkable about the distant galaxy in the constellation of Virgo, but that changed at the end of 2019 when astronomers noticed a dramatic surge in its luminosity that persists to this day,\" reports The Guardian. \"Researchers now believe they are witnessing changes that have never been seen before, with the black hole at the galaxy's core putting on an extreme cosmic light show as vast amounts of material fall into it.\" From the report: The galaxy, which goes by the snappy codename SDSS1335+0728 and lies 300m light years away, was flagged to astronomers in December 2019 when an observatory in California called the Zwicky Transient Facility recorded a sudden rise in its brightness. The alert prompted a flurry of new observations and checks of archived measurements from ground- and space-based telescopes to understand more about the galaxy and its pa", "id": 737405, "language": "en-us", "link": "https://science.slashdot.org/story/24/06/18/2151226/astronomers-detect-sudden-awakening-of-black-hole-for-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Astronomers Detect Sudden Awakening of Black Hole For First Time", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T04:26:19.754913+00:00", "description": "An anonymous reader quotes a report from MIT Technology Review: Meta has created a system that can embed hidden signals, known as watermarks, in AI-generated audio clips, which could help in detecting AI-generated content online. The tool, called AudioSeal, is the first that can pinpoint which bits of audio in, for example, a full hourlong podcast might have been generated by AI. It could help to tackle the growing problem of misinformation and scams using voice cloning tools, says Hady Elsahar, a research scientist at Meta. Malicious actors have used generative AI to create audio deepfakes of President Joe Biden, and scammers have used deepfakes to blackmail their victims. Watermarks could in theory help social media companies detect and remove unwanted content. However, there are some big caveats. Meta says it has no plans yet to apply the watermarks to AI-generated audio created using its tools. Audio watermarks are not yet adopted widely, and there is no single agreed industry sta", "id": 736828, "language": "en-us", "link": "https://slashdot.org/story/24/06/18/221204/meta-has-created-a-way-to-watermark-ai-generated-speech?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Has Created a Way To Watermark AI-Generated Speech", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T02:14:59.452314+00:00", "description": "AMD said on Tuesday it was looking into claims that company data was stolen in a hack by a cybercriminal organization called \"Intelbroker\". \"The alleged intrusion, which took place in June 2024, reportedly resulted in the theft of a significant amount of sensitive information, spanning across various categories,\" reports Hackread. From the report: In a recent post on Breach Forums, IntelBroker detailed the extent of the compromised data. The hacker claims to have accessed information related to the following records: ROMs, Firmware, Source code, Property files, Employee databases, Customer databases, Financial information, Future AMD product plans, and Technical specification sheets. The hacker is selling the data exclusively for XMR (Monero) cryptocurrency, accepting a middleman for transactions. He advises interested buyers to message him with their offers.\n \nThe reputation of IntelBroker in the cybersecurity community is one of significant concern, given the scale and sensitivity o", "id": 736478, "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/18/2121256/amd-is-investigating-claims-that-company-data-was-stolen-in-hack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AMD Is Investigating Claims That Company Data Was Stolen In Hack", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T02:14:57.889733+00:00", "description": "MattSparkes shares a report from NewScientist: The Russian invasion of Ukraine has seen so many landmines deployed across the country that clearing them would take 700 years, say researchers. To make the task more manageable, Ukrainian scientists are turning to artificial intelligence to identify which regions are a priority for de-mining, though they expect some may simply have to be left as a permanent \"scar\" on the country. The model considers vast amounts of data, including tax and property ownership records, agricultural maps, data on soil fertility, logs from the military and emergency services of where bombs and shells have landed, information gleaned from satellite images and interviews with local civilians and the military. Even climate change models and data on population density derived from mobile phone operators could be assessed. The AI then weighs factors such as civilian safety and potential economic benefits to determine the importance of a given piece of land and how", "id": 736477, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/18/2128214/ukraine-turning-to-ai-to-prioritize-700-years-of-landmine-removal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ukraine Turning To AI To Prioritize 700 Years of Landmine Removal", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T01:09:44.101365+00:00", "description": "Bipartisan agreement on government internet subsidies seems unlikely as Democrats and Republicans propose conflicting bills to reauthorize the FCC's spectrum auctions. The Democratic bill aims to fund the now-defunct Affordable Connectivity Program, while the Republican version does not. \"While some Republicans supported earlier efforts to extend the subsidy program, those efforts did not go through in time to keep it from ending,\" notes The Verge. From the report: The Senate Commerce Committee canceled a Tuesday morning markup meeting in which it was set to consider the Spectrum and National Security Act, led by committee chair Maria Cantwell (D-WA). When she introduced it in April, Cantwell said the bill would provide $7 billion to continue funding the Affordable Connectivity Program (ACP), the pandemic-era internet subsidy for low-income Americans that officially ran out of money and ended at the end of May. The main purpose of the bill is to reauthorize the Federal Communications ", "id": 736217, "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/18/214230/an-effort-to-fund-an-internet-subsidy-program-just-got-thwarted-again?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "An Effort To Fund an Internet Subsidy Program Just Got Thwarted Again", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T01:09:42.435363+00:00", "description": "French electricity prices turned negative due to a drop in demand and a surge in renewable energy output, prompting the grid operator to request that Electricite de France (EDF) take several nuclear reactors offline. Fortune reports: While more clean power is needed across Europe to reach climate goals, soaring renewables output and a lack of battery storage mean reactors sometimes have to be turned off during periods of low demand. It's becoming increasingly common around weekends in France -- which gets about two-thirds of its electricity from its atomic fleet -- and also occurs in the Nordic region and Spain.\n \nEDF halted its Golfech 2, Cruas 2 and Tricastin 1 nuclear plants, and plans to halt three others during the weekend. Some renewables producers will also have to curb generation to avoid paying a fee amid negative prices.\nFrench day-ahead power fell to -5.76 euros a megawatt-hour, the lowest in four years, in an auction on Epex Spot. Germany's equivalent contract dropped to 7", "id": 736216, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/18/2228205/electricity-prices-in-france-turn-negative-as-renewable-energy-floods-the-grid?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Electricity Prices In France Turn Negative As Renewable Energy Floods the Grid", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-19T01:09:40.862142+00:00", "description": "An anonymous reader quotes a report from The Register: Asda is transferring more than 100 internal IT workers to Indian outsourcing company TCS as it labors to meet deadlines to move away from IT systems supported by previous owner Walmart by the end of the year. According to documents seen by The Register, a collective consultation for a staff transfer under TUPE -- an arrangement by which employment rights are protected under UK law -- begins today (June 17). The UK's third-largest supermarket expects affected staff to meet line managers from June 24, while the transfer date is set for September 16. Contractors will be let go at the end of their current contracts. Asda employs around 5,000 staff in its UK offices. Between 130 and 135 members of the IT team have entered the collective consultation to move to TCS.\n \nThe move came as private equity company TDR Capital gained majority ownership of the supermarket group. It was acquired from Walmart by the brothers Mohsin and Zuber Issa ", "id": 736215, "language": "en-us", "link": "https://it.slashdot.org/story/24/06/18/2112216/asda-it-staff-shuffled-off-to-tcs-amid-messy-tech-divorce-from-walmart?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Asda IT Staff Shuffled Off To TCS Amid Messy Tech Divorce From Walmart", "user": null, "vote": 0}]