[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T22:30:00+00:00", "description": "Back in 2022, Soulframe was announced with a CG cinematic trailer offering a glimpse of its unique fantasy world. Soulframe, a fantasy free to play action MMORPG is still in development and we recently got an extended look at the game, with additional details also being shared by the developer afterward, and here, we are going to go over some of those key details that you should know.", "id": 938011, "language": null, "link": "https://www.youtube.com/watch?v=3rvkDtqU5nI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/3rvkDtqU5nI/hqdefault.jpg", "title": "Soulframe - 10 NEW Things You May Not Know", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T20:30:03+00:00", "description": "There’s a lot to love in Hangar 13’s third instalment of its Mafia series. The game’s setting, the wonderfully evocative, socially antagonistic city of New Bordeaux is fantastically realised. The story – whilst predictable – is wonderfully scripted and acted. Player character Lincoln Clay – a grizzled Vietnam war vet – is likeable, and superbly animated. \n\nHowever, this video sets out to analyse if the glut of game-breaking bugs prevalent when the game launched in 2016 still exist, and whether they make the experience unplayable. \n\nWhat we discover is that despite some glitches still lurking here and there, there are deeper issues running through the heart of Mafia III. Take your pick from the following: unimaginative mission structure, shoddy AI, paint-by-numbers gameplay – these unfixable issues undermine a game which had potential to endear as one of the greats.", "id": 937405, "language": null, "link": "https://www.youtube.com/watch?v=JYbG0_0kKkI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/JYbG0_0kKkI/hqdefault.jpg", "title": "Eight Years Later, Is Mafia 3 Finally FIXED?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T10:45:03+00:00", "description": "Very rarely do we see an unofficial mod generating the sort of excitement that Fallout London has done over the years, and after five years of development and a lot of waiting, the total conversion expansion sized Fallout 4 mod is finally here. \n\nAnd with it looking incredibly unlikely that we see an official new Fallout game at any point in the near future, what with Bethesda having its hands full with Starfield and The Elder Scrolls 6, a total conversion mod is a solid alternative for those looking desperately for their next Fallout fix. So, before you dive into the mod's offerings, here, we're going to go over all the key details that you should know about it.", "id": 933950, "language": null, "link": "https://www.youtube.com/watch?v=s0-XL6hC0ms", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/s0-XL6hC0ms/hqdefault.jpg", "title": "Fallout London - 11 Things You NEED TO KNOW Before You Play", "user": null, "vote": 0}]