[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T23:41:01.784239+00:00", "description": "The White House announced that Apple has \"signed onto the voluntary commitments\" in line with the administration's previous AI executive order. \"In addition, federal agencies reported that they completed all of the 270-day actions in the Executive Order on schedule, following their on-time completion of every other task required to date.\" From a report: The executive order \"built on voluntary commitments\" was supported by 15 leading AI companies last year. The White House said the agencies have taken steps \"to mitigate AI's safety and security risks, protect Americans' privacy, advance equity and civil rights, stand up for consumers and workers, promote innovation and competition, advance American leadership around the world, and more.\" It's a White House effort to mobilize government \"to ensure that America leads the way in seizing the promise and managing the risks of artificial intelligence,\" according to the White House.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"h", "id": 938154, "language": "en-us", "link": "https://apple.slashdot.org/story/24/07/26/2052238/white-house-announces-new-ai-actions-as-apple-signs-on-to-voluntary-commitments?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "White House Announces New AI Actions As Apple Signs On To Voluntary Commitments", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T23:40:59.292935+00:00", "description": "US presidential candidate, Robert F. Kennedy Jr., announced during his keynote Friday at the Bitcoin Conference that he would direct the US government to buy Bitcoin until the size of its Bitcoin reserves matched its gold reserves. At current prices, that equates to $615 billion worth of gold. RFK Jr. said: \"I will sign an executive order directing the US Treasury to purchase 550 Bitcoin daily until the US has built a reserve of at least 4,000,000 Bitcoins and a position of dominance that no other country will be able to usurp.\" 4 million Bitcoin is 19% of all Bitcoin that will ever exist.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=RFK+Jr.+Says+He'd+Direct+the+Government+to+Buy+%24615+Billion+in+Bitcoin+or+4+Million+Bitcoins%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F07%2F26%2F239214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.", "id": 938153, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/26/239214/rfk-jr-says-hed-direct-the-government-to-buy-615-billion-in-bitcoin-or-4-million-bitcoins?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "RFK Jr. Says He'd Direct the Government to Buy $615 Billion in Bitcoin or 4 Million Bitcoins", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T23:40:56.168536+00:00", "description": "An anonymous reader quotes a report from The Register: Not long after Windows PCs and servers at the Australian limb of audit and tax advisory Grant Thornton started BSODing last Friday, senior systems engineer Rob Woltz remembered a small but important fact: When PCs boot, they consider barcode scanners no differently to keyboards. That knowledge nugget became important as the firm tried to figure out how to respond to the mess CrowdStrike created, which at Grant Thornton Australia threw hundreds of PCs and no fewer than 100 servers into the doomloop that CrowdStrike's shoddy testing software made possible. [...] The firm had the BitLocker keys for all its PCs, so Woltz and colleagues wrote a script that turned them into barcodes that were displayed on a locked-down management server's desktop. The script would be given a hostname and generate the necessary barcode and LAPS password to restore the machine.\n \nWoltz went to an office supplies store and acquired an off-the-shelf barcode", "id": 938152, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/26/2059246/how-a-cheap-barcode-scanner-helped-fix-crowdstriked-windows-pcs-in-a-flash?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How a Cheap Barcode Scanner Helped Fix CrowdStrike'd Windows PCs In a Flash", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T22:29:40.700832+00:00", "description": "Thomas Claburn reports via The Register: Researchers at Truffle Security have found, or arguably rediscovered, that data from deleted GitHub repositories (public or private) and from deleted copies (forks) of repositories isn't necessarily deleted. Joe Leon, a security researcher with the outfit, said in an advisory on Wednesday that being able to access deleted repo data -- such as APIs keys -- represents a security risk. And he proposed a new term to describe the alleged vulnerability: Cross Fork Object Reference (CFOR). \"A CFOR vulnerability occurs when one repository fork can access sensitive data from another fork (including data from private and deleted forks),\" Leon explained.\n \nFor example, the firm showed how one can fork a repository, commit data to it, delete the fork, and then access the supposedly deleted commit data via the original repository. The researchers also created a repo, forked it, and showed how data not synced with the fork continues to be accessible through ", "id": 937898, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/26/2041207/data-from-deleted-github-repos-may-not-actually-be-deleted-researchers-claim?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Data From Deleted GitHub Repos May Not Actually Be Deleted, Researchers Claim", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T21:23:30.051529+00:00", "description": "Internet service providers are pushing back against the Biden administration's requirement for low-cost options even as they are attempting to secure funds from a $42.45 billion government broadband initiative. The Broadband Equity, Access, and Deployment program, established by law to expand internet access, mandates that recipients offer affordable plans to eligible low-income subscribers, a stipulation the providers argue infringes on legal prohibitions against rate regulation. ISPs claim that the proposed $30 monthly rate for low-cost plans is economically unfeasible, especially in hard-to-reach rural areas, potentially undermining the program's goals by discouraging provider participation.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=ISPs+Seeking+Government+Handouts+Try+To+Avoid+Offering+Low-Cost+Broadband%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F26%2F1949229%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"htt", "id": 937602, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/26/1949229/isps-seeking-government-handouts-try-to-avoid-offering-low-cost-broadband?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "ISPs Seeking Government Handouts Try To Avoid Offering Low-Cost Broadband", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T21:23:28.456822+00:00", "description": "An anonymous reader quotes a report from the New York Times: If you drive a car made by General Motors and it has an internet connection, your car's movements and exact location are being collected and shared anonymously with a data broker. This practice, disclosed in a letter (PDF) sent by Senators Ron Wyden of Oregon and Edward J. Markey of Massachusetts to the Federal Trade Commission on Friday, is yet another way in which automakers are tracking drivers (source may be paywalled; alternative source), often without their knowledge. Previous reporting in The New York Times which the letter cited, revealed how automakers including G.M., Honda and Hyundai collected information about drivers' behavior, such as how often they slammed on the brakes, accelerated rapidly and exceeded the speed limit. It was then sold to the insurance industry, which used it to help gauge individual drivers' riskiness.\n \nThe two Democratic senators, both known for privacy advocacy, zeroed in on G.M., Honda a", "id": 937601, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/26/2029236/automakers-sold-driver-data-for-pennies-senators-say?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Automakers Sold Driver Data For Pennies, Senators Say", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T20:18:57.883774+00:00", "description": "Google's upcoming Pixel 9 smartphones are set to introduce new AI-powered features, including \"Add Me,\" a tool that will allow users to insert themselves into group photos after those pictures have been taken, according to leaked promotional video obtained by Android Headlines. This feature builds on the Pixel 8's \"Best Take\" function, which allowed face swapping in group shots.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Pixel+9+AI+Will+Add+You+To+Group+Photos+Even+When+You're+Not+There%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F26%2F192230%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F26%2F192230%2Fpixel-9-ai-will-add-you-to-group-photos-even-when-youre-not-there%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/face", "id": 937290, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/26/192230/pixel-9-ai-will-add-you-to-group-photos-even-when-youre-not-there?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Pixel 9 AI Will Add You To Group Photos Even When You're Not There", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T20:18:56.039826+00:00", "description": "Online education company 2U filed for Chapter 11 bankruptcy protection and is being taken private in a deal that will wipe out more than half of its $945 million debt [non-paywalled link]. From a report: 2U was a pioneer in the online education space, joining with schools including the University of Southern California, Georgetown University and the University of North Carolina at Chapel Hill to design and operate online courses in fields including nursing and social work. But it struggled in recent years amid new competition and changing regulations. It also had a highly leveraged balance sheet with looming loan-repayment deadlines. 2U closed Wednesday with a market value of about $11.5 million, down from more than $5 billion in 2018. In 2021, 2U bought edX, an online platform for classes that was founded by Harvard University and the Massachusetts Institute of Technology. The debt from that $800 million deal for edX proved debilitating to 2U, WSJ reports.<p><div class=\"share_submiss", "id": 937289, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/26/1916238/2u-once-a-giant-in-online-education-files-for-chapter-11-bankruptcy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "2U, Once a Giant in Online Education, Files for Chapter 11 Bankruptcy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T19:06:07.578998+00:00", "description": "Russia admitted that it's deliberately slowing YouTube's loading speeds and said it plans to throttle the download speeds on the Google platform by up to 70% by the end of next week. Russia is taking this stand in response to Google's refusal to comply with the demands of the Russian authorities, local lawmaker Alexander Khinshtein said. From a report: Khinshtein, the head of the State Duma's Information Policy Committee, claimed that the move is \"not aimed against Russian users, but against the administration of a foreign resource that still believes that it can violate and ignore our legislation with impunity.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Russia+To+Slow+YouTube+Speeds%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F07%2F26%2F186225%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fn", "id": 936871, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/26/186225/russia-to-slow-youtube-speeds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Russia To Slow YouTube Speeds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T19:06:05.922263+00:00", "description": "Open AI models that allow developers to customize them with few restrictions are more likely to promote competition, FTC Chair Lina Khan said, weighing in on a key debate within the industry. From a report: \"There's tremendous potential for open-weight models to promote competition,\" Khan said Thursday in San Francisco at startup incubator Y Combinator. \"Open-weight models can liberate startups from the arbitrary whims of closed developers and cloud gatekeepers.\" \n\n\"Open-weight\" models disclose what an AI model picked up and was tweaked on during its training process. That allows developers to better customize them and makes them more accessible to smaller companies and researchers. But critics have warned that open models carry an increased risk of abuse and could potentially allow companies from geopolitical rivals like China to piggyback off the technology. Khan's comments come as the Biden administration is considering guidance on the use and safety of open-weight models.<p><div c", "id": 936870, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/26/1820202/ftcs-khan-backs-open-ai-models-in-bid-to-avoid-monopolies?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FTC's Khan Backs Open AI Models in Bid to Avoid Monopolies", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T17:57:38.268369+00:00", "description": "Marvel Studios President Kevin Feige, who has overseen the Marvel Cinematic Universe's unprecedented success, has expressed his longstanding appreciation for sequels and world-building in cinema at a time when Disney's top executive has admitted that the company has diluted audience's attention by making too many TV shows and movies. \n\n\"I was never cynical or rolling my eyes the way people still do today for some reason, even though there've been sequels since the '30s and they're an absolute pillar of the industry,\" Feige told Variety in an interview, highlighting his enthusiasm for returning to beloved characters and expanding on established narratives. The studio's ambitious expansion into streaming content for Disney+ has led to what Disney CEO Bob Iger described as \"some disappointments\" in theatrical releases. In July 2023, Iger cited the increased output for streaming as a factor that \"diluted focus and attention\" at Marvel. In response to these challenges, Disney announced a s", "id": 936505, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/07/26/1647230/marvels-kevin-feige-defends-sequels-as-an-absolute-pillar-of-the-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Marvel's Kevin Feige Defends Sequels as an 'Absolute Pillar of the Industry'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T17:57:36.252442+00:00", "description": "An anonymous reader shares a report: On Monday, it initially seemed like the beginning of the end for Intel's desktop CPU instability woes -- the company confirmed a patch is coming in mid-August that should address the \"root cause\" of exposure to elevated voltage. But if your 13th or 14th Gen Intel Core processor is already crashing, that patch apparently won't fix it. \n\nCiting unnamed sources, Tom's Hardware reports that any degradation of the processor is irreversible, and an Intel spokesperson did not deny that when we asked. Intel is \"confident\" the patch will keep it from happening in the first place. But if your defective CPU has been damaged, your best option is to replace it instead of tweaking BIOS settings to try and alleviate the problems. \n\nAnd, Intel confirms, too-high voltages aren't the only reason some of these chips are failing. Intel spokesperson Thomas Hannaford confirms it's a primary cause, but the company is still investigating. Intel community manager Lex Hoyos", "id": 936504, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/26/176215/no-fix-for-intels-crashing-13th-and-14th-gen-cpus---any-damage-is-permanent?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "No Fix For Intel's Crashing 13th and 14th Gen CPUs - Any Damage is Permanent", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T16:44:56.887958+00:00", "description": "Air pollution breathed in during childhood is one of the factors in adult lung health, according to a new study. From a report: The origins of the study date back to 1992 when researchers began investigating the effects of air pollution on groups of children in California. Some of these children are now in their 40s. Dr Erika Garcia and colleagues from the University of Southern California decided to see how they were getting on. More than 1,300 people replied and filled in detailed questionnaires on their income, lifestyle (including smoking), homes and health. This was matched against their childhood health and the local air pollution when they were growing up. \n\nThe first finding was that people with higher childhood exposures to particle pollution and nitrogen dioxide had a higher likelihood of bronchitic symptoms as an adult. This relationship was strongest for those who had developed asthma and lung problems as children, meaning these people had a vulnerability that continued in", "id": 936005, "language": "en-us", "link": "https://science.slashdot.org/story/24/07/26/1536239/childhood-air-pollution-directly-linked-to-adult-lung-health-study-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Childhood Air Pollution Directly Linked To Adult Lung Health, Study Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T16:44:55.293899+00:00", "description": "More students are getting high scores on Advanced Placement tests, long seen as a gateway to elite college admissions as well as a way to earn college credit during high school. From a report: Changes by the tests' maker in recent years have shifted scores upward. That has led to hundreds of thousands of additional students getting what's considered a passing score -- 3 or above on the 1-to-5 scale -- on exams in popular courses including AP U.S. History and AP U.S. Government. \n\nThe nonprofit behind the tests, College Board, says it updated the scoring by replacing its panel of experts with a large-scale data analysis to better reflect the skills students learn in the courses. Some skeptical teachers, test-prep companies and college administrators see the recent changes as another form of grade inflation, and a way to boost the organization's business by making AP courses seem more attractive. \n\n\"It is hard to argue with the premise of AP, that students who are talented and academica", "id": 936004, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/26/1556242/it-is-now-easier-to-pass-ap-tests?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "It Is Now Easier To Pass AP Tests", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T15:38:53.461278+00:00", "description": "Microsoft has started testing a new way to access your Android phone from directly within Windows 11's File Explorer. From a report: Windows Insiders are now able to test this new feature, which lets you wirelessly browse through folders and files on your Android phone. The integration in File Explorer means your Android device appears just like a regular USB device on the left-hand side, with the ability to copy or move files between a PC and Android phone, and rename or delete them. It's certainly a lot quicker than using the existing Phone Link app.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+11+Will+Soon+Add+Your+Android+Phone+To+File+Explorer%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F07%2F26%2F1440232%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F07", "id": 935501, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/26/1440232/windows-11-will-soon-add-your-android-phone-to-file-explorer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Windows 11 Will Soon Add Your Android Phone To File Explorer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T14:33:53.294132+00:00", "description": "In the wake of a major incident that affected millions of Windows PCs, Microsoft is calling for significant changes to enhance the resilience of its operating system. John Cable, Microsoft's vice president of program management for Windows servicing and delivery, said there was a need for \"end-to-end resilience\" in a blog post, signaling a potential shift in Microsoft's approach to third-party access to the Windows kernel. \n\nWhile not explicitly detailing planned improvements, Cable pointed to recent innovations like VBS enclaves and the Azure Attestation service as examples of security measures that don't rely on kernel access. This move towards a \"Zero Trust\" approach could have far-reaching implications for the cybersecurity industry and Windows users worldwide, as Microsoft seeks to balance system security with the needs of its partners in the broader security community. \n\nThe comment follows a Microsoft spokesman revealed last week that a 2009 European Commission agreement preven", "id": 935049, "language": "en-us", "link": "https://slashdot.org/story/24/07/26/146252/microsoft-pushes-for-windows-changes-after-crowdstrike-incident?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Pushes for Windows Changes After CrowdStrike Incident", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T13:16:39.292348+00:00", "description": "An anonymous reader quotes a report from The Hacker News: Google said it's adding new security warnings when downloading potentially suspicious and malicious files via its Chrome web browser. \"We have replaced our previous warning messages with more detailed ones that convey more nuance about the nature of the danger and can help users make more informed decisions,\" Jasika Bawa, Lily Chen, and Daniel Rubery from the Chrome Security team said. To that end, the search giant is introducing a two-tier download warning taxonomy based on verdicts provided by Google Safe Browsing: Suspicious files and Dangerous files. Each category comes with its own iconography, color, and text to distinguish them from one another and help users make an informed choice.\n \nGoogle is also adding what's called automatic deep scans for users who have opted-in to the Enhanced Protection mode of Safe Browsing in Chrome so that they don't have to be prompted each time to send the files to Safe Browsing for deep sc", "id": 934610, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/26/017223/new-chrome-feature-scans-password-protected-files-for-malicious-content?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New Chrome Feature Scans Password-Protected Files For Malicious Content", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T11:05:07.295742+00:00", "description": "Longtime Slashdot reader sandbagger shares a blog post from Meta Engineer Jordan Eldredge, with the caption: A biography of jazz trumpeter Chet Baker, weird images, a worm.exe, random images, encrypted files, a gift a dad in Thailand had made for his two-and-a-half-year-old son, and much more could be found when investigating corrupt WinAmp files. Who knew? \"In January of 2021, I was exploring the corpus of skins I collected for the Winamp Skin Museum and found some that seemed corrupted, so I decided to explore them,\" writes Eldredge. \"Winamp skins are actually just zip files with a different file extension, so I tried extracting their files to see what I could find. This ended up leading me down a series of wild rabbit holes...\"\n \nIn all, Eldredge found more than 16 distinct types of items -- most of which are completely random but intriguing nonetheless. \"It's so interesting how if you get a large enough number of things that were created by real people, you can end up finding all ", "id": 933918, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/26/0058212/bizarre-secrets-found-investigating-corrupt-winamp-skins?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Bizarre Secrets Found Investigating Corrupt Winamp Skins", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T07:48:15.995359+00:00", "description": "Yesterday, the Energy Information Agency (EIA) released electricity generation numbers for the first five months of 2024, revealing that solar power generation increased by 25% compared to the same period last year. Ars Technica's John Timmer reports: The EIA breaks down solar production according to the size of the plant. Large grid-scale facilities have their production tracked, giving the EIA hard numbers. For smaller installations, like rooftop solar on residential and commercial buildings, the agency has to estimate the amount produced, since the hardware often resides behind the metering equipment, so only shows up via lower-than-expected consumption.\n \nIn terms of utility-scale production, the first five months of 2024 saw it rise by 29 percent compared to the same period in the year prior. Small-scale solar was \"only\" up by 18 percent, with the combined number rising by 25.3 percent. Most other generating sources were largely flat, year over year. This includes coal, nuclear, ", "id": 933057, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/07/26/0042224/us-solar-production-soars-by-25-percent-in-just-one-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Solar Production Soars By 25 Percent In Just One Year", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T04:33:04.185117+00:00", "description": "An anonymous reader quotes a report from The Conversation, written by Michael W. Crowder, Professor of Chemistry and Biochemistry and Dean of the Graduate School at Miami University: For many people, the aroma of freshly brewed coffee is the start of a great day. But caffeine can cause headaches and jitters in others. That's why many people reach for a decaffeinated cup instead. I'm a chemistry professor who has taught lectures on why chemicals dissolve in some liquids but not in others. The processes of decaffeination offer great real-life examples of these chemistry concepts. Even the best decaffeination method, however, does not remove all of the caffeine -- about 7 milligrams of caffeine usually remain in an 8-ounce cup. Producers decaffeinating their coffee want to remove the caffeine while retaining all -- or at least most -- of the other chemical aroma and flavor compounds.\n \nDecaffeination has a rich history, and now almost all coffee producers use one of three common methods.", "id": 932529, "language": "en-us", "link": "https://developers.slashdot.org/story/24/07/26/0029204/chemist-explains-the-chemistry-behind-decaf-coffee?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Chemist Explains the Chemistry Behind Decaf Coffee", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T02:13:37.321699+00:00", "description": "In a major victory for ride-hail companies, California Supreme Court upheld a law classifying gig workers as independent contractors, maintaining their ineligibility for benefits such as sick leave and workers' compensation. This decision concludes a prolonged legal battle and supports the 2020 ballot measure Proposition 22, despite opposition from labor groups who argued it was unconstitutional. Politico reports: Thursday's ruling capped a yearslong battle between labor and the companies over the status of workers who are dispatched by apps to deliver food, buy groceries and transport customers. A 2018 Supreme Court ruling and a follow-up bill would have compelled the gig companies to treat those workers as employees. A collection of five firms then spent more than $200 million to escape that mandate by passing the 2020 ballot measure Proposition 22 in one of the most expensive political campaigns in American history. The unanimous ruling on Thursday now upholds the status quo of the", "id": 932155, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/26/005248/california-supreme-court-upholds-gig-worker-law-in-a-win-for-ride-hail-companies?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "California Supreme Court Upholds Gig Worker Law In a Win For Ride-Hail Companies", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T02:13:34.982046+00:00", "description": "According to a new study published in Nature, researchers found that training AI models using AI-generated datasets can lead to \"model collapse,\" where models produce increasingly nonsensical outputs over generations. \"In one example, a model started with a text about European architecture in the Middle Ages and ended up -- in the ninth generation -- spouting nonsense about jackrabbits,\" writes The Register's Lindsay Clark. From the report: [W]ork led by Ilia Shumailov, Google DeepMind and Oxford post-doctoral researcher, found that an AI may fail to pick up less common lines of text, for example, in training datasets, which means subsequent models trained on the output cannot carry forward those nuances. Training new models on the output of earlier models in this way ends up in a recursive loop. In an accompanying article, Emily Wenger, assistant professor of electrical and computer engineering at Duke University, illustrated model collapse with the example of a system tasked with ge", "id": 932154, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/26/0016252/ai-models-face-collapse-if-they-overdose-on-their-own-output?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Models Face Collapse If They Overdose On Their Own Output", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T01:04:09.380498+00:00", "description": "An anonymous reader quotes a report from the Associated Press: Hollywood's video game performers voted to go on strike Thursday, throwing part of the entertainment industry into another work stoppage after talks for a new contract with major game studios broke down over artificial intelligence protections. The strike -- the second for video game voice actors and motion capture performers under the Screen Actors Guild-American Federation of Television and Radio Artists -- will begin at 12:01 a.m. Friday. The move comes after nearly two years of negotiations with gaming giants, including divisions of Activision, Warner Bros. and Walt Disney Co., over a new interactive media agreement.\n \nSAG-AFTRA negotiators say gains have been made over wages and job safety in the video game contract, but that the studios will not make a deal over the regulation of generative AI. Without guardrails, game companies could train AI to replicate an actor's voice, or create a digital replica of their likene", "id": 931932, "language": "en-us", "link": "https://games.slashdot.org/story/24/07/25/2055242/video-game-performers-will-go-on-strike-over-ai-concerns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Video Game Performers Will Go On Strike Over AI Concerns", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-26T01:04:07.353544+00:00", "description": "snydeq shares a report from CIO.com: ServiceNow has reported potential compliance issues to the US Department of Justice \"related to one of its government contracts\" as well as the hiring of the then-CIO of the US Army to be its head of global public sector, the company said in regulatory filings on Wednesday. The DOJ is looking into the matter. Following an internal investigation, ServiceNow said, its President and COO, CJ Desai, has resigned, while \"the other individual has also departed the company.\" That executive, Raj Iyer, told CIO.com, \"I resigned because I didn't want to be associated with this fiasco in any way. It's not my fault.\" \n\n CEO Bill McDermott told financial analysts in a conference call Wednesday that someone within ServiceNow had complained about the situation and that an internal probe \"determined that our company policy was violated.\"\n \n\"Acting with total transparency, the company proactively disclosed the findings of the investigation to the proper government e", "id": 931931, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/25/235234/servicenow-embroiled-in-doj-probe-of-government-contract-award?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "ServiceNow Embroiled In DOJ Probe of Government Contract Award", "user": null, "vote": 0}]