[{"source": "https://www.arabnews.com/rss.xml", "title": "US forces attacked 4 times in Iraq, Syria within hours", "description": "BAGHDAD: US forces were attacked four times in Iraq and Syria on Thursday with rockets and armed drones, but there were no casualties or damage to infrastructure, a USmilitary official said.\n\tSpeaking on condition of anonymity, the official said US and international forces were attacked at two sites in northeastern Syria with multiple rockets and a one-way attack drone.\n\tIn Iraq, multiple one-way drones were launched at the Ain Al-Asad air base west of Baghdad and a drone was launched at a base housing US forces near Irbil airport in northern Iraq.", "link": "https://www.arabnews.com/node/2414241/middle-east", "date_published": "2023-11-23T23:25:26.616388+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "MBC announces plans to float 33.25 million shares on Tadawul", "description": "LONDON: MBC Group has announced further details of its offering on Thursday, stating that it will float 33.25 million shares on the Tadawul, Saudi Arabia’s official stock exchange.\n\n\tThe media conglomerate’s prospectus states that the current capital stands at $797.7 million, and that there are currently 299.25 million shares.\n\n\tThe company plans to issue 33.25 million new shares for the offering, which is 10 percent of MBC’s total capital after the offering.", "link": "https://www.arabnews.com/node/2414251/media", "date_published": "2023-11-23T23:25:26.615895+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Volleyball, kiteboarding kick off day one of Saudi Games 2023", "description": "RIYADH: The second edition of the Saudi Games began on Thursday as the Al-Hilal women's volleyball team secured a victory over Al-Nassr, with a score of three games to two, at Green Hall at the Prince Faisal bin Fahad Olympic Complex in Riyadh.\n\n\tIn an action-packed day of volleyball, the women’s Al-Riyadh team defeated Manjam Al-Mwuahib with an impressive 3-0 win, while Al-Ittihad achieved a 3-0 victory against Al-Zulfi. Meanwhile, Al-Ahli triumphed over Al-Anqaa with a final score of 3-0.", "link": "https://www.arabnews.com/node/2414261/sport", "date_published": "2023-11-23T23:25:26.615401+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Jeddah Historic District Program sponsors FIFA Club World Cup Saudi Arabia 2023", "description": "JEDDAH: The Jeddah Historic District Program has secured sponsorship rights as the official cultural destination and main supporter of the FIFA Club World Cup Saudi Arabia 2023.\n\n\tThe prestigious tournament, which takes place in Jeddah from Dec. 12-22, is being played in the Kingdom for the first time.\n\n\tThe program’s sponsorship of the tournament is part of its efforts to showcase the UNESCO World Heritage Site of Jeddah, also known as Al-Balad, and to promote the region as a global destination for culture and heritage.", "link": "https://www.arabnews.com/node/2414266/saudi-arabia", "date_published": "2023-11-23T22:11:52+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Halal Expo London 2023 set to unveil lucrative opportunities in sector", "description": "LONDON: Halal Expo London is set to take center stage once again in the UK capital, promising to be “bigger, better, and more compelling than ever before,” organizers have announced.\n\n\tThey said in a statement: “Building on the successes of Halal Expo London 2022 and Halal Expo Manchester 2023, this event is poised to be a pivotal moment for the halal trade industry.”\n\n\tThe three-day event, between Dec. 1-3, takes place at the Tottenham Hotspur Stadium in London.", "link": "https://www.arabnews.com/node/2414271/world", "date_published": "2023-11-23T22:11:37+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi Arabia to host 27th World Energy Congress in Riyadh in 2026", "description": "RIYADH: The World Energy Council has announced that the Saudi capital Riyadh will host the 27th World Energy Congress, which is set to take place in 2026 from Oct. 26-29.\n\n\tThe congress is at the Riyadh Front Center, strategically located in the heart of the capital and at the center of one of the world’s most important energy regions.\n\n\tThe location was chosen following a highly competitive bidding process which was open to all the council’s more than 70 national member committees, representing more than 3,000 organizations across the energy ecosystem.", "link": "https://www.arabnews.com/node/2414276/saudi-arabia", "date_published": "2023-11-23T22:11:20+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi EXIM Bank and Thai counterpart sign MoU to propel trade exchange", "description": "RIYADH: Trade exchange between Saudi Arabia and Thailand is on track to flourish following a new agreement signed by the Saudi EXIM Bank.\n\n\tInked with its counterpart, the EXIM Bank of Thailand, the memorandum of understanding aims to enhance aspects of cooperation in export and import-related activities, the Saudi Press Agency reported.\n\n\tSigned on the sidelines of the Asian EXIM Banks Forum held in Sydney from Nov. 20-23, the new deal falls in line with the Saudi EXIM Bank’s vision to further empower the Kingdom’s non-oil economy in global markets.", "link": "https://www.arabnews.com/node/2413821/business-economy", "date_published": "2023-11-23T09:11:57+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "WHO says misuse of antibiotics undermining efficacy", "description": "COPENHAGEN: Misuse of antibiotics is denting their efficacy and spawning resistant bacteria which could be responsible for 10 million deaths worldwide by 2050, the World Health Organization warned Thursday.\n\tWHO’s European chapter conducted a study which showed that antibiotics were prescribed for things like common cold (24 percent of cases), flu-like symptoms (16 percent), a sore throat (21 percent) and a cough (18 percent).\n\tThe survey was carried out in 14 countries, mostly in Eastern Europe and Central Asia.", "link": "https://www.arabnews.com/node/2413831/world", "date_published": "2023-11-23T09:11:20+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi, Norwegian foreign ministers discuss Gaza crisis, relief efforts", "description": "RIYADH: Saudi Arabia’s Foreign Minister Prince Faisal bin Farhan received a phone call from his Norwegian counterpart Espen Barth Eide, the Kingdom’s foreign ministry said on Thursday.\n\n\tThe two ministers discussed the work and efforts of the ministerial committee assigned by the Joint Arab-Islamic Extraordinary Summit and the talks held by the delegation in Beijing, Moscow, London and Paris.", "link": "https://www.arabnews.com/node/2414206/saudi-arabia", "date_published": "2023-11-23T08:11:45+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Where We Are Going Today: Orbe doughnut shop in Jeddah", "description": "JEDDAH: If you have a soft spot for doughnuts, look no further than Orbe. \n\n\tThis outlet in the heart of Jeddah offers light, fresh, and delectable mini-doughnuts. Simply order and then savor the moment, with each item made on the spot and served piping hot.\n\n\tDoughnut lovers can order from six to 48 pieces from a menu that ranges from classics such as Nutella and lotus to adventurous pistachio and fruity options.", "link": "https://www.arabnews.com/node/2414211/food-health", "date_published": "2023-11-23T08:11:22+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi, Jordanian ministers discuss water cooperation in Riyadh", "description": "RIYADH: Saudi Minister of Environment, Water, and Agriculture Abdulrahman bin Abdulmohsen Al-Fadhli met Jordanian Minister of Water and Irrigation Raed Abu Soud to discuss bilateral cooperation in the water sector, Jordan News Agency reported.\n\n\tThe meeting took place on Thursday on the sidelines of the 15th session of the Arab Ministerial Water Council and the 5th Arab Water Conference, which ran from Nov. 22-23 in Riyadh.", "link": "https://www.arabnews.com/node/2414196/saudi-arabia", "date_published": "2023-11-23T08:11:17+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Saudi deputy minister meets Irish envoy", "description": "Saudi Deputy Minister for Political Affairs Ambassador Dr. Saud Al-Sati received Irish Ambassador to the Kingdom Gerry Cunningham in Riyadh on Thursday.\n\n\tThe two sides discussed bilateral relations and developments of common concern.\n\n\tA day earlier, the minister met the executive director of Middle East relations at the Canadian Ministry of Foreign Affairs, Martin Larose, in Riyadh.", "link": "https://www.arabnews.com/node/2414201/saudi-arabia", "date_published": "2023-11-23T08:11:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "New Yorkers rally in support of halal food vendor after rant by former Obama adviser", "description": "LONDON: New Yorkers have rallied in support of a group of Arab food vendors after a video of a former White House adviser to Barack Obama harassing a halal cart worker went viral.\n\tThe Adam Halal Food Cart experienced a surge in business the day after the videos surfaced online, with both regulars and first-time customers forming long queues to place their orders.\n\tPeople gathered around a folding table provided by a local resident, where they shared meals and conversation.", "link": "https://www.arabnews.com/node/2414091/offbeat", "date_published": "2023-11-23T05:11:36+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "News from Gaza ‘difficult to wake up to’: F1’s Lewis Hamilton", "description": "ABU DHABI: Formula One star Lewis Hamilton on Thursday said that he felt helpless and found it “difficult to wake up each day” knowing children were dying in Gaza.\n\n\tThe British seven-time world champion revealed it had been hard to compartmentalize his feelings about the atrocities taking place in the Israel-Hamas war as he tried to focus on his job ahead of the season finale in Abu Dhabi this weekend.\n\n\tSpeaking to Arab News at Yas Marina Circuit, he noted that the ongoing conflict had been on his mind.", "link": "https://www.arabnews.com/node/2414081/sport", "date_published": "2023-11-23T04:11:50+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "North Korea to send new weapons to border after spy satellite launch", "description": "SEOUL: North Korea said Thursday it would deploy new weapons and stronger armed forces to the border with the South, as Seoul’s spy agency said Pyongyang had received Russian help to successfully put a military spy satellite into orbit.\n\tThe “Malligyong-1” was launched Tuesday, Pyongyang’s third attempt at securing a military eye in the sky after two failures in May and August, with Kim Jong Un already reviewing images of US military bases in Guam, the North’s state media has reported.", "link": "https://www.arabnews.com/node/2413661/world", "date_published": "2023-11-23T04:11:42+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Alinghi Red Bull Racing sailing team gears up for America’s Cup preliminary regatta", "description": "JEDDAH: Alinghi Red Bull Racing sailing team are gearing up for the second preliminary regatta of the 37th America’s Cup, to be held in Jeddah from Nov. 29-Dec. 2.\n\tThe team were the first of the six America’s Cup entries to arrive in Jeddah three weeks ago to train, and along with the shore team set up a temporary base to prepare the AC40 boats.\n\tInitial conditions were perfect, providing an ideal opportunity to train and test out of Jeddah’s scenic Corniche.", "link": "https://www.arabnews.com/node/2414061/saudi-sport", "date_published": "2023-11-23T04:11:29+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Netanyahu should be thrown out now, says ex Israeli PM Olmert", "description": "LONDON: A former prime minister of Israel said on Thursday that current premier Benjamin Netanyahu should be removed from power for being a “real danger” to the country, despite the ongoing conflict with Hamas in Gaza.\n\n\tEhud Olmert told Sky News that Netanyahu and his administration were a “real danger” to Israel’s stability and he should be “thrown out” of office during an interview with the channel’s international affairs editor, Dominic Waghorn.", "link": "https://www.arabnews.com/node/2414056/middle-east", "date_published": "2023-11-23T04:11:20+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Prosecutors seek jail term for ex-Brazil star Alves over rape charge", "description": "BARCELONA: Spanish prosecutors are seeking a nine-year jail term for former Brazil star Dani Alves who is accused of raping a young woman at a Barcelona nightclub in December 2022.\n\tProsecutors have also demanded the former Barcelona and Paris Saint-Germain full-back, who has been in jail in Spain since his arrest in January, pay his alleged victim 150,000 euros ($163,500) in compensation, according to a copy of his indictment seen by AFP on Thursday.\n\tA date for his trial had not yet been set. The 40-year-old has maintained that he had consensual sex with his accuser.", "link": "https://www.arabnews.com/node/2414046/football", "date_published": "2023-11-23T04:11:08+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Turkiye’s central bank raises interest rate to 40% to tame rising inflation", "description": "RIYADH: For the 6th consecutive time, Turkiye’s central bank has raised the one-week repo rate to 40 percent, signaling the conclusion of its tightening cycle.  \n\n\tIn a bid to address persisting inflationary pressures and ensure sustained price stability, the Turkish Monetary Policy Committee announced in a statement on Thursday its decision to raise the interest rate from 35 percent to 40 percent. \n\n\tThe move came as headline inflation experienced a slight decline in October.", "link": "https://www.arabnews.com/node/2414066/business-economy", "date_published": "2023-11-23T04:11:06+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Reef Saudi launches bee clinics in major cities in Kingdom", "description": "RIYADH: The Sustainable Agricultural Rural Development Program, or Reef Saudi, has launched bee clinics in Jeddah, Jazan, Madinah and Abha, providing examination, diagnosis, guidance and aids to beekeepers, and empowering small producers.\n\n\tThe bee clinics will provide beekeepers with a guide manual, collect and examine samples, send instructions for development according to the samples, develop and update a database of pests and diseases affecting bees, and alert relevant departments if needed.", "link": "https://www.arabnews.com/node/2414026/saudi-arabia", "date_published": "2023-11-23T03:11:49+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Korea’s CJ Logistics partners with Nesma to widen footprint in the Middle East", "description": "RIYADH: Saudi Arabia’s logistics sector is set to undergo positive transformations thanks to a new agreement between the Kingdom’s Nesma Co. and Korean firm CJ Logistics. \n\n\tThe companies have formally signed a memorandum of understanding at CJ Logistics' headquarters in Seoul, affirming their shared commitment to explore joint business ventures and prioritize collaborative projects in Saudi Arabia, according to a press release. \n\n\tThe partnership aims to bring transformative changes to the logistics industry in the Middle East region.", "link": "https://www.arabnews.com/node/2414021/business-economy", "date_published": "2023-11-23T03:11:33+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "English FA council member resigns after inappropriate social media post on war in Gaza", "description": "LONDON: A council member at the English Football Association who made an inappropriate post regarding the war in Gaza resigned from his position on Thursday.\n\tWasim Haq had been suspended for the comments he made this month on the social platform X, formerly known as Twitter, which reportedly referred to Adolf Hitler and Israeli Prime Minister Benjamin Netanyahu. The post was deleted and Haq apologized.\n\tThe FA, the governing body of soccer in England, was conducting an investigation.", "link": "https://www.arabnews.com/node/2414041/football", "date_published": "2023-11-23T03:11:23+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "LIV unveils 2024 schedule with 12 events in eight nations", "description": "MIAMI: The LIV Golf League released its 2024 regular-season schedule on Wednesday even as merger talks continue between LIV’s Saudi backers and the PGA Tour over a framework agreement.\n\n\tThe campaign runs from February to August with 12 events in eight nations and is to be followed by LIV’s individual and team championship tournaments, details of which were not announced.\n\n\tSome of LIV’s events are opposite PGA Tour signature events.", "link": "https://www.arabnews.com/node/2413656/sport", "date_published": "2023-11-23T03:11:22+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Five people, including three children, in hospital after Dublin stabbing", "description": "DUBLIN: Irish police said five people, including three young children, have been taken to hospital following a serious public order incident in Dublin city center on Thursday that local media reported as a stabbing.\n\tPolice said in a statement that they were following a definite line of inquiry and not looking for any other person at this time.", "link": "https://www.arabnews.com/node/2414031/world", "date_published": "2023-11-23T03:11:13+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "South American coaches lead Albania to Euro 2024 spot.", "description": "TIRANA, Albania: Albania qualified for just their second European Championship in style, atop a group that included the Czech Republic and Poland.\n\n\tIt’s a dream come true for the team’s South American coaches.\n\n\t“It’s unbelievable,” Brazilian head coach Sylvinho said Wednesday. “We’ve got everything around a moment. We did a great job. Everyone, together.”\n\n\tSylvinho brought in countryman Doriva and Argentinian Pablo Zabaleta as his assistants when he was hired in January.", "link": "https://www.arabnews.com/node/2413651/football", "date_published": "2023-11-23T02:11:03+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Ukraine welcomes Western allies’ air defense coalition", "description": "President Volodymyr Zelensky and his defense minister welcomed the formation by Ukraine’s Western allies on Thursday of a 20-nation “coalition” to boost air defenses, seen as a key element in the country’s campaign against Russian forces.\n\tZelensky said the group, one of several devoted to specific areas of Ukraine’s defense, was formed at a virtual meeting of the “Ramstein group” examining Ukraine’s military needs.", "link": "https://www.arabnews.com/node/2413636/world", "date_published": "2023-11-23T00:11:51+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Who’s Who: Princess Lolowa bint Nawaf, chair of Al-Mawaddah Association for Family Development", "description": "Princess Lolowa bint Nawaf has been the chair of Al-Mawaddah Association for Family Development since October 2020.\n\n\tThe organization is dedicated to education, training, guidance, reform, and family awareness through sustainable development initiatives.\n\n\tIn her role, Princess Lolowa has focused on enhancing the association’s public standing, securing funds, and overseeing the performance of directors, members, committees, and staff.", "link": "https://www.arabnews.com/node/2413646/saudi-arabia", "date_published": "2023-11-23T00:11:49+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.arabnews.com/rss.xml", "title": "Israeli officials say no Gaza pause, hostage releases before Friday", "description": "JERUSALEM: Israeli officials said there would be no pause in the Gaza fighting or any release of hostages held by Hamas before Friday, despite the two sides agreeing a truce.\n\n\tThe agreement was approved by the Israeli government early Wednesday and had been widely expected to take effect on Thursday.\n\n\tBut an Israeli official told AFP early Thursday there would be no halt in the fighting between Israel and Gaza’s Hamas rulers “before Friday.”", "link": "https://www.arabnews.com/node/2413641/middle-east", "date_published": "2023-11-23T00:11:21+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Middle East - ArabNews", "album": "Middle East - ArabNews", "user": null, "language": "en", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]