[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T21:29:30+00:00", "description": "<p>Last Updated on July 2, 2024 Welcome to issue #39 of Grimdark Magazine! Grimdark is a state of mind; it is a style of storytelling that finds a home in just about every genre. Knowing this, we dedicate one of our quarterly GdM issues to science fiction, yearly. As a heavy reader of science fiction, I look forward to this issue every year. I enjoy reading stories that bring you into the cold, endless dark of space or the rotten politics of futuristic societies. In this issue, we have a unique collection of stories that range in style and subject, promising to captivate even the most dedicated science fiction reader. So, kick back and let us take you into the vast black. Happy reading, my friends. Cover reveal Carlos Diaz has knocked it out of the park once again! The depth and eeriness he injects into his SF covers is amazing, as is the detail on those ships. This cover is based on Christian Cameron&#8217;s story Dead Reckoning Part II (you can find part 1 in Issue #34), an Arcana I", "id": 801855, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/grimdark-magazine-issue-39-out-now", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "Grimdark Magazine Issue #39 out now!", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T04:25:58+00:00", "description": "<p>In K.A. Linde’s The Wren in the Holly Library, a monster-packed New York City provides the backdrop for a heist and a romance with an overlay of Celtic mythology. Unfortunately for me, the action-packed plot and charismatic leads struggled to transcend the novel’s overstuffed, ungrounded worldbuilding. Abandoned on the streets of a New York City decimated by monsters, Kierse is a skilled thief with a reckless streak. A robbery gone awry draws the attention of handsome, broody warlock Graves. Intrigued by Kierse’s apparent ability to evade his magical home security system, Graves hires her to steal a powerful spear from the vampire king of the monster underworld at a Winter Solstice party. As the solstice approaches and Kierse and Graves grow closer, his true motivations and Kierse’s true heritage are brought to light, both of which are intimately bound up in the thread of Celtic mythology that runs throughout the book. Slow to start, The Wren in the Holly Library gathers speed as i", "id": 796362, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-the-wren-in-the-holly-library-by-k-a-linde", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: The Wren in the Holly Library by K.A. Linde", "user": null, "vote": 0}]