[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T19:30:00+00:00", "description": "When it launched for the 3DS in 2013, Luigi’s Mansion: Dark Moon saw its fair share of critical and commercial success, even if it never hit the heights of Luigi’s Mansion 3, and now, in the final months of the Nintendo Switch’s lifecycle, the action-adventure title is back with an HD remaster in the form of Luigi’s Mansion 2 HD. \n\nFrom bucketloads of charm and whimsy to ingenious design that never fails to delight and surprise, from enjoyable combat and exploration to varied enemy designs and satisfying collectible hunting, Luigi’s Mansion 2 is a delightful game that’s easy to explore to fans of the series. Its pricing may leave some a little miffed, especially given the lack of additional content or bonus goodies in this remaster, but for those who never played the original or returning fans who want to re-experience it, Luigi’s Mansion 2 HD is easy to recommend.", "id": 800842, "language": null, "link": "https://www.youtube.com/watch?v=ArAndsn4TrY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/ArAndsn4TrY/hqdefault.jpg", "title": "Luigi's Mansion 2 HD Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T15:30:08+00:00", "description": "FromSoftware has gone above and beyond in terms of stuffing Elden Ring: Shadow of the Erdtree full of content. There’s a bevy of bosses to be found, a massive world to explore that’s crawling with secrets, dungeons to dive into, and more. \n\nThe same, in fact, applies to the range of new weapons to be found throughout the expansion as well. From weapons with high-flying new skills to those with neat, unique mechanics, from those that are impossibly hard to get your hands on to others that are relatively easier to nab, there’s a host of weapons to find in the Elden Ring expansion that are actually worth seeking out. \n\nHere, we are going to talk about a few such weapons.", "id": 799473, "language": null, "link": "https://www.youtube.com/watch?v=ZzdoEnhn_5U", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/ZzdoEnhn_5U/hqdefault.jpg", "title": "15 MOST POWERFUL WEAPONS IN ELDEN RING SHADOW OF THE ERDTREE", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T09:45:01+00:00", "description": "It's hard to believe that we're already six months into 2024. The Summer showcases have wrapped, and the rest of the year seems all planned out, but what were some of the best games to have been released thus far?\n\nThough the output is less than last year, 2024 is still noteworthy. Role-playing fans have titles like Like a Dragon: Infinite Wealth, Final Fantasy 7 Rebirth and Elden Ring: Shadow of the Erdtree to dive into, each providing dozens of hours of fun. Action-adventure players can check out Senua's Saga: Hellblade 2 and Prince of Persia: The Lost Crown.\n\nEven the early access space is buzzing, with Hades 2 stepping up over its predecessor. Of course, you can't discount Helldivers 2 either, with its many ups and downs. Check out our picks for the top 15 best games for 2024's first half.", "id": 797278, "language": null, "link": "https://www.youtube.com/watch?v=_fcai9n1klw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/_fcai9n1klw/hqdefault.jpg", "title": "TOP 15 BEST Games of 2024 So Far", "user": null, "vote": 0}]