[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T21:15:00+00:00", "description": "Dave Rubin of “The Rubin Report” talks to Paul Saladino about why seed oils and ultra-processed foods may be the root cause of a lot of the modern diseases facing Americans.\n\nCheck out the NEW RUBIN REPORT MERCH here:\nhttps://daverubin.store/\n\n#DaveRubinReacts #RubinReport #PaulSaladino #canolaoil #seedoils #processedfoods  #nutrition #bestdiet  #animalbaseddiet #daverubin #Shorts\n\nLooking for inspiring individuals to give you helpful life strategies? Curious about increasing your self awareness to change to a more intentional living approach? Do you want to learn how the power of habit and a personal development plan can lead to dramatic self improvement? These speakers help put their audiences on a path to lifelong learning to improve both body and mind. To start learning check out this playlist:\nhttps://www.youtube.com/playlist?list=PLEbhOtC9klbC2YRtDs9vM2Vjx7f_G2eOh\n\nTo make sure you never miss a single Rubin Report video, click here to subscribe:\nhttps://www.youtube.com/channel/U", "id": 802195, "language": null, "link": "https://www.youtube.com/watch?v=FRJW7UCiSWw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "source_obj__id": 438, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/FRJW7UCiSWw/hqdefault.jpg", "title": "The #1 Source of Health Problems & Disease? | Paul Saladino", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T15:00:08+00:00", "description": "Dave Rubin of “The Rubin Report” talks to Paul Saladino about his journey into the medical field and advocacy for an animal-based diet; why seed oils may be the root cause of a lot of the modern diseases facing Americans; how he became disillusioned with traditional medicine's lack of focus on nutrition; the negative impact of ultra-processed foods on health; why the government continues to push dangerous dietary guidelines; why minimally processed foods are crucial for well-being and not all calories are equal; how processed foods can alter metabolism and increase hunger; the potential benefits of the carnivore diet for autoimmune conditions; why Jordan Peterson saw significant health improvements while following the diet; how any diet that minimizes or eliminates ultra-processed foods and focuses on unprocessed animal and plant foods can benefit individuals with autoimmune issues; why some foods that are typically considered healthy might trigger immune responses in certain people; ", "id": 799032, "language": null, "link": "https://www.youtube.com/watch?v=_8HeFvrMpJk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "source_obj__id": 438, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/_8HeFvrMpJk/hqdefault.jpg", "title": "Why Is the Government Ignoring the #1 Source of Health Problems? | Paul Saladino", "user": null, "vote": 0}]