[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T23:06:53.249416+00:00", "description": "Keith Gill, the investor known as \"Roaring Kitty\" online, is being used by GameStop investors for helping spur the meme stock mania of 2021. The plaintiffs said they lost money through his \"pump-and-dump\" scheme, which led to a \"short squeeze\" that caused losses for hedge funds betting stock prices would fall. Reuters reports: A proposed class action accusing Gill of securities fraud was filed on Friday in the Brooklyn, New York federal court. Investors led by Martin Radev, who lives in the Las Vegas area, said Gill manipulated GameStop securities between May 13 and June 13 by quietly accumulating large quantities of stock and call options, and then dumping some holdings after emerging from a three-year social media hiatus. They said Gill's activities caused GameStop's share price to gyrate wildly, generating \"millions of dollars\" in profit for him at their expense. \"Defendant still enjoys celebrity status and commands a following of millions through his social media accounts,\" the co", "id": 802153, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/01/2126206/roaring-kitty-is-sued-for-alleged-gamestop-manipulation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Roaring Kitty' Is Sued For Alleged GameStop Manipulation", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T23:06:51.100137+00:00", "description": "Microsoft revealed that the Russian hackers who breached its systems earlier this year stole more emails than initially reported. \"We are continuing notifications to customers who corresponded with Microsoft corporate email accounts that were exfiltrated by the Midnight Blizzard threat actor, and we are providing the customers the email correspondence that was accessed by this actor,\" a Microsoft spokesperson told Bloomberg (paywalled). \"This is increased detail for customers who have already been notified and also includes new notifications.\" The Register reports: We've been aware for some time that the digital Russian break-in at the Windows maker saw Kremlin spies make off with source code, executive emails, and sensitive U.S. government data. Reports last week revealed that the issue was even larger than initially believed and additional customers' data has been stolen. Along with Russia, Microsoft was also compromised by state actors from China not long ago, and that issue simila", "id": 802152, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/01/2138234/microsoft-tells-yet-more-customers-their-emails-have-been-stolen?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Tells Yet More Customers Their Emails Have Been Stolen", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T22:01:42.885895+00:00", "description": "An anonymous reader quotes an op-ed written by Kenneth Roth, former executive director of Human Rights Watch (1993-2022) and a visiting professor at Princeton's School of Public and International Affairs: Julian Assange's lengthy detention has finally ended, but the danger that his prosecution poses to the rights of journalists remains. As is widely known, the U.S. government's pursuit of Assange under the Espionage Act threatens to criminalize common journalistic practices. Sadly, Assange's guilty plea and release from custody have done nothing to ease that threat. That Assange was indicted under the Espionage Act, a U.S. law designed to punish spies and traitors, should not be considered the normal course of business. Barack Obama's justice department never charged Assange because it couldn't distinguish what he had done from ordinary journalism. The espionage charges were filed by the justice department of Donald Trump. Joe Biden could have reverted to the Obama position and withdr", "id": 801824, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/01/1953212/julian-assange-should-not-have-been-prosecuted-in-the-first-place?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Julian Assange Should Not Have Been Prosecuted In the First Place'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T20:56:42.123103+00:00", "description": "Chicken Soup for the Soul Entertainment, the parent of DVD rental operator Redbox, has filed for Chapter 11 bankruptcy protection after months of financial struggles and piling unpaid bills. The Associated Press reports: Chicken Soup for the Soul has accumulated nearly $1 billion in debt, the Chapter 11 filing submitted Friday in Delaware bankruptcy court shows, after reporting loss after loss over recent quarters. The filing also discloses that Chicken Soup for the Soul owes millions to over 500 creditors -- which range from big names in the entertainment world like Sony Pictures and Warner Bros, to major retailers like Walgreens and Walmart. As of March of this year, Friday's filing shows, Chicken Soup for the Soul had about $414 million in assets and $970 million in debts. Shares for the public company have fallen more than 90% over the last year. \"Redbox, founded in 2002, is best known for red-colored, self-serve machines that sit outside of pharmacies or groceries stores to rent ", "id": 801393, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/07/01/1924257/redbox-owner-chicken-soup-for-the-soul-files-for-chapter-11-bankruptcy-protection?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Redbox Owner Chicken Soup For the Soul Files For Chapter 11 Bankruptcy Protection", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T20:56:39.671732+00:00", "description": "According to Bloomberg's Mark Gurman, Apple plans to add its \"Apple Intelligence\" AI features to visionOS and update its approach to in-store demos of the headset. The Verge reports: The company is adding a new \"Go Deeper\" option to its in-store demos, Gurman writes. That reportedly includes testing office features and watching videos, as well as defaulting to the Dual Loop band that sends straps over the top and around the back of wearers' heads instead of the single-strap Solo Loop band, which some find uncomfortable. Apple will also reportedly let people view their own videos and photos, including panoramas, in the headset. Adding the sentimental touch to the demos could work out, especially once visionOS 2 comes out this fall, with its \"spatialize\" option to turn 2D photos into 3D ones -- a feature that's more impressive than it has the right to be (though still a little quirky with hair and glasses, like Apple's Portrait Mode feature).<p><div class=\"share_submission\">\n<a class=\"s", "id": 801392, "language": "en-us", "link": "https://apple.slashdot.org/story/24/07/01/1931216/the-vision-pro-will-get-apple-intelligence-go-deeper-in-store-demos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Vision Pro Will Get Apple Intelligence, 'Go Deeper' In-Store Demos", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T19:51:22.246171+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Meta continues to hit walls with its heavily scrutinized plan to comply with the European Union's strict online competition law, the Digital Markets Act (DMA), by offering Facebook and Instagram subscriptions as an alternative for privacy-inclined users who want to opt out of ad targeting. Today, the European Commission (EC) announced preliminary findings that Meta's so-called \"pay or consent\" or \"pay or OK\" model -- which gives users a choice to either pay for access to its platforms or give consent to collect user data to target ads -- is not compliant with the DMA. According to the EC, Meta's advertising model violates the DMA in two ways. First, it \"does not allow users to opt for a service that uses less of their personal data but is otherwise equivalent to the 'personalized ads-based service.\" And second, it \"does not allow users to exercise their right to freely consent to the combination of their personal data,\" the press ", "id": 800999, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/01/1917210/meta-defends-charging-fee-for-privacy-amid-showdown-with-eu?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Defends Charging Fee For Privacy Amid Showdown With EU", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T18:46:38.103856+00:00", "description": "An anonymous reader shares a report: Amazon built a $2 trillion company through years of aggressive spending on its retail and logistics businesses. Its future gains will likely be determined by the billions designated to fund its artificial-intelligence push. Amazon is planning to spend more than $100 billion over the next decade on data centers, an impressive level of investment even for a company known for its spending ways. The Seattle company is now devoting more investment money to its cloud computing and AI infrastructure than to its sprawling network of e-commerce warehouses. \n\nAmazon Web Services, the arm that manages Amazon's cloud business, has opened data centers for years, but executives said there is a surge in investment now to meet demand triggered by the excitement around AI. \"We have to dive in. We have to figure it out,\" said John Felton, who took over as AWS's chief financial officer this year after spending most of his career in Amazon's retail fulfillment operati", "id": 800686, "language": "en-us", "link": "https://slashdot.org/story/24/07/01/1813211/amazon-built-by-retail-invests-in-its-ai-future?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon, Built by Retail, Invests in Its AI Future", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T17:42:42.249950+00:00", "description": "A new study suggests at least 10% of scientific abstracts in 2024 were processed using large language models, researchers from the University of Tubingen and Northwestern University report. Analyzing 14 million PubMed abstracts from 2010-2024, the team identified an unprecedented surge in certain \"style words\" following LLMs' widespread adoption in late 2022. \n\nWords like \"delves\" and \"showcasing\" saw a 25-fold and 9-fold increase respectively in 2024 abstracts compared to pre-LLM trends. Common terms such as \"potential\" and \"findings\" also spiked in usage. The researchers drew parallels to studies measuring COVID-19's impact through excess deaths, applying a similar methodology to detect \"excess word usage\" in scientific writing.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=The+Telltale+Words+That+Could+Identify+Generative+AI+Text%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F01%2F1656208%2F%3Futm_source%3Dtwitter%26utm_medium%3Dt", "id": 800246, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/01/1656208/the-telltale-words-that-could-identify-generative-ai-text?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Telltale Words That Could Identify Generative AI Text", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T17:42:40.615862+00:00", "description": "Tennis is betting on video games to lure young fans. Two titles are set to compete: TopSpin 2K25, out now, and Tiebreak, coming in August. TopSpin lets players match legends like Federer against newcomers like Alcaraz. Tiebreak, backed by pro tours, features Djokovic on its cover. \n\nThe push comes as TV viewership among youth plummets. Only a third of 18-24 year-olds watch live matches, versus 75% of over-55s. Game makers claim playing increases the odds of buying tickets and hitting real courts. Football's EA Sports FC, with 150 million users, has shown gaming's pull. Tennis officials hope pixelated rallies will spark real-world passion.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Tennis+Expands+Gaming+Tie-ins+To+Win+Next+Generation+of+Fans%3A+https%3A%2F%2Fgames.slashdot.org%2Fstory%2F24%2F07%2F01%2F1736241%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\"", "id": 800245, "language": "en-us", "link": "https://games.slashdot.org/story/24/07/01/1736241/tennis-expands-gaming-tie-ins-to-win-next-generation-of-fans?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Tennis Expands Gaming Tie-ins To Win Next Generation of Fans", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T16:36:41.153869+00:00", "description": "An anonymous reader shares a report: When someone loses part of a leg, a prosthetic can make it easier to get around. But most prosthetics are static, cumbersome, and hard to move. A new neural interface connects a bionic limb to nerve endings in the thigh, allowing the limb to be controlled by the brain. The new device, which is described today in Nature Medicine, could help people with lower-leg amputations feel as if their prosthesis is part of them. \"When you ask a patient 'What is your body?' They don't include the prosthesis,\" says MIT biophysicist Hugh Herr, one of the lead authors on the study. The work is personal for him: he lost both his lower legs in a climbing accident when he was 17. He says linking the brain to the prosthesis can make it feel more like part of someone's anatomy, which can have a positive emotional impact. \n\nGetting the neural interface hooked up to a prosthetic takes two steps. First, patients undergo surgery. Following a lower leg amputation, portions ", "id": 799894, "language": "en-us", "link": "https://science.slashdot.org/story/24/07/01/167233/people-can-move-this-bionic-leg-just-by-thinking-about-it?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "People Can Move This Bionic Leg Just By Thinking About It", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T15:32:03.632936+00:00", "description": "The Supreme Court on Monday ordered lower courts to take another look at a pair of laws from Florida and Texas that imposed restrictions on how social media companies can moderate the content posted to their platforms. From a report: Justice Elena Kagan delivered the court's opinion, which tossed out lower court rulings and sent the two cases back for additional proceedings. The court said neither lower court conducted the proper analysis of the First Amendment challenges to the laws regulating major social media platforms. \n\n\"[T]he question in such a case is whether a law's unconstitutional applications are substantial compared to its constitutional ones. To make that judgment, a court must determine a law's full set of applications, evaluate which are constitutional and which are not, and compare the one to the other,\" Kagan wrote. \"Neither court performed that necessary inquiry.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Supreme+Court", "id": 799353, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/01/1447204/supreme-court-orders-new-look-at-social-media-laws-in-texas-and-florida?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Supreme Court Orders New Look At Social Media Laws in Texas and Florida", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T15:32:01.912125+00:00", "description": "French antitrust regulators are preparing to charge Nvidia for allegedly anti-competitive practices, Reuters reported Monday, citing sources. From the report: The French so-called statement of objections or charge sheet would follow dawn raids in the graphics cards sector in September last year which sources said targeted Nvidia. The world's largest maker of chips used both for artificial intelligence and for computer graphics has seen demand for its chips jump following the release of the generative AI application ChatGPT, triggering regulatory scrutiny on both sides of the Atlantic.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=French+Antitrust+Regulators+Preparing+Nvidia+Charges%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F07%2F01%2F1528252%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.or", "id": 799352, "language": "en-us", "link": "https://slashdot.org/story/24/07/01/1528252/french-antitrust-regulators-preparing-nvidia-charges?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "French Antitrust Regulators Preparing Nvidia Charges", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T14:27:26.544632+00:00", "description": "Apple's decision not to launch its own AI features in the EU is a \"stunning declaration\" of its anticompetitive behavior, European Commission Vice-President Margrethe Vestager said. From a report: About two weeks ago, Apple announced it will not launch its homegrown AI features in the EU, saying that interoperability required by the EU's Digital Markets Act (DMA) could hurt user privacy and security. A few days later, the Commission accused Apple's App Store of DMA breaches. Apple's move to roll back its AI plans in Europe is the most \"stunning, open declaration that they know 100% that this is another way of disabling competition where they have a stronghold already,\" Vestager, the Commission's vice president for a Europe fit for the digital age and Commissioner for Competition, told a Forum Europa event. \n\nThe \"short version of the DMA [Digital Markets Act]\" is that to operate in Europe, companies have to be open for competition, said Vestager. The DMA foresees fines of up to 10% of", "id": 798805, "language": "en-us", "link": "https://apple.slashdot.org/story/24/07/01/144256/eu-competition-commissioner-says-apples-decision-to-pull-ai-from-eu-shows-anticompetitive-behavior?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EU Competition Commissioner Says Apple's Decision To Pull AI From EU Shows Anticompetitive Behavior", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T11:46:34.858936+00:00", "description": "In 1994, college student Jim Hall created FreeDOS (in response to Microsoft's plan to gradually phase out MS-DOS). After celebrating its 30th anniversary last week, Hill wrote a new article Saturday for OpenSource.net: \"What I've learned about Open Source community over 30 years.\" \n\nLessons include \"every Open Source project needs a website,\" but also \"consider other ways to raise awareness about your Open Source software project.\" (\"In the FreeDOS Project, we've found that posting videos to our YouTube channel is an excellent way to help people learn about FreeDOS... The more information you can share about your Open Source project, the more people will find it familiar and want to try it out.\") \n\nBut the larger lesson is that \"Open Source projects must be grounded in community.\"\n\nWithout open doors for new ideas and ongoing development, even the most well-intentioned project becomes a stagnant echo chamber... \n\nMaintain open lines of communication... This can take many forms, includ", "id": 797943, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/01/047239/freedos-founder-jim-hall-after-30-years-what-ive-learned-about-open-source-community?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FreeDOS Founder Jim Hall: After 30 Years, What I've Learned About Open Source Community", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T08:30:30.275381+00:00", "description": "The Los Angeles Times reports that \"multiple projects seeking to remove carbon dioxide from the air have been launched across Los Angeles County:\nWhen completed, Project Monarch and its wastewater component, Pure Water Antelope Valley, will purify up to 4.5 million gallons of water each day and capture 25,000 tons of atmospheric CO2 each year. (The typical gasoline-powered automobile spews 4.6 tons of carbon each year, according to the Environmental Protection Agency).... But the Palmdale project isn't the only new carbon-capture development in L.A. County. On Friday, officials from CarbonCapture Inc. gathered in Long Beach to introduce the first commercial-scale U.S. direct air capture, or DAC, system designed for mass production. The unit, which resembles a shipping container, can remove more than 500 tons of atmospheric CO2 per year... The L.A.-based company also announced that it will mass-produce up to 4,000 of its DAC modules annually at a new facility in Mesa, Arizona. It joins", "id": 796942, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/01/0040252/many-carbon-capture-projects-are-now-launching?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Many Carbon Capture Projects Are Now Launching", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T04:10:16.978993+00:00", "description": "game of Asteroids\n\nAn anonymous reader shared this report from The Hill:\nAn asteroid the size of a football stadium threaded the needle between Earth and the moon Saturday morning &mdash; the second of two astronomical near misses in three days. Near miss, in this case, is a relative term: Saturday's asteroid, 2024 MK, came within 180,000 miles of Earth. On Thursday, meanwhile, asteroid 2011 UL21 flew within 4 million miles. \n\nBut the Saturday passage of 2024 MK &mdash; which scientists discovered only two weeks ago &mdash; coincides with a sobering reminder of threats from space. Sunday is Asteroid Day, the anniversary of the 1908 explosion of a rock from space above a Russian town &mdash; the sort of danger that, astronomers warn, is always lurking as the Earth hurtles through space... In 2013, for instance, an asteroid about 62 feet across that broke apart nearly 20 miles above Siberia released 30 times as much energy as the atomic bomb that hit Hiroshima. While most of the impact ", "id": 796141, "language": "en-us", "link": "https://science.slashdot.org/story/24/07/01/0327221/an-asteroid-just-passed-within-180000-miles-of-earth?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "An Asteroid Just Passed Within 180,000 Miles of Earth", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-01T02:00:11.682006+00:00", "description": "It's been adapted into a graphic novel, a videogame, a radio play, and an opera, according to Wikipedia &mdash; which also describes years of trying to adapt Neuromancer into a movie. \"The landmark 1984 cyberpunk novel has been on Hollywood's wishlist for decades,\" writes Gizmodo, \"with multiple filmmakers attempting to bring it to the big screen.\" (Back in 2010, Slashdot's CmdrTaco even posted an update with the headline \"Neuromancer Movie In Your Future?\" with a 2011 story promising the movie deal was \"moving forward....\") \n\nBut now Deadline reports it's becoming a 10-episode series on Apple TV+ (co-produced by Apple Studios) starring Callum Turner and Brianna Middleton:\nCreated for television by Graham Roland and JD Dillard, Neuromancer follows a damaged, top-rung super-hacker named Case (Turner) who is thrust into a web of digital espionage and high stakes crime with his partner Molly (Middleton), a razor-girl assassin with mirrored eyes, aiming to pull a heist on a corporate dyna", "id": 795822, "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/07/01/0127251/william-gibsons-neuromancer-to-become-a-series-on-apple-tv?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "William Gibson's 'Neuromancer' to Become a Series on Apple TV+", "user": null, "vote": 0}]