[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "NARUTO X BORUTO Ultimate Ninja STORM CONNECTIONS Review - The Final Verdict", "description": "Naruto X Boruto Ultimate Ninja Storm Connections presents itself as the ultimate way to experience the Naruto franchise, with a story mode that tries to encapsulate the entirety of the manga’s story and especially its most exciting fights, as well as an expansive roster that’s bound to make any long-time Naruto fan happy. The game also features a completely original story starring Naruto’s son, Boruto.\n\nUnfortunately, there isn’t really much in the way of gameplay depth in Naruto X Boruto Ultimate Ninja Storm Connections, and every fight, no matter how exciting, essentially boils down to button mashing while pretty lights pop up on the screen. On the other hand, the game isn’t really trying to be ultra-competitive, and with its excellent presentation of the story and versus mode options, is a great way to kill a few hours with fellow Naruto fans.", "link": "https://www.youtube.com/watch?v=ei8KwuCqfMU", "date_published": "2023-11-17T15:30:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/ei8KwuCqfMU/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "God of War Ragnarok's Rumored DLC - 5 BIG THINGS IT NEEDS", "description": "Not long after the game came out, the developer said that it was unlikely to get DLC, but if rumors are to be believed, we do have new content headed our way sooner rather than later. \n\nWhether it'll end up being DLC or a smaller, standalone sequel similar to Marvel's Spider-Man: Miles Morales is something that the jury is still out on, but there's enough smoke here either way to make us think that an announcement might not be too far away. And working on the assumption (or the hope) that that is going to happen, here, we're going to talk about five things we'd like to see in the DLC/half-sequel.", "link": "https://www.youtube.com/watch?v=wbyb0wX0QCI", "date_published": "2023-11-17T13:30:27+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/wbyb0wX0QCI/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Call of Duty's Time Is Up...IT'S TIME TO MOVE ON", "description": "It’s fair to say the release of Call of Duty: Modern Warfare III has been a disaster. A paltry single player campaign that became available a week early was just the beginning. Remixing the usual gunplay to something of a solo endeavor with open-ended ‘Open Combat Missions’ is the first misstep. \n\nThe story itself is a vapid, shallow attempt at shock value, and the result is an experience largely about nothing. Is it time Activision hit the brakes on Call of Duty? Modern Warfare III isn’t fit for purpose – perhaps it’d be best we all took a rest and played something else.", "link": "https://www.youtube.com/watch?v=WoiuVYrbUgk", "date_published": "2023-11-17T09:30:08+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/WoiuVYrbUgk/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]