[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T23:53:49.127499+00:00", "description": "A business columnist at the Los Angeles Times notes Sam Bankman-Fried's judge issued another ruling \"that may have a more far-reaching effect on the crypto business. \n\nU.S. Judge Failla \"cleared the Securities and Exchange Commission to proceed with its lawsuit alleging that the giant crypto broker and exchange Coinbase has been dealing in securities without a license.\"\n\nWhat's important about Failla's ruling is that she dismissed out of hand Coinbase's argument, which is that cryptocurrencies are novel assets that don't fall within the SEC's jurisdiction &mdash; in short, they're not \"securities.\" Crypto promoters have been making the same argument in court and the halls of Congress, where they're urging that the lawmakers craft an entirely new regulatory structure for crypto &mdash; preferably one less rigorous than the existing rules and regulations promulgated by the SEC and the Commodity Futures Trading Commission... \n\nFailla saw through that argument without breaking a sweat. \"T", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/14/2256204/americas-legal-system-may-be-closing-in-on-regulating-cryptocurrencies?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "America's Legal System May Be 'Closing In' on Regulating Cryptocurrencies", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T22:48:23.009026+00:00", "description": "Movie exhibitors still face \"serious risks,\" the Los Angeles Times reported Tuesday:\nAttendance was on the decline even before the pandemic shuttered theaters, thanks to changing consumer habits and competition for people's time and money from other entertainment options. The industry has demonstrated an over-reliance on Imax-friendly studio action tent poles, when theater chains need a deep and diverse roster of movies in order to thrive... It remains to be seen whether the global box office will ever get back to the $40 billion-plus days of 2019 and earlier years. A clearer picture will emerge in 2025 when the writers' and actors' strikes are further in the past. But overall, there's a strong case that moviegoing has proved to be relatively sturdy despite persistent difficulties. \nWhich brings us to this year's CinemaCon convention, where multiplex operators heard from Hollywood studios teasing upcoming blockbusters like Joker: Folie &agrave; Deux, Furiosa: A Mad Max Saga, Transform", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/04/14/221247/struggling-movie-exhibitors-beg-studios-for-more-movies---and-not-just-blockbusters?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Struggling Movie Exhibitors Beg Studios For More Movies - and Not Just Blockbusters", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T21:42:51.573971+00:00", "description": "The Associated Press reports:\n\nAs their rivalry intensifies, U.S. and Chinese military planners are gearing up for a new kind of warfare in which squadrons of air and sea drones equipped with artificial intelligence work together like swarms of bees to overwhelm an enemy. The planners envision a scenario in which hundreds, even thousands of the machines engage in coordinated battle. A single controller might oversee dozens of drones. Some would scout, others attack. Some would be able to pivot to new objectives in the middle of a mission based on prior programming rather than a direct order. \n\nThe world's only AI superpowers are engaged in an arms race for swarming drones that is reminiscent of the Cold War, except drone technology will be far more difficult to contain than nuclear weapons. Because software drives the drones' swarming abilities, it could be relatively easy and cheap for rogue nations and militants to acquire their own fleets of killer robots. The Pentagon is pushing u", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/14/2033200/will-the-us-china-competition-to-field-military-drone-swarms-spark-a-global-arms-race?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Will the US-China Competition to Field Military Drone Swarms Spark a Global Arms Race?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T20:38:29.675032+00:00", "description": "In the view of Jim VandeHei, CEO of Axios, artificial intelligence will eviscerate the weak, the ordinary, the unprepared in media,\" reports the New York Times:\n\nVandeHei says the only way for media companies to survive is to focus on delivering journalistic expertise, trusted content and in-person human connection. For Axios, that translates into more live events, a membership program centered on its star journalists and an expansion of its high-end subscription newsletters. \"We're in the middle of a very fundamental shift in how people relate to news and information,\" he said, \"as profound, if not more profound, than moving from print to digital.\" \"Fast forward five to 10 years from now and we're living in this AI-dominated virtual world &mdash; who are the couple of players in the media space offering smart, sane content who are thriving?\" he added. \"It damn well better be us.\" \n\nAxios is pouring investment into holding more events, both around the world and in the United States. V", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/14/1956259/axios-ceo-believes-ai-will-eviscerate-the-unprepared-among-media-companies?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Axios CEO Believes AI Will 'Eviscerate the Unprepared' Among Media Companies", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T19:35:01.894037+00:00", "description": "Intel, Nvidia, AMD, and Arm are among Canonical's \"silicon partners,\" a program that \"ensures maximum Ubuntu compatibility and long-term support with certified hardware,\" according to Web Pro News. \n\nAnd now Qualcomm is set to be Canonical's next silicon partner, \"giving Qualcomm access to optimized versions of Ubuntu for its processors.\"\n\n\nCompanies looking to use Ubuntu on Qualcomm chips will benefit from an OS that provides 10 years of support and security updates. \nThe collaboration is expected to be a boon for AI, edge computing, and IoT applications. \"The combination of Qualcomm Technologies' processors with the popularity of Ubuntu among AI and IoT developers is a game changer for the industry,\" commented Dev Singh, Vice President, Business Development and Head of Building, Enterprise &amp; Industrial Automation, Qualcomm Technologies, Inc...\n \n\"Optimised Ubuntu and Ubuntu Core images will be available for Qualcomm SoCs,\" according to the announcement, \"enabling enterprises to ", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/14/1652246/canonical-says-qualcomm-has-joined-ubuntus-silicon-partner-program?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Canonical Says Qualcomm Has Joined Ubuntu's 'Silicon Partner' Program", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T18:29:59.922379+00:00", "description": "America's FCC votes on net neutrality April 25th. And the director of Stanford Law School's \"Center for Internet and Society\" (also a law professor) says mostly there's \"much to celebrate\" in the draft rules released earlier this month.\n\nMobile carriers like T-Mobile, AT&amp;T and Verizon that have been degrading video quality for mobile users will have to stop. The FCC kept in place state neutrality protections like California's net neutrality law, allowing for layers of enforcement. The FCC also made it harder for ISPs to evade net neutrality at the point where data enters their networks. \n\nHowever, the draft rules also have \"a huge problem.\"\n\nThe proposed rules make it possible for mobile ISPs to start picking applications and putting them in a fast lane &mdash; where they'll perform better generally and much better if the network gets congested. \n\nT-Mobile, AT&amp;T and Verizon are all testing ways to create these 5G fast lanes for apps such as video conferencing, games, and video", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/14/1629230/stop-harmful-5g-fast-lanes-legal-scholar-warns-americas-fcc?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Stop 'Harmful 5G Fast Lanes', Legal Scholar Warns America's FCC", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T17:24:46.085877+00:00", "description": "The PHP programming language has sunk to its lowest position ever on the long-running TIOBE index of programming language popularity. It now ranks #17 &mdash; lower than Assembly Language, Ruby, Swift, Scratch, and MATLAB. InfoWorld reports:\n\n\nWhen the Tiobe index started in 2001, PHP was about to become the standard language for building websites, said Paul Jansen, CEO of software quality services vendor Tiobe. PHP even reached the top 3 spot in the index, ranking third several times between 2006 and 2010. But as competing web development frameworks such as Ruby on Rails, Django, and React arrived in other languages, PHP's popularity waned. \n\n\"The major driving languages behind these new frameworks were Ruby, Python, and most notably JavaScript,\" Jansen noted in his statement accompanying the index. \"On top of this competition, some security issues were found in PHP. As a result, PHP had to reinvent itself.\" Nowadays, PHP still has a strong presence in small and medium websites and i", "language": "en-us", "link": "https://developers.slashdot.org/story/24/04/14/1413227/is-php-declining-in-popularity?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Is PHP Declining In Popularity?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T16:21:01.635630+00:00", "description": "Ubuntu 24.10 [expected this October] and Debian GNU/Linux 13 \"Trixie\" [expected June-July 2025] \"will feature a refined APT command-line interface,\" reports 9to5Linux:\n\n\nAPT developer and Canonical engineer Julian Andres Klode took to LinkedIn to present the revamped APT interface powered by the upcoming APT 3.0 package manager that looks to give users a more concise and well-laid-out command-line output when updating, installing, or removing packages via the terminal emulator. \n\nThe new APT 3.0 UI brings a columnar display that will make it easier for users to quickly scan for a package name, support for colors (red for removals and green for other changes), which makes it easier to quickly distinguish commands at a glance, and smoother install progress bars using Unicode blocks. \n\nIn addition, the new APT 3.0 command-line interface will be less verbose and offer more padding to make it easier to separate sections and extract the relevant information for you. \n\"Bleeding-edge users an", "language": "en-us", "link": "https://linux.slashdot.org/story/24/04/14/052258/apt-interface-revamped-for-ubuntu-2410-and-debian-trixie-with-colors-and-columns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "APT Interface 'Revamped' For Ubuntu 24.10 and Debian Trixie with Colors and Columns", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T15:14:39.631059+00:00", "description": "Engadget warns Windows 11 users that Microsoft is \"exploring the idea\" of putting ads in their Start menu. Sort of...\n\nTo be specific, it's looking to place advertisements for apps you can find in the Microsoft Store in the menu's recommended section.... \n\nAt the moment, Microsoft will only show ads in this version if you're in the US and a Windows Insider in the Beta Channel. You won't be seeing them if you're not a beta tester or if you're using a device managed by an organization. Further, you can disable the advertisements altogether. To do so, just go to Personalization under Settings and then toggle off \"Show recommendations for tips, app promotions, and more\" in the Start section. \n\nLike any other Microsoft experiment, it may never reach wider rollout, but you may want to remember the aforementioned steps, since the company does have history of incorporating ads into its desktop platforms.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status", "language": "en-us", "link": "https://slashdot.org/story/24/04/13/2016225/windows-11s-beta-testers-may-start-seeing-ads-for-microsoft-store-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Windows 11's Beta Testers May Start Seeing Ads for Microsoft Store Apps", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T11:59:36.187884+00:00", "description": "\"Federal regulators are investigating a whistleblower's claims about flaws in the assembly of Boeing's 787 Dreamliner,\" NPR reported this week:\n\nLongtime Boeing engineer Sam Salehpour went public Tuesday with claims that he observed problems with how parts of the plane's fuselage were fastened together. Salehpour warns that production \"shortcuts\" could significantly shorten the lifespan of the plane, eventually causing the fuselage to fall apart in mid-flight. \"It can cause a catastrophic failure,\" Salehpour said Tuesday during a press briefing to discuss his claims. \n\nA spokesman for the FAA confirmed that the agency is investigating those allegations, which were first reported by the New York Times, but declined to comment further on them. Boeing immediately pushed back. \"These claims about the structural integrity of the 787 are inaccurate and do not represent the comprehensive work Boeing has done to ensure the quality and long-term safety of the aircraft,\" Boeing spokeswoman Jess", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/14/0012214/two-boeing-whistleblowers-allege-disregarded-worker-concerns-pressure-for-speed?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Two Boeing Whistleblowers Allege Disregarded Worker Concerns, Pressure For Speed", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T08:44:20.418945+00:00", "description": "An anonymous reader shared this report from ScienceAlert:\n\n\nThe Fermi Paradox is the discrepancy between the apparent high likelihood of advanced civilizations existing and the total lack of evidence that they do exist. Many solutions have been proposed for why the discrepancy exists. One of the ideas is the 'Great Filter.' The Great Filter is a hypothesized event or situation that prevents intelligent life from becoming interplanetary and interstellar and even leads to its demise.... \n\n[H]ow about the rapid development of AI? \nA new paper in Acta Astronautica explores the idea that Artificial Intelligence becomes Artificial Super Intelligence (ASI) and that ASI is the Great Filter. The paper's title is \"Is Artificial Intelligence the Great Filter that makes advanced technical civilizations rare in the universe?\" \n\"Upon reaching a technological singularity, ASI systems will quickly surpass biological intelligence and evolve at a pace that completely outstrips traditional oversight mec", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/14/0446244/ai-could-explain-why-were-not-meeting-any-aliens-wild-study-proposes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Could Explain Why We're Not Meeting Any Aliens, Wild Study Proposes", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T06:34:03.476384+00:00", "description": "Popular Science reports that early last week, researchers at the U.S. Energy Department's Princeton Plasma Physics Laboratory revealed their new \"MUSE\" stellarator &mdash; \"a unique fusion reactor that uses off-the-shelf and 3D-printed materials to contain its superheated plasma.\" \n\nThe researchers' announcement says the technique suggests \"a simple way to build future devices for less cost and allow researchers to test new concepts for future fusion power plants.\"\n\n\nStellarators typically rely on complicated electromagnets that have complex shapes and create their magnetic fields through the flow of electricity. Those electromagnets must be built precisely with very little room for error, increasing their cost. However, permanent magnets, like the magnets that hold art to refrigerator doors, do not need electric currents to create their fields. They can also be ordered off the shelf from industrial suppliers and then embedded in a 3D-printed shell around the device's vacuum vessel, w", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/14/0332230/fusion-experiment-demonstrates-cheaper-stellerator-using-creative-magnet-workaround?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Fusion Experiment Demonstrates Cheaper Stellerator Using Creative Magnet Workaround", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-14T03:19:32.655072+00:00", "description": "\"An improved charging protocol might help lithium-ion batteries to last much longer,\" writes Science Daily:\n\nThe best commercial lithium-ion batteries...have a service life of up to eight years. Batteries are usually charged with a constant current flow. But is this really the most favorable method? A new study by Prof. Philipp Adelhelm's group at HZB and Humboldt-University Berlin answers this question clearly with \"no.\" [In collaboration with teams including the Technical University of Berlin.] \n\nPart of the battery tests were carried out at Aalborg University. The batteries were either charged conventionally with constant current (CC) or with a new charging protocol with pulsed current (PC). Post-mortem analyses revealed clear differences after several charging cycles: In the CC samples, the solid electrolyte interface (SEI) at the anode was significantly thicker, which impaired the capacity... PC-charging led to a thinner SEI interface and fewer structural changes in the electrode", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/14/020205/could-a-new-charge-double-the-service-life-of-li-ion-batteries?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Could a New Charge Double the Service-life of Li-Ion Batteries?", "user": null, "vote": 0}]