[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-24T17:30:05+00:00",
        "description": "When you think about some of the most challenging genres to develop for, role-playing games are probably near the top. A developer must deliver a compelling story set in a memorable world with extensive lore but also provide top-tier combat, dialogue systems, endearing characters, unique locations, skills, upgrades, and much more.\n\nOf course, not every role-playing game is the same. Some may embrace a more open-world action RPG format and extensive production values for its cutscenes. Others may take a more old-school CRPG approach while offering a range of reactive choices and character customization. Then you have the titles which flip the script entirely and push the limits of role-playing while forgoing more traditional combat mechanics.\n\nThere are tons of great role-playing games as a result. Today, we picked out 15 of the very best of all time worth playing. Check them out below.",
        "id": 1774874,
        "language": null,
        "link": "https://www.youtube.com/watch?v=k0J6nkpvAu8",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/k0J6nkpvAu8/hqdefault.jpg",
        "title": "15 Greatest RPGs You Need To Play ATLEAST ONCE [2024 Edition]",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-24T13:30:20+00:00",
        "description": "Failing to live up to promise, having technical shortcomings, being too boring – there are a multitude of reasons why a game ultimately underdelivers. Whilst we spend an awful lot of time waxing lyrical on games which are great, there are, sadly, numerous games released every year which are awful.\n\nThis feature will focus on single player games which will go down as the worst this year has to offer, but worth pointing out too that whilst some of these games have multiplayer elements, it’s their single player content that has been considered for this rundown. Whether they have fans or not, it’s our subjective that these games are the worst single players of 2024.",
        "id": 1773570,
        "language": null,
        "link": "https://www.youtube.com/watch?v=QmcN-zM67Q4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/QmcN-zM67Q4/hqdefault.jpg",
        "title": "15 WORST Single Player Games of 2024",
        "vote": 0
    }
]