[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-24T14:00:00+00:00",
        "description": "<p dir=\"ltr\">Most mornings, I stumble out of bed, grab my phone, and crack open some Pokemon packs. Over the last month, I've been consumed by the routine of booting up Pokemon TCG Pocket, a mobile adaptation of the popular card game, and--much like the video games and show encourage--catching 'em all. I've blown through dozens of booster packs by now chasing the thrill of filling my digital library with rare holographic and full-art cards. I know for a fact I'm not alone in this craze, either. Group chats of mine are filled with friends sharing the rewards of their booster packs, and my social media feeds often consist of a handful of screenshots of someone's haul. That's not all that I've seen.</p><p dir=\"ltr\">Everywhere I looked this year, some kind of card game was killing it and dominating conversations and minds. Balatro grabbed a hold of gamers early into the year and never particularly let go. My favorite part of Final Fantasy VII Rebirth wasn't taking Tifa on a date or watch",
        "id": 1775797,
        "language": "en-US",
        "link": "https://www.gamespot.com/articles/in-2024-we-went-all-in-on-card-games/1100-6528593/?ftag=CAD-01-10abi2f",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 126,
        "source_url": "https://www.gamespot.com/feeds/mashup",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/1585/15855271/4418884-best-balatro.jpg",
        "title": "In 2024, We Went All-In On Card Games",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-24T08:00:00+00:00",
        "description": "<p><img src=\"https://www.gamespot.com/a/uploads/scale_large/1752/17528202/4413752-witnessintro.jpg\" /><br /><em>2024 saw players battling everything from smoky-headed world-enders to really, really big snakes.</em><br /><h3><p dir=\"ltr\">2024 has seen the release of several classic game remakes, along with some incredible DLC expansions, long-awaited sequels, and engaging new IP. While quality storytelling and beautiful graphics certainly play a part in a game's reception, the base upon which many of the best games are built is fun, engaging gameplay. Boss battles are an integral part of this formula, and 2024 saw players fighting some seriously good big bads.</p><p dir=\"ltr\">From iconic characters like Masamune's terrifying owner to a comically cartoonish cobra from PlayStation's recent bot-based nostalgia trip, here are the best boss fights of 2024. For more, check out our picks for the <a href=\"https://www.gamespot.com/gallery/gamespots-10-best-games-of-2024/2900-6045/\">10 best gam",
        "id": 1774379,
        "language": "en-US",
        "link": "https://www.gamespot.com/gallery/the-best-boss-fights-of-2024/2900-6066",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 126,
        "source_url": "https://www.gamespot.com/feeds/mashup",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://www.gamespot.com/a/uploads/screen_medium/123/1239113/4418258-bestofthumb2%281%29.jpg",
        "title": "The Best Boss Fights Of 2024",
        "vote": 0
    }
]