[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T22:59:51.749988+00:00", "description": "An anonymous reader quotes a report from The Hill: In the wake of the COVID-19 pandemic, the dynamics of the workplace have undergone a seismic shift. While some heralded the return to the office as a sign of normalcy, evidence suggests that for many, this transition has been far from smooth sailing. Nowhere is this struggle more evident than in the case of the U.S. federal government employees, particularly those within the Department of Justice. At the beginning of the year, the Justice Department initiated a return-to-office policy requiring much of its workforce to be present in person for up to six days per pay period or about three days per week. However, there were more stringent requirements for assistant U.S. attorneys. While approximately 70 percent of AUSAs currently enjoy the flexibility of two days per week of telework, recent changes in telework policies within certain offices have left many feeling stranded.\n \nA survey by the National Association of Assistant U.S. Attor", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/20/2046233/return-to-office-mandate-is-backfiring-on-a-key-federal-agency?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Return-To-Office Mandate Is Backfiring On a Key Federal Agency", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T22:59:49.798894+00:00", "description": "HP announced today that it will resurrect the \"Omni\" branding it first coined for its business-oriented laptops introduced in 1993. The vintage branding will now be used for the company's new consumer-facing laptops, with HP retiring the Spectre and Dragonfly brands in the process. Furthermore, computers under consumer PC series names like Pavilion will also no longer be released. \"Instead, every consumer computer from HP will be called either an OmniBook for laptops, an OmniDesk for desktops, or an OmniStudio for AIOs,\" reports Ars Technica. From the report: The computers will also have a modifier, ranging from 3 up to 5, 7, X, or Ultra to denote computers that are entry-level all the way up to advanced. For instance, an HP OmniBook Ultra would represent HP's highest-grade consumer laptop. \"For example, an HP OmniBook 3 will appeal to customers who prioritize entertainment and personal use, while the OmniBook X will be designed for those with higher creative and technical demands,\" S", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/20/2059220/hp-resurrects-90s-omnibook-branding-kills-spectre-and-dragonfly?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "HP Resurrects '90s OmniBook Branding, Kills Spectre and Dragonfly", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T21:55:07.776901+00:00", "description": "With JPMorgan and Mastercard piloting biometric payment options, a future where consumers can pay with their face is rapidly approaching. \"Our focus on biometrics as a secure way to verify identity, replacing the password with the person, is at the heart of our efforts in this area,\" said Dennis Gamiello, executive vice president of identity products and innovation at Mastercard. Based on the positive feedback received thus far, Gamiello says the biometric checkout technology will roll out to more new markets later this year. CNBC reports: Biometric payment options are becoming more common. Amazon introduced pay-by-palm technology in 2020, and while its cashier-less store experiment has faltered, it installed the tech in 500 of its Whole Foods stores last year. Mastercard, which is working with PopID, launched a pilot for face-based payments in Brazil back in 2022, and it was deemed a success -- 76% of pilot participants said they would recommend the technology to a friend. Late last ", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/20/2028241/jpmorgan-mastercard-embrace-biometric-payment-options?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "JPMorgan, Mastercard Embrace Biometric Payment Options", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T21:55:06.249255+00:00", "description": "Microsoft Paint is getting a new image generator tool called Cocreator that can generate images based on text prompts and doodles. Engadget reports: During a demo at its Surface event, the company showed off how Cocreator combines your own drawings with text prompts to create an image. There's also a \"creativity slider\" that allows you to control how much you want AI to take over compared with your original art. As Microsoft pointed out, the combination of text prompts and your own brush strokes enables faster edits. It could also help provide a more precise rendering than what you'd be able to achieve with DALL-E or another text-to-image generator alone.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Paint+Is+Getting+an+AI-Powered+Image+Generator%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F05%2F20%2F2036239%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a clas", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/20/2036239/microsoft-paint-is-getting-an-ai-powered-image-generator?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Paint Is Getting an AI-Powered Image Generator", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T20:49:22.905997+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Microsoft is going all-in on Arm-powered Windows PCs today with the introduction of a Snapdragon X Elite-powered Surface Pro convertible and Surface Laptop, and there are inevitable comparisons to draw with another big company that recently shifted from Intel's processors to Arm-based designs: Apple. A huge part of the Apple Silicon transition's success was Rosetta 2, a translation layer that makes it relatively seamless to run most Intel Mac apps on an Apple Silicon Mac with no extra effort required from the user or the app's developer. Windows 11 has similar translation capabilities, and with the Windows 11 24H2 update, that app translation technology is getting a name: Prism.\n \nMicrosoft says that Prism isn't just a new name for the same old translation technology. Translated apps should run between 10 and 20 percent faster on the same Arm hardware after installing the Windows 11 24H2 update, offering some trickle-down benefits", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/20/2011258/prism-translation-layer-does-for-arm-pcs-what-rosetta-did-for-macs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Prism' Translation Layer Does For Arm PCs What Rosetta Did For Macs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T19:44:27.556228+00:00", "description": "Microsoft today launched its new Surface Laptop, featuring Qualcomm's Snapdragon X Elite or Plus chips, aiming to compete with Apple's powerful and efficient MacBook laptops. The Surface Laptop, available for preorder starting at $999.99, boasts up to 22 hours of battery life, a haptic touchpad, and support for three external 4K monitors. Microsoft claims the device is 80% faster than its predecessor and comes with AI features powered by its Copilot technology.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Launches+Arm-Powered+Surface+Laptop%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F05%2F20%2F1916203%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F05%2F20%2F1916203%2Fmicrosoft-launches-arm-powered-surface-laptop%3Futm_source%3Dslashdot%26utm_me", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/05/20/1916203/microsoft-launches-arm-powered-surface-laptop?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Launches Arm-Powered Surface Laptop", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T18:42:15.430306+00:00", "description": "Microplastics have been found in human testicles, with researchers saying the discovery might be linked to declining sperm counts in men. From a report: The scientists tested 23 human testes, as well as 47 testes from pet dogs. They found microplastic pollution in every sample. The human testicles had been preserved and so their sperm count could not be measured. However, the sperm count in the dogs' testes could be assessed and was lower in samples with higher contamination with PVC. The study demonstrates a correlation but further research is needed to prove microplastics cause sperm counts to fall. \n\nSperm counts in men have been falling for decades, with chemical pollution such as pesticides implicated by many studies. Microplastics have also recently been discovered in human blood, placentas and breast milk, indicating widespread contamination of people's bodies. The impact on health is as yet unknown but microplastics have been shown to cause damage to human cells in the laborat", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/20/1639201/microplastics-found-in-every-human-testicle-in-study?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microplastics Found in Every Human Testicle in Study", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T18:42:13.793828+00:00", "description": "An anonymous reader shares a report: Hims &amp; Hers Health, one of the online pharmacies that got its start prescribing dick pills, is now offering knockoff versions of GLP-1 weight loss drugs. Hims &amp; Hers says it will offer drugs that mimic Ozempic and Wegovy, the active ingredient of which is semaglutide. The copycat versions are made by compounding pharmacies. The formulations aren't the same as the FDA-approved versions of the drug and haven't been directly evaluated by the FDA, either. But they're cheaper than the real thing: $199 a month, compared to the branded version, which can cost more than $1,000 a month without insurance. \n\nCompounding pharmacies can make knockoff versions of branded drugs when they are in shortage, as the GLP-1 drugs -- prescribed for diabetes and weight loss -- currently are. The FDA has already received reports of adverse events for compounded versions of semaglutide. Hims &amp; Hers says it \"conducted extensive research for over a year\" into find", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/20/1728215/another-online-pharmacy-bypasses-the-fda-to-offer-cut-rate-weight-loss-drugs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Another Online Pharmacy Bypasses the FDA To Offer Cut-Rate Weight Loss Drugs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T18:42:12.180341+00:00", "description": "Microsoft today unveiled Recall, a new AI-powered feature for Windows 11 PCs, at its Build 2024 conference. Recall aims to improve local searches by making them as efficient as web searches, allowing users to quickly retrieve anything they've seen on their PC. Using voice commands and contextual clues, Recall can find specific emails, documents, chat threads, and even PowerPoint slides. \n\nThe feature uses semantic associations to make connections, as demonstrated by Microsoft Product Manager Caroline Hernandez, who searched for a blue dress and refined the query with specific details. Microsoft said that Recall's processing is done locally, ensuring data privacy and security. The feature utilizes over 40 local multi-modal small language models to recognize text, images, and video.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=With+Recall%2C+Microsoft+is+Using+AI+To+Fix+Windows'+Eternally+Broken+Search%3A+https%3A%2F%2Ftech.slashdot.org%2Fsto", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/20/180204/with-recall-microsoft-is-using-ai-to-fix-windows-eternally-broken-search?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "With Recall, Microsoft is Using AI To Fix Windows' Eternally Broken Search", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T18:42:10.567437+00:00", "description": "An anonymous reader shares a report: Google is pouncing on Microsoft's weathered enterprise security reputation by pitching its services to government institutions. Pointing to a recent report from the US Cyber Safety Review Board (CSRB) that found that Microsoft's security woes are the result of the company \"deprioritizing\" enterprise security, Google says it can help. The company's pitch isn't quite as direct as Microsoft CEO Satya Nadella saying he made Google dance, but it's spicy all the same. Repeatedly referring to Microsoft as \"the vendor\" throughout its blog post on Monday, Google says the CSRB \"showed that lack of a strong commitment to security creates preventable errors and serious breaches.\" Platforms, it added, \"have a responsibility\" to hold to strong security practices. And of course, who is more responsible than Google?<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Thinks+the+Public+Sector+Can+Do+Better+Than+Microsoft", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/20/1838221/google-thinks-the-public-sector-can-do-better-than-microsofts-security-failures?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Thinks the Public Sector Can Do Better Than Microsoft's 'Security Failures'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T16:39:04.696811+00:00", "description": "An Australian computer scientist who claimed he invented bitcoin lied \"extensively and repeatedly\" and forged documents \"on a grand scale\" to support his false claim, a judge at London's High Court ruled on Monday. From a report: [...] Judge James Mellor ruled in March that the evidence Craig Wright was not Satoshi was \"overwhelming\", after a trial in a case brought by the Crypto Open Patent Alliance (COPA) to stop Wright suing bitcoin developers. Mellor gave reasons for his conclusions on Monday, stating in a written ruling: \"Dr Wright presents himself as an extremely clever person. However, in my judgment, he is not nearly as clever as he thinks he is.\" The judge added: \"All his lies and forged documents were in support of his biggest lie: his claim to be Satoshi Nakamoto.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Self-Proclaimed+Bitcoin+Inventor+Lied+'Repeatedly'+To+Support+Claim%2C+Says+UK+Judge%3A+https%3A%2F%2Fslashdot.org%2Fstory", "language": "en-us", "link": "https://slashdot.org/story/24/05/20/161242/self-proclaimed-bitcoin-inventor-lied-repeatedly-to-support-claim-says-uk-judge?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Self-Proclaimed Bitcoin Inventor Lied 'Repeatedly' To Support Claim, Says UK Judge", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T15:34:04.574361+00:00", "description": "A new Pew Research Center analysis shows just how fleeting online content actually is: 1. A quarter of all webpages that existed at one point between 2013 and 2023 are no longer accessible, as of October 2023. In most cases, this is because an individual page was deleted or removed on an otherwise functional website.\n2. For older content, this trend is even starker. Some 38% of webpages that existed in 2013 are not available today, compared with 8% of pages that existed in 2023. \n\nThis \"digital decay\" occurs in many different online spaces. We examined the links that appear on government and news websites, as well as in the \"References\" section of Wikipedia pages as of spring 2023. This analysis found that:\n1. 23% of news webpages contain at least one broken link, as do 21% of webpages from government sites. News sites with a high level of site traffic and those with less are about equally likely to contain broken links. Local-level government webpages (those belonging to city governm", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/20/1412222/38-of-webpages-that-existed-in-2013-are-no-longer-accessible-a-decade-later?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "38% of Webpages That Existed in 2013 Are No Longer Accessible a Decade Later", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T15:34:03.058790+00:00", "description": "OpenAI is pausing the use of the popular Sky voice in ChatGPT over concerns it sounds too much like the \"Her\" actress Scarlett Johansson. From a report: The company says the voices in ChatGPT were from paid voice actors. A final five were selected from an initial pool of 400 and it's purely a coincidence the unnamed actress behind the Sky voice has a similar tone to Johansson. Voice is about to become more prominent for OpenAI as it begins to roll out a new GPT-4o model into ChatGPT. With it will come an entirely new conversational interface where users can talk in real-time to a natural-sounding and emotion-mimicking AI. \n\nWhile the Sky voice and a version of ChatGPT Voice have been around for some time, the comparison to Johansson became more obvious due to OpenAI CEO Sam Altman, and many others, drawing the similarity between the new AI model and the movie \"Her\". In \"Her,\" Scarlett Johansson voices an advanced AI operating system named Samantha, who develops a romantic relationship", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/20/1526247/openai-says-sky-voice-in-chatgpt-will-be-paused-after-concerns-it-sounds-too-much-like-scarlett-johansson?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI Says Sky Voice in ChatGPT Will Be Paused After Concerns It Sounds Too Much Like Scarlett Johansson", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T12:18:58.270087+00:00", "description": "An anonymous reader shared this report from the Washington Post:\n\n\nAs cities and states push to restrict the use of facial recognition technologies, some police departments have quietly found a way to keep using the controversial tools: asking for help from other law enforcement agencies that still have access. Officers in Austin and San Francisco &mdash; two of the largest cities where police are banned from using the technology &mdash; have repeatedly asked police in neighboring towns to run photos of criminal suspects through their facial recognition programs, according to a Washington Post review of police documents... \n\nAustin police officers received the results of at least 13 face searches from a neighboring police department since the city's 2020 ban &mdash; and appeared to get hits on some of them, according to documents obtained by The Post through public records requests and sources who shared them on the condition of anonymity. \"That's him! Thank you very much,\" one Austin", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/20/0251226/police-found-ways-to-use-facial-recognition-tech-after-their-cities-banned-it?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Police Found Ways to Use Facial Recognition Tech After Their Cities Banned It", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T12:18:55.940171+00:00", "description": "Julian Assange has won a victory in his ongoing battle against extradition from the UK after judges at the high court in London granted him leave to appeal. From a report: Two judges deferred a decision in March on whether Assange, who is trying to avoid being prosecuted in the US on espionage charges relating to the publication of thousands of classified and diplomatic documents, could take his case to another appeal hearing. Assange had been granted permission to appeal only if the Biden administration was unable to provide the court with suitable assurances \"that the applicant [Assange] is permitted to rely on the first amendment, that the applicant is not prejudiced at trial, including sentence, by reason of his nationality, that he is afforded the same first amendment [free speech] protections as a United States citizen, and that the death penalty is not imposed.\" \n\nLegal argument on Monday focused on the issue of whether Assange would be allowed first amendment protections. Assa", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/20/1159238/julian-assange-wins-high-court-victory-in-case-against-extradition-to-us?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Julian Assange Wins High Court Victory in Case Against Extradition To US", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T07:58:47.982337+00:00", "description": "\"Last week, we reported on a customer who was charged $277 for gasoline his rented Tesla couldn't have possibly used,\" writes the automotive blog The Drive. \n\n\"And now, we've heard from other Hertz customers who say they've been charged even more.\"\n\nHertz caught attention last week for how it handled a customer whom it had charged a \"Skip the Pump\" fee, which allows renters to pay a premium for Hertz to refill the tank for them. But of course, this customer's rented Tesla Model 3 didn't use gas &mdash; it draws power from a battery &mdash; and Hertz has a separate, flat fee for EV recharges. Nevertheless, the customer was charged $277.39 despite returning the car with the exact same charge they left with, and Hertz refused to refund it until after our story ran. It's no isolated incident either, as other customers have written in to inform us that it happened to them, too.... \n\nEvan Froehlich returned the rental at 21 percent charge, expecting to pay a flat $25 recharge fee. (It's ord", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/20/022247/some-people-who-rented-a-tesla-from-hertz-were-still-charged-for-gas?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Some People Who Rented a Tesla from Hertz Were Still Charged for Gas", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T03:38:39.498655+00:00", "description": "\"$5,000 in cash had been withdrawn from my checking account &mdash; but not by me,\" writes journalist Linda Matchan in the Boston Globe. A police station manager reviewed footage from the bank &mdash; which was 200 miles away &mdash; and deduced that \"someone had actually come into the bank and spoken to a teller, presented a driver's license, and then correctly answered some authentication questions to validate the account...\"\n\"You're pitting a teller against a national crime syndicate with massive resources behind them,\" says Paul Benda, executive vice president for risk, fraud, and cybersecurity at the American Bankers Association. \"They're very well-funded, well-resourced criminal gangs doing this at an industrial scale.\" \nThe reporter writes that \"For the past two years, I've worked to determine exactly who and what lay behind this crime...\"\n[N]ow I had something new to worry about: Fraudsters apparently had a driver's license with my name on it... \"Forget the fake IDs adolescent", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/20/0014249/what-happened-after-a-reporter-tracked-down-the-identity-thief-who-stole-5000?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "What Happened After a Reporter Tracked Down The Identity Thief Who Stole $5,000", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T02:33:39.331268+00:00", "description": "An anonymous reader shared this report from the blog OMG Ubuntu:\n\n\nUbuntu first switched to using Wayland as its default display server in 2017 before reverting the following year. It tried again in 2021 and has stuck with it since. But while Wayland is what most of us now log into after installing Ubuntu, anyone doing so on a PC or laptop with an NVIDIA graphics card present instead logs into an Xorg/X11 session. \n\nThis is because NVIDIA's proprietary graphics drivers (which many, especially gamers, opt for to get the best performance, access to full hardware capabilities, etc) have not supported Wayland as well as as they could've. Past tense as, thankfully, things have changed in the past few years. NVIDIA's warmed up to Wayland (partly as it has no choice given that Wayland is now standard and a 'maybe one day' solution, and partly because it wants to: opportunities/benefits/security). \n\n\nWith the NVIDIA + Wayland sitch' now in a better state than before &mdash; but not perfect &m", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/20/013218/ubuntu-2410-to-default-to-wayland-for-nvidia-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ubuntu 24.10 to Default to Wayland for NVIDIA Users", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-20T00:23:30.173599+00:00", "description": "This week the nonprofit Linux Foundation announced the launch of the High Performance Software Foundation, which \"aims to build, promote, and advance a portable core software stack for high performance computing\" (or HPC) by \"increasing adoption, lowering barriers to contribution, and supporting development efforts.\" \n\nIt promises initiatives focused on \"continuously built, turnkey software stacks,\" as well as other initiatives including architecture support and performance regression testing. Its first open source technical projects are: \n\n- Spack: the HPC package manager. \n- Kokkos: a performance-portable programming model for writing modern C++ applications in a hardware-agnostic way. \n- Viskores (formerly VTK-m): a toolkit of scientific visualization algorithms for accelerator architectures. \n- HPCToolkit: performance measurement and analysis tools for computers ranging from desktop systems to GPU-accelerated supercomputers. \n- Apptainer: Formerly known as Singularity, Apptainer i", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/19/2234254/linux-foundation-announces-launch-of-high-performance-software-foundation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Linux Foundation Announces Launch of 'High Performance Software Foundation'", "user": null, "vote": 0}]