[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T11:00:00+00:00", "description": "Following the adoption of the new Hong Kong Security Law on March 19, the European & International Booksellers Federation and the International Publishers Association expressed concerns about the limits this law will create on the freedom to publish and on bookselling in Hong Kong. At issue are the bill's sweeping provisions and broad definitions. The Guardian recently reported that the impact of the new law on publishers and booksellers has been immediate.\n<br /><br />\n\"The steady deterioration of the freedom of expression in Hong Kong is alarming and disheartening,\" said EIBF co-president Jean-Luc Treutenaere. \"The book publishing and bookselling communities are under threat by repressive security laws, which are resulting in vibrant and beloved bookshops shutting down. Any closure, and particularly in current times, is a massive loss to the book world.\"", "language": "en", "link": "http://www.bookbrowse.com/news/detail/index.cfm?news_item_number=3191", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.bookbrowse.com/rss/book_news.rss", "source_obj__id": 43, "status_code": 0, "tags": [], "thumbnail": null, "title": "International Update: EIBF, IPA protest new Hong Kong security law; Sweden's World Book Week", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T11:00:00+00:00", "description": "PEN America has canceled its 2024 Literary Awards ceremony, which was previously scheduled to be held at the Town Hall in New York City on April 29, although some awards will still be conferred. The move follows months of steadily mounting criticism of the organization over its response to the humanitarian crisis in Gaza, which culminated last week in 28 authors withdrawing books from consideration for the awards, including nine of the 10 authors nominated for the organization's top prize, the PEN/Jean Stein Book Award.\n<br /><br />\n\"We greatly respect that writers have followed their consciences, whether they chose to remain as nominees in their respective categories or not,\" PEN America literary programming chief officer Clarisse Rosaz Shariyf said in a statement. \"We regret that this unprecedented situation has taken away the spotlight from the extraordinary work selected by esteemed, insightful and hard-working judges across all categories. As an organization dedicated to freedom ", "language": "en", "link": "http://www.bookbrowse.com/news/detail/index.cfm?news_item_number=3190", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.bookbrowse.com/rss/book_news.rss", "source_obj__id": 43, "status_code": 0, "tags": [], "thumbnail": null, "title": "PEN America cancels 2024 literary awards ceremony", "user": null, "vote": 0}]