[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T23:37:29.243585+00:00", "description": "The European Union has opened a second formal investigation into TikTok under its Digital Services Act (DSA), an online governance and content moderation framework. The investigation centers around TikTok Lite's \"Task and Reward\" feature that may harm mental health, especially among minors, by promoting addictive behavior. TechCrunch reports: The Commission also said it's minded to impose interim measures that could force the company to suspend access to the TikTok Lite app in the EU while it investigates concerns the app poses mental health risks to users. Although the EU has given TikTok until April 24 to argue against the measure -- meaning the app remains accessible for now. Penalties for confirmed violations of the DSA can reach up to 6% of global annual turnover. So ByeDance, TikTok's parent, could face hefty fines if EU enforcers do end up deciding it has broken the law.\n \nThe EU's first TikTok probe covers multiple issues including the protection of minors, advertising transpa", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/22/1954244/eu-opens-probe-of-tiktok-lite-citing-concerns-about-addictive-design?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EU Opens Probe of TikTok Lite, Citing Concerns About Addictive Design", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T23:37:27.728149+00:00", "description": "Jess Weatherbed reports via The Verge: Swedish gaming conglomerate Embracer Group announced plans on Monday to split itself into three distinct games and entertainment companies: Asmodee Group, Coffee Stain &amp; Friends, and Middle-earth Enterprises &amp; Friends. These will be separate, publicly listed companies, according to Embracer, which says the move will allow \"each entity to better focus on their respective core strategies and offer more differentiated and distinct equity stories for existing and new shareholders.\" [...]\n \nThe three new companies will be broken down as follows:\n \n- Middle-earth Enterprises &amp; Friends: This company, which will be renamed from Embracer Group, is described as a \"creative powerhouse in AAA game development and publishing\" that will retain ownership of the Dead Island, Killing Floor, Kingdom Come Deliverance, Tomb Raider, and The Lord of the Rings IPs.\n- Asmodee Group: a new arm dedicated to publishing and distributing tabletop games. The exist", "language": "en-us", "link": "https://games.slashdot.org/story/24/04/22/1959202/gaming-giant-embracer-group-is-splitting-into-three-companies?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Gaming Giant Embracer Group Is Splitting Into Three Companies", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T22:32:15.303129+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Home Assistant, until recently, has been a wide-ranging and hard-to-define project. The open smart home platform is an open source OS you can run anywhere that aims to connect all your devices together. But it's also bespoke Raspberry Pi hardware, in Yellow and Green. It's entirely free, but it also receives funding through a private cloud services company, Nabu Casa. It contains tiny board project ESPHome and other inter-connected bits. It has wide-ranging voice assistant ambitions, but it doesn't want to be Alexa or Google Assistant. Home Assistant is a lot.\n \nAfter an announcement this weekend, however, Home Assistant's shape is a bit easier to draw out. All of the project's ambitions now fall under the Open Home Foundation, a non-profit organization that now contains Home Assistant and more than 240 related bits. Its mission statement is refreshing, and refreshingly honest about the state of modern open source projects. \"We've", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/22/1946245/home-assistant-has-a-new-foundation-goal-to-become-a-consumer-brand?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Home Assistant Has a New Foundation, Goal To Become a Consumer Brand", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T21:26:46.298333+00:00", "description": "AmiMoJo writes: Knowing your ABCs is essential to academic success, but having a last name starting with A, B or C might also help make the grade. An analysis by University of Michigan researchers of more than 30 million grading records from U-M finds students with alphabetically lower-ranked names receive lower grades. This is due to sequential grading biases and the default order of students' submissions in Canvas -- the most widely used online learning management system -- which is based on alphabetical rank of their surnames.\n\n What's more, the researchers found, those alphabetically disadvantaged students receive comments that are notably more negative and less polite, and exhibit lower grading quality measured by post-grade complaints from students.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Study%3A+Alphabetical+Order+of+Surnames+May+Affect+Grading%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F04%2F22%2F190217%2F%3Futm_sourc", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/22/190217/study-alphabetical-order-of-surnames-may-affect-grading?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Study: Alphabetical Order of Surnames May Affect Grading", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T21:26:43.830804+00:00", "description": "Scorching weather has baked Europe in more days of \"extreme heat stress\" than its scientists have ever seen. The Guardian: Heat-trapping pollutants that clog the atmosphere helped push temperatures in Europe last year to the highest or second-highest levels ever recorded, according to the EU's Earth-watching service Copernicus and the World Meteorological Organization (WMO). Europeans are suffering with unprecedented heat during the day and are stressed by uncomfortable warmth at night. The death rate from hot weather has risen 30% in Europe in two decades, the joint State of the Climate report from the two organisations found. \n\n\"The cost of climate action may seem high,\" said WMO secretary-general Celeste Saulo, \"but the cost of inaction is much higher.\" The report found that temperatures across Europe were above average for 11 months of 2023, including the warmest September since records began. The hot and dry weather fuelled large fires that ravaged villages and spewed smoke that ", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/22/1914219/europe-baked-in-extreme-heat-stress-pushing-temperatures-to-record-highs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Europe Baked in 'Extreme Heat Stress' Pushing Temperatures To Record Highs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T20:22:12.842115+00:00", "description": "In a huge move for the mixed reality industry, Meta announced today that it's opening the Quest's operating system to third-party companies, allowing them to build headsets of their own. From a report: Think of it like moving the Quest's ecosystem from an Apple model, where one company builds both the hardware and software, to more of a hardware free-for-all like Android. The Quest OS is being rebranded to \"Meta Horizon OS,\" and at this point it seems to have found two early adopters. ASUS's Republic of Gamers (ROG) brand is working on a new \"performance gaming\" headsets, while Lenovo is working on devices for \"productivity, learning and entertainment.\" (Don't forget, Lenovo also built the poorly-received Oculus Rift S.) \n\nAs part of the news, Meta says it's also working on a limited-edition Xbox \"inspired\" Quest headset. (Microsoft and Meta also worked together recently to bring Xbox cloud gaming to the Quest.) Meta is also calling on Google to bring over the Google Play 2D app store", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/22/1718249/meta-opens-quest-os-to-third-parties-including-asus-and-lenovo?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Opens Quest OS To Third Parties, Including ASUS and Lenovo", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T20:22:11.343970+00:00", "description": "Amazon confirmed it is ending Prime Air drone delivery operations in Lockeford, California. The Central California town of 3,500 was the company's second U.S. drone delivery site, after College Station, Texas. Operations were announced in June 2022. From a report: The retail giant is not offering details around the setback, only noting, \"We'll offer all current employees opportunities at other sites, and will continue to serve customers in Lockeford with other delivery methods. We want to thank the community for all their support and feedback over the past few years.\" \n\nCollege Station deliveries will continue, along with a forthcoming site in Tolleson, Arizona set to kick off deliveries later this year. Tolleson, a city of just over 7,000, is located in Maricopa County, in the western portion of the Phoenix metropolitan area. Prime Air's arrival brings same-day deliveries to Amazon customers in the region, courtesy of a hybrid fulfillment center/delivery station. The company says it ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/22/1834249/amazon-ends-california-drone-deliveries?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Ends California Drone Deliveries", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T19:17:11.961196+00:00", "description": "A Shanghai flying taxi company says that China's \"low altitude\" industry is edging ahead of western rivals, thanks to more supportive regulators, technological breakthroughs and cut-throat competition in the Chinese logistics sector. From a report: The total market created by electric vertical take-off and landing, or eVTOL, aircraft is forecast to be worth $1.5tn a year by 2040 in a base-case assessment by Morgan Stanley analysts, with potential customers across airlines, logistics, emergency services, agriculture, tourism and security operations. China's AutoFlight Group won airworthiness certification from the Civil Aviation Administration of China in late March for the design and parts for its unmanned CarryAll aircraft -- a global first for an eVTOL weighing more than 1 tonne being cleared by regulators. \n\nKellen Xie, AutoFlight vice-president, said that while the company is also seeking similar approvals in Europe, the CAAC has been \"quite supportive\" of the new industry. \"They ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/22/1636200/chinese-flying-taxi-sector-claims-global-lead-thanks-to-regulatory-support?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Chinese Flying Taxi Sector Claims Global Lead Thanks To Regulatory Support", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T18:11:32.019078+00:00", "description": "Apple has stopped production of FineWoven accessories, according to reliable Apple leaker and prototype collector known as \"Kosutami.\" From a report: In a post on X (formerly Twitter), Kosutami explained that Apple has stopped production of FineWoven accessories due to its poor durability. The company may move to another non-leather material for its premium accessories in the future. Apple introduced FineWoven, a soft fabric material, last year. The company claimed that the material is made of 68 percent post-consumer content and is overall more environmentally friendly compared to the company's previous line of leather accessories. As part of the introduction of FineWoven case, Apple also discontinued the use of leather for new Apple accessories. Reviewers didn't like FineWoven, calling it \"bad. Like, really bad.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Reportedly+Stops+Production+of+FineWoven+Accessories%3A+https%3A%2F%2Fapple.", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/22/150251/apple-reportedly-stops-production-of-finewoven-accessories?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Reportedly Stops Production of FineWoven Accessories", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T18:11:30.089460+00:00", "description": "Yet another international cop shop has come out swinging against end-to-end encryption - this time it's Europol which is urging an end to implementation of the tech for fear police investigations will be hampered by protected DMs. The Register: In a joint declaration of European police chiefs published over the weekend, Europol said it needs lawful access to private messages, and said tech companies need to be able to scan them (ostensibly impossible with E2EE implemented) to protect users. Without such access, cops fear they won't be able to prevent \"the most heinous of crimes\" like terrorism, human trafficking, child sexual abuse material (CSAM), murder, drug smuggling and other crimes. \n\n\"Our societies have not previously tolerated spaces that are beyond the reach of law enforcement, where criminals can communicate safely and child abuse can flourish,\" the declaration said. \"They should not now.\" The joint statement, which was agreed to in cooperation with the UK's National Crime A", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/22/1714217/europol-becomes-latest-law-enforcement-group-to-plead-with-big-tech-to-ditch-e2ee?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Europol Becomes Latest Law Enforcement Group To Plead With Big Tech To Ditch E2EE", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T17:05:29.803331+00:00", "description": "An anonymous reader shares a report: To accommodate tech companies' pivots to artificial intelligence, tech companies are increasingly investing in ways to power AI's immense electricity needs. Most recently, OpenAI CEO Sam Altman invested in Exowatt, a company using solar power to feed data centers, according to the Wall Street Journal. That's on the heals of OpenAI partner, Microsoft, working on getting approval for nuclear energy to help power its AI operations. Last year Amazon, which is a major investor in AI company Anthropic, said it invested in more than 100 renewable energy projects, making it the \"world's largest corporate purchaser of renewable energy for the fourth year in a row.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Needs+So+Much+Electricity+That+Tech+Companies+Are+Getting+Into+Energy+Business%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F04%2F22%2F1427219%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><im", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/22/1427219/ai-needs-so-much-electricity-that-tech-companies-are-getting-into-energy-business?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Needs So Much Electricity That Tech Companies Are Getting Into Energy Business", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T17:05:28.311782+00:00", "description": "President Joe Biden travels to Triangle, Virginia, Monday to mark Earth Day, where he'll unveil $7 billion in grant funding for solar power under the Inflation Reduction Act and announce new steps to stand up his administration's American Climate Corps -- a program popular with youth climate groups. From a report: The announcements come days after the Biden administration made several significant conservation announcements, including barring oil drilling on nearly half of the national petroleum reserve in Alaska. Under the Environmental Protection Agency's Solar for All program, the administration will announce funding awards to states territories, tribal governments, municipalities and nonprofits \"to develop long-lasting solar programs that are targeted towards the communities and people who need them most,\" EPA Deputy Administrator Janet McCabe told reporters. Per McCabe, the funding will enable nearly one million households in low-income and disadvantaged communities to benefit fro", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/22/1629217/biden-marks-earth-day-by-announcing-7-billion-in-solar-power-grants?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Biden Marks Earth Day by Announcing $7 Billion in Solar Power Grants", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T16:01:08.917388+00:00", "description": "A military court in Moscow on Monday sentenced Meta spokesperson Andy Stone to six years in prison for \"publicly defending terrorism,\" a verdict handed down in absentia, RIA news agency reported. Reuters: Meta itself is designated an extremist organisation in Russia and its Facebook and Instagram social media platforms have been banned in the country since 2022 when Russia invaded Ukraine. \n\n[...] Russia's interior ministry opened a criminal investigation into Stone late last year, without disclosing specific charges. RIA cited state investigators as saying Stone had published online comments that defended \"aggressive, hostile and violent actions\" towards Russian soldiers involved in what Moscow calls its \"special military operation\" in Ukraine.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Russian+Court+Sentences+Meta+Spokesperson+To+Six+Years+in+Absentia%2C+Calls+Meta+'Extremist+Organisation'%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/22/158257/russian-court-sentences-meta-spokesperson-to-six-years-in-absentia-calls-meta-extremist-organisation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Russian Court Sentences Meta Spokesperson To Six Years in Absentia, Calls Meta 'Extremist Organisation'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T14:54:55.757444+00:00", "description": "North Korean animators have been secretly working on major international TV shows, including an Amazon superhero series and an upcoming HBO Max children's anime, according to a report by cybersecurity researchers. The findings, detailed in a report by the Stimson Center think tank's 38 North Project and Google-owned security firm Mandiant, provide a glimpse into how North Korea can use skilled IT workers to raise funds for its heavily sanctioned regime. \n\nResearcher Nick Roy discovered a misconfigured cloud server on a North Korean IP address in December, containing thousands of animation files, including cells, videos, and notes discussing ongoing projects. Some images appeared to be from Amazon's \"Invincible\" and HBO Max's \"Iyanu: Child of Wonder.\" The server, which mysteriously stopped being used at the end of February, likely allowed work to be sent to and from North Korean animators, according to Martyn Williams, a senior fellow on the 38 North Project. U.S. sanctions prohibit co", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/22/1335234/north-koreans-secretly-animated-amazon-and-max-shows-researchers-say?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "North Koreans Secretly Animated Amazon and Max Shows, Researchers Say", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T14:54:54.259187+00:00", "description": "Abstract of a paper on National Bureau of Economic Research: Physicians commonly receive marketing-related transfers from drug firms. We examine the impact of these relationships on the prescribing of physician-administered cancer drugs in Medicare. We find that prescribing of the associated drug increases 4\\% in the twelve months after a payment is received, with the increase beginning sharply in the month of payment and fading out within a year. A marketing payment also leads physicians to begin treating cancer patients with lower expected mortality. While payments result in greater expenditure on cancer drugs, there are no associated improvements in patient mortality.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Marketing+Cancer+Drugs+To+Physicians+Increases+Prescribing+Without+Improving+Mortality%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F04%2F22%2F1412256%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.f", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/22/1412256/marketing-cancer-drugs-to-physicians-increases-prescribing-without-improving-mortality?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Marketing Cancer Drugs To Physicians Increases Prescribing Without Improving Mortality", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T11:40:07.024515+00:00", "description": "50 years ago this week, PC software pioneer Gary Kildall \"demonstrated CP/M, the first commercially successful personal computer operating system in Pacific Grove, California,\" according to a blog post from Silicon Valley's Computer History Museum. It tells the story of \"how his company, Digital Research Inc., established CP/M as an industry standard and its subsequent loss to a version from Microsoft that copied the look and feel of the DRI software.\" \nKildall was a CS instructor and later associate professor at the Naval Postgraduate School (NPS) in Monterey, California...\n\nHe became fascinated with Intel Corporation's first microprocessor chip and simulated its operation on the school's IBM mainframe computer. This work earned him a consulting relationship with the company to develop PL/M, a high-level programming language that played a significant role in establishing Intel as the dominant supplier of chips for personal computers. \n\nTo design software tools for Intel's second-gene", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/22/0427255/how-cpm-launched-the-next-50-years-of-operating-systems?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How CP/M Launched the Next 50 Years of Operating Systems", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T08:23:22.851793+00:00", "description": "Bloomberg looks at America's biggest operator of private electrical vehicle charging infrastructure: Amazon. \"In a little more than two years, Amazon has installed more than 17,000 chargers at about 120 warehouses around the U.S.\" &mdash; and had Rivian build 13,500 custom electric delivery vans.\n\nAmazon has a long way to go. The Seattle-based company says its operations emitted about 71 million metric tons of carbon dioxide equivalent in 2022, up by almost 40% since Jeff Bezos's 2019 vow that his company would eventually stop contributing to the emissions warming the planet. Many of Amazon's emissions come from activities &mdash; air freight, ocean shipping, construction and electronics manufacturing, to name a few &mdash; that lack a clear, carbon-free alternative, today or any time soon. The company has not made much progress on decarbonization of long-haul trucking, whose emissions tend to be concentrated in industrial and outlying areas rather than the big cities that served as t", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/21/1816225/what-happened-after-amazon-electrified-its-delivery-fleet?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "What Happened After Amazon Electrified Its Delivery Fleet?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T05:06:48.510536+00:00", "description": "This week the Register spoke to former senior White House cyber policy director A.J. Grotto &mdash; who complained it was hard to get even slight concessions from Microsoft:\n\"If you go back to the SolarWinds episode from a few years ago ... [Microsoft] was essentially up-selling logging capability to federal agencies\" instead of making it the default, Grotto said. \"As a result, it was really hard for agencies to identify their exposure to the SolarWinds breach.\" Grotto told us Microsoft had to be \"dragged kicking and screaming\" to provide logging capabilities to the government by default. [In the interview he calls it \"an epic fight\" which lasted 18 months.\"] [G]iven the fact the mega-corp banked around $20 billion in revenue from security services last year, the concession was minimal at best. \n\nThat illustrates, Grotto said, that \"they [Microsoft] just have a ton of leverage, and they're not afraid to use it.\" Add to that concerns over an Exchange Online intrusion by Chinese snoops,", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/22/0337218/ex-white-house-cyber-policy-director-microsoft-is-a-national-security-risk?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ex-White House Cyber Policy Director:  Microsoft is a National Security Risk", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T02:56:39.901893+00:00", "description": "An anonymous reader shared this report from CNN:\nOn a slice of the ocean front in west Singapore, a startup is building a plant to turn carbon dioxide from air and seawater into the same material as seashells, in a process that will also produce \"green\" hydrogen &mdash; a much-hyped clean fuel. \n\nThe cluster of low-slung buildings starting to take shape in Tuas will become the \"world's largest\" ocean-based carbon dioxide removal plant when completed later this year, according to Equatic, the startup behind it that was spun out of the University of California at Los Angeles. The idea is that the plant will pull water from the ocean, zap it with an electric current and run air through it to produce a series of chemical reactions to trap and store carbon dioxide as minerals, which can be put back in the sea or used on land... The $20 million facility will be fully operational by the end of the year and able to remove 3,650 metric tons of carbon dioxide annually, said Edward Sanders, chie", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/22/026240/startup-is-building-the-worlds-largest-ocean-based-carbon-plant---and-its-scalable?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Startup is Building the World's Largest Ocean-Based Carbon Plant - and It's Scalable", "user": null, "vote": 0}]