[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T19:30:02+00:00", "description": "When first announced several years ago, Eiyuden Chronicle: Hundred Heroes sounded like a dream project. Initial trailers looked solid, and the reveals of its many unique heroes were compelling.\n\nNow that I've finally gotten my hands on it, Rabbit and Bear Studios' first title is an epic through and through, telling the tale of an extensive war with all kinds of characters and intrigue. Though it starts in a typical fashion, the plot encompasses the journeys of three protagonists - Nowa, Seign and Marisa - as they gather allies against the Galdean Empire.\n\nThe premise is strong, backed by a capable aesthetic and music, and it's enough to weather some of the issues with combat, quest design and enemy difficulty.", "language": null, "link": "https://www.youtube.com/watch?v=YruC1N1jTx0", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/YruC1N1jTx0/hqdefault.jpg", "title": "Eiyuden Chronicle: Hundred Heroes Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T17:30:07+00:00", "description": "Do you ever complete a narrative heavy game, one with arduous journeys, immense challenge, or emotional punishment, and instead of experiencing a sense of euphoria you feel as though you’ve lost something? \n\nThe fifteen games on this rundown aim to highlight this feeling. You complete what the game asks of you, but you’re left pondering – from a moral or emotional sense – if it was worth it. \n\nMaybe you’re not the good guy you thought you were. Maybe humanity is saved, but you’ve lost something near and dear to you. Maybe you thought you were acting in service of something else, only to find you were being manipulated the whole time. Games, more than any other medium, have that potential to put you right in the shoes of someone contemplating quandary in their actions.", "language": null, "link": "https://www.youtube.com/watch?v=ktg3F_SyTQg", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/ktg3F_SyTQg/hqdefault.jpg", "title": "15 Video Game Endings That Made You Feel Like You Lost When You Had Won", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T13:30:22+00:00", "description": "Game development can be a pretty hard to thing to do. Everything from ample financial resources to smooth development and market conditions can heavily alter the making of a game.\n\nOver the years, we have seen plenty of instances where we have been really excited about a game, but we never actually got to experience it. It’s easy to latch on to the hopes of getting these games someday, but often times that hope doesn’t bear any fruit. \n\nWith this video, we will be taking a look at 15 such games that we continue to dream about but can’t really get them. We will be discussing rumored games, games that are stuck in development hell, vaporware, and much more.", "language": null, "link": "https://www.youtube.com/watch?v=cO5elYMdZ5M", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/cO5elYMdZ5M/hqdefault.jpg", "title": "15 Games We DREAM About But Will Never Get", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-22T07:30:04+00:00", "description": "The Rising Tide, the final paid DLC for Final Fantasy 16, is finally here. After Echoes of the Fallen offered a dungeon romp and a few fun enemies, the development team looks to end things on a high note.\n\nAfter Clive and his friends receive word of Leviathan's Dominant, they venture to a new region, Mysidia, alongside Shula, a new character. Throughout their journey, they learn more about her people, the truth behind the aquatic Eikon and much more in a compelling narrative. You also have new Eikonic abilities, fun (and challenging) bosses and an incredible Eikon battle.\n\nThough it still lacks in dungeon and side quest design, The Rising Tide is an excellent end to the action RPG's run, delivering on its presentation and combat while packing enough goodies - like the endgame Kairos Gate - to keep hardcore fans hooked.", "language": null, "link": "https://www.youtube.com/watch?v=DK76RS9GFdI", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/DK76RS9GFdI/hqdefault.jpg", "title": "Final Fantasy 16: The Rising Tide Review - The Final Verdict", "user": null, "vote": 0}]