[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-03T13:00:25+00:00", "description": "☑️ \"Uwolnijcie nas stąd!\" z Wydawnictwa M jest opracowane dzięki wielkiej uprzejmości tego wydawnictwa. Książka jest dostępna pod tym linkiem:\nhttps://tiny.pl/d5rwd\n\nOd roku 2017 kiedy pojawiła się pierwsza wersja tej książki odnotowaliśmy już ponad milion wyświetleń. Również druga wersja audiobooka przygotowana przez Roberta i Ludwikę cieszyła się dużą popularnością. Za zgodą Wydawnictwa M publikujemy książkę po raz trzeci - odnowioną wizualnie i dźwiękowo. \nTym razem w rolę Marii wciela się:\nMagdalena Woźniak\n@magda_wozniak_17\na Nickiego Eltz'a odtwarza Igor Nadolski.\nKsiążka-wywiad z Marią Simmą mistyczką, która przez wiele lat rozmawiała z duszami czyśćcowymi to jej relacja z kilkudziesięciu lat obcowania z duszami czyśćcowymi. Z książki dowiemy się czego potrzebują dusze w czyśćcu cierpiące, dlaczego ważna jest msza za zmarłych i jak możemy się za nich modlić. Książka została opatrzona pozytywną opinią przedstawicieli Kościoła i choć nie ma imprimatur z pewnością przyczynia się d", "id": 812168, "language": null, "link": "https://www.youtube.com/watch?v=Tz5fQgorI04", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg", "source_obj__id": 178, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/Tz5fQgorI04/hqdefault.jpg", "title": "Uwolnijcie Nas Stąd! (część 16) CHOROBA", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-03T09:58:23+00:00", "description": "\"Wszystko zaczęło się, gdy moja 16-letnia córka uciekła za granicę do Holandii, by być z ukochanym. Nie wiedziałam, co się z nią dzieje, a serce matki bolało mnie strasznie. Zawierzyłam Matce Bożej i prosiłam o Jej opiekę nad moim dzieckiem. W tym trudnym czasie zaczęłam odmawiać Nowennę Pompejańską. To były dni pełne prób i pokus, ale w mojej modlitwie czułam obecność Matki Bożej. Nawet w najtrudniejszych chwilach, kiedy ataki szatana były silne, nie przestawałam się modlić. Pewnego dnia, wracając do domu, znalazłam różaniec z wizerunkiem Matki Bożej Pompejańskiej na klatce schodowej. To był dla mnie znak. Od tego momentu zaczęłam przychodzić na zawierzenia i oddawać swoje troski Matce Bożej. Nawiasem mówiąc, moja córka, która uciekła rok temu, również doświadczyła cudu. Prosiła o to, by uwolnić ją od złego człowieka, który ją otaczał. I o dziwo, w ciągu zaledwie dwóch tygodni dostała miejsce na terapii, na którą normalnie czeka się dwa lata! Chwała Panu za Jego miłosierdzie i opiekę", "id": 812169, "language": null, "link": "https://www.youtube.com/watch?v=u4sM-SURDl8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg", "source_obj__id": 178, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/u4sM-SURDl8/hqdefault.jpg", "title": "Zawierzenie Niepokalanemu Sercu Maryi Królowej Polski", "user": null, "vote": 0}]