[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-24T17:30:12+00:00", "description": "As one of the best games of 2023, Alan Wake 2 deserved a great sendoff, and with its second and final expansion, that is exactly what developer Remedy Entertainment has delivered. \n\nThe survival horror title’s The Lake House expansion delivers another compelling survival horror experience, one that delivers solid level design, rewarding exploration, a captivating and atmospheric setting, and more of Alan Wake 2’s tense brand of gameplay. \n\nOn top of all of that, the DLC also wonderfully blends the worlds of Alan Wake and Control while also settings things up for the larger Remedy Connected Universe’s future in exciting ways. Whether you’re an Alan Wake 2 fanatic looking for a solid and self- sufficient horror chapter, or a Remedy nut desperate to dive further into the studio’s shared universe, The Lake House has plenty to love.", "id": 1382189, "language": null, "link": "https://www.youtube.com/watch?v=xMFGvn-r2gE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/xMFGvn-r2gE/hqdefault.jpg", "title": "Alan Wake 2: The Lake House Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-24T15:30:19+00:00", "description": "The Dragon Age franchise has consistently been one of the most widely beloved and fiercely followed gaming franchises for as long as it has existed, and a huge part of that has been the incredible worldbuilding that the series has always been known for. \n\nAcross three games over the course of the last decade and a half, the Dragon Age series has touted some of the most compelling epic fantasy action we’ve seen in games- which is why it’s no surprise that there’s as much excitement surrounding the upcoming Dragon Age: The Veilguard and its story as there is. \n\nBioWare has said that the upcoming fourth mainline Dragon Age instalment is going to be a perfectly suitable jumping on point even for someone who has never played a Dragon Age game before- which, given the fact that it has been a decade since the series’ last game, doesn’t come as a massive surprise. \n\nEven so, it’s fair to assume that there’s going to be plenty of connective tissue tying The Veilguard to its predecessors, as f", "id": 1381341, "language": null, "link": "https://www.youtube.com/watch?v=vaeb_CkvE58", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/vaeb_CkvE58/hqdefault.jpg", "title": "The Full Story of Dragon Age Series: Before You Play Dragon Age The Veilguard: The Complete Timeline", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-24T13:30:30+00:00", "description": "It's been close to two and a half decades since we last got Microids' strategy game Empire of the Ants, and though that game certainly had its fair share of issues, Microids is taking another crack at bringing that vision to life.\n\nPartnering with developer Tower Five, the publisher is bringing a new game based on Empire of the Ants, partnering not only complex strategy gameplay but also photorealistic visuals and impressive technical advancements. With the game set to launch in just a few days' time, here, we'll be going over a few key details that you should know about it.", "id": 1380841, "language": null, "link": "https://www.youtube.com/watch?v=Ukz2SCxePck", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/Ukz2SCxePck/hqdefault.jpg", "title": "Empire of the Ants - 11 Things You Need To Know Before You Buy", "vote": 0}]