[{"page_rating_contents": 0, "thumbnail": "https://i1.ytimg.com/vi/Ha-17NJlDr0/hqdefault.jpg", "tags": [], "artist": "GamingBolt", "bookmarked": false, "description": "PlayStation has been on fire nonstop for over a decade at this point, but recently, it feels like the company has been stumbling a little bit more than what we’ve grown used to seeing. \n\nRecently, it was revealed that the console missed its sales target for the current fiscal year, with Sony later also confirming that, what with it entering the latter half of its lifecycle, its sales are going to see a gradual slowdown going forward. \n\nFurther confirmation that there won’t be any new releases in any major existing first-party franchise until at least April of next year has only served to fan the flames, and all of that has combined with a number of other missteps and infractions over the last year or so to lend PlayStation as a whole an unusual air of fragility. Here, we talk about all of that and more.", "link": "https://www.youtube.com/watch?v=Ha-17NJlDr0", "album": "", "page_rating_votes": 0, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating": 0, "date_published": "2024-02-16T15:45:00+00:00", "permanent": false, "dead": false, "language": null, "source_obj__id": 208, "page_rating_visits": 0, "user": null, "age": null, "vote": 0, "title": "What The Hell Is Going On At PlayStation?"}, {"page_rating_contents": 0, "thumbnail": "https://i2.ytimg.com/vi/MXde8jpAVDw/hqdefault.jpg", "tags": [], "artist": "GamingBolt", "bookmarked": false, "description": "Since launch, Helldivers 2 has been amazing, whether you were among the first to liberate Heeth or answered the call to fight back against the surprise Automaton invasion. It's hard to explain why the co-op shooter is so addictive, but it's an incredible experience on PC and PS5.\n\nMatchmaking issues aside, however, there are several areas where Helldivers 2 could improve and more than a few features that it needs. A proper lobby browser is one, but being able to save loadouts, test out different weapons and Stratagems, and more are just a few things on our wishlist.\n\nCheck out 15 things Helldivers 2 needs, from new biomes, objectives and weapon types to different missions, including large co-op Operations with more than four players.", "link": "https://www.youtube.com/watch?v=MXde8jpAVDw", "album": "", "page_rating_votes": 0, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating": 0, "date_published": "2024-02-16T09:45:02+00:00", "permanent": false, "dead": false, "language": null, "source_obj__id": 208, "page_rating_visits": 0, "user": null, "age": null, "vote": 0, "title": "Helldivers 2 - 15 Things It DESPERATELY NEEDS"}]