[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-08T15:30:00+00:00", "description": "Concord’s massive failure did more than just cost PlayStation a ton of money, it sullied their image as a leader in premium first-party games. Sony has always had a solid lineup with its first-party studios, and most of those games didn’t follow trends or force itself into a crowded genre. \n\nNaughty Dog was faced with the ultimatum to either be a live-service studio or continue making rich narrative single-player experiences when they were developing TLOU Online. Thankfully, they shut the project down and focused on the latter, though most of those seem to be remasters and remakes at the moment but that’s another discussion. \n\nSony should follow in their footsteps. The AAA live-service market is overcrowded, and players have more than enough options for their wants and needs. What players want is fresh new experiences that nobody else is providing. This is where Sony has always excelled in the past with marque titles like Bloodborne, and Horizon drawing in new audiences and keeping th", "id": 1289998, "language": null, "link": "https://www.youtube.com/watch?v=2HQ_YNmCk4Q", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/2HQ_YNmCk4Q/hqdefault.jpg", "title": "PlayStation Is At Their Best When They DON'T CHASE TRENDS", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-08T13:30:11+00:00", "description": "After rave reviews, Bloober Team's Silent Hill 2 is out now for all players on PS5 and PC. However, at one point, the combination seemed almost impossible. Many were sceptical that the developer, or even publisher Konami, could pull it off, much less create a remake that lived up to expectations.\n\nSilent Hill 2 remake not only does that but blows expectations out of the water. Its visual fidelity, resulting in reimagined environments, incredibly detailed character models, and stellar effects, only tells half the story. The new camera perspective and how that translates to gameplay, the sound design and rearranged soundtrack, and the changes to enemy placements all contribute to a new experience that's still inherently Silent Hill.\n\nOf course, this wouldn't have been possible without Bloober Team or Konami working together. How did both parties achieve the impossible and deliver one of the best remakes ever? Find out here.", "id": 1287564, "language": null, "link": "https://www.youtube.com/watch?v=Nico7KHpdCw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/Nico7KHpdCw/hqdefault.jpg", "title": "Silent Hill 2 Remake Just Did The IMPOSSIBLE", "vote": 0}]