[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-08T00:28:48+00:00", "description": "DevSecOps Transformation at Speed and Scale Using Tekton - Caroline Cameron & Tony Higham, IBM\n\nThe distributed development effort across individual teams to build secure software in a constantly evolving security threat landscape results in massive duplication of CI/CD automation work and inconsistent security and compliance postures across teams. The solution is to standardize the CI/CD security & compliance automation for development teams and centralize platform operations and maintenance. Our centralized CI/CD platform prevents software security problems from reaching production systems and streamlines compliance audits using built-in DevSecOps practices. Tekton is used as the open source orchestrator to standardize CI/CD and contribute open source enhancements through our valued ecosystem partnerships to benefit all users. The platform includes open source scanning tools such as Clair for OSS threat intelligence, SonarQube for SAST, and OWASP ZAP for DAST. The platform also exte", "id": 1284482, "language": null, "link": "https://www.youtube.com/watch?v=h6EIquCZPzs", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/h6EIquCZPzs/hqdefault.jpg", "title": "DevSecOps Transformation at Speed and Scale Using Tekton - Caroline Cameron & Tony Higham, IBM", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-08T00:28:34+00:00", "description": "Sponsored Session: Solving for the Cloud Native Security Paradox - Robert Sirchia, SUSE\n\nWhen we talk about the risks associated with containers in the context of enterprise workloads, there are various factors that come into play - multiple vendors and individuals, lack of standardization and conformance, tooling fatigue and of course, vulnerabilities! While the SLSA framework and OCI specification are great signals of your risk posture and conformance, how do you as a developer ensure that you're following best practices while staying up-to-date with the latest releases? In this session, learn how SUSE's Base Container Images empower you to build enterprise-ready containers without compromising on developer experience, security, or flexibility.", "id": 1284483, "language": null, "link": "https://www.youtube.com/watch?v=p_c4op3U45U", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 499, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCfX55Sx5hEFjoC3cNs6mCUQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/p_c4op3U45U/hqdefault.jpg", "title": "Sponsored Session: Solving for the Cloud Native Security Paradox - Robert Sirchia, SUSE", "vote": 0}]