[{"tags": [], "vote": 0, "age": null, "language": "en", "bookmarked": false, "permanent": false, "page_rating": 100, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-01-24T18:45:01+00:00", "page_rating_contents": 100, "user": null, "link": "https://www.youtube.com/watch?v=PpOD6tBBrGE", "page_rating_votes": 0, "title": "Tekken 8 vs Tekken 7 Graphics Comparison - Pushing Unreal Engine 5 To Its Limit?", "page_rating_visits": 1, "description": "Bandai Namco’s Tekken series has managed to stay relevant over the course of a very long, which is an achievement in an industry that’s known to move extremely fast with constantly shifting trends and consumer preferences. \n\nTekken’s constant evolution of gameplay mechanics and setting has helped it to stay relevant through the years, and those merits shine brightly in Tekken 8 - which represents a bold step towards the future of the genre. \n\nWith this video, we will be diving deep into Tekken 8’s technical side and break down each individual aspect ranging from lighting to character models and loading times among others.", "artist": "GamingBolt", "source_obj__id": 208, "thumbnail": "https://i1.ytimg.com/vi/PpOD6tBBrGE/hqdefault.jpg", "album": "", "dead": false}, {"tags": [], "vote": 0, "age": null, "language": null, "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-01-24T16:30:05+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.youtube.com/watch?v=S18SF1WI9wo", "page_rating_votes": 0, "title": "Graven Review - The Final Verdict", "page_rating_visits": 0, "description": "Graven is a first-person action-adventure game that takes ideas from several different genres, ranging from RPGs to boomer shooters and even immersive sims. The game puts players in the shoes of an exiled protagonist that finds himself in a strange swamp shrouded in darkness and beset by enemies, and things only get weirder and darker from there.\n\nSadly, while Graven looks absolutely wonderful, especially if you’re a fan of classic shooters from the 90s, the game’s different gameplay ideas never feel like they come together in a satisfying way.\n\nThe game is strangely strict but inconsistent about what environmental objects can be interacted with and the enemies never really react to whatever you might do, making combat incredibly unsatisfying.", "artist": "GamingBolt", "source_obj__id": 208, "thumbnail": "https://i4.ytimg.com/vi/S18SF1WI9wo/hqdefault.jpg", "album": "", "dead": false}, {"tags": [], "vote": 0, "age": null, "language": null, "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "date_published": "2024-01-24T10:45:03+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.youtube.com/watch?v=h-Lf9fgbuUI", "page_rating_votes": 0, "title": "Final Fantasy 7 Rebirth - 15 Things You NEED TO KNOW Before You Buy", "page_rating_visits": 0, "description": "Calling Final Fantasy 7 Rebirth one of the most massively anticipated games of the year would be a bit of an understatement, to say the very least, and it’s easy to see why that’s the case. \n\nEverything that the developer has shown of it so far has also looked extremely promising. From its massive world to its combat improvements to the lofty promises it’s making with its setting, there’s plenty about Final Fantasy 7 Rebirth that has caught our eye, and in this feature, we are going to look at a few such details.", "artist": "GamingBolt", "source_obj__id": 208, "thumbnail": "https://i1.ytimg.com/vi/h-Lf9fgbuUI/hqdefault.jpg", "album": "", "dead": false}]