[{"tags": [], "vote": 0, "age": null, "language": "en-AU", "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.grimdarkmagazine.com/feed", "date_published": "2024-01-24T10:14:49+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.grimdarkmagazine.com/news-world-of-darkness-reprints", "page_rating_votes": 0, "title": "NEWS: World of Darkness Reprints", "page_rating_visits": 0, "description": "<p>Last Updated on January 24, 2024 White Wolf Publishing was the darling of the Goth and counterculture gaming scene from 1991 to 2004 when they were publishing the World of Darkness universe based around such hit titles as Vampire: The Masquerade as well as Werewolf: The Apocalypse. Like many tabletop game companies, they also released tie-in novels to further explore the characters and world. The tie-in novels started with Dark Prince by Keither Herber and ended with the Time of Judgement novels that brought an official end to the campaign setting before its reboot (and later revival with Vampire: The Masquerade 5th Edition). Over a hundred novels were published during this time and, until recently, all of them have been out of print. In 2019, a deal was reached with Crossroad Press and Paradox Interactive (current holder of the IP) to re-release the Clan Novels, Dark Age Clan Novels, and Grail Covenant Trilogy&#8211;a collection of twenty-nine novels that were some of the", "artist": null, "source_obj__id": 571, "thumbnail": null, "album": "", "dead": false}, {"tags": [], "vote": 0, "age": null, "language": "en-AU", "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.grimdarkmagazine.com/feed", "date_published": "2024-01-24T04:25:03+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.grimdarkmagazine.com/review-six-rooms-by-gemma-amor", "page_rating_votes": 0, "title": "REVIEW: Six Rooms by Gemma Amor", "page_rating_visits": 0, "description": "<p>Gemma Amor puts a new spin on the familiar haunted house trope with Six Rooms. The novel takes place at Sunshire Chateau, an enormous, labyrinthine mansion sitting atop a hill in New York state, replete with secret passages and a mysterious past. Rumored to be haunted, the estate offers the occasional tour to brave (or perhaps foolish) groups of visitors. Six Rooms opens with one such tour, featuring a hodgepodge of nosy neighbors and unsuspecting tourists. Sunshire Chateau’s unnamed tour guide is imposing and mercurial, displaying abrupt flashes of anger that show no mercy toward uncompliant guests. The tour guide keeps everyone on their toes, although not necessarily on their best behavior, with his sudden alternations between scripted history and vulgar outbursts. The Sunshire Chateau also employs a book antiquarian devoted to the meticulous study and preservation of thousands of historic and one-of-a-kind volumes contained in the sprawling mansion. Although he would ra", "artist": null, "source_obj__id": 571, "thumbnail": null, "album": "", "dead": false}]