[{"tags": [], "vote": 0, "age": null, "language": "en-us", "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.sciencedaily.com/rss/all.xml", "date_published": "2024-01-24T16:46:18+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.sciencedaily.com/releases/2024/01/240124164618.htm", "page_rating_votes": 0, "title": "World's first successful embryo transfer in rhinos paves the way for saving the northern white rhinos from extinction", "page_rating_visits": 0, "description": "Scientists have succeeded in achieving the world's first pregnancy of a rhinoceros after an embryo transfer. The southern white rhino embryo was produced in vitro from collected egg cells and sperm and transferred into a southern white rhino surrogate mother at the Ol Pejeta Conservancy in Kenya on September 24, 2023. The BioRescue team confirmed a pregnancy of 70 days with a well-developed 6.4 cm long male embryo. The successful embryo transfer and pregnancy are a proof of concept and allow to now safely move to the transfer of northern white rhino embryos -- a cornerstone in the mission to save the northern white rhino from extinction.", "artist": null, "source_obj__id": 342, "thumbnail": null, "album": "", "dead": false}, {"tags": [], "vote": 0, "age": null, "language": "en-us", "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.sciencedaily.com/rss/all.xml", "date_published": "2024-01-24T16:45:06+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.sciencedaily.com/releases/2024/01/240124164506.htm", "page_rating_votes": 0, "title": "Microplastics may be accumulating rapidly in endangered Galápagos penguins' food web", "page_rating_visits": 0, "description": "Model predictions showed a rapid increase in microplastic accumulation and contamination across the penguins' prey organisms resulting in Galapagos penguin showing the highest level of microplastics per biomass, followed by barracuda, anchovy, sardine, herring, and predatory zooplankton.", "artist": null, "source_obj__id": 342, "thumbnail": null, "album": "", "dead": false}, {"tags": [], "vote": 0, "age": null, "language": "en-us", "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.sciencedaily.com/rss/all.xml", "date_published": "2024-01-24T13:27:24+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.sciencedaily.com/releases/2024/01/240124132724.htm", "page_rating_votes": 0, "title": "Global groundwater depletion is accelerating, but is not inevitable", "page_rating_visits": 0, "description": "Groundwater is rapidly declining across the globe, often at accelerating rates. Researchers now present the largest assessment of groundwater levels around the world, spanning nearly 1,700 aquifers. In addition to raising the alarm over declining water resources, the work offers instructive examples of where things are going well, and how groundwater depletion can be solved. The study is a boon for scientists, policy makers and resource managers working to understand global groundwater dynamics.", "artist": null, "source_obj__id": 342, "thumbnail": null, "album": "", "dead": false}, {"tags": [], "vote": 0, "age": null, "language": "en-us", "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.sciencedaily.com/rss/all.xml", "date_published": "2024-01-24T13:27:16+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.sciencedaily.com/releases/2024/01/240124132716.htm", "page_rating_votes": 0, "title": "New pieces in the puzzle of first life on Earth", "page_rating_visits": 0, "description": "Microorganisms were the first forms of life on our planet. The clues are written in 3.5 billion-year-old rocks by geochemical and morphological traces, such as chemical compounds or structures that these organisms left behind. However, it is still not clear when and where life originated on Earth and when a diversity of species developed in these early microbial communities. Evidence is scarce and often disputed. Now, researchers have uncovered key findings about the earliest forms of life. In rock samples from South Africa, they found evidence dating to around 3.42 billion years ago of an unprecedentedly diverse carbon cycle involving various microorganisms. This research shows that complex microbial communities already existed in the ecosystems during the Palaeoarchaean period.", "artist": null, "source_obj__id": 342, "thumbnail": null, "album": "", "dead": false}, {"tags": [], "vote": 0, "age": null, "language": "en-us", "bookmarked": false, "permanent": false, "page_rating": 0, "comments": [], "source": "https://www.sciencedaily.com/rss/all.xml", "date_published": "2024-01-24T13:27:11+00:00", "page_rating_contents": 0, "user": null, "link": "https://www.sciencedaily.com/releases/2024/01/240124132711.htm", "page_rating_votes": 0, "title": "New model predicts how shoe properties affect a runner's performance", "page_rating_visits": 0, "description": "A new model predicts how shoe properties will affect a runner's performance. The model could be a tool for designers looking to push the boundaries of sneaker design.", "artist": null, "source_obj__id": 342, "thumbnail": null, "album": "", "dead": false}]