[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-19T15:30:10+00:00", "description": "For fans of horror games, and the survival horror genre in particular, the last few years have been a time of great bounty, thanks to the sheer number of excellent games we've been treated to. There's been a cavalcade of major heavyweights that have impressed like Silent Hill 2, underrated classics like Amnesia: The Bunker and The Evil Within 2, indie darlings like Tormented Souls and Signalis, and so, so much more. \n\nAnd nearly as gratifying as that impressive list of games has been the assurance that has embedded itself in everyone that there is always going to be another exciting survival horror release around the corner for fans of the genre to look forward to and pin all of their keenest hopes and expectations on.\n\nWe just got one such game earlier this year in the form of the aforementioned Silent Hill 2 remake, but before the year is out, we're going to get another one- because if you're a fan of the survival horror genre and not paying attention to S.T.A.L.K.E.R. 2: Heart of ", "id": 1544124, "language": null, "link": "https://www.youtube.com/watch?v=YMwQ5Y-QX3w", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/YMwQ5Y-QX3w/hqdefault.jpg", "title": "STALKER 2 Will Be A SPINE-CHILLING Survival Horror Experience We're Itching To Start", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-19T09:30:03+00:00", "description": "There’s something fundamentally profound about alien life that has kept their looming threat at the top of global pop culture for over a hundred years. It isn’t just movies, TV, books, and art that have propagated aliens’ notoriety.\n\nNo, video games have been getting in on the act since their origin too. There are tons of games available where you fight against (and sometimes for) interstellar life, and their popularity is likely down to interstellar life’s enigmatic nature. What do aliens look like? \n\nWill they be more technologically advanced than us? Do they come in peace? The games included here put extra-terrestrial forces under the microscope; this selection perhaps answering some of humanity’s pervading questions through their creativity, innovativeness, and (most often) their eagerness for violence and destruction.", "id": 1541967, "language": null, "link": "https://www.youtube.com/watch?v=8DDUvVJk4DA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/8DDUvVJk4DA/hqdefault.jpg", "title": "15 Excellent Single Player Games WHERE YOU FOUGHT ALIENS", "vote": 0}]