[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-19T13:27:42+00:00", "description": "<!-- SC_OFF --><div class=\"md\"><p>Hey everybody, so I’m the founder of WeStrive (WeStrive.com) - we’re an all-in-one personal training software and I’ve been running the company for a few years.</p> <p>The issue with all-in-one in SaaS is that we’re always adding new features while others features fall behind. A huge feature (not really a feature) that’s always been our downfall is page loading speed. Once you’re in the page, life is good, switching between in-page tabs is fast, graphs load quickly… life is good.</p> <p>The issue is when you open up a new page and it takes honestly 4-7 seconds to load every time. It’s absolutely killing us.</p> <p>We’re a little tight on hours right now and have a couple of massive projects for partnerships we’re working on so I do not have the bandwidth to have our developers stop everything we’re doing and solve this.</p> <p>My main dev is great but we just don’t have time to give him 2 weeks to figure out why we are so damn slow. Beyond that, he’s", "id": 1543132, "language": null, "link": "https://www.reddit.com/r/developer/comments/1gux3kc/need_help_improving_software_speed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 508, "source_url": "https://www.reddit.com/r/developer/.rss", "status_code": 0, "tags": [], "thumbnail": null, "title": "Need help improving software speed", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-19T12:03:53+00:00", "description": "<!-- SC_OFF --><div class=\"md\"><p>Hello I am creating a social media like app/website on squarespace (think tinder or meetup) and am running into trouble. I made some html that asks some questions to create a profile for the user and it outputs a neat little textbox in squarespace that has the information for their profile but I would like for it to be its own “official” profile for said user. I realized a part of the issue was it has no database connected storing the information so I signed up for Zapier to help auto retrieve that user information but now I’m having trouble where to go from here. I still need a database to send this information to that is being retrieved by Zapier and store it but I’m not sure what resources there are for that. Any tips?</p> </div><!-- SC_ON --> &#32; submitted by &#32; <a href=\"https://www.reddit.com/user/divineInsanity4\"> /u/divineInsanity4 </a> <br/> <span><a href=\"https://www.reddit.com/r/developer/comments/1guvknv/creating_an_appwebsite/\">[link", "id": 1542722, "language": null, "link": "https://www.reddit.com/r/developer/comments/1guvknv/creating_an_appwebsite", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 508, "source_url": "https://www.reddit.com/r/developer/.rss", "status_code": 0, "tags": [], "thumbnail": null, "title": "Creating an app/website", "vote": 0}]