[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-20T21:15:02+00:00", "description": "Dave Rubin of “The Rubin Report” shares a DM clip of his talk with Dr. Drew Pinsky and Karol Markowicz about how the entire field of journalism has proved Trump’s “fake news” label correct with the complete ignoring of the coup against Joe Biden\n\nWATCH the MEMBER-EXCLUSIVE segment of the show here: https://rubinreport.locals.com/\n\nCheck out the NEW RUBIN REPORT MERCH here:\nhttps://daverubin.store/\n\n----------\n\n#RubinReport #fakenews #journalism #mediabias #coup #DrDrew #DaveRubin\n\nThe Rubin Report Roundtable is a place where you can hear sane discussions on controversial topics. Is the state of US news driving you crazy? Does the coverage of political news rarely seem “fair and balanced”? Serious discussions on US politics is vital to having a healthy democracy. No matter what political party you belong to, we need to be able to hear a variety of political perspectives. Whether you majored in political science or just want to have a deeper understanding of the issues you’ll want to ch", "id": 1184668, "language": null, "link": "https://www.youtube.com/watch?v=vEIg40GSA44", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 438, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/vEIg40GSA44/hqdefault.jpg", "title": "They Let This Happen Under Our Noses & Did Nothing! | Dr. Drew", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-20T19:15:01+00:00", "description": "Dave Rubin of “The Rubin Report” shares a DM clip of his talk with Dr. Drew Pinsky and Karol Markowicz about how current polling in important swing states is showing how easily voters could tip the election in favor of Republicans or Democrats.\n\nWATCH the MEMBER-EXCLUSIVE segment of the show here: https://rubinreport.locals.com/\n\nCheck out the NEW RUBIN REPORT MERCH here:\nhttps://daverubin.store/\n\n----------\n\n#RubinReport  #polling #swingstates #2024election #DaveRubin \n\nThe Rubin Report Roundtable is a place where you can hear sane discussions on controversial topics. Is the state of US news driving you crazy? Does the coverage of political news rarely seem “fair and balanced”? Serious discussions on US politics is vital to having a healthy democracy. No matter what political party you belong to, we need to be able to hear a variety of political perspectives. Whether you majored in political science or just want to have a deeper understanding of the issues you’ll want to check out th", "id": 1183870, "language": null, "link": "https://www.youtube.com/watch?v=ekah6jE9w6E", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 438, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/ekah6jE9w6E/hqdefault.jpg", "title": "One Major Reason to Distrust Latest Attention-Getting Poll for 2024 Election", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-20T18:15:02+00:00", "description": "Dave Rubin of “The Rubin Report” shares a DM clip of his talk with Dr. Drew Pinsky and Karol Markowicz about Gavin Newsom making it illegal to post AI-generated parodies like the AI-created Kamala Harris campaign ad shared by Elon Musk and how it just backfired.\n\nWATCH the MEMBER-EXCLUSIVE segment of the show here: https://rubinreport.locals.com/\n\nCheck out the NEW RUBIN REPORT MERCH here:\nhttps://daverubin.store/\n\n----------\n\n#RubinReport #GavinNewsom #memes #AI #deepfake #Kamala #KamalaHarris #parody #DaveRubin\n\nThe Rubin Report Roundtable is a place where you can hear sane discussions on controversial topics. Is the state of US news driving you crazy? Does the coverage of political news rarely seem “fair and balanced”? Serious discussions on US politics is vital to having a healthy democracy. No matter what political party you belong to, we need to be able to hear a variety of political perspectives. Whether you majored in political science or just want to have a deeper understandi", "id": 1183871, "language": null, "link": "https://www.youtube.com/watch?v=OH0puD0czmM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 438, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/OH0puD0czmM/hqdefault.jpg", "title": "Banning AI Memes Already Blew Up in Gavin Newsom's Face", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-20T17:15:01+00:00", "description": "Dave Rubin of “The Rubin Report” shares a DM clip of his talk with Dr. Drew Pinsky and Karol Markowicz about Pharrell Williams mocking self-righteous celebrities for their political endorsements in his interview with “The Hollywood Reporter”.\n\nWATCH the MEMBER-EXCLUSIVE segment of the show here: https://rubinreport.locals.com/\n\nCheck out the NEW RUBIN REPORT MERCH here:\nhttps://daverubin.store/\n\n----------\n\n#RubinReport #pharrellwilliams #pharrell #celebs #celebrities #endorsement #political  #daverubin \n\nThe Rubin Report Roundtable is a place where you can hear sane discussions on controversial topics. Is the state of US news driving you crazy? Does the coverage of political news rarely seem “fair and balanced”? Serious discussions on US politics is vital to having a healthy democracy. No matter what political party you belong to, we need to be able to hear a variety of political perspectives. Whether you majored in political science or just want to have a deeper understanding of the", "id": 1183872, "language": null, "link": "https://www.youtube.com/watch?v=mHThjyWgaPk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 438, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/mHThjyWgaPk/hqdefault.jpg", "title": "Pharrell Williams Has Harsh Words for Celebrities Pushing Politics", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-20T15:00:27+00:00", "description": "Dave Rubin of “The Rubin Report” talks to Dr. Drew Pinsky and Karol Markowicz about Barstool Sports’ Dave Portnoy finally announcing that he will be voting for Donald Trump after delivering a scathing attack on the Democratic Party for pretending to be the party that can save democracy as Democrat elites anoint Kamala Harris as the Democrat nominee while ignoring the will of Democrat voters; how the entire field of journalism has proved Trump’s “fake news” label correct with the complete ignoring of the coup against Joe Biden; Pharrell Williams mocking self-righteous celebrities for their political endorsements in his interview with “The Hollywood Reporter”; Gavin Newsom making it illegal to post AI-generated parodies like the AI-created Kamala Harris campaign ad shared by Elon Musk; how current polling in important swing states is showing how easily voters could tip the election in favor of Republicans; predictions for who will win the 2024 election; and much more.\n\nWATCH the MEMBER-", "id": 1182813, "language": null, "link": "https://www.youtube.com/watch?v=ma0VizdODF4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 438, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/ma0VizdODF4/hqdefault.jpg", "title": "Is This the Issue That Finally Causes Dave Portnoy to Break with Democrats?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-20T01:15:01+00:00", "description": "Dave Rubin of “The Rubin Report” shares a DM clip of Benjamin Netanyahu’s address to Congress and Elon Musk attending with Douglas Murray.\nWatch Dave Rubin's FULL DIRECT MESSAGE: https://www.youtube.com/watch?v=eiU_-usDIkw&list=PLEbhOtC9klbDG22n--rCDbv02-n8l6agL&index=1&pp=gAQBiAQB\n\nWATCH the MEMBER-EXCLUSIVE segment of the show here: https://rubinreport.locals.com/\n\nCheck out the NEW RUBIN REPORT MERCH here:\nhttps://daverubin.store/\n\n----------\n\n#DaveRubinReacts #RubinReport #ElonMusk #BenjaminNetanyahu #DouglasMurray #DaveRubin #shorts\n\nThe Direct Message segments of the Rubin Report are a chance for Dave Rubin to directly address current events, political news and the topics of the day. Whether it’s encouraging critical thinking, defending free speech, or fending off political correctness, it’s only by having calm rational conversations about these issues that can help de-escalate the political polarization and help heal our democracy. To hear what Dave has to say on these and a va", "id": 1179250, "language": null, "link": "https://www.youtube.com/watch?v=bgRiBI3n5o4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 438, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJdKr0Bgd_5saZYqLCa9mng", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/bgRiBI3n5o4/hqdefault.jpg", "title": "Look Who Elon Musk Is Sitting Next to at Benjamin Netanyahu’s Speech", "vote": 0}]