[{"source": "https://www.wirtualnemedia.pl/rss/wm_internet.xml", "title": "Krzysztof Stanowski przejmie sponsorów Kanału Sportowego? \"To nie będzie łatwe\", \"Nielogiczne plotki”", "description": "Czy Krzysztof Stanowski może przejąć do Kanału Zero reklamodawców Kanału Sportowego? - Nie będzie mu łatwo, bo duże brandy zwykle czekają na ostateczny produkt i rzeczywiste wyniki - mówi Wirtualnemedia.pl Zbigniew Badziak z 38 Content Communication. Paweł Wilk z  KINESSO Polska odnosi się do marki Tyskie: „Z moich informacji wynika, że nie opuszczą swojego dotychczasowego partnera.” Marcin Błoński z Havas Media Network uważa zaś, że Stanowski będzie starał się pozyskać sponsorów, którzy dotychczas nie współpracowali z Kanałem Sportowym.", "link": "https://www.wirtualnemedia.pl/artykul/krzysztof-stanowski-kanal-zero-kanal-sportowy-reklama-reklamodawcy", "date_published": "2023-12-02T07:13:48.544621+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Wirtualne Media - Internet", "album": "Wirtualne Media - Internet", "user": null, "language": "pl-PL", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.wirtualnemedia.pl/rss/wm_internet.xml", "title": "Wirtualna Aitana zarabia 10 tys. euro miesięcznie. \"Wirtualni influencerzy nie wyprą prawdziwych twórców\"", "description": "Agencja reklamowa w Hiszpanii, nie do końca zadowolona ze współpracy z influencerami, stworzyła wirtualną influencerkę, 25-letnią Aitanę, która teraz zarabia do 10 tys. euro miesięcznie. Podobno nigdy nie zawodzi, a współpracując z nią agencja nie ryzykuje, że projekt dla klienta może zostać przerwany. - Influencerzy wykreowani przez AI to niekoniecznie alternatywa dla tych realnych. Wszyscy będą w przyszłości funkcjonowali równolegle, a jedni i drudzy będą mieli swoją własną charakterystykę oraz korzyści z niej wynikające. Ci prawdziwi influencerzy wciąż będą mieli jedną ważną cechę, którą trudno będzie im odebrać, ale którą na pewno będą musieli jeszcze bardziej pielęgnować, czyli autentyczność - uważa Rafał Lampasiak.", "link": "https://www.wirtualnemedia.pl/artykul/wirtualna-influencerka-aitana-zarabia-10-tys-euro-miesiecznie", "date_published": "2023-12-02T06:07:31.293504+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "Wirtualne Media - Internet", "album": "Wirtualne Media - Internet", "user": null, "language": "pl-PL", "thumbnail": null, "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]