[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Remnant 2: The Awakened King DLC Review - The Final Verdict", "description": "Gunfire Games' acclaimed third-person shooter Remnant 2 has received its first paid expansion. It's exciting, given the mechanics and how it adds to the already-disturbing world of Losomn.\n\nUnfortunately, the DLC has its highs, which are good but rarely incredible, and its lows, usually erring on the side of boredom and frustration. It's fun to try out the new battles and discover some secrets. However, a few subpar weapons, recycled enemies, and all-too-familiar-looking locations are a big letdown.\n\nThose checking out the DLC as part of their initial run with the base game will have plenty to do, but it seldom reaches the same highs. On its own, it's hard to recommend to all but the most hardcore Remnant 2 player.", "link": "https://www.youtube.com/watch?v=wmwNBNH9KgU", "date_published": "2023-12-02T18:00:32+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/wmwNBNH9KgU/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Is This Remaster of A 23 Year Old Game Worth It? (Turok 3: Shadow of Oblivion Remastered Review)", "description": "Originally released in 2000, Turok 3: Shadows of Oblivion is a classic shooter following up on the events of its predecessor. The game continues the series trend of featuring entertaining single player campaigns with inventive weapons that are a lot of fun to play around with. Add in the fact that there are multiple characters to play as, with each featuring their own weapon upgrade options, the title offers up a lot of replayability.\n\nThe only downside to the remaster of Turok 3: Shadows of Oblivion is the fact that the original game’s local multiplayer modes didn’t make the jump to modern systems. Aside from that, the remaster is excellent; it features sharper visuals while still maintaining its retro art style, and despite its bigger focus on the story, the game doesn’t waste too much of your time before throwing you into the action.", "link": "https://www.youtube.com/watch?v=yrX8k_U4N30", "date_published": "2023-12-02T14:30:30+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/yrX8k_U4N30/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Cyberpunk 2077 2.1 Update - 10 BIGGEST Gameplay Changes You Need To Know", "description": "It's been said often enough, but these three years since Cyberpunk 2077 have been excruciatingly long for fans and the development team. Numerous updates have been released, adding new features and fixes, but following Update 2.0 and Phantom Liberty, it seemed like support for the first-person action RPG was well and truly over.\n\nThat is, until CD Projekt RED confirmed Update 2.1, also launching on December 5th alongside the Ultimate Edition for Xbox Series X/S, PS5 and PC. It promised some “hotly anticipated” gameplay elements, which is an understatement based on the developer's recent Twitch stream. \n\nHere are the ten biggest things you need to know about the update, though beware of spoilers for the base game's story. This isn't everything in the update, so expect other surprises when it goes live.", "link": "https://www.youtube.com/watch?v=R5Yyupf4zVk", "date_published": "2023-12-02T09:45:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i3.ytimg.com/vi/R5Yyupf4zVk/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]