[{"page_rating_votes": 0, "comments": [], "user": null, "artist": "GamingBolt", "page_rating_visits": 0, "source_obj__id": 208, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "thumbnail": "https://i2.ytimg.com/vi/QMsPGFntmQ0/hqdefault.jpg", "date_published": "2024-02-19T22:30:07+00:00", "page_rating": 0, "title": "The Story of Red XIII So Far - Before You Begin Final Fantasy 7 Rebirth", "permanent": false, "album": "", "page_rating_contents": 0, "tags": [], "link": "https://www.youtube.com/watch?v=QMsPGFntmQ0", "dead": false, "age": null, "description": "Red XIII might not be as prominent of a character as other Final Fantasy 7 Remake cast like Cloud or Tifa, but for fans of the game, he’s still an invaluable part of that universe. A lot of that is down to his unique and instantly eye-catching design, of course, but beyond that, he also has benefits from excellent characterization and a captivating backstory- something that proven in 2020’s Final Fantasy 7 Remake, in spite of the fact that he really only had quite a small part to play in that game. \n\nIn its upcoming sequel, however, he’s going to take on a much more important role, so here, we’re going to shine the spotlight on him, his past, and his future.", "language": null, "vote": 0, "bookmarked": false}, {"page_rating_votes": 0, "comments": [], "user": null, "artist": "GamingBolt", "page_rating_visits": 0, "source_obj__id": 208, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "thumbnail": "https://i1.ytimg.com/vi/tv6VSEnWy7I/hqdefault.jpg", "date_published": "2024-02-19T18:00:27+00:00", "page_rating": 0, "title": "Final Fantasy 7 Rebirth – 10 Remake MISTAKES We Hope Won’t Be Repeated", "permanent": false, "album": "", "page_rating_contents": 0, "tags": [], "link": "https://www.youtube.com/watch?v=tv6VSEnWy7I", "dead": false, "age": null, "description": "With Final Fantasy 7 Rebirth, the developer is poised to deliver a bigger, better experience than Remake. There's more side content, characters, environments, activities and combat tactics to embrace, and the hype is palpable.\n\nHowever, Final Fantasy 7 Remake wasn't perfect. Several issues with its pacing, certain level layouts and graphics on PS4 were severe enough to be called out, even by ardent players. The question is whether Rebirth has learned enough from the first part's mistakes to avoid repeating them.\n\nLet's examine ten such mistakes here.", "language": null, "vote": 0, "bookmarked": false}, {"page_rating_votes": 0, "comments": [], "user": null, "artist": "GamingBolt", "page_rating_visits": 0, "source_obj__id": 208, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "thumbnail": "https://i4.ytimg.com/vi/SZFf7Q3QMTY/hqdefault.jpg", "date_published": "2024-02-19T11:15:15+00:00", "page_rating": 0, "title": "Skull And Bones Review - A Massive Disappointment", "permanent": false, "album": "", "page_rating_contents": 0, "tags": [], "link": "https://www.youtube.com/watch?v=SZFf7Q3QMTY", "dead": false, "age": null, "description": "After years of delays, reported reboots, controversies and numerous studio departures, Skull and Bones is here. As a $70 \"quadruple-A\" live service title, it's all about sailing around during the Golden Age of Piracy and making a name for yourself.\n\nUnfortunately, you're one of many other Kingpins in this forgettable story, with most of your tasks revolving around delivering items and destroying other ships. While the combat and sailing are decent, the gameplay gets repetitive quickly due to a lack of variety, unimaginative objectives and tedious back and forth, and that's before the end game.\n\nWhen the best thing you can say is \"not a complete mess,\" you know there are fundamental problems.", "language": null, "vote": 0, "bookmarked": false}]