[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T23:19:13.550270+00:00", "description": "Oracle cofounder Larry Ellison envisions AI as the backbone of a new era of mass surveillance, positioning Oracle as a key player in AI infrastructure through its unique networking architecture and partnerships with AWS and Microsoft. The Register reports: Ellison made the comments near the end of an hour-long chat at the Oracle financial analyst meeting last week during a question and answer session in which he painted Oracle as the AI infrastructure player to beat in light of its recent deals with AWS and Microsoft. Many companies, Ellison touted, build AI models at Oracle because of its \"unique networking architecture,\" which dates back to the database era.\n \n\"AI is hot, and databases are not,\" he said, making Oracle's part of the puzzle less sexy, but no less important, at least according to the man himself - AI systems have to have well-organized data, or else they won't be that valuable. The fact that some of the biggest names in cloud computing (and Elon Musk's Grok) have turne", "id": 1157241, "language": null, "link": "https://developers.slashdot.org/story/24/09/16/213256/ellison-declares-oracle-all-in-on-ai-mass-surveillance?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Ellison Declares Oracle 'All In' On AI Mass Surveillance", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T22:14:40.681187+00:00", "description": "An anonymous reader quotes a report from ZDNet, written by Steven Vaughan-Nichols: In a candid keynote chat at the Linux Foundation's Open Source Summit Europe, Linux creator Linus Torvalds shared his thoughts on kernel development, the integration of Rust, and the future of open source. Dirk Hohndel, Verizon's Open Source Program Office head and Torvalds friend, moderated their conversation about the Linux ecosystem. Torvalds emphasized that kernel releases, like the recent 6.11 version, are intentionally not exciting. \"For almost 15 years, we've had a very good regular cadence of releases,\" he explained. With releases every nine weeks, this regularity aims for timeliness and reliability rather than flashy new features. The Linux creator noted that while drivers still make up the bulk of changes, core kernel development continues to evolve. \"I'm still surprised that we're doing very core development,\" Torvalds said, mentioning ongoing work in virtual file systems and memory managemen", "id": 1157000, "language": null, "link": "https://linux.slashdot.org/story/24/09/16/2047217/linus-torvalds-muses-about-maintainer-gray-hairs-next-king-of-linux?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Linus Torvalds Muses About Maintainer Gray Hairs, Next 'King of Linux'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T22:14:40.595738+00:00", "description": "Apple today is rolling out iOS 18, introducing support for Rich Communications Services (RCS) to enhance messaging between iPhone and Android devices with features like typing indicators, read receipts, and higher resolution media. \"However, there continues to be no end-to-end encryption (E2EE), with work towards that between Android and iOS continuing,\" notes 9to5Google. The feature will be enabled by default on iPhones with major U.S. carriers supported, but smaller MVNOs are not yet included.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=iOS+18+Rolling+Out+RCS+To+the+iPhone+For+Better+Android+Messaging%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F09%2F16%2F2057240%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F09%2F16%2F2057240%2Fios-", "id": 1156999, "language": null, "link": "https://apple.slashdot.org/story/24/09/16/2057240/ios-18-rolling-out-rcs-to-the-iphone-for-better-android-messaging?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "iOS 18 Rolling Out RCS To the iPhone For Better Android Messaging", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T21:10:07.989453+00:00", "description": "AI pioneers have issued a stark warning about the technology's potential risks, calling for urgent global oversight. At a recent meeting in Venice, scientists from around the world discussed the need for a coordinated international response to AI safety concerns. The group proposed establishing national AI safety authorities to monitor and register AI systems, which would collaborate to define red flags such as self-replication or intentional deception capabilities. The report adds: Scientists from the United States, China, Britain, Singapore, Canada and elsewhere signed the statement. Among the signatories was Yoshua Bengio, whose work is so often cited that he is called one of the godfathers of the field. There was Andrew Yao, whose course at Tsinghua University in Beijing has minted the founders of many of China's top tech companies. Geoffrey Hinton, a pioneering scientist who spent a decade at Google, participated remotely. All three are winners of the Turing Award, the equivalent", "id": 1156735, "language": null, "link": "https://slashdot.org/story/24/09/16/198242/ai-pioneers-call-for-protections-against-catastrophic-risks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Pioneers Call for Protections Against 'Catastrophic Risks'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T21:10:07.896439+00:00", "description": "The U.S. government said Monday that it has issued fresh financial sanctions against five individuals and a corporate entity associated with spyware-making consortium Intellexa, months after the government sanctioned its founder. From a report: In its latest statement, the U.S. Treasury said it sanctioned the five people, including senior Intellexa executives and associates, who are alleged to be involved in the sale of Intellexa's phone spyware, dubbed Predator, to authoritarian governments. Predator can be used to hack into fully patched phones nearly invisibly, allowing the organization that deployed the spyware to obtain complete access to the target's device, including their private messages and real-time location. The Treasury said the spyware has been used to target U.S. government officials, journalists, and opposition politicians. \n\nThe sanctions include Felix Bitzios, who owns an Intellexa consortium company that the Treasury says was used to supply Predator spyware to an un", "id": 1156734, "language": null, "link": "https://news.slashdot.org/story/24/09/16/1917216/us-government-expands-sanctions-against-spyware-maker-intellexa?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Government Expands Sanctions Against Spyware Maker Intellexa", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T20:04:24.064651+00:00", "description": "Linux creator Linus Torvalds has released version 6.11 of the open-source operating system kernel. The new release, while not considered major by Torvalds, introduces several notable improvements for AMD hardware users and Arch Linux developers. ZDNet: This latest version introduces several enhancements, particularly for AMD hardware users, while offering broader system improvements and new capabilities. These include:\nRDNA4 Graphics Support: The kernel now includes baseline support for AMD's upcoming RDNA4 graphics architecture. This early integration bodes well for future AMD GPU releases, ensuring Linux users have day-one support.\nCore Performance Boost: The AMD P-State driver now includes handling for AMD Core Performance Boost. This driver gives AMD Core users more granular control over turbo and boost frequency ranges.\nFast Collaborative Processor Performance Control (CPPC) Support: Overclockers who want the most power possible from their computers will be happy with this improv", "id": 1156287, "language": null, "link": "https://linux.slashdot.org/story/24/09/16/1928224/linux-kernel-611-is-out?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Linux Kernel 6.11 is Out", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T19:01:23.616721+00:00", "description": "Intel lost a bid to design and manufacture Sony's PlayStation 6 chip in 2022, dealing a blow to its contract manufacturing business. The contract, worth potentially billions in revenue, went to rival AMD after Intel failed to agree on pricing with Sony, Reuters reported Monday. \n\nDiscussions between the companies spanned months and involved top executives. Intel's loss has hampered CEO Pat Gelsinger's turnaround strategy, which hinges on expanding the company's foundry operations. The PlayStation deal would have provided steady business for Intel's struggling manufacturing arm, which reported $7 billion in operating losses last quarter. Sony's need for backwards compatibility with older PlayStation models complicated Intel's bid, as AMD designed chips for previous console generations, the report adds. \n\nFurther reading:\nIntel Foundry Achieves Major Milestones;\nIntel Weighs Options Including Foundry Split To Stem Losses:\nIntel's Money Woes Throw Biden Team's Chip Strategy Into Turmoil.", "id": 1155863, "language": null, "link": "https://games.slashdot.org/story/24/09/16/174231/how-intel-lost-the-sony-playstation-business?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How Intel Lost the Sony PlayStation Business", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T19:01:23.364235+00:00", "description": "Amazon is instructing corporate staffers to spend five days a week in the office, CEO Andy Jassy wrote in a memo on Monday. From a report: The decision marks a significant shift from Amazon's earlier return-to-work stance, which required corporate workers to be in the office at least three days a week. Now, the company is giving employees until Jan. 2 to start adhering to the new policy. Corporate employees will be expected to be in the office five days a week \"outside of extenuating circumstances\" or unless they've been granted an exception by their organization's S-team leader, Jassy said, referring to the close-knit group of executives that report to Amazon's CEO. \n\n\"Before the pandemic, it was not a given that folks could work remotely two days a week, and that will also be true moving forward -- our expectation is that people will be in the office outside of extenuating circumstances,\" Jassy said. Amazon also plans to simplify its corporate structure by having fewer managers in o", "id": 1155862, "language": null, "link": "https://slashdot.org/story/24/09/16/1845223/amazon-ceo-tells-employees-to-return-to-office-five-days-a-week?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon CEO Tells Employees To Return To Office Five Days a Week", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T17:55:29.966303+00:00", "description": "Retraction Watch: A Nobel prize-winning genetics researcher has retracted two more papers, bringing his total to 13. Gregg Semenza, a professor of genetic medicine and director of the vascular program at Johns Hopkins' Institute for Cell Engineering in Baltimore, shared the 2019 Nobel prize in physiology or medicine for \"discoveries of how cells sense and adapt to oxygen availability.\" Since pseudonymous sleuth Claire Francis and others began using PubPeer to point out potential duplicated or manipulated images in Semenza's work in 2019, the researcher has retracted 12 papers. A previous retraction from 2011 for a paper co-authored with Naoki Mori -- who with 31 retractions sits at No. 25 on our leaderboard -- brings the total to 13.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Nobel+Prize-Winner+Tallies+Two+More+Retractions%2C+Bringing+Total+To+13%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F09%2F16%2F143", "id": 1155511, "language": null, "link": "https://science.slashdot.org/story/24/09/16/1433245/nobel-prize-winner-tallies-two-more-retractions-bringing-total-to-13?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Nobel Prize-Winner Tallies Two More Retractions, Bringing Total To 13", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T16:50:26.554124+00:00", "description": "Microsoft has abandoned plans to overhaul its Edge browser interface, scrapping the design choice unveiled in February 2023. The redesign -- featuring a sleeker look with rounded tab buttons and increased blur effects -- aimed to give Edge a distinct identity as the company pushed into AI services. The new design never officially launched and the company has no intention to launch it later, according to Microsoft-focused news outlet Windows Central. \n\nA Microsoft spokesperson confirmed to Windows Central that the company is moving away from the rounded tabs concept. Some elements of the redesign will remain, including webpage borders and a repositioned user button, but the majority of the proposed changes have been shelved. The decision marks a retreat from Microsoft's efforts to visually differentiate Edge from Google Chrome and align it with Windows 11's design language.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?sta", "id": 1154951, "language": null, "link": "https://it.slashdot.org/story/24/09/16/1420225/microsoft-has-scrapped-edges-big-ui-refresh-with-rounded-tabs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Has Scrapped Edge's Big UI Refresh With Rounded Tabs", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T16:50:26.468989+00:00", "description": "Apple has increased its out-of-warranty battery replacement fee for iPhone 16 Pro models. From a report: Apple Stores can replace the battery inside an iPhone 16 Pro or iPhone 16 Pro Max for $119 in the U.S., which is up from $99 for the iPhone 15 Pro and iPhone 15 Pro Max. This is a 20% increase to the fee, which includes the cost of a new battery and service by an Apple Store. The fee may vary at third-party Apple Authorized Service Providers. The fee remains $99 for the standard iPhone 16 and iPhone 16 Plus. Customers with AppleCare+ can still get an iPhone 16 Pro battery replaced for free, but only if the battery retains less than 80% of its original capacity. \n\nApple says all four iPhone 16 models are equipped with larger batteries, and all of the devices received an internal redesign for improved heat dissipation, according to the company. A metal enclosure was rumored for at least some iPhone 16 batteries, but we are still waiting for teardowns to get a proper look inside of th", "id": 1154950, "language": null, "link": "https://apple.slashdot.org/story/24/09/16/1425237/apple-charging-20-more-to-replace-batteries-in-iphone-16-pro-models?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Charging 20% More To Replace Batteries in iPhone 16 Pro Models", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T15:25:12.650594+00:00", "description": "China will \"gradually raise\" its retirement age for the first time since the 1950s, as the country confronts an ageing population and a dwindling pension budget. From a report: The top legislative body on Friday approved proposals to raise the statutory retirement age from 50 to 55 for women in blue-collar jobs, and from 55 to 58 for females in white-collar jobs. Men will see an increase from 60 to 63. China's current retirement ages are among the lowest in the world. \n\nAccording to the plan passed on Friday, the change will set in from 1 January 2025, with the respective retirement ages raised every few months over the next 15 years, said Chinese state media. Retiring before the statutory age will not be allowed, state news agency Xinhua reported, although people can extend their retirement by no more than three years. Starting 2030, employees will also have to make more contributions to the social security system in order to receive pensions. By 2039, they would have to clock 20 yea", "id": 1154449, "language": null, "link": "https://slashdot.org/story/24/09/16/147243/china-raises-retirement-age-for-first-time-since-1950s?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China Raises Retirement Age For First Time Since 1950s", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T15:25:12.567130+00:00", "description": "Ming-Chi Kuo, a high-profile and reliable Apple analyst, says the demand for the iPhone 16 Pro and iPhone 16 Pro Max has been \"lower than expected\" since the devices became available to pre-order in the U.S. and dozens of other countries on Friday. From a report: Kuo said his data is based on a \"supply chain survey\" and shipping estimates listed on Apple's online store. Kuo estimated that sales of all four iPhone 16 models reached about 37 million units in the first weekend after Apple began accepting pre-orders, which is down nearly 13% compared to first-weekend sales of the iPhone 15 series last year. The analyst said a key factor for the decline is the lower demand for the Pro models, with first-weekend sales of the iPhone 16 Pro and iPhone 16 Pro Max estimated to be down 27% and 16%, respectively, compared to iPhone 15 Pro and iPhone 15 Pro Max sales during the equivalent period last year.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http:/", "id": 1154448, "language": null, "link": "https://mobile.slashdot.org/story/24/09/16/1413218/iphone-16-pro-demand-has-been-lower-than-expected-analyst-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "iPhone 16 Pro Demand Has Been Lower Than Expected, Analyst Says", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T14:21:04.414223+00:00", "description": "NASA will coordinate with U.S. government stakeholders, partners, and international standards organizations to establish a Coordinated Lunar Time (LTC) following a policy directive from the White House in April. From a report: The agency's Space Communication and Navigation (SCaN) program is leading efforts on creating a coordinated time, which will enable a future lunar ecosystem that could be scalable to other locations in our solar system. The lunar time will be determined by a weighted average of atomic clocks at the Moon, similar to how scientists calculate Earth's globally recognized Coordinated Universal Time (UTC). Exactly where at the Moon is still to be determined, since current analysis indicates that atomic clocks placed at the Moon's surface will appear to 'tick' faster by microseconds per day. A microsecond is one millionth of a second. NASA and its partners are currently researching which mathematical models will be best for establishing a lunar time. To put these numbe", "id": 1154043, "language": null, "link": "https://science.slashdot.org/story/24/09/16/1359252/nasa-to-develop-lunar-time-standard-for-exploration-initiatives?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA To Develop Lunar Time Standard for Exploration Initiatives ", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T13:10:38.786213+00:00", "description": "On Tuesday Ivanti issued a \"high severity vulnerability\" announcement for version 4.6 of its Cloud Service Appliance (or CSA). \"Successful exploitation could lead to unauthorized access to the device running the CSA.\" And Friday that announcement got an update: Ivanti \"has confirmed exploitation of this vulnerability in the wild.\" \n\nWhile Ivanti released a security update, they warned that \"with the end-of-life status this is the last fix that Ivanti will backport for this version. Customers must upgrade to Ivanti CSA 5.0 for continued support.\" \n\nThis prompted a response from CISA (the Cybersecurity and Infrastructure Security Agency, part of the U.S. Department of Homeland Security). The noted that Ivanti is urging customers to upgrade to version 5.0, as \"Ivanti no longer supports CSA 4.6 (end-of-life).\" But in addition, CISA \"ordered all federal civilian agencies to remove CSA 4.6. from service or upgrade to the 5.0. by October 4,\" reports the Record:\n\n\nIvanti said users will know ", "id": 1153486, "language": null, "link": "https://it.slashdot.org/story/24/09/16/0536231/multiple-attacks-force-cisa-to-order-us-agencies-to-upgrade-or-remove-end-of-life-ivanti-appliance?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Multiple Attacks Force CISA to Order US Agencies to Upgrade or Remove End-of-Life Ivanti Appliance", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T09:53:51.904990+00:00", "description": "An EFF article calls out a \"brazen attempt to privatize\" a wireless frequency band (900 MHz) which America's FCC's left \" as a commons for all... for use by amateur radio operators, unlicensed consumer devices, and industrial, scientific, and medical equipment.\" The spectrum has also become \"a hotbed for new technologies and community-driven projects. Millions of consumer devices also rely on the range, including baby monitors, cordless phones, IoT devices, garage door openers.\"\n\nBut NextNav would rather claim these frequencies, fence them off, and lease them out to mobile service providers. This is just another land-grab by a corporate rent-seeker dressed up as innovation. EFF and hundreds of others have called on the FCC to decisively reject this proposal and protect the open spectrum as a commons that serves all. \n\nNextNav [which sells a geolocation service] wants the FCC to reconfigure the 902-928 MHz band to grant them exclusive rights to the majority of the spectrum... This prop", "id": 1152462, "language": null, "link": "https://yro.slashdot.org/story/24/09/16/0059226/eff-decries-brazen-land-grab-attempt-on-900-mhz-commons-frequency-used-by-amateur-radio?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EFF Decries 'Brazen Land-Grab' Attempt on 900 MHz 'Commons' Frequency Used By Amateur Radio", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T04:25:55.973655+00:00", "description": "Flappy Bird's original creator hasn't posted anything on social media since 2017. Until today. \n\n\"This morning, the game's creator Dong Nguyen posted a characteristically terse comment stating that he has nothing to do with the revival,\" report TechCrunch, \"and that he 'did not sell anything.' He added, 'I also don't support crypto'... The post makes it clear that Nguyen is not involved with the new project, and that he doesn't seem particularly happy about it.\"\nAs for Nguyen's reference to crypto, while the foundation's current PR materials don't mention anything crypto-related, Varun Biniwale did some digging around hidden pages on the Flappy Bird Foundation website and found a reference to Flappy Bird flying \"higher than ever on Solana as it soars into Web 3.0,\" though it's not clear whether that refers to upcoming features or abandoned plans. \n\nMore from Fortune:\nExactly what is going to happen with this zombified version of Flappy Bird is unclear, but digging through data and fil", "id": 1151495, "language": null, "link": "https://games.slashdot.org/story/24/09/16/025251/original-flappy-bird-creator-disavows-new-version---and-its-possible-crypto-ties?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Original 'Flappy Bird' Creator Disavows New Version - and Its Possible Crypto Ties", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T02:16:58.013754+00:00", "description": "For 30 days, 17,000 AT&amp;T workers in nine different states from the CWA union went on strike. As it began one North Carolina newspaper noted some AT&amp;T customers \"report prolonged internet outages.\" Last week an Emory University economist told NPR that \"If it wasn't disruptive or it didn't have any kind of negative element towards customers, then AT&amp;T, I suspect, wouldn't feel any kind of pressure to negotiate.\" \n\nThe 30-day strike was \"the longest telecommunications strike in the region's history,\" according to the union &mdash; announcing today that they'd now negotiated \"strong tentative contract agreements\" and that workers would report to work for their scheduled shifts tomorrow.\nThe new contract in the Southeast covers 17,000 workers technicians, customer service representatives and others who install, maintain and support AT&amp;T's residential and business wireline telecommunications network in Alabama, Florida, Georgia, Kentucky, Louisiana, Mississippi, North Caroli", "id": 1151190, "language": null, "link": "https://tech.slashdot.org/story/24/09/16/0127232/17000-att-workers-end-the-southeasts-longest-telecommunications-strike-after-30-days?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "17,000 ATT Workers End the Southeast's Longest Telecommunications Strike After 30 Days", "vote": 0}]