[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T19:00:24+00:00", "description": "Satisfactory is a visually beautiful and aesthetically enthralling title that will have gamers sinking hours into exploring the vibrant and colorful planet of Massage-2(Ab)b.  There's a lot of fun to be had building an intricate and vast factory, all while reaping the incentives such as every new weapon, vehicle, and building that becomes available as the game progresses. \n\nWhilst there is scope in the long term for developing certain elements of the story further, there is a great gaming experience here to uncover, offering players a lot in terms of gameplay variety, reward, and… satisfaction.", "id": 1156179, "language": null, "link": "https://www.youtube.com/watch?v=PBkuld8Mb7U", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/PBkuld8Mb7U/hqdefault.jpg", "title": "Satisfactory Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T16:00:20+00:00", "description": "Polish developer Bloober Team face the unenviable task of remaking one of the most dreamlike, downright nebulous horror games in existence. Their goal in remaking Silent Hill 2 has of course been to honour the original whilst putting their own stamp on it, but it’s their approach to achieving this which takes the limelight in this video. \n\nIn short, they’re harnessing memories, reinterpreting our thoughts and how we collectively remember feeling when creeping through the fog-strewn abandoned streets for the first time. \n\nIt’s no easy task but given the thoughtful innovations to gameplay and setting whilst keeping narrative and character fundamentals largely unchanged, Silent Hill 2 is set to coexist with the original nicely and be an exceptional remake in the process.", "id": 1155211, "language": null, "link": "https://www.youtube.com/watch?v=PdppgqyPCfg", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/PdppgqyPCfg/hqdefault.jpg", "title": "Despite All the Odds Against It, Silent Hill 2 Remake Is Shaping Up to Be A Cracking Experience", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-16T09:30:09+00:00", "description": "The response to Sony's pricing of the PlayStation 5 Pro is less than ideal (to put it nicely). While rumors ran rampant over the mid-gen console for months, with many hoping it would lead to the arrival of next-gen gaming, it's more of a luxury device, and that's before factoring in the additional costs for a disc drive and vertical stand.\n\nWhile the hardware reveal wasn't awful, the lack of any real jump in the CPU has drawn some criticism. Above all, it fuels arguments regarding Rockstar's Grand Theft Auto 6 and how it won't run in 60 frames per second on the console. Leave aside that we haven't seen any extensive gameplay for the title, there's no indication that this is the case.\n\nLet's dive deeper into the argument about GTA 6 not running at 60 FPS on PS5 Pro and why it's a little overblown.", "id": 1152653, "language": null, "link": "https://www.youtube.com/watch?v=SexTEF7X2BI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/SexTEF7X2BI/hqdefault.jpg", "title": "Why The \"GTA 6 Not Hitting 60 FPS On PS5 Pro\" Argument IS OVERBLOWN", "vote": 0}]