[{"comments": [], "source_obj__id": 208, "link": "https://www.youtube.com/watch?v=c-wZxJZ5Vjg", "dead": false, "date_published": "2024-01-26T19:00:24+00:00", "description": "Survival crafting is hardly a niche genre in this day and age, with a few coming out just about every month. Despite most games in the genre withering away, however, Enshrouded might end up being one of the rare titles that bucks the trend thanks to its refinement of genre conventions, as well as an emphasis on combat-oriented encounters with its action RPG gameplay.\n\nWhile Enshrouded doesn’t really bring anything brand new to the genre, the game is able to make expert use of tried-and-tested genre conventions, as well as an interesting emphasis on character progression. Despite the Early Access tag, Enshrouded doesn’t feel like it needs too much more time in development, but rather, just some polish for its rougher edges.", "page_rating_votes": 0, "language": null, "tags": [], "page_rating": 0, "permanent": false, "page_rating_visits": 0, "user": null, "thumbnail": "https://i4.ytimg.com/vi/c-wZxJZ5Vjg/hqdefault.jpg", "artist": "GamingBolt", "age": null, "bookmarked": false, "vote": 0, "title": "Enshrouded Early Access Review", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": ""}, {"comments": [], "source_obj__id": 208, "link": "https://www.youtube.com/watch?v=BIVZ_0eSF_0", "dead": false, "date_published": "2024-01-26T13:30:06+00:00", "description": "Tekken 8 continues the series' tradition of being extremely accessible for newcomers while boasting tons of depth for fighting game fans to sink hundreds of hours into. With the addition of Heat and recoverable health, not to mention new techniques, it may seem a bit much for those diving into the series for the first time.\n\nFortunately, the sequel offers several options to help new players and veterans. Punishment Training helps nail the timing of counters on oft-used moves for characters; Frame Data is included by default, indicating attack startup frames and advantages; and Super Ghost Battle allows for improving against one's self.\n\nCheck out 15 tips and tricks you should know when playing Tekken 8. It's out on January 26th for Xbox Series X/S, PS5 and PC.", "page_rating_votes": 0, "language": null, "tags": [], "page_rating": 0, "permanent": false, "page_rating_visits": 0, "user": null, "thumbnail": "https://i3.ytimg.com/vi/BIVZ_0eSF_0/hqdefault.jpg", "artist": "GamingBolt", "age": null, "bookmarked": false, "vote": 0, "title": "15 Things Tekken 8 DOESN'T TELL YOU", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": ""}, {"comments": [], "source_obj__id": 208, "link": "https://www.youtube.com/watch?v=bbVvRa2wpo0", "dead": false, "date_published": "2024-01-26T09:30:19+00:00", "description": "Out of nowhere, Palworld has exploded onto the gaming scene to massive success. It's sold millions of copies and new records in concurrent player counts and yet isn't without controversy, whether it's some of the harsher game-breaking bugs or the allegations of plagiarising Pokemon.\n\nBetween all this, one has to wonder: Why is Palworld so popular? Why do so many people enjoy what's essentially another survival crafting title? Pokemon does enter the equation, as some may feel that it does things that it can't while presenting better visuals or a much larger scale.\n\nHowever, it also comes down to the fact that Palworld stands out enough to make it enjoyable. Whether you're traversing the world and discovering new Dungeons, collecting Pals or optimizing your base, it's an addictive gameplay loop that's ensnared millions.", "page_rating_votes": 0, "language": null, "tags": [], "page_rating": 0, "permanent": false, "page_rating_visits": 0, "user": null, "thumbnail": "https://i3.ytimg.com/vi/bbVvRa2wpo0/hqdefault.jpg", "artist": "GamingBolt", "age": null, "bookmarked": false, "vote": 0, "title": "Why Do Gamers LOVE Palworld?", "page_rating_contents": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "album": ""}]