[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T23:50:26.022008+00:00",
        "description": "Canada's Competition Bureau is suing Alphabet's Google over alleged anti-competitive conduct in online advertising, the antitrust watchdog said on Thursday. From a report: The Competition Bureau, in a statement, said it had filed an application with the Competition Tribunal seeking an order that, among other things, requires Google to sell two of its ad tech tools. It is also seeking a penalty from Google to promote compliance with Canada's competition laws, the statement said. \n\nGoogle said the complaint \"ignores the intense competition where ad buyers and sellers have plenty of choice and we look forward to making our case in court.\" [...] \"Our advertising technology tools help websites and apps fund their content, and enable businesses of all sizes to effectively reach new customers,\" Dan Taylor, VP of Global Ads, Google said in a statement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Canada's+Antitrust+Watch",
        "id": 1606660,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/28/2239218/canadas-antitrust-watchdog-sues-google-alleging-anti-competitive-conduct-in-advertising?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Canada's Antitrust Watchdog Sues Google Alleging Anti-Competitive Conduct in Advertising",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T23:50:25.937015+00:00",
        "description": "The ongoing cybersecurity incident affecting a North West England NHS group has forced sites to fall back on pen-and-paper operations. From a report: The Wirral University Teaching Hospital NHS Trust updated its official line on the incident on Wednesday evening, revealing new details about the case, but remains coy about the true nature of the attack. \n\n\"After detecting suspicious activity, as a precaution, we isolated our systems to ensure that the problem did not spread. This resulted in some IT systems being offline,\" the updated statement said. \n\n\"We have reverted to our business continuity processes and are using paper rather than digital in the areas affected. We are working closely with the national cybersecurity services and we are planning to return to normal services at the earliest opportunity.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=NHS+Major+'Cyber+Incident'+Forces+Hospitals+To+Use+Pen+and+Pap",
        "id": 1606659,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/28/2251215/nhs-major-cyber-incident-forces-hospitals-to-use-pen-and-paper?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NHS Major 'Cyber Incident' Forces Hospitals To Use Pen and Paper",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T19:31:07.505200+00:00",
        "description": "An anonymous reader shares a report: Coffee beans hit their highest price in 47 years, driven by bad weather in Vietnam and Brazil, the biggest producers of robusta and arabica beans respectively. \n\nBrazil saw its worst drought in 70 years this year followed by heavy rains, raising fears that next season's output will drop, further pinching already tight global supplies. Vietnam has itself had three years of low output. \n\nArabica beans hit $3.18 a pound on Wednesday, leading Nestle, the world's biggest coffee company, to increase prices. As well as climate concerns, future prices are being raised by worries about tariffs: Roasters \"will try to import now, because otherwise you will be paying tariffs later,\" one trade analyst told the Financial Times.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Coffee+at+Highest+Price+in+47+years%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F28%2F1831249%2F%3Futm_source%",
        "id": 1605606,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/28/1831249/coffee-at-highest-price-in-47-years?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Coffee at Highest Price in 47 years",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T16:15:42.772274+00:00",
        "description": "Central bank support for digital currencies appears to have fallen sharply, with only 13% of central bankers surveyed by OMFIF Digital Monetary Institute backing CBDCs as a cross-border payment solution, down from 31% in 2023. \n\nThe survey found just 10% of respondents are actively developing CBDCs, compared with 21% last year. The decline comes despite major initiatives including the Bank for International Settlements' Project Agora and China's Project mBridge. The BIS recently withdrew from mBridge, creating a potential split between Western and emerging market payment systems. Nearly half of surveyed bankers favor improving existing instant payment infrastructure over CBDCs.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Even+Central+Banks+Are+Losing+Faith+in+CBDCs%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F11%2F28%2F168214%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/",
        "id": 1604573,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/28/168214/even-central-banks-are-losing-faith-in-cbdcs?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Even Central Banks Are Losing Faith in CBDCs",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T15:11:52.379269+00:00",
        "description": "Australia will ban children under 16 from using social media after its senate approved what will become a world-first law. From a report: Children will be blocked from using platforms including TikTok, Instagram, Snapchat and Facebook, a move the Australian government argue is necessary to protect their mental health and wellbeing. \n\nThe online safety amendment (social media minimum age) bill will impose fines of up to 50 million Australian dollars ($32.5 million) on platforms for systemic failures to prevent young children from holding accounts. It would take effect a year after the bill becomes law, allowing platforms time to work out technological solutions that would also protect users' privacy. The senate passed the bill 34 votes to 19. The house of representatives overwhelmingly approved the legislation 102 votes to 13 on Wednesday.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Australia+To+Ban+Under-16s+Fro",
        "id": 1604126,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/11/28/1316247/australia-to-ban-under-16s-from-social-media-after-passing-landmark-law?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Australia To Ban Under-16s From Social Media After Passing Landmark Law",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T15:11:52.294974+00:00",
        "description": "Record numbers of plastic industry lobbyists are attending global talks that are the last chance to hammer out a treaty to cut plastic pollution around the world. From a report: The key issue at the conference will be whether caps on global plastic production will be included in the final UN treaty. Lobbyists and leading national producers are furiously arguing against any attempt to restrain the amount that can be produced, leaving the talks on a knife-edge. \n\nNew analysis by the Center for International Environmental Law (CIEL) shows 220 fossil fuel and chemical industry representatives -- more plastic producers than ever -- are represented at the UN talks in Busan, South Korea. Taken as a group, they would be the biggest delegation at the talks, with more plastic industry lobbyists than representatives from the EU and each of its member states, (191) or the host country, South Korea (140), according to the Centre for International Environmental Law. Their numbers overwhelm the 89 ",
        "id": 1604125,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/28/1454234/plastics-lobbyists-make-up-biggest-group-at-vital-un-treaty-talks?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Plastics Lobbyists Make Up Biggest Group at Vital UN Treaty Talks",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T14:06:03.641723+00:00",
        "description": "Longtime Slashdot reader AmiMoJo shares a report from Phys.org: Researchers from Imperial College London have discovered that a space-returned sample from asteroid Ryugu was rapidly colonized by terrestrial microorganisms, even under stringent contamination control measures. In the study, [...] researchers analyzed sample A0180, a tiny (1 x 0.8 mm) particle collected by the JAXA Hayabusa 2 mission from asteroid Ryugu.\n \nTransported to Earth in a hermetically sealed chamber, the sample was opened in nitrogen in a class 10,000 clean room to prevent contamination. Individual particles were picked with sterilized tools and stored under nitrogen in airtight containers. Before analysis, the sample underwent Nano-X-ray computed tomography and was embedded in an epoxy resin block for scanning electron microscopy. Rods and filaments of organic matter, interpreted as filamentous microorganisms, were observed on the sample's surface. Variations in size and morphology of these structures resembl",
        "id": 1603375,
        "language": null,
        "link": "https://science.slashdot.org/story/24/11/28/0147219/ryugu-asteroid-sample-rapidly-colonized-by-terrestrial-life?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Ryugu Asteroid Sample Rapidly Colonized By Terrestrial Life",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T14:06:03.400188+00:00",
        "description": "An anonymous reader quotes a report from Space.com: NASA scientists conducting surveys of arctic ice sheets in Greenland got an unprecedented view of an abandoned \"city under the ice\" built by the U.S. military during the Cold War. During a scientific flight in April 2024, a NASA Gulfstream III aircraft flew over the Greenland Ice Sheet carrying radar instruments to map the depth of the ice sheet and the layers of bedrock below it. The images revealed a new view of Camp Century, a Cold War-era U.S. military base consisting of a series of tunnels carved directly into the ice sheet.\n \nAs it turns out, this abandoned \"secret city\" was the site of a secret Cold War project known as Project Iceworm which called for the construction of 2,500 miles (4,023 km) of tunnels that could be used to nuclear intermediate range ballistic missiles (IRBMs) at the Soviet Union. \"We were looking for the bed of the ice and out pops Camp Century. We didn't know what it was at first,\" said NASA's Chad Green",
        "id": 1603374,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/11/28/076204/nasa-aircraft-uncovers-cold-war-nuclear-missile-tunnels-under-greenland-ice?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "NASA Aircraft Uncovers Cold War Nuclear Missile Tunnels Under Greenland Ice",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T07:12:39.167043+00:00",
        "description": "A University of Birmingham study reveals that PFAS and microplastics have a synergistic effect that significantly increases their toxicity. \"The study's authors exposed water fleas to mixtures of the toxic substances and found they suffered more severe health effects, including lower birth rates, and developmental problems, such as delayed sexual maturity and stunted growth,\" reports The Guardian. From the report: The enhanced toxic effects raise alarm because PFAS and microplastics are researched and regulated in isolation from one one another, but humans are virtually always exposed to both. The research also showed those fleas previously exposed to chemical pollution were less able to withstand the new exposures. The findings \"underscore the critical need to understand the impacts of chemical mixtures on wildlife and human health,\" wrote the study's authors, who are with the University of Birmingham in the United Kingdom.\n \nResearchers compared a group of water fleas that had neve",
        "id": 1602173,
        "language": null,
        "link": "https://science.slashdot.org/story/24/11/28/0136209/pfas-and-microplastics-become-more-toxic-when-combined-research-shows?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "PFAS and Microplastics Become More Toxic When Combined, Research Shows",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T03:57:39.489382+00:00",
        "description": "An anonymous reader quotes a report from the Associated Press: Danish lawmakers on Monday agreed on a deal to plant 1 billion trees and convert 10% of farmland into forest and natural habitats over the next two decades in an effort to reduce fertilizer usage. The government called the agreement \"the biggest change to the Danish landscape in over 100 years.\" Under the agreement, 43 billion kroner ($6.1 billion) have been earmarked to acquire land from farmers over the next two decades, the government said.\n \nDanish forests would grow on an additional 250,000 hectares (618,000 acres), and another 140,000 hectares (346,000 acres), which are currently cultivated on climate-damaging low-lying soils, must be converted to nature. Currently, 14.6% of land is covered by forests. [...] In June, the government said livestock farmers will be taxed for the greenhouse gases emitted by their cows, sheep and pigs from 2030, the first country to do so as it targets a major source of methane emissions",
        "id": 1601574,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/27/232203/denmark-will-plant-1-billion-trees-convert-10-farmland-into-forest?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Denmark Will Plant 1 Billion Trees, Convert 10% Farmland Into Forest",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T02:52:59.940463+00:00",
        "description": "A bipartisan group of 12 senators has urged the TSA inspector general to investigate the agency's use of facial recognition technology, citing concerns over privacy, civil liberties, and its expansion to over 430 airports without sufficient safeguards or proven effectiveness. Gizmodo reports: \"This technology will soon be in use at hundreds of major and mid-size airports without an independent evaluation of the technology's precision or an audit of whether there are sufficient safeguards in place to protect passenger privacy,\" the senators wrote. The letter was signed by Jeffrey Merkley (D-OR), John Kennedy (R-LA), Ed Markey (D-MA), Ted Cruz (R-TX), Roger Marshall (R-Kansas), Ron Wyden (D-OR), Steve Daines (R-MT), Elizabeth Warren (D-MA), Bernie Sanders (I-VT), Cynthia Lummis (R-WY), Chris Van Hollen (D-MD), and Peter Welch (D-VT).\n \nWhile the TSA's facial recognition program is currently optional and only in a few dozen airports, the agency announced in June that it plans to expand ",
        "id": 1601344,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/11/27/2314220/senators-say-tsas-facial-recognition-program-is-out-of-control?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Senators Say TSA's Facial Recognition Program Is Out of Control",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T01:47:49.223008+00:00",
        "description": "British Prime Minister Keir Starmer inaugurated London's first Google-funded AI Campus in Camden, aiming to equip young people with AI and machine learning skills. Reuters reports: The center, based in Camden, an area which Starmer represents in parliament and which is also home to Google's future offices in Kings Cross, has already started a two-year pilot project for local students. An first cohort of 32 people aged 16-18 will have access to resources in AI and machine learning and receive mentoring and expertise from Google's AI company DeepMind, the tech giant said. The students will tackle real-world projects connecting AI to fields such as health, social sciences and the arts at the campus, which has been established in partnership with the local authority, Google said.\n \nGoogle's UK and Ireland managing director Debbie Weinstein announced 865,000 pounds ($1.10 million) of funding for an AI literacy program across the UK. The money will be used by charities Raspberry Pi Foundat",
        "id": 1601134,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/27/2257219/google-opens-ai-campus-in-london?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google Opens AI Campus In London",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T01:47:49.098827+00:00",
        "description": "A security researcher discovered an unprotected database belonging to SL Data Services containing over 600,000 sensitive files, including criminal histories and background checks with names, addresses, and social media accounts. The Register reports: We don't know how long the personal information was openly accessible. Infosec specialist Jeremiah Fowler says he found the Amazon S3 bucket in October and reported it to the data collection company by phone and email every few days for more than two weeks. [The info service provider eventually closed up the S3 bucket, says Fowler, although he never received any response.] In addition to not being password protected, none of the information was encrypted, he told The Register. In total, the open bucket contained 644,869 PDF files in a 713.1 GB archive.\n \nSome 95 percent of the documents Fowler saw were labeled \"background checks,\" he said. These contained full names, home addresses, phone numbers, email addresses, employment, family memb",
        "id": 1601133,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/11/27/2253216/data-broker-leaves-600k-sensitive-files-exposed-online?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Data Broker Leaves 600K+ Sensitive Files Exposed Online",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T00:32:20.558543+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: Over the past decade, a new class of infections has threatened Windows users. By infecting the firmware that runs immediately before the operating system loads, these UEFI bootkits continue to run even when the hard drive is replaced or reformatted. Now the same type of chip-dwelling malware has been found in the wild for backdooring Linux machines. Researchers at security firm ESET said Wednesday that Bootkitty -- the name unknown threat actors gave to their Linux bootkit -- was uploaded to VirusTotal earlier this month. Compared to its Windows cousins, Bootkitty is still relatively rudimentary, containing imperfections in key under-the-hood functionality and lacking the means to infect all Linux distributions other than Ubuntu. That has led the company researchers to suspect the new bootkit is likely a proof-of-concept release. To date, ESET has found no evidence of actual infections in the wild.\n \nStill, Bootkitty suggests thr",
        "id": 1600863,
        "language": null,
        "link": "https://it.slashdot.org/story/24/11/27/2028231/the-worlds-first-unkillable-uefi-bootkit-for-linux?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "The World's First Unkillable UEFI Bootkit For Linux",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T00:32:20.251908+00:00",
        "description": "A U.S. federal appeals court ruled that sanctions against Tornado Cash, a crypto transaction anonymization service, must be abandoned, stating that its immutable smart contracts do not constitute \"property\" under U.S. law and that the Treasury overstepped its authority. The ruling is available here (PDF). CoinDesk reports: The decision answers a controversial privacy debate on whether the government -- via a sanctions list maintained by the U.S. Treasury Department -- has a right to target the technology because it's associated with criminals. The ruling reversed a district court's August ruling that had sided with the government's pursuit of what it had characterized as a \"notorious\" crypto-mixing service.\n \nOFAC had sanctioned Tornado Cash last year, contending that it was a vital tool used by bad actors including North Korea's Lazarus Group to launder crypto tokens pilfered from platforms and games such as Axie Infinity. Coinbase (COIN) and others had sued the government, claiming",
        "id": 1600862,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/11/27/2019239/tornado-cash-sanctions-overturned-by-us-appeals-court?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Tornado Cash Sanctions Overturned By US Appeals Court",
        "vote": 0
    }
]