[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T18:45:01+00:00",
        "description": "EA Sports has dominated the football sim scene with EA Sports FC (formerly FIFA) for as long as anyone can remember, while Konami has also enjoyed its fair share of success in the genre as well, but beyond that, competition has usually been pretty sparse- especially now. \n\nUFL, however, is a game that many have been keeping an eye on for some time now. Announced a couple of years ago, the game has actually been in development for eight, and its developer, Strikerz has made some bold and lofty promises. \n\nWhether the game can live up to them remains to be seen, but with its launch approaching, here, we’re covering some key details that you should know to get yourself prepared for what it will have in store.",
        "id": 1605632,
        "language": null,
        "link": "https://www.youtube.com/watch?v=telmY6SBzbo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/telmY6SBzbo/hqdefault.jpg",
        "title": "UFL - 13 Things You Need To Know BEFORE YOU PLAY",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T15:30:10+00:00",
        "description": "Whether it's the early days or modern gaming, survival horror usually evokes two big names - Resident Evil and Silent Hill. The 2000s had their share of new properties, including Computer Artworks' The Thing stood out. Thanks to Nightdive Studios, it's getting a remaster this year on Xbox Series X/S, PS5, PS4, Xbox One, PC, and Nintendo Switch.\n\nA release date has yet to be announced yet The Thing: Remastered will feature 4K resolution and 144 FPS support on current-gen alongside improved character models, textures, animations, lighting, and atmospheric effects. \n\nAreas that felt rough in the original will be polished up while Achievements are incoming for Xbox, PlayStation, and PC.\n\nThere's still a lot we don't know about; however, based on how underrated the original is, we felt it's a good idea to cover everything you should know about The Thing before the remaster arrives.",
        "id": 1604620,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Q97hsBb-cts",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Q97hsBb-cts/hqdefault.jpg",
        "title": "The Thing Remastered - 15 Things You NEED TO KNOW Before You Buy",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-28T13:30:02+00:00",
        "description": "As fans of the S.T.A.L.K.E.R. series will gladly tell you, the series has always boasted one of the most thriving and active modding communities out there, and appropriately enough, developer GSC Game World has ensured that S.T.A.L.K.E.R. 2 has everything in place for that trend to continue. \n\nWith the game still being only a few days old, it’s obviously going to be a while before players are able to come up with the truly elaborate mods, but already, S.T.A.L.K.E.R. 2 has a fair few mods available on PC that tweak and refine the experience in a number of different ways, from sanding out some of the technical issues to adjusting gameplay-related things and more. \n\nHere, we’re going to talk about fifteen such mods.\n\nLink to all the mods mentioned in the video:\n\nUse these mods at your own discretion:\n\nOPTIMIZED TWEAKS: https://www.nexusmods.com/stalker2heartofchornobyl/mods/7\n\nSTEALTH: https://www.nexusmods.com/stalker2heartofchornobyl/mods/100\n\nMUTANT HEALTH: https://www.nexusmods.com/",
        "id": 1603484,
        "language": null,
        "link": "https://www.youtube.com/watch?v=6jP8x6cVaiE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/6jP8x6cVaiE/hqdefault.jpg",
        "title": "15 BEST STALKER 2 PC Mods You Absolutely NEED To Try",
        "vote": 0
    }
]