[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-21T18:30:10+00:00", "description": "The Realm of Shadow is dangerous, especially for any curious Tarnished who wanders in. With Elden Ring's first (and last) expansion, Shadow of the Erdtree, players will venture to this mysterious realm. To what end remains to be seen.\n\nWith all the new enemies, bosses and hazards, navigating the world and escaping unscathed can be challenging. Fortunately, there are new weapons with unique move sets and abilities to grant a fighting chance. New Spirit Ashes can provide some much-needed backup while Incantations, armor sets, Talismans and more await.\n\nYou can also use Scadutree Fragments and Revered Spirit Ashes to improve your defense, damage and Spirit Summons. Here are some early game options for all of the above that will increase your chances of survival. Be warned, though - further horrors await deeper within.", "id": 754812, "language": null, "link": "https://www.youtube.com/watch?v=DpzznDe9OG8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/DpzznDe9OG8/hqdefault.jpg", "title": "Elden Ring: Shadow of the Erdtree - 24 Early Items You Don't Want To Miss", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-21T10:30:31+00:00", "description": "There are numerous games out there that, for one reason or another, failed to provide substantial promise. These games might have poor marketing, or maybe their pre-release demos were underwhelming. Others were made by tiny development teams that had little to no expectation on how successful their game could become. \n\nSome games on this list represent complete tonal shifts from a developer’s previous output, or presented a reboot too far removed from the hallmarks of a beloved franchise. \n\nWhatever the reason for the game’s pre-release grievances, doubters have been well and truly silenced. This video highlights 15 games that under-promised but let the game do the talking once it had been released. Many of these games have gone on to be amongst the biggest selling games ever or have garnered a cult classic status despite reviewing terribly.", "id": 751497, "language": null, "link": "https://www.youtube.com/watch?v=jszQUuwLhaw", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/jszQUuwLhaw/hqdefault.jpg", "title": "15 Games That UNDERPROMISED AND OVERDELIVERED", "user": null, "vote": 0}]