[{"permanent": false, "language": null, "page_rating_visits": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "thumbnail": "https://i2.ytimg.com/vi/Y0k3HTE3M_c/hqdefault.jpg", "description": "The VR platform was subject to a ton of skepticism when it first came out, and many players passed it off as a fad that had no real potential in the realm of video games. But the original PSVR platform and its amazing suite of games were a success for Sony. \n\nThe PSVR 2, right now, is struggling and although it doesn't have an impressive library like its predecessor, 2024 and beyond is looking to be a pretty great time for its owners. With this video we will be taking a look at 16 of the best PSVR2 games of 2024 and beyond. \n\nFrom horror to action adventures to offbeat titles, there are plenty of new games that are worth looking forward to.", "title": "16 BIG PSVR 2 Games To Look Forward To In 2024 And Beyond", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://www.youtube.com/watch?v=Y0k3HTE3M_c", "vote": 0, "page_rating_contents": 0, "source_obj__id": 208, "user": null, "artist": "GamingBolt", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T13:30:25+00:00"}, {"permanent": false, "language": null, "page_rating_visits": 0, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "thumbnail": "https://i4.ytimg.com/vi/k-5BftKBqsc/hqdefault.jpg", "description": "The more we learn about Final Fantasy 7 Rebirth and witness it in action, the more excited we get about actually getting our own hands on it and experiencing its offerings. Building on the foundation of its 2020 predecessor, the upcoming action RPG is being touted as a massive, sprawling experience, one that’s promising greater depth and breadth in content than many would have expected from the middle part of a trilogy. \n\nA significant chunk of those details have been covered here at GamingBolt in features over recent weeks, but given how much has been revealed so far, naturally, there’s plenty more left to discuss. As such, with Final Fantasy 7 Rebirth’s launch drawing every closer, here, we’re going to go over a few more tidbits that you should know about it.", "title": "Final Fantasy 7 Rebirth - 15 Things You Need To Know Before You PRE-ORDER", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://www.youtube.com/watch?v=k-5BftKBqsc", "vote": 0, "page_rating_contents": 0, "source_obj__id": 208, "user": null, "artist": "GamingBolt", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T07:00:12+00:00"}]