[{"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "An anonymous reader shared this report from the Associated Press:\n\n\nAn abrupt shutdown of Atlantic Ocean currents that could put large parts of Europe in a deep freeze is looking a bit more likely and closer than before as a new complex computer simulation finds a \"cliff-like\" tipping point looming in the future. A long-worried nightmare scenario, triggered by Greenland's ice sheet melting from global warming, still is at least decades away if not longer, but maybe not the centuries that it once seemed, a new study in Friday's Science Advances finds. \n\nThe study, the first to use complex simulations and include multiple factors, uses a key measurement to track the strength of vital overall ocean circulation, which is slowing. A collapse of the current &mdash; called the Atlantic Meridional Overturning Circulation or AMOC &mdash; would change weather worldwide because it means a shutdown of one of key the climate and ocean forces of the planet. It would plunge northwestern Eur", "title": "Computer Simulations of Atlantic Ocean Currents Finds Collapse Could Happen in Our Lifetime", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://news.slashdot.org/story/24/02/11/2141215/computer-simulations-of-atlantic-ocean-currents-finds-collapse-could-happen-in-our-lifetime?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T23:00:34.409234+00:00"}, {"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "Remember \"Servo,\" Mozilla's \"next-generation browser engine,\" focused on performance and robustness? \n\n\"The developers of Servo are starting 2024 by going all in...\" reports It's FOSS News, citing a social media post from FOSDEM. \"[T]he Servo Project team were there showing off the work done so far.\"\nIf you were not familiar, Servo is an experimental browser engine that leverages the power of Rust to provide a memory-safe and modular experience that is highly adaptable. After Mozilla created Servo back in 2012 as a research project, it saw its share of ups and downs over the years, with it making a comeback in 2023; thanks to a fresh approach by the developers on how Servo should move forward. \n\nEven though there are plenty of open source Chrome alternatives, with this, there's a chance that we will get some really cool options based on Servo that just might give Blink and Gecko a run for the money! Just a few months back, in September 2023, after The Servo Project officially", "title": "Mozilla's Abandoned Web Engine 'Servo' is Rebooting in 2024", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://news.slashdot.org/story/24/02/11/2024233/mozillas-abandoned-web-engine-servo-is-rebooting-in-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T21:50:36.895197+00:00"}, {"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "\"Mutant wolves roaming the deserted streets of Chernobyl appear to have developed resistance to cancer,\" reports Sky News, \"raising hopes the findings can help scientists fight the disease in humans.\"\n\nDr Cara Love, an evolutionary biologist and ecotoxicologist at Princeton University in the U.S., has been studying how the Chernobyl wolves survive despite generations of exposure to radioactive particles... The researchers discovered that Chernobyl wolves are exposed to upwards of 11.28 millirem of radiation every day for their entire lives &mdash; which is more than six times the legal safety limit for a human. Dr Love found the wolves have altered immune systems similar to cancer patients undergoing radiation treatment, but more significantly she also identified specific parts of the animals' genetic information that seemed resilient to increased cancer risk. \n\nThanks to long-time Slashdot reader AmiMoJo for sharing the news.<p><div class=\"share_submission\">\n<a class=\"slashp", "title": "Chernobyl's Mutant Wolves Appear To Have Developed Resistance To Cancer", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://hardware.slashdot.org/story/24/02/11/2058259/chernobyls-mutant-wolves-appear-to-have-developed-resistance-to-cancer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T21:50:35.321389+00:00"}, {"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "Thursday a climate technology startup called Twelve \"took a major step toward producing sustainable aviation fuel...\" reports Bloomberg, \"by launching its commercial-scale carbon transformation unit.\"\n\nTwelve is among the emerging companies working on ways to transform captured CO2 into useful products. In the case of the Berkeley, California-based startup, its nascent technology will be critical to cleaning up one of the hardest-to-decarbonize sectors: aviation. Twelve uses a technique called electrolysis that uses electricity to repurpose carbon dioxide and water into various products. When the electricity is generated from renewables, the process is essentially no-carbon. The company's CO2 electrochemical reactor &mdash; called OPUS &mdash; will be at the center of its first commercial production plant for sustainable aviation fuel, under construction in Moses Lake and set to be completed this year. The plant will run on hydropower and use CO2 captured from a nearby ethano", "title": "Clean Jet Fuel Startup Fires Up New Carbon Converter", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://tech.slashdot.org/story/24/02/11/0629237/clean-jet-fuel-startup-fires-up-new-carbon-converter?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T19:18:47.053011+00:00"}, {"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "Martin Hellman \"achieved legendary status as co-inventor of the Diffie-Hellman public key exchange algorithm, a breakthrough in software and computer cryptography,\" notes a new interview in InfoWorld. \n\nNine years after winning the Turing award, the 78-year-old cryptologist shared his perspective on some other issues:\n\n\n What do you think about the state of digital spying today? \n\nHellman: There's a need for greater international cooperation. How can we have true cyber security when nations are planning &mdash; and implementing &mdash; cyber attacks on one another? How can we ensure that AI is used only for good when nations are building it into their weapons systems? Then, there's the grandaddy of all technological threats, nuclear weapons. If we keep fighting wars, it's only a matter of time before one blows up. \n\nThe highly unacceptable level of nuclear risk highlights the need to look at the choices we make around critical decisions, including cyber security. We have to t", "title": "Cryptography Guru Martin Hellman Urges International Cooperation on AI, Security", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://it.slashdot.org/story/24/02/11/0432236/cryptography-guru-martin-hellman-urges-international-cooperation-on-ai-security?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T18:14:02.081708+00:00"}, {"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "Shell once announced it would build 48 new Hydrogen fueling stations for light-duty vehicles in California, according to the blog Hydrogen Insights. But then in September, Shell told the site they'd \"discontinued\" that plan. \n\nAnd last month the Inside EVs blog noted that in all of 2023, just 2,968 hydrogen cars were sold \"in the United States &mdash; and by that, we mean in California, where the series-produced models are available.\" That's according to data from the Hydrogen Fuel Cell Partnership &mdash; admittedly a 10% increase from 2022's sales figure of 2,707 &mdash; but with both numbers lower than 2021's sales of 3,341. \"The overall cumulative sales of hydrogen fuel cell vehicles exceeded 17,940 as of the end of the quarter (not counting vehicles removed from use), which is 20% more than a year ago.\" \n\n\nThen this week Shell said it will \"no longer be operating\" any light-duty hydrogen fuelling stations in the U.S., and will close all seven of its California pumping st", "title": "Shell Is Immediately Closing All Of Its California Hydrogen Fueling Stations", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://tech.slashdot.org/story/24/02/11/1017224/shell-is-immediately-closing-all-of-its-california-hydrogen-fueling-stations?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T17:10:07.455719+00:00"}, {"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "\"Something revolutionary is on the horizon...\" claims the company's web site. \"Wearable neurotechnology that augments sleep, attention, and ultimately the human experience.\" \n\nOr, as Fierce Biotech put it, \"A startup emerged from stealth this week with grand plans to pioneer a new form of neurotech dubbed 'electric medicine.'\"\nElemind's approach centers on artificial intelligence-powered algorithms that are trained to continuously analyze neurological activity collected by a noninvasive wearable device, then to deliver through the wearable bursts of neurostimulation that are uniquely tailored to those real-time brain wave readings. The Cambridge, Massachusetts-based company claims that its approach &mdash; which is based on research from its founders, a group of high-profile scientists hailing from the likes of MIT, Stanford and Harvard &mdash; offers a more \"natural\" treatment option than pharmaceuticals for neurological conditions like insomnia, essential tremor and memory ", "title": "Wearable AI-Powered Neurotech Startup Promises 'Electric Medicine' and Wellness Benefits", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://science.slashdot.org/story/24/02/11/0710200/wearable-ai-powered-neurotech-startup-promises-electric-medicine-and-wellness-benefits?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T17:10:04.105267+00:00"}, {"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "An anonymous reader shared this report from the New York Times\n\nWhen it's after hours, and the boss is on the line, Australian workers &mdash; already among the world's best-rested and most personally fulfilled employees &mdash; can soon press \"decline\" in favor of the seductive call of the beach. In yet another buttress against the scourge of overwork, Australia's Senate on Thursday passed a bill giving workers the right to ignore calls and messages outside of working hours without fear of repercussion. It will now return to the House of Representatives for final approval. \n\nThe bill, expected to pass in the House with ease, will let Australian workers refuse \"unreasonable\" professional communication outside of the workday. Workplaces that punish employees for not responding to such demands could be fined. \"Someone who is not being paid 24 hours a day shouldn't be penalized if they're not online and available 24 hours a day,\" Prime Minister Anthony Albanese said at a news co", "title": "New Australian Law Will Give Workers 'Right to Disconnect'", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://it.slashdot.org/story/24/02/11/0515215/new-australian-law-will-give-workers-right-to-disconnect?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T13:25:51.552703+00:00"}, {"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "America's Federal Aviation Administration \"is midway through a review of manufacturing at Boeing,\" reports the Associated Press, but \"already knows that changes must be made in how the government oversees the aircraft manufacturer.\"\n\n\nFAA Administrator Michael Whitaker suggested that Boeing &mdash; under pressure from airlines to produce large numbers of planes &mdash; is not paying enough attention to safety. \n\nWhitaker said that FAA has had two challenges since January 5, when an emergency door panel blew off a Boeing 737 Max 9 jetliner over Oregon. \"One, what is wrong with this airplane? But two, what's going on with the production at Boeing?\" Whitaker told a House subcommittee. \"There have been issues in the past. They don't seem to be getting resolved, so we feel like we need to have a heightened level of oversight.\" \n\nWhitaker, who took over the FAA about three months ago, was making his first appearance on Capitol Hill since the blowout over Oregon.... Whitaker said th", "title": "Oversight of Boeing 'is Not Delivering Safe Aircraft', Says America's Top Aviation Regulator", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://yro.slashdot.org/story/24/02/11/0558200/oversight-of-boeing-is-not-delivering-safe-aircraft-says-americas-top-aviation-regulator?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T10:06:27.300557+00:00"}, {"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "InfoWorld reports:\n\nDon't look now, but 25% of organizations surveyed in the United Kingdom have already moved half or more of their cloud-based workloads back to on-premises infrastructures. This is according to a recent study by Citrix, a Cloud Software Group business unit. The survey questioned 350 IT leaders on their current approaches to cloud computing. The survey also showed that 93% of respondents had been involved with a cloud repatriation project in the past three years. That is a lot of repatriation. Why? \n\n Security issues and high project expectations were reported as the top motivators (33%) for relocating some cloud-based workloads back to on-premises infrastructures such as enterprise data centers, colocation providers, and managed service providers (MSPs). Another significant driver was the failure to meet internal expectations, at 24%... Those surveyed also cited unexpected costs, performance issues, compatibility problems, and service downtime. The most com", "title": "Why Companies Are Leaving the Cloud", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://it.slashdot.org/story/24/02/11/0227250/why-companies-are-leaving-the-cloud?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T05:20:58.962663+00:00"}, {"permanent": false, "language": "en-us", "page_rating_visits": 0, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "thumbnail": null, "description": "In 2022 Apple filed a lawsuit against startup Rivos. The lawsuit said that in one year Rivos had hired more than 40 former Apple employees to work on competing system-on-a-chip technology, according to Reuters, \"and that at least two former Apple engineers took gigabytes of confidential information with them to Rivos.\" \n\nBut Friday Bloomberg reported that the two companies told a judge that they'd \"signed an agreement that potentially settles the case.\"\n\n\"The agreement provides for remediation of Apple confidential information based on a forensic examination of Rivos systems and other activities,\" according to the filing in federal court in San Jose, California. \"The parties currently are working through that process.\" \n\nMore details from Engadget:\n\nApple also accused the defendant of instructing the employees it hired away to steal presentations and other proprietary information for unreleased iPhone chip designs that cost billions of dollars to develop. Rivos countersued Ap", "title": "Apple Is Settling Chip Secrets Theft Case Against Startup Rivos, Former Employees", "comments": [], "page_rating_votes": 0, "tags": [], "age": null, "page_rating": 0, "link": "https://apple.slashdot.org/story/24/02/11/0120236/apple-is-settling-chip-secrets-theft-case-against-startup-rivos-former-employees?utm_source=rss1.0mainlinkanon&utm_medium=feed", "vote": 0, "page_rating_contents": 0, "source_obj__id": 607, "user": null, "artist": "help@slashdot.org", "bookmarked": false, "album": "", "dead": false, "date_published": "2024-02-11T03:58:01.874740+00:00"}]