[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Why I Am Apprehensive About Suicide Squad: Kill the Justice League", "description": "Following the disastrous reception to Suicide Squad: Kill the Justice League’s State of Play last February, it was radio silence from developer Rocksteady and Warner Bros. until the unveiling of new gameplay through Insider series and a fresh trailer for the upcoming looter shooter at The Game Awards. \n\nFan feedback hasn’t resulted in a rehash of the most derided elements of the game – that being the live-service model and cosmetics-focused battle passes – but at least the gunplay and traversal looks a little more intriguing now. The recent trailer does a better job of demonstrating how it will feel to command each of the four distinct members of the Suicide Squad, but there’s still the niggling feeling there’s something derivative about the game. Something doesn’t work, and this feature aims to outline what that is.", "link": "https://www.youtube.com/watch?v=tq9MhHv0u0Q", "date_published": "2023-12-20T16:30:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/tq9MhHv0u0Q/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Like A Dragon: Infinite Wealth - 15 Things YOU ABSOLUTELY NEED TO KNOW Before You Buy", "description": "The Like a Dragon franchise – formerly known as Yakuza – has been steadily gaining momentum for a number of years now, and after having delivered a couple of spinoff entries in the form of Like a Dragon: Ishin! and Like a Dragon Gaiden, its ready to return with its next mainline instalment. \n\nLike a Dragon: Infinite Wealth will once again turn focus to new series protagonist Ichiban Kasuga, who is joined by his friends – including longtime Yakuza star Kazuma Kiryu – on a new adventure that, for the first time in franchise history, will take us outside Japan, to the sunny islands of Hawaii.\n\nWith the RPG now not far away from launch, here, we’re going to go over a few key details that you should know about it.\n\nNote: This video was re-uploaded because the original video had mistakes in it.", "link": "https://www.youtube.com/watch?v=PH_P0Lo489k", "date_published": "2023-12-20T13:30:15+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i1.ytimg.com/vi/PH_P0Lo489k/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 Games of 2023 That Can Give You OVER 100 HOURS OF GAMEPLAY", "description": "It’s only natural to want as much bang for your buck as possible, so it’s no surprise that longer games that offer more hours of gameplay than others are valued as highly as they are. \n\nOf course, as we’ve seen all too often over the years, bloat and padding and dilution of quality can be major issues with such experiences, but at the same time, when a game that is well-made, boasts an enjoyable core loop, and offers dozens upon dozens of hours of gameplay on top of all that, it’s bound to turn a few heads. \n\nThankfully, we’ve had plenty such games throughout the course of the year, and with 2023 now drawing to a close, here, we’re going to take a look at a few that have stood out to us.", "link": "https://www.youtube.com/watch?v=oUptd-HfEUY", "date_published": "2023-12-20T09:30:12+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i4.ytimg.com/vi/oUptd-HfEUY/hqdefault.jpg", "age": null, "page_rating_contents": 52, "page_rating_votes": 0, "page_rating_visits": 1, "page_rating": 52, "tags": [], "comments": [], "vote": 0}]