[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T15:30:05+00:00",
        "description": "Since S.T.A.LK.E.R. 2: Heart of Chornobyl’s launch not too long ago, the game has received more than its fair share of praise for everything from its open world and its stellar emergent gameplay to its terrifying horror atmosphere and its tense and unforgiving difficulty. \n\nAt the same time, however, it has also proven to be a highly divisive game, appropriately enough for the series in question. The many technical issues that S.T.A.L.K.E.R. 2 has launched with have obviously attracted widespread criticism, but owing to its very nature, there are other parts of the game that are going to turn many people away as well. \n\nHere, we talk about all of that and more as we take a look at exactly why S.T.A.L.K.E.R. 2 has split the player base the way that it has.",
        "id": 1590284,
        "language": null,
        "link": "https://www.youtube.com/watch?v=GiuhKVhhJPc",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/GiuhKVhhJPc/hqdefault.jpg",
        "title": "Why Is STALKER 2 So Divisive AMONG GAMERS?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T10:30:27+00:00",
        "description": "To say that Microsoft Flight Simulator 2024 didn't have the best launch would be an understatement. Asobo Studio addressed things pretty quickly when it came to servers and players unable to log in. However, it quickly became apparent that other problems plagued the title.\n\nAlongside stuttering and iffy performance when loading in and out of maps, various users have reported other glitches, bugs, and crashes. NPCs are hanging outside of planes, aircraft appearing inside of buildings, Career Mode missions not working properly, etc. Though another patch went live this week, the experience is far from ideal.\n\nIt's worth noting all this because Microsoft Flight Simulator 2024 isn't a bad game at all. There's been extensive praise for its visuals and attention to detail when things work - even those with problems can enjoy the game. Overall, it's a muddled situation that Asobo and Xbox Game Studios will need time to resolve.",
        "id": 1588010,
        "language": null,
        "link": "https://www.youtube.com/watch?v=kPpPhVf-hEo",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/kPpPhVf-hEo/hqdefault.jpg",
        "title": "Microsoft Flight Simulator 2024 - WHAT THE HELL IS GOING ON?",
        "vote": 0
    }
]