[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T23:08:05.318152+00:00",
        "description": "Ars Technica's Jon Brodkin reports: Lobby groups for Internet service providers claim that ISPs' customer service is so good already that the government shouldn't consider any new regulations to mandate improvements. They also claim ISPs face so much competition that market forces require providers to treat their customers well or lose them to competitors. Cable lobby group NCTA-The Internet &amp; Television Association told the Federal Communications Commission in a filing (PDF) that \"providing high-quality products and services and a positive customer experience is a competitive necessity in today's robust communications marketplace. To attract and retain customers, NCTA's cable operator members continuously strive to ensure that the customer support they provide is effective and user-friendly. Given these strong marketplace imperatives, new regulations that would micromanage providers' customer service operations are unnecessary.\"\n \nLobby groups filed comments in response to an FC",
        "id": 1592897,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/11/26/2013204/isps-say-their-excellent-customer-service-is-why-users-dont-switch-providers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "ISPs Say Their 'Excellent Customer Service' Is Why Users Don't Switch Providers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T23:08:05.061489+00:00",
        "description": "A group appears to have leaked access to Sora, OpenAI's video generator, in protest of what they're calling duplicity and \"art washing\" on OpenAI's part. From a report: On Tuesday, the group published a project on the AI dev platform Hugging Face seemingly connected to OpenAI's Sora API, which isn't yet publicly available. Using their authentication tokens -- presumably from an early access system -- the group created a frontend that lets users generate videos with Sora.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OpenAI's+Sora+Video+Generator+Appears+To+Have+Leaked%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F26%2F2020220%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F26%2F2020220%2Fopenais-sora-video-generator-appears-to-have-leaked%3",
        "id": 1592896,
        "language": null,
        "link": "https://slashdot.org/story/24/11/26/2020220/openais-sora-video-generator-appears-to-have-leaked?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "OpenAI's Sora Video Generator Appears To Have Leaked",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T22:04:22.488714+00:00",
        "description": "The Biden administration is reducing Intel's CHIPS Act award by over $600 million, citing a $3 billion military contract the chipmaker was also awarded. Engadget reports: Initially set to receive $8.5 billion from the domestic silicon production bill, the company will get up to $7.85 billion instead. On Tuesday, The New York Times reported that Intel has extended some plant openings beyond 2030 government deadlines. Intel posted its biggest-ever quarterly loss last month after announcing 15,000 layoffs in August. The chip-maker's struggles have reportedly led some government officials to worry about its ability to deliver as a central component of the Biden White House's CHIPS Act.\n \nIntel will receive at least $1 billion in CHIPS Act funding before the end of the year. The company plans to invest $90 billion in the US by the decade's end, a reduction from its initial goal of $100 billion in the next five years. The Commerce Department said the chip maker is still on schedule to inve",
        "id": 1592471,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/26/206258/intels-chips-act-funding-cut-by-over-600-million?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Intel's CHIPS Act Funding Cut By Over $600 Million",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T22:04:22.220237+00:00",
        "description": "Microsoft has denied claims that it automatically enables data collection from Word and Excel documents to train its AI models. The controversy emerged after cybersecurity expert nixCraft reported that Microsoft's Connected Experiences feature was collecting user data by default. While Microsoft's services agreement grants the company rights to use customer content, officials stated via Twitter that document data is not used for AI training.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Denies+Using+Word+and+Excel+Data+To+Train+AI+Models%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F26%2F2015232%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F26%2F2015232%2Fmicrosoft-denies-using-word-and-excel-data-to-train-ai-models%3Futm_source",
        "id": 1592470,
        "language": null,
        "link": "https://slashdot.org/story/24/11/26/2015232/microsoft-denies-using-word-and-excel-data-to-train-ai-models?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Denies Using Word and Excel Data To Train AI Models",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T20:57:03.884984+00:00",
        "description": "An anonymous reader quotes a report from the New York Times: The founder of an artificial intelligence start-up focused on education was arrested and charged with defrauding her investors, lying about the company's profits and falsely claiming that some of the largest school districts in the country, including New York City's, were her customers. The founder, Joanna Smith-Griffin, started the company, AllHere Education, in 2016, with the goal of using artificial intelligence to increase student and parent engagement and curb absenteeism. In the years that followed, Ms. Smith-Griffin, 33, misrepresented AllHere's revenue and customer base to fraudulently raise almost $10 million in funds, according to the indictment. Once the company's valuation had climbed, she sold some of her stake in it and spent hundreds of thousands of dollars on a down payment for a new home and on her wedding.\n \nMs. Smith-Griffin was arrested Tuesday in North Carolina, where she lives, and charged with wire fr",
        "id": 1592032,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/11/26/1958250/forbes-30-under-30-founder-who-sold-ai-chatbot-to-schools-charged-with-fraud?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Forbes 30 Under 30 Founder Who Sold AI Chatbot To Schools Charged With Fraud",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T19:51:44.299107+00:00",
        "description": "American hospitals and healthcare organizations would be required to adopt multi-factor authentication (MFA) and other minimum cybersecurity standards under new legislation proposed by a bipartisan group of US senators. From a report: The Health Care Cybersecurity and Resiliency Act of 2024 [PDF], introduced on Friday by US Senators Bill Cassidy (R-Louisiana), Mark Warner (D-Virginia), John Cornyn (R-Texas), and Maggie Hassan (D-New Hampshire), would, among other things, require better coordination between the Department of Health and Human Services (HHS) and the Cybersecurity and Infrastructure Security Agency (CISA) around cybersecurity in the healthcare and public health sector. \n\nThis includes giving HHS a year to implement a cybersecurity incident response plan and update the types of information displayed publicly via the department's breach reporting portal.\n Currently, all healthcare orgs that are considered \"covered entities\" under the US Health Insurance Portability and Acc",
        "id": 1591662,
        "language": null,
        "link": "https://it.slashdot.org/story/24/11/26/1855253/us-senators-propose-law-to-require-bare-minimum-security-standards?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Senators Propose Law To Require Bare Minimum Security Standards",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T19:51:44.049406+00:00",
        "description": "Anthropic is adding a new feature to its Claude AI assistant that will give users more control over how the chatbot responds to different writing tasks. From a report: The new custom styles are available to all Claude AI users, enabling anyone to train it to match their own communication style or select from preset options to quickly adjust the tone and level of detail it provides. \n\nThis update aims to personalize the chatbot's replies and make them feel more natural or appropriate for specific applications, such as writing detailed technical documents or professional emails. Three preset styles are available: Formal for \"clear and polished\" text, Concise for shorter and more direct responses, and Explanatory for educational replies that need to include additional detail. If these don't suit your requirements, Claude can also generate custom styles that are trained to mimic other writing mannerisms. Anthropic says users need to upload \"sample content that reflects your preferred way",
        "id": 1591661,
        "language": null,
        "link": "https://slashdot.org/story/24/11/26/194212/anthropic-says-claude-ai-can-match-your-unique-writing-style?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Anthropic Says Claude AI Can Match Your Unique Writing Style",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T18:46:36.925527+00:00",
        "description": "Interpol arrested 1,006 suspects in Africa during a massive two-month operation, clamping down on cybercrime that left tens of thousands of victims, including some who were trafficked, and produced millions in financial damages, the global police organization said Tuesday. From a report: Operation Serengeti, a joint operation with Afripol, the African Union's police agency, ran from Sept. 2 to Oct. 31 in 19 African countries and targeted criminals behind ransomware, business email compromise, digital extortion and online scams, the agency said in a statement.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Interpol+Clamps+Down+on+Cybercrime+and+Arrests+Over+1%2C000+Suspects+in+Africa%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F11%2F26%2F1831232%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.p",
        "id": 1591194,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/11/26/1831232/interpol-clamps-down-on-cybercrime-and-arrests-over-1000-suspects-in-africa?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Interpol Clamps Down on Cybercrime and Arrests Over 1,000 Suspects in Africa",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T17:42:37.321250+00:00",
        "description": "Software company Deno Land has filed a petition with the U.S. Patent and Trademark Office to cancel Oracle's JavaScript trademark, citing trademark abandonment and fraud. The November 22 filing claims Oracle has not sold JavaScript products or services since acquiring the trademark through its 2009 Sun Microsystems purchase. The petition alleges Oracle committed fraud during its 2019 trademark renewal by submitting Node.js website screenshots without authorization. \n\nThe legal action follows a September open letter from JavaScript creator Brendan Eich, Node.js and Deno creator Ryan Dahl, and other prominent JavaScript developers urging Oracle to relinquish the trademark. The letter has garnered over 14,000 signatures.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=USPTO+Petitioned+To+Cancel+Oracle's+JavaScript+Trademark%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F11%2F26%2F1312213%2F%3Futm_source%3Dtwit",
        "id": 1590667,
        "language": null,
        "link": "https://developers.slashdot.org/story/24/11/26/1312213/uspto-petitioned-to-cancel-oracles-javascript-trademark?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "USPTO Petitioned To Cancel Oracle's JavaScript Trademark",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T17:42:37.086338+00:00",
        "description": "Google announced additional modifications to its European search results on Tuesday, following complaints from smaller competitors about traffic losses and amid potential EU antitrust charges under new tech regulations. The changes come as Google attempts to comply with the Digital Markets Act, which prohibits tech giants from favoring their own services and after hotels, airlines, and small retailers reported a 30% decline in direct booking clicks following recent platform adjustments. \n\nGoogle's legal director Oliver Bethell said the new proposals include expanded search units offering equal formatting between comparison sites and supplier websites, along with new formats for competitors to display prices and images. The company will also test removing hotel map displays in Germany, Belgium, and Estonia. The Alphabet unit faces possible enforcement action from the European Commission, which began investigating potential DMA violations in March. Companies found breaching the regulat",
        "id": 1590666,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/11/26/1057225/google-to-test-maps-removal-in-eu-hotel-search-amid-antitrust-pressure?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google To Test Maps Removal in EU Hotel Search Amid Antitrust Pressure",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T16:32:44.944292+00:00",
        "description": "An anonymous reader shares a report: The human eye can't really tell the difference between 4K and 8K resolution. Video game console manufacturers, who have built their businesses selling increasingly powerful machines every few years, are grappling with a future where performance improvements are becoming less dramatic. \n\nSony Group launched its PlayStation 5 Pro console in mid-November. The $700 upgraded version of Sony's 2020 gaming machine uses AI to improve games' frame rate while maintaining exceptional image quality -- at least for 82 games that have been enhanced to take advantage of the new specs. That means gamers can see the realistic glint of their metal sword and experience smooth, sword-swinging battle action. \n\nBut despite all the fancy tech and a $200 price increase over the previous version, reviews so far haven't suggested it's a must-have machine. \"It's an improvement, but there's nothing that makes it a complete generation above what the Series X offered,\" Daniel ",
        "id": 1590227,
        "language": null,
        "link": "https://games.slashdot.org/story/24/11/26/135259/video-game-console-makers-confront-performance-ceiling?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Video Game Console Makers Confront Performance Ceiling",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T15:28:00.750046+00:00",
        "description": "Brazilian antitrust regulator Cade said this week that Apple must lift restrictions on payment methods for in-app purchases, among other things, as the watchdog moved to proceed with an investigation into a complaint filed by Latin America e-commerce giant MercadoLibre. From a report: MercadoLibre's complaint, filed in 2022 in Brazil and Mexico, accused Apple of imposing a series of restrictions on the distribution of digital goods and in-app purchases, including banning apps from distributing third-party digital goods and services such as movies, music, video games, books and written content. \n\nIn the complaint, MercadoLibre criticized the California tech giant for requiring developers that offer digital goods or services within apps to use Apple's own payment system and stopping them from redirecting buyers to their websites. Cade ruled that Apple must allow app developers to add tools so customers can buy their services or products outside the app, such as through the use of hyper",
        "id": 1589698,
        "language": null,
        "link": "https://apple.slashdot.org/story/24/11/26/1256205/brazil-rules-apple-must-lift-restrictions-on-in-app-payments?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Brazil Rules Apple Must Lift Restrictions On In-App Payments",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T15:28:00.665177+00:00",
        "description": "An anonymous reader shares a report: Softbank-backed online shopping site Meesho has rolled out what it claims is the first GenAI-powered voice bot among Indian e-commerce firms for customer support, paring down some expenses by 75%. Meesho has more than 160 million customers in India, with 80% of them in smaller cities, towns and villages. \n\n[...] The Bengaluru-based e-commerce startup said Tuesday its AI bot currently handles 60,000 customer calls daily in English and Hindi. The startup, which also counts Elevation and Prosus among its backers, plans to add support for six more Indian languages.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Helps+Indian+Ecommerce+Firm+Cut+Customer+Call+Costs+By+75%25%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F11%2F26%2F131222%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.fa",
        "id": 1589697,
        "language": null,
        "link": "https://slashdot.org/story/24/11/26/131222/ai-helps-indian-ecommerce-firm-cut-customer-call-costs-by-75?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "AI Helps Indian Ecommerce Firm Cut Customer Call Costs By 75%",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T14:22:45.907804+00:00",
        "description": "A Stanford study of over 50,000 software engineers across hundreds of companies has found that approximately 9.5% of engineers perform minimal work while drawing full salaries, potentially costing tech companies billions annually. \n\nThe research showed the issue is most prevalent in remote work settings, where 14% of engineers were classified as \"ghost engineers\" compared to 6% of office-based staff. The study evaluated productivity through analysis of private Git repositories and simulated expert assessments of code commits. \n\nMajor tech companies could be significantly impacted, with IBM estimated to have 17,100 underperforming engineers at an annual cost of $2.5 billion. Across the global software industry, the researchers estimate the total cost of underperforming engineers could reach $90 billion, based on a conservative 6.5% rate of \"ghost engineers\" worldwide.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=S",
        "id": 1589225,
        "language": null,
        "link": "https://developers.slashdot.org/story/24/11/26/1346219/stanford-research-reveals-95-of-software-engineers-do-virtually-nothing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Stanford Research Reveals 9.5% of Software Engineers 'Do Virtually Nothing'",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T13:17:48.465744+00:00",
        "description": "Blue Yonder, a Panasonic subsidiary specializing in AI-driven supply chain solutions, experienced a recent ransomware attack that impacted many of its customers. \"Among its 3,000 customers are high-profile organizations like DHL, Renault, Bayer, Morrisons, Nestle, 3M, Tesco, Starbucks, Ace Hardware, Procter &amp; Gamble, Sainsbury, and 7-Eleven,\" reports BleepingComputer. From the report: On Friday, the company warned that it was experiencing disruptions to its managed services hosting environment due to a ransomware incident that occurred the day before, on November 21. \"On November 21, 2024, Blue Yonder experienced disruptions to its managed services hosted environment, which was determined to be the result of a ransomware incident,\" reads the announcement. \"Since learning of the incident, the Blue Yonder team has been working diligently together with external cybersecurity firms to make progress in their recovery process. We have implemented several defensive and forensic protocol",
        "id": 1588827,
        "language": null,
        "link": "https://it.slashdot.org/story/24/11/26/0323243/blue-yonder-ransomware-attack-disrupts-grocery-store-supply-chain?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Blue Yonder Ransomware Attack Disrupts Grocery Store Supply Chain",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T11:07:47.773698+00:00",
        "description": "The U.S. is preparing to impose new sanctions targeting 200 Chinese chipmakers and potentially restricting the export of High Bandwidth Memory (HBM). The move is intended to further hinder China's semiconductor and AI advancements. Tom's Hardware reports: The update sheds light on the Biden administration's recent efforts to impose stricter regulations on chip manufacturers in China. The latest swarm of sanctions reportedly targets roughly 200 Chinese firms. US companies are prohibited from exporting select technologies or products to the targeted firms. The report suggests that the US Department of Commerce aims to push these new regulations before the Thanksgiving break - or November 28. Neither the Department of Commerce nor the Chamber of Commerce responded to Reuters' request for comments.\n \nMoreover, another wave of sanctions is set to follow in December - targeting the export of HBM (High Bandwidth Memory) - primarily to choke China's advance in the AI domain. The impacts of t",
        "id": 1587974,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/26/0332203/us-to-reportedly-sanction-200-more-chinese-chip-firms?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US To Reportedly Sanction 200 More Chinese Chip Firms",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T07:52:35.987332+00:00",
        "description": "An asteroid named 2024 PT5, recently exhibiting \"mini moon\" behavior around Earth, may have been a boulder that was blasted off the moon by an impacting, crater-forming asteroid,\" reports the Associated Press. The 33-foot space rock is expected to pass safely near Earth in January, when it will be closely observed. From the report: While not technically a moon -- NASA stresses it was never captured by Earth's gravity and fully in orbit -- it's \"an interesting object\" worthy of study. The astrophysicist brothers who identified the asteroid's \"mini moon behavior,\" Raul and Carlos de la Fuente Marcos of Complutense University of Madrid, have collaborated with telescopes in the Canary Islands for hundreds of observations so far.\n \nCurrently more than 2 million miles (3.5 million kilometers) away, the object is too small and faint to see without a powerful telescope. It will pass as close as 1.1 million miles (1.8 million kilometers) of Earth in January, maintaining a safe distance before",
        "id": 1587187,
        "language": null,
        "link": "https://science.slashdot.org/story/24/11/26/0343237/earths-mini-moon-may-have-been-a-chunk-of-our-actual-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Earth's 'Mini Moon' May Have Been a Chunk of Our Actual Moon",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T04:37:49.693464+00:00",
        "description": "An anonymous reader quotes a report from TheGamer: With thousands of cards available in Pokemon's \"Pokemon Trading Card Game,\" it can be hard to remember what is what. After all, since first debuting in the mid 1990s to coincide with the games of the same name, the popular collectible has been going strong ever since, with new releases constantly filling store shelves. That said, one avid Pokemon fan took it upon themselves to archive the card game's unique artwork. After hundreds of hours of work, over 23,000 cards have been archived, along with an additional 2,000 pieces of artwork. The end result is one of the best fan creations around.\n \nMeet Twitter user pkm_jp, who devoted hundreds of hours to learning how to program in order to make their dream of a one-stop shop of all available card art a reality. \"I remember the joy of getting the first set page working, displaying a small collection of cards,\" they wrote on Twitter. \"I knew it was just the beginning.\" The site, artofpkm.co",
        "id": 1586592,
        "language": null,
        "link": "https://developers.slashdot.org/story/24/11/26/016253/pokemon-fan-learns-to-code-in-order-to-archive-tcg?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Pokemon Fan Learns To Code In Order To Archive TCG",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T02:29:17.831489+00:00",
        "description": "Microsoft is retiring its \"Get Licensing Ready\" website, a resource for software licensing education. Going forward, content licensing will be located at microsoft.com/licensing. The Register also notes Microsoft's plans to enhance learning with AI tools, though specifics for licensing applications remain unclear. From the report: Software licensing is notoriously labyrinthine, so resources like the site Microsoft will close -- Get Licensing Ready -- can be very handy. Today, the site offers over 50 training modules plus documentation. But Microsoft has decided not to keep it around in its current form. Indeed, visitors to the site currently see a pop-up that explains \"Microsoft will be ending support for licensing certifications through this platform and phasing out the Get Licensing Ready resource.\"\n \nThe site's \"retirement\" date is January 1. Users have until December 1 to complete any active modules and download certificates. If you're a user of the site, get cracking: Redmond wa",
        "id": 1586236,
        "language": null,
        "link": "https://news.slashdot.org/story/24/11/26/0058258/microsoft-shuttering-dedicated-licensing-education-certification-site?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Microsoft Shuttering Dedicated Licensing Education, Certification Site",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T01:24:31.456202+00:00",
        "description": "9to5Google's Ben Schoon reports: Google has introduced a new feature on iOS that injects links on third-party websites that take users back to Google Search. Recently, Google announced new \"Page Annotations\" within the Google app on iOS. This feature, as Google explains, \"extracts interesting entities from the webpage and highlights them in line.\" Effectively, it creates links on a website that you've opened through Google's browser that the website's owner did not put there. The links, when clicked, then perform a search on Google for that subject and open the search in a pop-up window on top of the third-party website.\n \nThe feature, Google says, will offer an opt-out for website owners through a form. It's pointed out by SERoundTable that opting out can take up to 30 days, while the feature is live now. Further reading: US Says Google Is an Ad Tech Monopolist, in Closing Arguments<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.",
        "id": 1585982,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/11/26/0029213/googles-ios-app-now-injects-links-on-third-party-websites-that-go-back-to-search?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Google's iOS App Now Injects Links On Third-Party Websites That Go Back To Search",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T01:24:31.114082+00:00",
        "description": "A new bill introduced by Sen. Peter Welch (D-Vt) aims to make it easier for human creators to find out if their work was used without permission to train artificial intelligence. NBC News reports: The Transparency and Responsibility for Artificial Intelligence Networks (TRAIN) Act would enable copyright holders to subpoena training records of generative AI models, if the holder can declare a \"good faith belief\" that their work was used to train the model. The developers would only need to reveal the training material that is \"sufficient to identify with certainty\" whether the copyright holder's works were used. Failing to comply would create a legal assumption -- until proven otherwise -- that the AI developer did indeed use the copyrighted work. [...]\n \nIn a news release, Welch said the TRAIN Act has been endorsed by several organizations -- including the Screen Actors Guild-American Federation of Television and Radio Artists (SAG-AFTRA), the American Federation of Musicians, and th",
        "id": 1585981,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/11/26/0047249/senator-introduces-bill-to-compel-more-transparency-from-ai-developers?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Senator Introduces Bill To Compel More Transparency From AI Developers",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-26T00:08:33.435814+00:00",
        "description": "An anonymous reader quotes a report from Ars Technica: The Supreme Court signaled it may take up a case that could determine whether Internet service providers must terminate users who are accused of copyright infringement. In an order (PDF) issued today, the court invited the Department of Justice's solicitor general to file a brief \"expressing the views of the United States.\"\n \nIn Sony Music Entertainment v. Cox Communications, the major record labels argue that cable provider Cox should be held liable for failing to terminate users who were repeatedly flagged for infringement based on their IP addresses being connected to torrent downloads. There was a mixed ruling at the US Court of Appeals for the 4th Circuit as the appeals court affirmed a jury's finding that Cox was guilty of willful contributory infringement but reversed a verdict on vicarious infringement \"because Cox did not profit from its subscribers' acts of infringement.\" That ruling vacated a $1 billion damages award a",
        "id": 1585710,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/11/25/2133222/supreme-court-wants-us-input-on-whether-isps-should-be-liable-for-users-piracy?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Supreme Court Wants US Input On Whether ISPs Should Be Liable For Users' Piracy",
        "vote": 0
    }
]