[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-27T08:30:46+00:00",
        "description": "<p>Co piąty pracownik polskiej firmy był ofiarą cyberataku w miejscu pracy. Mimo to tylko 59% polskich firm deklaruje używanie oprogramowania antywirusowego, a inwestowanie w takie rzeczy jak 2FA jest jeszcze rzadsze. To niektóre wnioski z raportu ESET i DAGMA Bezpieczeństwo IT, który daje ciekawy wgląd w to jak naprawdę wygląda cyberbezpieczeństwo w polskim biznesie.<span id=\"more-26155\"></span></p>\n<p>Można odnieść wrażenie, że tzw. cyberbezpieczeństwo dwa światy. Z jednej strony mówi się o bezpieczeństwie AI, cyberwojnie, albo o fantastycznych atakach z podsłuchiwaniem smartfona przez żarówkę. Z drugiej strony wciąż wiele osób używa powtarzalnych haseł albo ignoruje zagrożenie socjotechniką bo przecież „to nie będzie tak, że zaraz mnie okradną”.</p>\n<p>Efekty ignorowania podstaw bezpieczeństwa bywają spektakularne. Niedawno klub FC Barcelona przyznał, że przelał 1 mln euro na konto w banku cypryjskim tylko dlatego, bo otrzymał wiadomość e-mail od osoby podszywającej się pod Pinieg",
        "id": 1595370,
        "language": null,
        "link": "https://niebezpiecznik.pl/post/czy-polskie-firmy-sa-bezpieczniejsze-od-fc-barcelony-cyberportret-autorstwa-eset-sugeruje-ze-nie-do-konca",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 239,
        "source_url": "https://feeds.feedburner.com/niebezpiecznik",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Czy polskie firmy są bezpieczniejsze od FC Barcelony? Cyberportret autorstwa ESET sugeruje, że nie do końca",
        "vote": 0
    }
]