[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-27T18:30:31+00:00",
        "description": "Infinity Nikki is an RPG coming December 5th to various platforms and mobile. Beginning exclusively on mobile in 2012, Nikki’s latest adventure expands the series into an open world adventure across the vast, pastel-perfect world of Miraland, and together with her companion Momo, Nikki will engage in a raft of activities. \n\nWith this video, we are aiming to unpack all there is to know about Infinity Nikki, including its progression systems and other mechanics.",
        "id": 1598946,
        "language": null,
        "link": "https://www.youtube.com/watch?v=XP62s_GR_6Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/XP62s_GR_6Y/hqdefault.jpg",
        "title": "Infinity Nikki - 15 Things You NEED TO KNOW Before You Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-27T15:30:12+00:00",
        "description": "The games industry has been on an absolute rollercoaster as of late, with plenty of great releases gracing us gamers year after year. Right from household genres like action adventure and RPGs to platformers and even breakthrough genres like strand type games, there have been absolutely no shortage of amazing games that have stayed with us long after the credits rolled. \n\nWhile many of these games in this video would end up ranking as the best games to have released within that year, they failed to reach the top spot for one reason or another. With this video, we will be taking a look at 15 such games that did not won game of the year but were definitely very close contenders regardless.",
        "id": 1597423,
        "language": null,
        "link": "https://www.youtube.com/watch?v=c-lzwOpeZdw",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/c-lzwOpeZdw/hqdefault.jpg",
        "title": "15 STUNNING Single Player Games That Were ALMOST GAME OF THE YEAR",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-11-27T10:30:19+00:00",
        "description": "When you think December in the gaming industry, it's usually year-end awards, debating who deserves what more than the other. Though the month isn't known for its excessive number of releases, this year is different.\n\nDecember 2024 marks the release of several big-name titles. Marvel Rivals will present a true competitor to Overwatch 2 with its gameplay and mechanics. Meanwhile Indiana Jones and the Great Circle looks to wrap up Microsoft's trifecta of first-party exclusives (before arriving for PS5 next year). All this only scratches the surface, though. Check out 13 of the biggest games to look forward to in December.",
        "id": 1595546,
        "language": null,
        "link": "https://www.youtube.com/watch?v=llQeMQof67Y",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/llQeMQof67Y/hqdefault.jpg",
        "title": "13 NEW Games of December 2024 You NEED To Look Forward To",
        "vote": 0
    }
]