[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-17T20:30:03+00:00", "description": "First-person shooters are dime a dozen in the current gaming landscape, but many of these games are subject to widespread homogenization meaning that there’s not much in the name of discriminating factors. \n\nAs such, games that try to take the same concepts and create something fresh out of it continue to be a rare occurrence, but Starbreeze Studios’ 2012 release Syndicate is something that definitely belongs to this category. \n\nDespite a lukewarm critical and commercial reception, Syndicate’s visual aesthetics and gameplay mechanics make for a rather appealing combination that sadly many fans have missed out on. With this video, we will be taking a look back at Syndicate and discuss the game in length to better understand its merits and inherent flaws.", "language": null, "link": "https://www.youtube.com/watch?v=HgscY38sUpM", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/HgscY38sUpM/hqdefault.jpg", "title": "This Is One of The MOST UNDERRATED GAMES I Have Ever Played", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-17T15:30:11+00:00", "description": "Remember when The Division Heartland was announced in 2021 and received all those playtests? How about when it suffered multiple delays? The lack of buzz for it was palpable, which probably explains the developer's recent decision to cancel it.\n\nIt makes sense if the publisher is moving away from chasing trends, much like when it cancelled Ghost Recon Frontline and Project Q. Diverting Red Storm to work on other projects is also pretty solid reasoning. However, the reason that led to Heartland's cancellation is still relatively unknown.\n\nThat is until you hear the reports of the playtest and players' responses to the same. Was The Division Heartland just an unfortunate victim of a developer cutting back on unessential projects, or was it not shaping up all that well? As it turns out, the answer is a little bit of both.", "language": null, "link": "https://www.youtube.com/watch?v=W-KKACRP4ZE", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/W-KKACRP4ZE/hqdefault.jpg", "title": "What The HELL Happened To The Division Heartland?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-17T12:45:03+00:00", "description": "F1 24 is Codemasters' latest racing sim, once again promising the most realistic depiction of Formula One racing. This year's iteration isn't simply retreading old ground - it features a brand new Driver Career mode where players can play as one of 20 real-world drivers from the 2024 season and realize their dreams.\n\nEarn accolades, manage personnel, hold secret meetings with other teams - there's a lot to look forward to. You can also play various Formula One icons or go up through F2 to prove your skills. F1 24 also offers multiple visual improvements, a revamp of its handling, aerodynamics and tyre model, a new Challenge Career mode and much more.\n\nThere's also cross-platform play, new Fan Zones, updates to existing tracks, VR support on PC and more. Here's everything you should know before diving into this year's entry.", "language": null, "link": "https://www.youtube.com/watch?v=V1R_5d5p24s", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/V1R_5d5p24s/hqdefault.jpg", "title": "F1 24 – 15 Things You NEED TO KNOW Before You Buy", "user": null, "vote": 0}]