[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-28T17:30:01+00:00", "description": "There’s certainly been no shortage of massive, densely packed RPGs to dive into in recent years, but even in that group, Dragon’s Dogma 2 seems like a bigger and more complex experience than most. \n\nEven after you’ve finished the game (which can really take as long as you want it to), owing to its very nature, the game still has plenty of things left to offer, from secrets and lingering activities to new post-game content. So, if you have finished the game and are trying to figure out your next steps, look no further. Here, we’re going to go over some post-game activities to keep you occupied once you’ve finished Dragon’s Dogma 2.", "language": null, "link": "https://www.youtube.com/watch?v=1l7MrED8Jg8", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/1l7MrED8Jg8/hqdefault.jpg", "title": "Dragon's Dogma 2 - 11 Things To Do AFTER FINISHING THE GAME", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-03-28T13:30:06+00:00", "description": "It’s no secret that we have been seeing a resurgence of remakes of classic games in the last few years, and while there is an argument to be had that developers should focus on building new IPs rather than remaking old games, it’s also inarguable that these remakes provide an avenue for new  players to discover a classic without having to go through the many frustrations that come along with playing the original. \n\nThe PS3 generation is home to plenty of games that would benefit a lot from a ground-up remake that’s built for PS5. In this video, we will be taking a look at 15 such games ranging from shooters like Resistance: Fall of Man to action adventures like Enslaved and much more.", "language": null, "link": "https://www.youtube.com/watch?v=JPyFodZeou0", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/JPyFodZeou0/hqdefault.jpg", "title": "15 PS3 Games THAT NEED PS5 REMAKES", "user": null, "vote": 0}]