[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T17:30:01+00:00", "description": "Today, we will be taking a look at Clapperheads’ upcoming Zoochosis which combines different gameplay genres and contrasting ideas to create something that looks amazing and has us salivating to know more. \n\nClapperheads is a small game studio that previously worked on the free-to-play horror adventure Sparky Marky, and Zoochosis in many ways feels like a natural evolution of the ideas found in its previous games.", "language": null, "link": "https://www.youtube.com/watch?v=9gHsc-GAhYc", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/9gHsc-GAhYc/hqdefault.jpg", "title": "This Bodycam Zoo Game Will Immerse You In HEART-STOPPING HORROR", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T15:30:07+00:00", "description": "Fallout 76 was roundly criticized at launch for its overall quality (or lack thereof). However, it's now over five years later, and the online action RPG, criticized for its various technical issues and misrepresenting the essence of Fallout, is in a far better state.\n\nFrom more narrative-focused content, starting with Wastelanders and proceeding with the Brotherhood of Steel and revisiting Fallout 3's The Pitt, to new quality-of-life features, it's been quite the journey for Fallout 76. Not every new addition has met abject applause - Fallout 1st and the new Seasons Pass changes, for example - but the community is stronger than ever.\n\nWhat should you know when looking to jump into Fallout 76 after all these years? What can new fans who just watched Amazon's Fallout TV show expect, especially compared to the single-player games? Find out more here.", "language": null, "link": "https://www.youtube.com/watch?v=LacOIuzLoe0", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/LacOIuzLoe0/hqdefault.jpg", "title": "6 Years Later, IS FALLOUT 76 FINALLY FIXED?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T13:30:17+00:00", "description": "The never-ending quest for games to achieve mainstream success and global reach is one that has had some less than desirable consequences- like the excessive dumbing down of challenge, paired with a tendency to constantly hold players’ hands and guide them through even the simplest of hurdles and roadblocks. \n\nThankfully, though this continues to become increasingly prevalent, we do still get notable exceptions that make it a point to go out of their way and do the exact opposite. Rather than taking agency away from players, these games build their identities around not holding your hand and, without providing any guidance, giving you full control of your virtual destiny. \n\nHere, we are going to speak about a few notable open world titles from over the years that do exactly that.", "language": null, "link": "https://www.youtube.com/watch?v=dT9K8y75qYc", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/dT9K8y75qYc/hqdefault.jpg", "title": "10 Open World Games That NEVER HOLD YOUR HAND", "user": null, "vote": 0}]