[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T23:34:43.231426+00:00", "description": "Jess Weatherbed reports via The Verge: It's alive! A day after announcing it was retiring Atlas, its hydraulic robot, Boston Dynamics has introduced a new, all-electric version of its humanoid machine. The next-generation Atlas robot is designed to offer a far greater range of movement than its predecessor. Boston Dynamics wanted the new version to show that Atlas can keep a humanoid form without limiting \"how a bipedal robot can move.\" The new version has been redesigned with swiveling joints that the company claims make it \"uniquely capable of tackling dull, dirty, and dangerous tasks.\"\n \nThe teaser showcasing the new robot's capabilities is as unnerving as it is theatrical. The video starts with Atlas lying in a cadaver-like fashion on the floor before it swiftly folds its legs backward over its body and rises to a standing position in a manner befitting some kind of Cronenberg body-horror flick. Its curved, illuminated head does add some Pixar lamp-like charm, but the way Atlas th", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/17/215218/boston-dynamics-new-atlas-robot-is-a-swiveling-shape-shifting-nightmare?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Boston Dynamics' New Atlas Robot Is a Swiveling, Shape-Shifting Nightmare", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T22:29:43.209372+00:00", "description": "AltStore PAL has become one of the first alternative app marketplaces to launch in the European Union. Developed by Riley Testut, AltStore PAL is marketed as an open-source project designed to distribute apps from independent developers. MacRumors reports: At launch, it features two apps, including Testut's Delta game emulator and clipboard manager app Clip. Delta is also being simultaneously released in the App Store outside of the European Union, but it looks like EU customers will need to download it from AltStore. Testut says that once AltStore PAL is \"running smoothly,\" third-party app developers will be able to submit their apps for distribution outside of the App Store. The app marketplace is designed to be decentralized with no directory, so developers will need to self-promote their apps and direct users to their websites to install an app through AltStore.\n \nDistributing apps through AltStore is free of charge, but it is worth noting that apps that see more than one million ", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/17/2041240/altstore-pal-alternative-app-marketplace-launches-on-iphone-in-eu?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AltStore PAL Alternative App Marketplace Launches On iPhone In EU", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T22:29:41.713598+00:00", "description": "An anonymous reader quotes a report from Ars Technica: The US AI Safety Institute -- part of the National Institute of Standards and Technology (NIST)&mdash;has finally announced its leadership team after much speculation. Appointed as head of AI safety is Paul Christiano, a former OpenAI researcher who pioneered a foundational AI safety technique called reinforcement learning from human feedback (RLHF), but is also known for predicting that \"there's a 50 percent chance AI development could end in 'doom.'\" While Christiano's research background is impressive, some fear that by appointing a so-called \"AI doomer,\" NIST may be risking encouraging non-scientific thinking that many critics view as sheer speculation.\n \nThere have been rumors that NIST staffers oppose the hiring. A controversial VentureBeat report last month cited two anonymous sources claiming that, seemingly because of Christiano's so-called \"AI doomer\" views, NIST staffers were \"revolting.\" Some staff members and scientis", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/17/2052256/feds-appoint-ai-doomer-to-run-us-ai-safety-institute?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Feds Appoint 'AI Doomer' To Run US AI Safety Institute", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T21:24:33.230153+00:00", "description": "An anonymous reader quotes a report from Futurism: In a new blog post from LastPass, the password management firm used by countless personal and corporate clients to help protect their login information, the company explains that someone used AI voice-cloning tech to spoof the voice of its CEO in an attempt to trick one of its employees. As the company writes in the post, one of its employees earlier this week received several WhatsApp communications -- including calls, texts, and a voice message -- from someone claiming to be its CEO, Karim Toubba. Luckily, the LastPass worker didn't fall for it because the whole thing set off so many red flags. \"As the attempted communication was outside of normal business communication channels and due to the employee's suspicion regarding the presence of many of the hallmarks of a social engineering attempt (such as forced urgency),\" the post reads, \"our employee rightly ignored the messages and reported the incident to our internal security team ", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/17/2021229/hackers-voice-cloned-the-ceo-of-lastpass-for-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Hackers Voice Cloned the CEO of LastPass For Attack", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T21:24:31.336409+00:00", "description": "Trump Media &amp; Technology Group Corp., which has been called the \"mother of all meme stocks\" after it made its stock market debut in late March, announced that its Truth Social platform is moving to launch a live TV streaming platform. Following the news, shares of DJT closed more than 14% lower Tuesday. They ended trading Monday down by more than 18%. CNBC reports: The stock's price has dropped by a whopping 67.7% since Trump Media began trading as a public company on March 26, erasing more than $5 billion in market capitalization. Trump Media's majority shareholder is former President Donald Trump, who holds nearly 60% of its stock.\n \nEarlier Tuesday, Trump Media in a press release said it \"has finished the research and development phase of its new live TV streaming platform and will begin scaling up its own content delivery network.\" The company said it will roll out streaming content in three phases, the first of which will introduce Truth Social's content delivery network for ", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/04/17/2030230/trump-media-shares-down-14-after-company-says-truth-social-to-launch-tv-streaming?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Trump Media Shares Down 14% After Company Says Truth Social To Launch TV Streaming", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T20:19:23.155072+00:00", "description": "An anonymous reader shares a report: A storm hit the United Arab Emirates and Oman this week bringing record rainfall that flooded highways, inundated houses, grid-locked traffic and trapped people in their homes. [...] In the UAE, a record 254 millimetres (10 inches) of rainfall was recorded in Al Ain, a city bordering Oman. It was the largest ever in a 24-hour period since records started in 1949. Rainfall is rare in the UAE and elsewhere on the Arabian Peninsula, that is typically known for its dry desert climate. Summer air temperatures can soar above 50 degrees Celsius. But the UAE and Oman also lack drainage systems to cope with heavy rains and submerged roads are not uncommon during rainfall. \n\nFollowing Tuesday's events, questions were raised whether cloud seeding, a process that the UAE frequently conducts, could have caused the heavy rains. Cloud seeding is a process in which chemicals are implanted into clouds to increase rainfall in an environment where water scarcity is a", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/17/1756223/what-caused-the-storm-that-brought-dubai-to-a-standstill?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "What Caused the Storm That Brought Dubai To a Standstill?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T19:15:18.621373+00:00", "description": "AI's voracious need for computing power is threatening to overwhelm energy sources, requiring the industry to change its approach to the technology, according to Arm Chief Executive Officer Rene Haas. From a report: By 2030, the world's data centers are on course to use more electricity than India, the world's most populous country, Haas said. Finding ways to head off that projected tripling of energy use is paramount if artificial intelligence is going to achieve its promise, he said. \n\n\"We are still incredibly in the early days in terms of the capabilities,\" Haas said in an interview. For AI systems to get better, they will need more training -- a stage that involves bombarding the software with data -- and that's going to run up against the limits of energy capacity, he said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=AI+Computing+Is+on+Pace+To+Consume+More+Energy+Than+India%2C+Arm+Says%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F04%2", "language": "en-us", "link": "https://slashdot.org/story/24/04/17/1741230/ai-computing-is-on-pace-to-consume-more-energy-than-india-arm-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Computing Is on Pace To Consume More Energy Than India, Arm Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T18:10:10.837455+00:00", "description": "Pablo Escobar, the name of the late Colombian drug kingpin, can't be registered as a trademark in the European Union after judges said that approving his brother's bid would go against \"principles of morality.\" From a report: The public \"associate that name with drug trafficking and narco-terrorism and with the crimes and suffering resulting therefrom, rather than with his possible good deeds in favor of the poor in Colombia,\" the EU's General Court in Luxembourg said on Wednesday. Trademarking the name is \"counter to the fundamental values and moral standards prevailing within Spanish society,\" the court said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Escobar+Brother+Barred+by+EU+Court+From+Trademarking+Family+Name%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F04%2F17%2F1524249%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/17/1524249/escobar-brother-barred-by-eu-court-from-trademarking-family-name?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Escobar Brother Barred by EU Court From Trademarking Family Name", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T18:10:08.335855+00:00", "description": "Average incomes will fall by almost a fifth within the next 26 years as a result of the climate crisis, according to a study that predicts the costs of damage will be six times higher than the price of limiting global heating to 2C. From a report: Rising temperatures, heavier rainfall and more frequent and intense extreme weather are projected to cause $38tn of destruction each year by mid-century, according to the research, which is the most comprehensive analysis of its type ever undertaken, and whose findings are published in the journal Nature. The hefty toll -- which is far higher than previous estimates -- is already locked into the world economy over the coming decades as a result of the enormous emissions that have been pumped into the atmosphere through the burning of gas, oil, coal and trees. \n\nThis will inflict crippling losses on almost every country, with a disproportionately severe impact on those least responsible for climate disruption, further worsening inequality. Th", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/17/1645219/average-world-incomes-to-drop-by-nearly-a-fifth-by-2050-study-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Average World Incomes To Drop By Nearly a Fifth By 2050, Study Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T17:05:05.704799+00:00", "description": "404 Media: An online service is scraping Discord servers en masse, archiving and tracking users' messages and activity across servers including what voice channels they join, and then selling access to that data for as little as $5. Called Spy Pet, the service's creator says it scrapes more than ten thousand Discord servers, and besides selling access to anyone with cryptocurrency, is also offering the data for training AI models or to assist law enforcement agencies, according to its website. \n\nThe news is not only a brazen abuse of Discord's platform, but also highlights that Discord messages may be more susceptible to monitoring than ordinary users assume. Typically, a Discord user's activity is spread across disparate servers, with no one entity, except Discord itself, able to see what messages someone has sent across the platform more broadly. With Spy Pet, third-parties including stalkers or potentially police can look up specific users and see what messages they've posted on va", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/17/1556242/a-spy-site-is-scraping-discord-and-selling-users-messages?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "A Spy Site Is Scraping Discord and Selling Users' Messages", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T17:05:03.569377+00:00", "description": "At Amazon's annual cloud conference in 2016, the company captured the crowd's attention by driving an 18-wheeler onstage. Andy Jassy, now Amazon's CEO, called it the Snowmobile, and said the company would be using the truck to help customers speedily transfer data to Amazon Web Services facilities. Less than eight years later, the semi is out of commission. From a report: As of March, AWS had removed Snowmobile from its website, and the Amazon unit has stopped offering the service, CNBC has confirmed. The webpage devoted to AWS' \"Snow family\" of products now directs users to its other data transport services, including the Snowball Edge, a 50-pound suitcase-sized device that can be equipped with fast solid-state drives, and the smaller Snowcone. \n\nAn AWS spokesperson said in an emailed statement that the company has introduced more cost-effective options for moving data. Clients had to deal with power, cooling, networking, parking and security when they used the Snowmobile service, th", "language": "en-us", "link": "https://slashdot.org/story/24/04/17/1614227/amazon-cloud-unit-kills-snowmobile-data-transfer-truck-service?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Cloud Unit Kills Snowmobile Data Transfer Truck Service", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T16:00:06.785581+00:00", "description": "Pavel Durov, the founder of Telegram messaging app, has accused tech giants Google and Apple of threatening to censor content on smartphones [YouTube link]. In an interview with Tucker Carlson, Durov claimed that these companies told Telegram to comply with their guidelines or face removal from their app stores. \n\n\"Those two platforms, they could basically censor everything you can read, access on your smart phone,\" Durov said. With 900 million active users, Telegram is expected to cross the one billion mark within a year.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Telegram+Founder+Accuses+Google+and+Apple+of+Censorship+Threat%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F04%2F17%2F1520201%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F04%2F17%2F1520201%2Ftele", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/17/1520201/telegram-founder-accuses-google-and-apple-of-censorship-threat?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Telegram Founder Accuses Google and Apple of Censorship Threat", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T14:56:30.470743+00:00", "description": "An anonymous reader quotes a report from The Register: In a Monday post, Broadcom CEO Hock Tan restated his belief that VMware's portfolio was too complex, and too poorly integrated, for the virtualization giant to represent true competition for hyperscale clouds. Broadcom's injection of R&amp;D cash, he insisted, will see VMware's flagship Cloud Foundation suite evolve to become more powerful and easy to operate. He also admitted that customers aren't enjoying the ride. \"As we roll out this strategy, we continue to learn from our customers on how best to prepare them for success by ensuring they always have the transition time and support they need,\" he wrote. \"In particular, the subscription pricing model does involve a change in the timing of customers' expenditures and the balance of those expenditures between capital and operating spending.\"\n \nCustomers also told Tan that \"fast-moving change may require more time, so we have given support extensions to many customers who came up ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/17/0329253/broadcom-throws-vmware-customers-on-perpetual-licenses-a-lifeline?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Broadcom Throws VMware Customers On Perpetual Licenses a Lifeline", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T14:56:28.311383+00:00", "description": "Cloudflare, in a blog post: Key insights from the first quarter of 2024 include: \n1. 2024 started with a bang. Cloudflare's defense systems automatically mitigated 4.5 million DDoS attacks during the first quarter -- representing a 50% year-over-year (YoY) increase.\n2. DNS-based DDoS attacks increased by 80% YoY and remain the most prominent attack vector.\n3. DDoS attacks on Sweden surged by 466% after its acceptance to the NATO alliance, mirroring the pattern observed during Finland's NATO accession in 2023. \n\nWe've just wrapped up the first quarter of 2024, and, already, our automated defenses have mitigated 4.5 million DDoS attacks -- an amount equivalent to 32% of all the DDoS attacks we mitigated in 2023. Breaking it down to attack types, HTTP DDoS attacks increased by 93% YoY and 51% quarter-over-quarter (QoQ). Network-layer DDoS attacks, also known as L3/4 DDoS attacks, increased by 28% YoY and 5% QoQ. When comparing the combined number of HTTP DDoS attacks and L3/4 DDoS attack", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/17/131220/cloudflare-ddos-threat-report-for-2024-q1?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cloudflare DDoS Threat Report For 2024 Q1", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T14:56:25.743071+00:00", "description": "Dropbox cofounder and CEO Drew Houston said he views his employees like customers, and that means giving them what they want -- which isn't in-person work. From a report: \"We will support however they want to gather,\" Houston said in a new interview with The Verge. \"But we're finding that these retreats and off-sites and things like that are often a lot more effective than asking people to commute.\" Houston said other business leaders are making the wrong move by forcing employees back to the office. Many companies are pushing employees to return to office in a hybrid structure, including giants like Google, Apple, and Amazon. \n\n\"They keep mashing the go back to 2019 button, and they see it's not working,\" Houston said in the interview, speaking generally about return-to-office mandates. \"Then they just push harder, and then you have this really toxic relationship.\" He compared returning to the office to returning to movie theaters or malls. It may have been cool for a time and people", "language": "en-us", "link": "https://slashdot.org/story/24/04/17/1443226/dropbox-ceo-says-employees-appreciate-remote-work-more-than-cushy-office-perks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Dropbox CEO Says Employees Appreciate Remote Work More Than Cushy Office Perks", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T11:05:52.322232+00:00", "description": "The SEC has blocked third-party messaging apps and texts from employees' work phones, \"bringing its own practices closer to the standards it's enforcing for the industry,\" reports Bloomberg. From the report: The SEC's decision to block disappearing-messaging apps will help improve record-keeping and address potential security vulnerabilities at the agency, which saw one of its social-media accounts compromised earlier this year. It follows about $3 billion in fines imposed on financial firms to settle allegations that they failed to keep adequate records of work-related communications on mobile devices and apps such as Signal and Meta's WhatsApp.\n \nThe scrutiny prompted Wall Street to overhaul how employees communicate on business matters using mobile phones. Meanwhile, the SEC took a hard look at policies covering its own staff's communications on agency-issued phones. The agency has restricted access to third-party messaging applications, as well as SMS (short message service) and i", "language": "en-us", "link": "https://mobile.slashdot.org/story/24/04/17/0025212/sec-targets-its-own-staffs-texting-nixes-whatsapp-on-work-phones?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "SEC Targets Its Own Staff's Texting, Nixes WhatsApp On Work Phones", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T07:45:39.777783+00:00", "description": "NASA has confirmed that a piece of metal that tore through a Florida home last month was space junk from the International Space Station. NBC News reports: The agency confirmed Monday that the 1.6-pound object was debris from a cargo pallet that had been intentionally released from the space station three years ago. The pallet, packed with aging batteries, was supposed to burn up harmlessly in Earth's atmosphere, but a piece survived -- the piece that smashed into a house in Naples, Florida, on March 8.\n \nWINK News, a CBS News affiliate in southwestern Florida, first reported the incident. Naples resident Alejandro Otero told the outlet that the object crashed through the roof and two floors of his home. Otero was not home at the time, he told WINK News, but the metal object nearly hit his son, who was two rooms away. In a blog post about the incident, NASA said it had analyzed the object at the Kennedy Space Center in Florida and confirmed that it was part of the equipment used to mo", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/17/0032258/nasa-confirms-that-debris-from-iss-crashed-into-florida-home?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA Confirms That Debris From ISS Crashed Into Florida Home", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T05:19:08.936151+00:00", "description": "spatwei shares a report from SC Magazine: Microsoft has discovered a new method to jailbreak large language model (LLM) artificial intelligence (AI) tools and shared its ongoing efforts to improve LLM safety and security in a blog post Thursday. Microsoft first revealed the \"Crescendo\" LLM jailbreak method in a paper published April 2, which describes how an attacker could send a series of seemingly benign prompts to gradually lead a chatbot, such as OpenAI's ChatGPT, Google's Gemini, Meta's LlaMA or Anthropic's Claude, to produce an output that would normally be filtered and refused by the LLM model. For example, rather than asking the chatbot how to make a Molotov cocktail, the attacker could first ask about the history of Molotov cocktails and then, referencing the LLM's previous outputs, follow up with questions about how they were made in the past.\n \nThe Microsoft researchers reported that a successful attack could usually be completed in a chain of fewer than 10 interaction turn", "language": "en-us", "link": "https://slashdot.org/story/24/04/16/2341254/crescendo-method-can-jailbreak-llms-using-seemingly-benign-prompts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Crescendo' Method Can Jailbreak LLMs Using Seemingly Benign Prompts", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T05:19:07.467392+00:00", "description": "Framework, the company known for designing and selling upgradeable, modular laptops, has struggled with providing up-to-date software for its products. Ars Technica's Andrew Cunningham spoke with CEO Nirav Patel to discuss how the company is working on fixing these issues. Longtime Slashdot reader snikulin shares the report: Driver bundles remain un-updated for years after their initial release. BIOS updates go through long and confusing beta processes, keeping users from getting feature improvements, bug fixes, and security updates. In its community support forums, Framework employees, including founder and CEO Nirav Patel, have acknowledged these issues and promised fixes but have remained inconsistent and vague about actual timelines. [...] Patel says Framework has taken steps to improve the update problem, but he admits that the team's initial approach -- supporting existing laptops while also trying to spin up firmware for upcoming launches -- wasn't working. \"We started 12th-gen", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/16/2336255/frameworks-software-and-firmware-have-been-a-mess?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Framework's Software and Firmware Have Been a Mess", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T05:19:05.977383+00:00", "description": "State tax collectors, particularly in New York, have intensified their audit efforts on high earners, leveraging artificial intelligence to compensate for a reduced number of auditors. CNBC reports: In New York, the tax department reported 771,000 audits in 2022 (the latest year available), up 56% from the previous year, according to the state Department of Taxation and Finance. At the same time, the number of auditors in New York declined by 5% to under 200 due to tight budgets. So how is New York auditing more people with fewer auditors? Artificial Intelligence.\n \n\"States are getting very sophisticated using AI to determine the best audit candidates,\" said Mark Klein, partner and chairman emeritus at Hodgson Russ LLP. \"And guess what? When you're looking for revenue, it's not going to be the person making $10,000 a year. It's going to be the person making $10 million.\" Klein said the state is sending out hundreds of thousands of AI-generated letters looking for revenue. \"It's like a", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/16/2355249/state-tax-officials-are-using-ai-to-go-after-wealthy-payers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "State Tax Officials Are Using AI To Go After Wealthy Payers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-17T05:19:04.104913+00:00", "description": "An anonymous reader quotes a report from Wired: Dozens of Google employees began occupying company offices in New York City and Sunnyvale, California, on Tuesday in protest of the company's $1.2 billion contract providing cloud computing services to the Israeli government. The sit-in, organized by the activist group No Tech for Apartheid, is happening at Google Cloud CEO Thomas Kurian's office in Sunnyvale and the 10th floor commons of Google's New York office. The sit-in will be accompanied by outdoor protests at Google offices in New York, Sunnyvale, San Francisco, and Seattle beginning at 2 pm ET and 11 am PT. Tuesday's actions mark an escalation in a series of recent protests organized by tech workers who oppose their employer's relationship with the Israeli government, especially in light of Israel's ongoing assault on Gaza. Since Hamas killed about 1,100 Israelis on October 7, the IDF has killed more than 34,000 Palestinians.\n \nJust over a dozen people gathered outside Google's ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/17/0014253/google-workers-protest-cloud-contract-with-israels-government?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Workers Protest Cloud Contract With Israel's Government", "user": null, "vote": 0}]