[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T19:30:06+00:00", "description": "In this age of rogue-like deck builders, turn-based RPGs and dungeon crawlers, it's refreshing to see a developer put a new spin on these elements. Inkbound is from Shiny Shoe and sees players battle against the Blight using different classes known as Aspects.\n\nThe combat is turn-based but allows for moving freely on the battlefield, adjusting for the trajectory of enemy attacks. Vestiges provide passive effects, but you can also break them down to aid in set bonuses. If that weren't enough, there's also online multiplayer, which works seamlessly and lends to rethinking your approach to battles.\n\nInkbound isn't perfect and has minor issues, whether it's the same flow through environments or certain bosses at higher difficulties. However, it's a compelling rogue-like RPG with enough variety and depth to keep you invested.", "language": null, "link": "https://www.youtube.com/watch?v=rxsiHkhahl8", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/rxsiHkhahl8/hqdefault.jpg", "title": "Inkbound Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T15:30:19+00:00", "description": "With Summer approaching, news – official and otherwise – is beginning to roll in about upcoming showcases and events, and though Sony has yet to officially announce one of its own, recent leaks have suggested that a PlayStation Showcase could be lined up for May. \n\nIf that is indeed what Sony has planned, it needs to ensure that it brings out the big guns. Not only does the company need to wash away the lingering bitter taste of last year’s disappointing showcase, in the midst of what’s a relatively slower spell for first-party titles – especially the tentpole releases that Sony is usually equated with – it also needs to provide more details on what big, flagship first-party titles it has lined up for the future. The big question, of course, is whether or not Sony sees the situation the same way.", "language": null, "link": "https://www.youtube.com/watch?v=jyyEeQP8G4o", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/jyyEeQP8G4o/hqdefault.jpg", "title": "Sony’s Rumored PS5 Showcase Next Month Can’t Afford To Be Anything Less Than A Banger", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T10:15:00+00:00", "description": "No developer sets out to make a bad game. Circumstances come together in various ways, whether due to plans changing, delays, engine troubles, unsuccessfully aping other franchises or not understanding what makes for an enjoyable experience.\n\nWhatever the case, there have been some awful titles throughout gaming history, some recent and others stretching back several years. They could be terrible horror games that aren't scary or trying to rip off P.T. to little success; adaptations of movies and television that falter in every single way, from gameplay to story-telling; or, in the rare circumstances, a misleading early access title that's a borderline scam, with its developer mysteriously shutting down a few days later.\n\nCheck out our top 30 picks for the worst game of all time.", "language": null, "link": "https://www.youtube.com/watch?v=-k_cfWRsNGM", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 0, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/-k_cfWRsNGM/hqdefault.jpg", "title": "Top 30 WORST Games of All Time", "user": null, "vote": 0}]