[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T23:11:23.659844+00:00", "description": "A bill introduced in the US Congress on Tuesday intends to force AI companies to reveal the copyrighted material they use to make their generative AI models. From a report: The legislation adds to a growing number of attempts from lawmakers, news outlets and artists to establish how AI firms use creative works like songs, visual art, books and movies to train their software-and whether those companies are illegally building their tools off copyrighted content. \n\nThe California Democratic congressman Adam Schiff introduced the bill, the Generative AI Copyright Disclosure Act, which would require that AI companies submit any copyrighted works in their training datasets to the Register of Copyrights before releasing new generative AI systems, which create text, images, music or video in response to users' prompts. The bill would need companies to file such documents at least 30 days before publicly debuting their AI tools, or face a financial penalty. Such datasets encompass billions of ", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/10/201235/new-bill-would-force-ai-companies-to-reveal-use-of-copyrighted-art?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "New Bill Would Force AI Companies To Reveal Use of Copyrighted Art", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T22:06:14.975687+00:00", "description": "An anonymous reader writes: More books were called to be banned in 2023 across US schools and libraries than any other year on record, according to a new report from the American Library Association (ALA). Building on a surge that started in 2021, some 4,240 unique book titles were challenged last year -- a 65% increase from 2022, and the highest figure documented in over 20 years of tracking. \n\nAlthough the number of affected titles has grown dramatically, as groups increasingly target multiple books at once, overall censorship demands dropped slightly, down 2% to 1,247. Literature concerning race and gender was particularly contested, with autobiographical graphic novel Gender Queer named the most challenged library book of the year.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=More+Books+Than+Ever+Targeted+For+Bans%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F04%2F10%2F1950253%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img s", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/10/1950253/more-books-than-ever-targeted-for-bans?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "More Books Than Ever Targeted For Bans", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T22:06:12.926568+00:00", "description": "The Motion Picture Association is going off on piracy again. During CinemaCon in Las Vegas, MPA CEO Charles Rivkin announced that the organization plans on working with Congress to pass rules blocking websites with pirated content. The Verge: The MPA is a trade association representing Hollywood studios, including Paramount, Sony, Universal, and Disney (it's also behind the ratings board that gives you an R if you say curse words too often). It has long lobbied for anti-piracy laws, but it seems the battle is heating up again. In his speech on Tuesday, Rivkin highlights what a major problem piracy in the US has become, saying it costs \"hundreds of thousands of jobs\" and \"more than one billion in theatrical ticket sales.\" \n\nIt's true: piracy has gone up in recent years. A report from piracy data analytics company Muso revealed that video piracy websites around the globe received 141 billion visits in 2023, making for a 12 percent increase when compared to 2019. The US and India made up", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/10/1956256/mpa-has-big-plans-to-crack-down-on-movie-piracy-again?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "MPA Has Big Plans To Crack Down on Movie Piracy Again", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T21:01:00.973741+00:00", "description": "The Securities and Exchange Commission warned Uniswap on Wednesday that it intends to bring an enforcement action against the company, which is the leading platform for DeFi -- a segment of the crypto market where traders rely on computer protocols that act as automated market makers for exchanging various tokens. From a report: The warning came in the form of a so-called Wells Notice, which the SEC sends to a company prior to launching a formal lawsuit and which provides it a final opportunity to rebut any allegations. In this case, that process is likely to prove little more than a formality as the agency has reportedly been investigating Uniswap for some time, and is in the midst of a sweeping crackdown of the crypto industry.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=SEC+Moves+To+Sue+Uniswap+in+Bid+To+Hobble+Fast-Growing+DeFi+Sector%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F04%2F10%2F1938213%2F%3Futm_source%3Dtwitter%26utm_me", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/10/1938213/sec-moves-to-sue-uniswap-in-bid-to-hobble-fast-growing-defi-sector?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "SEC Moves To Sue Uniswap in Bid To Hobble Fast-Growing DeFi Sector", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T21:00:59.468935+00:00", "description": "An anonymous reader shares a report: It's getting to be a bit much. Auto insurance prices have surged over the last couple years. March consumer inflation out Wednesday shows them up 22% compared to last year. Since the end of 2019 -- just before Covid hit -- they're up 45%. \n\nWhy? That's where things get complicated. In a prophylactic press release released Wednesday morning, an insurance industry trade group cited \"greatly increased the cost of repairing and replacing cars\" due to inflation. As anyone who has shopped for a new or used car over the last couple years can tell you, costs have gone up. That goes for the costs of replacing minor parts like bumpers or mirrors as well. \n\nInsurers lost a lot of money on those replacement costs in 2021 and 2022, and are now trying to make that money back by raising rates a lot.\n\nThen there's also the the objectively atrocious driving record of Americans. Even before the pandemic, Americans were awful drivers compared to other high income cou", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/10/1942254/auto-insurance-prices-have-gone-nuts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Auto Insurance Prices Have Gone Nuts", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T19:56:04.955745+00:00", "description": "An anonymous reader quotes a report from Reuters: Independent browser companies in the European Union are seeing a spike in users in the first month after EU legislation forced Alphabet's Google, Microsoft and Apple to make it easier for users to switch to rivals, according to data provided to Reuters by six companies. The early results come after the EU's sweeping Digital Markets Act, which aims to remove unfair competition, took effect on March 7, forcing big tech companies to offer mobile users the ability to select from a list of available web browsers from a \"choice screen.\" [...]\n \nCyprus-based Aloha Browser said users in the EU jumped 250% in March -- one of the first companies to give monthly growth numbers since the new regulations came in. Founded in 2016, Aloha, which markets itself as a privacy focused alternative to browsers owned by big tech, has 10 million monthly average users and earns money through paid subscriptions, rather than selling ads by tracking users. \"Befor", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/10/1925223/eus-new-tech-laws-are-working-small-browsers-gain-market-share?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EU's New Tech Laws Are Working; Small Browsers Gain Market Share", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T17:47:28.090854+00:00", "description": "Kobo, a leading e-reader company, is set to release its first color e-readers on April 30: the Kobo Clara Colour ($149.99) and Kobo Libra Colour ($219.99). These devices feature colorful screens, waterproofing, Wi-Fi 5, Bluetooth, USB-C, and an adjustable frontlight. \n\nThe Clara has a 6-inch screen, while the Libra boasts a 7-inch display and supports the Kobo Stylus. Both utilize E Ink's Kaleido 3 technology, offering 4,096 colors and improved resolution. Kobo's competitive pricing undercuts other color e-readers, which typically start at $300. The company is also updating its black-and-white Clara model, now called Clara BW, with a faster processor at a lower price of $129.99.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Kobo+Adds+Color+To+Its+E-reader+Lineup+For+the+First+Time%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F04%2F10%2F1647234%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_la", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/10/1647234/kobo-adds-color-to-its-e-reader-lineup-for-the-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Kobo Adds Color To Its E-reader Lineup For the First Time", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T17:47:25.893003+00:00", "description": "Vinod Khosla, the founder of venture capital firm Khosla Ventures, opines on the bill that seeks to ban TikTok or force its parent firm to divest the U.S. business: Even if one could argue that this bill strikes at the First Amendment, there is legal precedent for doing so. In 1981, Haig vs Agee established that there are circumstances under which the government can lawfully impinge upon an individual's First Amendment rights if it is necessary to protect national security and prevent substantial harm. TikTok and the AI that can be channelled through it are national and homeland security issues that meet these standards. \n\nShould this bill turn into law, the president would have the power to force any foreign-owned social media to be sold if US intelligence agencies deem them a national security threat. This broader scope should protect against challenges that this is a bill of attainder. Similar language helped protect effective bans on Huawei and Kaspersky Lab. As for TikTok's value", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/10/172250/the-us-is-right-to-target-tiktok-says-vinod-khosla?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The US is Right To Target TikTok, Says Vinod Khosla", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T16:42:21.645846+00:00", "description": "For the first time ever, the Environmental Protection Agency announced Wednesday it is issuing a national regulation limiting the amount of certain per- and polyfluoroalkyl substances, known as PFAS, found in drinking water. From a report: Commonly called \"forever chemicals,\" PFAS are synthetic chemicals found nearly everywhere -- in air, water, and soil -- and can take thousands of years to break down in the environment. The EPA has stated there is no safe level of exposure to PFAS without risk of health impacts, but now it will require that public water utilities test for six different types of PFAS chemicals to reduce exposure in drinking water. The new standards will reduce PFAS exposure for 100 million people, according to the EPA, and prevent thousands of deaths and illnesses. \n\n\"Drinking water contaminated with PFAS has plagued communities across this country for too long,\" EPA Administrator Michael S. Regan said in a statement Wednesday. For public water utility companies to c", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/10/1531203/epa-announces-first-ever-national-regulations-for-forever-chemicals-in-drinking-water?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EPA Announces First-Ever National Regulations For 'Forever Chemicals' in Drinking Water", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T16:42:19.899019+00:00", "description": "Amazon will no longer pay developers to create applications for Alexa, scrapping a key element of the company's effort to build a flourishing app store for its voice-activated digital assistant. From a report: Amazon recently told participants of the Alexa Developer Rewards Program, which cut monthly checks to builders of popular Alexa apps, that the offering would end at the end of June. \"Developers like you have and will play a critical role in the success of Alexa and we appreciate your continued engagement,\" said the notice, which was reviewed by Bloomberg. Amazon is also winding down a program that offered free credits for Alexa developers to power their programs with Amazon Web Services, according to a notice posted on a company website. \n\nDespite losing the direct payments, developers can still monetize their efforts with in-app purchases. Alexa, which powers Echo smart speakers and other devices, helped popularize voice assistants when it debuted almost a decade ago, letting u", "language": "en-us", "link": "https://developers.slashdot.org/story/24/04/10/1626236/amazon-to-stop-paying-developers-to-create-apps-for-alexa?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon To Stop Paying Developers To Create Apps For Alexa", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T15:37:00.576065+00:00", "description": "It appears that a nearly eight-year-long battle by the FCC to require internet companies to display information on the costs, fees, and speeds of their broadband services is finally over. From a report: Starting on Wednesday, all but the smallest ISPs will be required to publish broadband \"nutrition labels\" on all of their plans, the regulator announced. [...] Each label will include monthly broadband prices, introductory rate details, data allowances, broadband speeds, and links to find out about any available discounts or service bundles. Links to network management practices and privacy policies should be listed as well.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Consumers+Will+Finally+See+FCC-Mandated+'Nutrition+Labels'+For+Most+Broadband+Plans%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F04%2F10%2F1433246%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"sl", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/10/1433246/consumers-will-finally-see-fcc-mandated-nutrition-labels-for-most-broadband-plans?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Consumers Will Finally See FCC-Mandated 'Nutrition Labels' For Most Broadband Plans", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T14:33:05.253234+00:00", "description": "Beginning today, Waymo said it would start offering paid robotaxi rides in Los Angeles. It's been offering free \"on tour\" rides since it announced plans for the service in January, and last month it received regulatory approval for the expansion to a paid service. NBC News reports: Waymo said Tuesday that more than 50,000 people were on its waitlist to use the service. The company did not say how many users it would allow to fully use the app starting Wednesday. Last month, the company said it was starting with a Los Angeles fleet of fewer than 50 cars covering a 63-square-mile area from Santa Monica to downtown L.A. Los Angeles County has a population of 9.7 million people. The service works similarly to other ride-hailing smartphone apps such as Flywheel, Lyft and Uber, except that Waymo's vehicles have no human drivers present. Riders follow instructions on the app and through the vehicle's sound system, though Waymo workers can assist remotely.\n \n[F]or now, Waymo's only competitio", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/10/0252206/waymo-launches-paid-robotaxi-service-in-los-angeles?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Waymo Launches Paid Robotaxi Service In Los Angeles", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T14:33:03.747316+00:00", "description": "Privacy startup Proton already offers an email app, a VPN tool, cloud storage, a password manager, and a calendar app. In April 2022, Proton acquired SimpleLogin, an open-source product that generates email aliases to protect inboxes from spam and phishing. Today, Proton acquired Standard Notes, advancing its already strong commitment to the open-source community. From a report: Standard Notes is an open-source note-taking app, available on both mobile and desktop platforms, with a user base of over 300,000. [...] Proton founder and CEO Andy Yen makes a point of stating that Standard Notes will remain open-source, will continue to undergo independent audits, will continue to develop new features and updates, and that prices for the app/service will not change. Standard Notes has three tiers: Free, which includes 100MB of storage, offline access, and unlimited device sync; Productivity for $90 per year, which includes features like markdown, spreadsheets with advanced formulas, Daily N", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/10/148253/proton-acquires-standard-notes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Proton Acquires Standard Notes", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T13:27:41.986953+00:00", "description": "An anonymous reader quotes a report from TorrentFreak: Cox Communications doesn't believe that ISPs should be held liable for the activities of their pirating subscribers. After a disappointing verdict from a Virginia jury and an unsatisfactory outcome at the Court of Appeals, the internet provider now intends to escalate the matter to the Supreme Court. If the present verdict stands, innocent people risk losing their Internet access, the ISP notes. [...] That's notable, as it would be the first time that a \"repeat infringer\" case ends up at the highest court United States. Cox asked the court of appeals to also stay its mandate pending its Supreme Court application, as this could steer the legal battle in yet another direction.\n \nAccording to Cox, the Supreme Court has substantial reasons to take on the case. For one, there are currently conflicting court of appeals rulings on the \"material contribution\" aspect of copyright infringement. The Supreme Court could give more clarity on w", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/10/0220241/cox-plans-to-take-piracy-liability-battle-to-the-supreme-court?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cox Plans To Take Piracy Liability Battle To the Supreme Court", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T10:08:04.503703+00:00", "description": "A brain implant startup called Synchron is preparing to recruit patients for a large-scale clinical trial to seek commercial approval for its device. Reuters reports: Synchron on Monday plans to launch an online registry for patients interested in joining the trial meant to include dozens of participants, and has received interest from about 120 clinical trial centers to help run the study, CEO Thomas Oxley said in an interview. \"Part of this registry is to start to enable local physicians to speak to patients with motor impairment,\" he said. \"There's a lot of interest so we don't want it to come in a big bottleneck right before the study we'll be doing.\"\n \nSynchron received U.S. authorization for preliminary testing in July 2021 and has implanted its device in six patients. Prior testing in four patients in Australia showed no serious adverse side effects, the company has reported. Synchron will be analyzing the U.S. data to prepare for the larger study, while awaiting authorization ", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/09/2137252/synchron-readies-large-scale-brain-implant-trial?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Synchron Readies Large-Scale Brain Implant Trial", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T07:57:50.698060+00:00", "description": "After 64 years of service, ULA on Tuesday launched its last-ever Delta rocket carrying a classified payload for the U.S. National Reconnaissance Office (NRO). \"The powerful booster departed Space Launch Complex-37 (SLC-37) at Cape Canaveral Space Force Station in Florida at 12:53 p.m. EDT (1653 GMT), literally setting itself on fire for the 16th and final time,\" reports Space.com. From the report: That spectacle, which was unique to the Delta IV in its heaviest configuration, was the result of hydrogen building up in the flame trench and then rising up alongside the rocket after it was used to cool down the three RS-68A engines to cryogenic temperatures. When the engines fired, the hydrogen ignited and flames lapped at the orange insulation covering the core stage and its two side-mounted boosters. The two boosters were jettisoned about four minutes into the flight, followed by the core, or first stage, separating one minute and 45 seconds later. A single RL10C-2-1 engine on the Delta", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/10/0230237/ula-launches-final-delta-rocket-after-64-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "ULA Launches Final Delta Rocket After 64 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T03:36:58.991164+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Former Apple design lead Jony Ive and current OpenAI CEO Sam Altman are seeking funding for a new company that will produce an \"artificial intelligence-powered personal device,\" according to The Information's sources, who are said to be familiar with the plans. The exact nature of the device is unknown, but it will not look anything like a smartphone, according to the sources. We first heard tell of this venture in the fall of 2023, but The Information's story reveals that talks are moving forward to get the company off the ground.\n \nIve and Altman hope to raise at least $1 billion for the new company. The complete list of potential funding sources they've spoken with is unknown, but The Information's sources say they are in talks with frequent OpenAI investor Thrive Capital as well as Emerson Collective, a venture capital firm founded by Laurene Powell Jobs. SoftBank CEO and super-investor Masayoshi Son is also said to have spoke", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/09/2119235/ai-hardware-company-from-jone-ive-sam-altman-seeks-1-billion-in-funding?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Hardware Company From Jone Ive, Sam Altman Seeks $1 Billion In Funding", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T02:32:13.507283+00:00", "description": "According to the European Union, Earth has reached its warmest March on record, capping a 10-month streak in which every month set a new temperature record. Reuters reports: Each of the last 10 months ranked as the world's hottest on record, compared with the corresponding month in previous years, the EU's Copernicus Climate Change Service (C3S) said in a monthly bulletin. The 12 months ending with March also ranked as the planet's hottest ever recorded 12-month period, C3S said. From April 2023 to March 2024, the global average temperature was 1.58 degrees Celsius above the average in the 1850-1900 pre-industrial period.\n \nC3S' dataset goes back to 1940, which the scientists cross-checked with other data to confirm that last month was the hottest March since the pre-industrial period. Already, 2023 was the planet's hottest year in global records going back to 1850. El Nino peaked in December-January and is now weakening, which may help to break the hot streak toward the end of the ye", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/09/2125238/march-marks-yet-another-record-in-global-heat?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "March Marks Yet Another Record In Global Heat", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T00:19:16.757825+00:00", "description": "According to StatCounter, Linux on the desktop has continued to rise and remain above 4%. GamingOnLinux reports: First hitting over 4% in February, their March data is now in showing not just staying above 4% but rising a little once again showing the trend is clear that Linux use is rising. Slow and steady wins the race as they say. [Last March, Linux on the desktop was at 2.85%.]\n \nTechnically, ChromeOS is also Linux, and while people like to debate that if you do include Linux and ChromeOS together it would actually be 6.32%. A number that is getting steadily harder for developers of all kinds to ignore. It terms of overall percentage, it's still relatively small but when you think about how many people that actually is, it's a lot. Since StatCounter gets its data from web traffic, it's unlikely the rise is due to the Steam Deck and its SteamOS. \"I doubt all that many browse the web regularly on Deck,\" writes GameOnLinux's Liam Dawe. \"However, indirectly? Possible, I've seen lots a", "language": "en-us", "link": "https://linux.slashdot.org/story/24/04/09/2048213/linux-continues-to-be-above-4-on-the-desktop?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Linux Continues To Be Above 4% On the Desktop", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-10T00:19:12.780336+00:00", "description": "Keaton Peters reports via the Texas Tribune: Students sitting for their STAAR exams this week will be part of a new method of evaluating Texas schools: Their written answers on the state's standardized tests will be graded automatically by computers. The Texas Education Agency is rolling out an \"automated scoring engine\" for open-ended questions on the State of Texas Assessment of Academic Readiness for reading, writing, science and social studies. The technology, which uses natural language processing technology like artificial intelligence chatbots such as GPT-4, will save the state agency about $15-20 million per year that it would otherwise have spent on hiring human scorers through a third-party contractor.\n \nThe change comes after the STAAR test, which measures students' understanding of state-mandated core curriculum, was redesigned in 2023. The test now includes fewer multiple choice questions and more open-ended questions -- known as constructed response items. After the rede", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/09/212247/texas-will-use-computers-to-grade-written-answers-on-this-years-staar-tests?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Texas Will Use Computers To Grade Written Answers On This Year's STAAR Tests", "user": null, "vote": 0}]