[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T04:25:15+00:00", "description": "<p>Master Assassins by Robert V.S. Redick is desert fantasy par excellence, a grimdark tale of two half-brothers, Kandri and Mektu Hinjuman, on the run after they are implicated in an accidental death. Kandri and Mektu love each other as brothers but are often bitter rivals consumed by jealousy. Although the novel focuses closely on Kandri and Mektu, the worldbuilding in Master Assassins steals the show. Master Assassins takes place in the vast desert world of Urrath, which is battling against a horrifying pandemic. Kandri and Mektu are soldiers in service of the Prophet, a madwoman who incites religious zealotry and warmongering among her quarantined people. However, Kandri and Mektu have doubts about the Prophet’s divinity, and an unintentional killing sends them fleeing into the vast desert known as The Land That Eats Men, pursued by a band of elite hunters (and worse). Kandri and Mektu have polar opposite personalities. Kandri is rational in thought and intentional in action. But ", "id": 838391, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-master-assassins-by-robert-v-s-redick", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: Master Assassins by Robert V.S. Redick", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T01:15:24+00:00", "description": "<p>Last Updated on July 10, 2024 Gladiator starring prime Russel Crowe is one of the best pieces of cinema ever created. I&#8217;ve watched that movie&#8211;or had it running in the background while working on this very website&#8211;so many times I&#8217;ve lost count. To actually see the trailer for Gladiator 2 release almost twenty-five years later is both wildly exciting and absolutely terrifying to a super fan, like me. The cinematics, battles, closeness of the one-on-one combat, and Denzel Washington&#8217;s character (despite whatever that American slash something accent attempt is) have me pumped for this. The one violently intrusive thought I have is that, other than 2022&#8217;s Top Gun: Maverick, I can&#8217;t really recall the last time trying to recreate that amazing feeling of the original or taking a new spin on an old movie went well. Whatever may come, there is the better part of half a year between now and when Gladiator 2 hits the screens, and if you&#8217;re anythi", "id": 837848, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/gladiator-2-is-coming-heres-the-best-dark-fantasy-to-read-between-now-and-november-14", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "Gladiator 2 is coming! Here’s the best dark fantasy to read between now and November 14", "user": null, "vote": 0}]