[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T13:01:01+00:00", "description": "ACCU Membership: https://tinyurl.com/ydnfkcyn\n---\n\nGamification - Falling Down the Leader Board? - Char Ryder - ACCU 2024\n---\n\nAttention is one of the most precious commodities a system can capture, and the most successful trap a system can deploy is gamification. This strategic implementation of game mechanics and systems to non-game applications is prevalent in almost every modern system - technical or otherwise.\n\nHowever, recent research has shone a spotlight on the dark side of gamification and unveiled the damage it can do to its audience. In this talk, we’ll explore the unseen side of gamification, explore its consequences, and discuss how best to counteract them.\n\nSlides: https://accu.org/conf-previous/accu2024/\nSponsored By think-cell\n---\n\nChar Ryder\n\nProud to be a course representative for 10 years running, Char is a passionate individual who excels at communication and organisation. When their course concludes, they look forward to returning to full-time development work, fr", "id": 840917, "language": null, "link": "https://www.youtube.com/watch?v=qO5sxo_liR8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJhay24LTpO1s4bIZxuIqKw", "source_obj__id": 421, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qO5sxo_liR8/hqdefault.jpg", "title": "Gamification - Falling Down the Leader Board? - Char Ryder - ACCU 2024", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T12:30:00+00:00", "description": "ACCU Membership: https://tinyurl.com/ydnfkcyn\n---\n\nShaping Perception - The Evolution of 3D Graphics and Cultural Transformation - Ben Kyd - ACCU 2024\n---\n\nFrom the beginnings of wireframes to the stunning realism of modern renders, the evolution of 3D graphics has been nothing short of world-changing. In this talk, we will explore how the historical development of 3D graphics has profoundly influenced our cultural landscape. Tracing the journey from early video games to blockbuster films and virtual reality experiences, we will uncover the pivotal moments and technological breakthroughs that have reshaped our perceptions of art, entertainment, and communication. Through a blend of historical analysis, industry insights, and cultural critique, attendees will gain a deeper understanding of how 3D graphics have not only transformed the way we create and consume media but also influenced societal norms, trends, and values.\n\nSlides: https://accu.org/conf-previous/accu2024/\nSponsored By th", "id": 840918, "language": null, "link": "https://www.youtube.com/watch?v=0T7r6zWWUBw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJhay24LTpO1s4bIZxuIqKw", "source_obj__id": 421, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/0T7r6zWWUBw/hqdefault.jpg", "title": "Shaping Perception - The Evolution of 3D Graphics and Cultural Transformation - Ben Kyd - ACCU 2024", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T12:00:01+00:00", "description": "ACCU Membership: https://tinyurl.com/ydnfkcyn\n---\n\nAmplifying Black Women's Voices - Building Inclusive Tech Spaces Beyond Tokenism - Yemi Adenekan - ACCU 2024\n---\n\nThe tech sector deprives itself of the smartness and the diversity of black women although it needs them. These women also have to deal with  discrimination and microaggressions. This presentation is intended to  uncover the challenges experienced by black women, in the quest for a truly demographic equality.\n\nGetting inspiration from talks like \"Black Women Lead: Leading the Tech Landscape Transformation‟ by Kimberly Bryant (Founder, Black Girls CODE) in Grace Hopper Celebration 2023, this interactive session is not about black female representation only. It offers authentic participation that creates a climate of inclusivity and psychological safety for black women. Participants will be taught how to act on challenging microaggressions, how to create safe environments for tough discussions, and how to speak up for equita", "id": 840919, "language": null, "link": "https://www.youtube.com/watch?v=0makY11qYs8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJhay24LTpO1s4bIZxuIqKw", "source_obj__id": 421, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/0makY11qYs8/hqdefault.jpg", "title": "Amplifying Black Women's Voices - Building Inclusive Tech Spaces Beyond Tokenism - Yemi Adenekan", "user": null, "vote": 0}]