[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T23:27:02.947297+00:00", "description": "The U.S. FTC, along with two other international consumer protection networks, announced on Thursday the results of a study into the use of \"dark patterns\" -- or manipulative design techniques -- that can put users' privacy at risk or push them to buy products or services or take other actions they otherwise wouldn't have. TechCrunch: In an analysis of 642 websites and apps offering subscription services, the study found that the majority (nearly 76%) used at least one dark pattern and nearly 67% used more than one. Dark patterns refer to a range of design techniques that can subtly encourage users to take some sort of action or put their privacy at risk. They're particularly popular among subscription websites and apps and have been an area of focus for the FTC in previous years. For instance, the FTC sued dating app giant Match for fraudulent practices, which included making it difficult to cancel a subscription through its use of dark patterns. \n\n[...] The new report published Thur", "id": 844221, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/10/2017255/ftc-study-finds-dark-patterns-used-by-a-majority-of-subscription-apps-and-websites?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FTC Study Finds 'Dark Patterns' Used By a Majority of Subscription Apps and Websites", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T22:23:02.870472+00:00", "description": "Microsoft is under fire for its handling of customer notifications following a data breach by Russian state-sponsored hackers. The tech giant confirmed in March that the group known as Midnight Blizzard had accessed its systems, potentially compromising customer data. Cybersecurity experts, including former Microsoft employee Kevin Beaumont, have raised concerns about the notification process. Beaumont warned on social media that the company's emails may be mistaken for spam or phishing attempts due to their format and the use of unfamiliar links. \"The notifications aren't in the portal, they emailed tenant admins instead,\" Beaumont stated, adding that the emails could be easily overlooked. Some recipients have reported confusion over the legitimacy of the notifications, with many seeking confirmation through support channels and account managers.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Emails+That+Warned+Customers+of+Russian", "id": 843922, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/10/2011234/microsoft-emails-that-warned-customers-of-russian-hacks-criticized-for-looking-like-spam-and-phishing?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Emails That Warned Customers of Russian Hacks Criticized For Looking Like Spam And Phishing", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T22:23:01.283220+00:00", "description": "An anonymous reader quotes a report from VentureBeat: The Girls in Tech nonprofit women's tech community is closing its doors after 17 years, according to a newsletter from founder Adriana Gascoigne. Gascoigne said the decision was made with \"sadness and devastation\" and was not made lightly. \"It is with a heavy heart that I share the news that Girls in Tech will be closing its doors. This decision was not made lightly, and the sadness and devastation we feel cannot be overstated,\" Gascoigne wrote. \"For 17 incredible years, we have offered a welcoming community based on empowerment, support, and inspiration for women in the tech industry. Together, we have made a profound impact, helping women reach for the stars and excel in their careers, while working tirelessly to eliminate the gender gap in tech worldwide.\"\n \nThe group reached more than 250,000 individuals across 35 chapters in 30 countries on six continents. It was founded in Silicon Valley, but Gascoigne relocated the group to ", "id": 843921, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/10/2037254/girls-in-tech-closes-its-doors-after-17-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Girls In Tech' Closes Its Doors After 17 Years", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T21:17:03.547109+00:00", "description": "AMD shares are up following the announcement that it plans to acquire Finnish artificial intelligence company Silo AI for about $665 million. Reuters reports: Acquiring Silo AI will help AMD improve the development and deployment of AMD-powered AI models and help potential customers build complex AI models with the company's chips, AMD said. Silo AI will also strengthen AMD's software development capabilities. While the deal will not impact AMD's financial performance, it \"unlocks a significant amount of business moving forward,\" AMD Senior Vice President of AI, Vamsi Boppana said in an interview. AMD declined to discuss how much business the acquisition would generate over time.\n \nHelsinki, Finland-based Silo AI specializes in end-to-end AI-driven solutions that help customers integrate the tech into their products and services. With operations in Europe and North America, the startup counts companies, including Philips, Rolls-Royce, and Unilever, among its customers. Silo AI's CEO a", "id": 843651, "language": "en-us", "link": "https://slashdot.org/story/24/07/10/2010244/amd-plans-to-acquire-silo-ai-in-665-million-deal?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AMD Plans To Acquire Silo AI In $665 Million Deal", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T21:17:01.478877+00:00", "description": "A bipartisan group of senators reached a new agreement on legislation that would ban members of Congress, their spouses and dependent children, as well as the president and vice president, from purchasing and selling stocks while in office. According to CNBC, it would also give lawmakers 90 days to sell their stocks. From the report: The proposal is the latest chapter in a yearslong saga in Congress to pass regulations that limit lawmakers' ability to buy and sell stocks, and the first one to get formal consideration by a Senate committee -- in this case the Homeland Security &amp; Governmental Affairs Committee on July 24. Ethics experts say that legislators' access to the kind of information they receive gives them the potential of having an unfair advantage to the investing public.\n \nSens. Hawley, Jon Ossoff, D-Ga., Jeff Merkley, D-Ore., and Gary Peters, D-Mich., negotiated and announced the new details. If passed, the bill would also prohibit lawmakers' spouses and dependent child", "id": 843650, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/10/1940249/senators-strike-bipartisan-deal-for-a-ban-on-stock-trading-by-members-of-congress?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Senators Strike Bipartisan Deal For a Ban On Stock Trading By Members of Congress", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T20:12:18.437959+00:00", "description": "At its Galaxy Unpacked event today, Samsung unveiled a slew of new devices ushering in the \"Next Frontier of Mobile AI.\" With \"cross-device intelligence,\" each device has its own set of AI features that Samsung said will be personalized for users, good for humanity, and empowering for creators. Ars Technica's Kevin Purdy reports: Aiming to put its Galaxy AI onto your wrist and fingers, Samsung announced a seventh version of its Galaxy Watch, a rugged and larger Galaxy Watch Ultra, and the first version of a Galaxy Ring. [...] The Galaxy Watch 7 and Watch Ultra are strikingly similar to their inspirations: the Apple Watch Ultra and the previous Galaxy Watch, respectively. [...] The Galaxy Z Fold 6 ($1,900) and Z Flip 6 ($1,100) have the kinds of boosts from their prior models you might expect. There's a Snapdragon 8 Gen 3 chip inside. The folding glass on both is supposedly stronger and now rated for IP48, which means dust resistance went from \"X\" (good luck) to \"4\" (1 mm and greater p", "id": 843281, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/07/10/1929206/galaxy-z-fold-z-flip-6-watch-ultra-and-new-ring-are-samsungs-ai-carriers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Galaxy Z Fold &amp; Z Flip 6, Watch Ultra, and New Ring Are Samsung's AI Carriers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T20:12:16.340306+00:00", "description": "Amazon Web Services is the latest entrant to the generative AI game with the announcement of App Studio, a groundbreaking tool capable of building complex software applications from simple written prompts. TechCrunch's Ron Miller reports: \"App Studio is for technical folks who have technical expertise but are not professional developers, and we're enabling them to build enterprise-grade apps,\" Sriram Devanathan, GM of Amazon Q Apps and AWS App Studio, told TechCrunch. Amazon defines enterprise apps as having multiple UI pages with the ability to pull from multiple data sources, perform complex operations like joins and filters, and embed business logic in them. It is aimed at IT professionals, data engineers and enterprise architects, even product managers who might lack coding skills but have the requisite company knowledge to understand what kinds of internal software applications they might need. The company is hoping to enable these employees to build applications by describing th", "id": 843280, "language": "en-us", "link": "https://slashdot.org/story/24/07/10/1955209/aws-app-studio-promises-to-generate-enterprise-apps-from-a-written-prompt?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AWS App Studio Promises To Generate Enterprise Apps From a Written Prompt", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T18:04:20.092323+00:00", "description": "An anonymous reader shares a report: On Wednesday, Amazon claimed that it reached its goal of sourcing all its power from clean energy sources in the past year. If taken at face value, the announcement would mean it hit the milestone seven years ahead of schedule, which would be a monumental achievement. But environmental experts speaking to The New York Times, including a group of concerned Amazon employees, warn that the company is \"misleading the public by distorting the truth.\" The company's claim of achieving 100 percent clean electricity is based in part on billion-dollar investments in over 500 solar and wind initiatives. The company's logic is that the energy these projects generate equals the electricity its data centers consume -- ergo, even Steven. But the renewable energy sources it uses for those calculations are fed into a general power grid, not exclusively into Amazon's operations. Environmental experts caution that the company is using \"accounting and marketing to mak", "id": 842514, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/10/1735234/environmental-groups-accuse-amazon-of-distorting-the-truth-in-latest-clean-energy-claim?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Environmental Groups Accuse Amazon of 'Distorting the Truth' in Latest Clean-Energy Claim", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T16:59:04.840680+00:00", "description": "Microsoft and Apple dropped plans to take board roles at OpenAI in a surprise decision that underscores growing regulatory scrutiny of Big Tech's influence over artificial intelligence. From a report: Microsoft, which invested $13 billion in the ChatGPT creator, will withdraw from its observer role on the board, the company said in a letter to OpenAI on Tuesday, which was seen by Bloomberg News. Apple was due to take up a similar role, but an OpenAI spokesperson said the startup won't have board observers after Microsoft's departure. Regulators in the US and Europe had expressed concerns about Microsoft's sway over OpenAI, applying pressure on one of the world's most valuable companies to show that it's keeping the relationship at arm's length. Microsoft has integrated OpenAI's services into its Windows and Copilot AI platforms and, like other big US tech companies, is banking on the new technology to help drive growth.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http:/", "id": 841996, "language": "en-us", "link": "https://apple.slashdot.org/story/24/07/10/1612246/microsoft-apple-drop-openai-board-plans-as-scrutiny-grows?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft, Apple Drop OpenAI Board Plans as Scrutiny Grows", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T16:59:03.175818+00:00", "description": "An anonymous reader shares a report: For years now, Microsoft's Xbox Game Pass has set itself apart by offering subscribers launch-day access to new first-party titles in addition to a large legacy library of older games. That important \"day one\" perk is now set to go away for all but the highest tier of Game Pass' console subscribers, even as Microsoft asks for more money for Game Pass across the board. Let's start with the price increases for existing Game Pass tiers, which are relatively straightforward: \n\n\"Game Pass Ultimate\" is going from $16.99 to $19.99 per month.\n\"Game Pass for PC\" is going from $9.99 to $11.99 per month.\n\"Game Pass Core\" (previously known as Xbox Live Gold) is going from $59.99 to $74.99 for annual subscriptions (and remains at $9.99 for monthly subscriptions).\nThings get a bit more complicated for the $10.99/month \"Xbox Game Pass for Console\" tier. \n\nMicrosoft announced that it will no longer accept new subscriptions for that tier after today, though current", "id": 841995, "language": "en-us", "link": "https://games.slashdot.org/story/24/07/10/1627237/microsoft-asks-many-game-pass-subscribers-to-pay-more-for-less?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Asks Many Game Pass Subscribers To Pay More For Less", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T15:54:02.999445+00:00", "description": "An anonymous reader shares a report: A CNN investigation found the use of hidden cameras is a persistent problem in the industry. Regulations are sparse, and the punishments for those that commit these crimes are lenient -- video voyeurism is typically charged as a misdemeanor. Meanwhile, the people who are recorded -- often naked or engaging in sexual activities -- say they suffer from long-term trauma and the fear that their images could, at any moment, be disseminated on the internet. An Airbnb spokesperson told CNN that hidden camera complaints are rare, but when they do occur, \"we take appropriate, swift action, which can include removing hosts and listings that violate the policy.\" \n\nAt a court-ordered deposition last year, an Airbnb representative was supposed to answer a key question from the attorney suing the company: How many complaints or reports had been made to Airbnb since December 1, 2013, of people who had been recorded by surveillance devices? The Airbnb representati", "id": 841471, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/10/1531251/hidden-camera-concerns-plague-short-term-rental-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Hidden Camera Concerns Plague Short-Term Rental Industry", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T14:48:56.027000+00:00", "description": "Google has streamlined its Advanced Protection Program, allowing users to enroll using a single passkey instead of two physical security keys. The program, designed for individuals at high risk of targeted online attacks, now uses built-in biometric authentication on Pixel phones and iPhones.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Boosts+High-Risk+Account+Security+with+Phone-Only+Setup%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F10%2F1352232%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F10%2F1352232%2Fgoogle-boosts-high-risk-account-security-with-phone-only-setup%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/07/10", "id": 841077, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/10/1352232/google-boosts-high-risk-account-security-with-phone-only-setup?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Boosts High-Risk Account Security with Phone-Only Setup", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T14:48:54.027680+00:00", "description": "TurboTax-parent Intuit said on Wednesday it will let go of about 1,800 employees, or 10% of its workforce, as it looks to focus on its AI-powered tax preparation software and other financial products. From a report: The company, which has invested heavily in providing generative AI powered accounting and tax preparation tools for small and medium businesses in the past few years, expects to close two of its sites in Edmonton, Canada and Boise, Idaho. Intuit will rehire 1,800 new people primarily in engineering, product and customer-facing roles, CEO Sasan Goodarzi said in a note to employees.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Intuit+To+Cut+About+1%2C800+Jobs+As+It+Looks+To+Increase+AI+Investments%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F07%2F10%2F1429231%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?", "id": 841076, "language": "en-us", "link": "https://slashdot.org/story/24/07/10/1429231/intuit-to-cut-about-1800-jobs-as-it-looks-to-increase-ai-investments?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intuit To Cut About 1,800 Jobs As It Looks To Increase AI Investments", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T13:45:04.834761+00:00", "description": "An anonymous reader quotes a report from the BBC: US officials say they have taken action against an AI-powered information operation run from Russia, including nearly 1,000 accounts pretending to be Americans. The accounts on X were designed to spread pro-Russia stories but were automated \"bots\" -- not real people. In court documents made public Tuesday the US justice department said the operation was devised by a deputy editor at Kremlin-owned RT, formerly Russia Today. RT runs TV channels in English and several other languages, but appears much more popular on social media than on conventional airwaves.\n \nThe justice department seized two websites that were used to issue emails associated with the bot accounts, and ordered X to turn over information relating to 968 accounts that investigators say were bots. According to the court documents, artificial intelligence was used to create the accounts, which then spread pro-Russian story lines, particularly about the war in Ukraine. \"Tod", "id": 840413, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/10/0335208/us-officials-uncover-alleged-russian-bot-farm?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Officials Uncover Alleged Russian 'Bot Farm'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T10:44:39.135313+00:00", "description": "On Monday, the biggest labor union at Samsung Electronics launched its first strike in the tech giant's 55-year history, vowing to continue indefinitely until its demands for better pay and benefits are met. According to Reuters, \"The National Samsung Electronics Union (NSEU), whose roughly 30,000 members make up almost a quarter of the firm's South Korean workforce, said it has decided to continue striking because management has shown no indication of holding talks [...].\" From the report: \"We haven't spoken to management since we started the strike on Monday,\" said Lee Hyun-kuk, the union's vice president. The union said it would extend the strike initially planned to last three days through Wednesday. Lee told Reuters that the union found its strike has disrupted production on certain chip lines such as with equipment running more slowly. Samsung previously said the strike has caused no disruption to production. Lee said about 6,500 workers have been participating in the strike and", "id": 839507, "language": "en-us", "link": "https://slashdot.org/story/24/07/10/0330224/samsung-electronics-union-launches-first-strike-in-55-year-history?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Samsung Electronics Union Launches First Strike In 55-Year History", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T07:29:22.926576+00:00", "description": "A US District Court judge in San Francisco has largely dismissed a class-action lawsuit against GitHub, Microsoft, and OpenAI, which challenged the legality of using code samples to train GitHub Copilot. The judge ruled that the plaintiffs failed to establish a claim for restitution or unjust enrichment but allowed the claim for breach of open-source license violations to proceed. InfoWorld reports: The lawsuit, first filed in Nov. 2022, claimed that GitHub's training of the Copilot AI on public GitHub code repositories violated the rights of the \"vast number of creators\" who posted code under open-source licenses on GitHub. The complaint (PDF) alleged that \"Copilot ignores, violates, and removes the Licenses offered by thousands -- possibly millions -- of software developers, thereby accomplishing software piracy on an unprecedented scale.\" [...]\n \nIn a decision first announced on June 24, but only unsealed and made public on July 5, California Northern District judge Jon S. Tigar wr", "id": 838756, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/10/0319259/judge-dismisses-lawsuit-over-github-copilot-ai-coding-assistant?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Judge Dismisses Lawsuit Over GitHub Copilot AI Coding Assistant", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T04:14:08.828409+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Northwest Oregon had never seen anything like it. Over the course of three days in June 2021, Multnomah County -- the state's most populous county, which rests in the swayback along Oregon's northern border -- recorded highs of 108, 112, and 116 degrees Fahrenheit. Temperatures were so hot that the metal on cable cars melted and the asphalt on roadways buckled. Nearly half the homes in the county lacked cooling systems because of Oregon's typically gentle summers, where average highs top out at 81 degrees. Sixty-nine people perished from heat stroke, most of them in their homes. When scientific studies showed that the extreme temperatures were caused by heat domes, which experts say are influenced by climate change, county officials didn't just chalk it up to a random weather occurrence. They started researching the large fossil fuel companies whose emissions are driving the climate crisis -- including ExxonMobil, Shell, and Chevr", "id": 838190, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/09/2233206/oregon-county-seeks-to-hold-fossil-fuel-companies-accountable-for-extreme-heat?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Oregon County Seeks To Hold Fossil Fuel Companies Accountable For Extreme Heat", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T01:03:06.967005+00:00", "description": "Eton College, Britain's elite boarding school with alumni that includes Princes William and Harry, as well as George Orwell and a long list of others, is banning incoming students from having smartphones. Instead, the school will provide students with a Nokia \"brick\" phone, which will only be capable of making calls and sending text messages. CBS News reports: Parents of first-year students at Eton -- where tuition exceeds $60,000 per year -- were informed of the changes in a letter, which said that incoming 13-year-old boarders should have their smart devices taken home after their SIM cards are transferred to offline Nokia phones provided by the school, which can only make calls and send simple text messages. Eton's previous rules on smartphones required first-year students to hand over their devices overnight.\n \n\"Eton routinely reviews our mobile phone and devices policy to balance the benefits and challenges that technology brings to schools,\" a spokesperson for the school told CB", "id": 837648, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/09/2248244/british-boarding-school-bans-smartphones-hands-out-nokia-phones-instead?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "British Boarding School Bans Smartphones, Hands Out Nokia Phones Instead", "user": null, "vote": 0}]