[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T15:30:02+00:00", "description": "Whether it’s because of colossal development budgets or prolonged development cycles or any number of other factors, AAA games are all too often a bit too afraid to take risks or do anything that is even slightly experimental. \n\nIt stands to reason, however, that the less money you spend on your game, the more willing you’ll likely be to take risks- which is why the AA gaming space is such an excellent breeding ground for creativity. This is the place where we have so often played some of the most unique games of our lifetimes over the years, games that we are going to remember forever for how singular they were. Here, we are going to honor fifteen such games that we feel will always live on in memory.", "id": 841454, "language": null, "link": "https://www.youtube.com/watch?v=5WP3E1ejR4M", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/5WP3E1ejR4M/hqdefault.jpg", "title": "15 Best AA Games That Did Something DIFFERENT", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-10T10:00:13+00:00", "description": "Depending on your looter shooter preference, The First Descendant is either easy to slip into and waste a few hours, despisable or repetitive. Regardless, it's captured a sizable audience since launching on consoles and PC, one that keeps returning and having fun.\n\nThis isn't to say there aren't things to fix or issues that can be left unchecked, but if you poured dozens of hours since launch, The First Descendant may have a few annoying quirks. Maybe it's a distinct lack of matchmaking for Infiltration Operations on Hard mode (which Nexon is addressing soon). Perhaps it's the utter lack of free premium currency.\n\nIt may even be a fundamental issue with the performance on PC or the Descendant Instructor talking way too fast for anyone to learn anything. Here are ten things hardcore players dislike about The First Descendant and what a new player should know before jumping in.", "id": 839324, "language": null, "link": "https://www.youtube.com/watch?v=ydJ64rfzhK0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/ydJ64rfzhK0/hqdefault.jpg", "title": "The First Descendant - 10 Things HARDCORE PLAYERS HATE About It", "user": null, "vote": 0}]