[{"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "As reported by 404 Media, the New York Times has issued hundreds of copyright takedown requests against Wordle clones \"in which it asserts not just ownership over the Wordle name but over the broad concepts and mechanics of the word game, which includes its '5x6 grid' and 'green tiles to indicate correct guesses.'\" From the report: The Times filed at least three DMCA takedown requests with coders who have made clones of Wordle on GitHub. These include two in January and, crucially, a new DMCA filed this week against Chase Wackerfuss, the coder of a repository called &#226;oeReactle,&#226; which cloned Wordle in React JS (JavaScript). The most recent takedown request is critical because it not only goes after Reactle but anyone who has forked Reactle to create a different spinoff game; an archive of the Reactle code repository shows that it was forked 1,900 times to create a diverse set of games and spinoffs. These include Wordle clones in dozens of languages, crossword versio", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T23:14:28.889067+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://games.slashdot.org/story/24/03/08/2057231/nytimes-files-copyright-takedown-against-hundreds-of-wordle-clones?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "NYTimes Files Copyright Takedown Against Hundreds of Wordle Clones", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "Ahead of its IPO, Reddit has announced a set of tools for businesses that want to be more active on the platform -- including the ability to see which subreddits are mentioning a brand. For businesses, Reddit says it's a way to \"establish and grow a meaningful organic presence on Reddit.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Marketers+Are+About+To+Infiltrate+Subreddits%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F03%2F08%2F1820242%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F03%2F08%2F1820242%2Fmarketers-are-about-to-infiltrate-subreddits%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://slashdot.org/story/24/03/08/1820242/marketers-are-about-to-infiltrate-sub", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T22:09:22.154990+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://slashdot.org/story/24/03/08/1820242/marketers-are-about-to-infiltrate-subreddits?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Marketers Are About To Infiltrate Subreddits", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "An anonymous reader quotes a report from Ars Technica: AMD announced this week that it has ceased FreeSync certification for monitors or TVs whose maximum refresh rates are under 144 Hz. Previously, FreeSync monitors and TVs could have refresh rates as low as 60 Hz, allowing for screens with lower price tags and ones not targeted at serious gaming to carry the variable refresh-rate technology. AMD also boosted the refresh-rate requirements for its higher AdaptiveSync tiers, FreeSync Premium and FreeSync Premium Pro, from 120 Hz to 200 Hz.\n \nHere are the new minimum refresh-rate requirements for FreeSync, which haven't changed for laptops. AMD will continue supporting already-certified FreeSync displays even if they don't meet the above requirements. Interestingly, AMD's minimum refresh-rate requirements for TVs goes beyond 120 Hz, which many premium TVs max out at currently, due to the current-generation Xbox and PlayStation supporting max refresh rates of 120 frames per seco", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T22:09:20.599183+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://hardware.slashdot.org/story/24/03/08/2050227/amd-stops-certifying-monitors-tvs-under-144-hz-for-freesync?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "AMD Stops Certifying Monitors, TVs Under 144 Hz For FreeSync", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "Astronomers have observed a distant planet that could be entirely covered in a deep water ocean, in findings that advance the search for habitable conditions beyond Earth. From a report: The observations, by Nasa's James Webb space telescope (JWST), revealed water vapour and chemical signatures of methane and carbon dioxide in the atmosphere of the exoplanet, which is twice Earth's radius and about 70 light years away. This chemical mix is consistent with a water world where the ocean would span the entire surface, and a hydrogen-rich atmosphere, according to researchers from the University of Cambridge, although they do not envisage a balmy, inviting seascape. \"The ocean could be upwards of 100 degrees [Celsius] or more,\" said Prof Nikku Madhusudhan, who led the analysis. At high atmospheric pressure, an ocean this hot could still be liquid, \"but it's not clear if it would be habitable,\" he added. \n\nThis interpretation is favoured in a paper published in the journal Astronom", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T21:04:49.492324+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://science.slashdot.org/story/24/03/08/181202/astronomers-detect-waterworld-with-a-boiling-ocean-in-deep-space?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Astronomers Detect 'Waterworld With a Boiling Ocean' in Deep Space", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "An anonymous reader shares a report: Dario Amodei, chief executive of the high-profile A.I. start-up Anthropic, told Congress last year that new A.I. technology could soon help unskilled but malevolent people create large-scale biological attacks, such as the release of viruses or toxic substances that cause widespread disease and death. Senators from both parties were alarmed, while A.I. researchers in industry and academia debated how serious the threat might be. Now, over 90 biologists and other scientists who specialize in A.I. technologies used to design new proteins -- the microscopic mechanisms that drive all creations in biology -- have signed an agreement that seeks to ensure that their A.I.-aided research will move forward without exposing the world to serious harm. \n\nThe biologists, who include the Nobel laureate Frances Arnold and represent labs in the United States and other countries, also argued that the latest technologies would have far more benefits than neg", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T21:04:47.618670+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://tech.slashdot.org/story/24/03/08/1551256/dozens-of-top-scientists-sign-effort-to-prevent-ai-bioweapons?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Dozens of Top Scientists Sign Effort To Prevent AI Bioweapons", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "Epic Games, in a blog post: Apple has told us and committed to the European Commission that they will reinstate our developer account. This sends a strong signal to developers that the European Commission will act swiftly to enforce the Digital Markets Act and hold gatekeepers accountable. We are moving forward as planned to launch the Epic Games Store and bring Fortnite back to iOS in Europe. Epic CEO Tim Sweeney adds: The DMA went through its first major challenge with Apple banning Epic Games Sweden from competing with the App Store, and the DMA just had its first major victory. Following a swift inquiry by the European Commission, Apple notified the Commission and Epic that it would relent and restore our access to bring back Fortnite and launch Epic Games Store in Europe under the DMA law.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Reinstates+Epic+Developer+Account+After+Public+Backlash+for+Retaliation%3A+https%3A%2F%2", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T20:00:30.372542+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://apple.slashdot.org/story/24/03/08/1810244/apple-reinstates-epic-developer-account-after-public-backlash-for-retaliation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Apple Reinstates Epic Developer Account After Public Backlash for Retaliation", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "Microsoft has abruptly pulled a feature from OneDrive that allows users to upload files to the cloud storage service directly from a URL. From a report: The feature turned up as a preview in 2021 and was intended for scenarios \"where the file contents aren't available, or are expensive to transfer,\" according to Microsoft. It was particularly useful for mobile users, for whom uploading files directly through their apps could be costly. Much better to simply point OneDrive at a given URL and let it handle the upload itself. \n\nHowever, the experimental feature never made it past the consumer version of OneDrive. It also didn't fit with Microsoft's \"vision for OneDrive as a cloud storage service that syncs your files across devices.\" Indeed, the idea of hosing data into OneDrive from a remote source sits at odds with the file synchronization model being championed by Microsoft and conveniently available from macOS and Windows.<p><div class=\"share_submission\">\n<a class=\"slashpop\"", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T20:00:28.785805+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://it.slashdot.org/story/24/03/08/1726227/microsoft-sends-onedrive-url-upload-feature-to-the-cloud-graveyard?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Microsoft Sends OneDrive URL Upload Feature To the Cloud Graveyard", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "An anonymous reader shares a report: In the 1960s, secret test flights of advanced government spy planes generated U.F.O. sightings. More recently, government and commercial drones, new kinds of satellites and errant weather balloons have led to a renaissance in unusual observations. But, according to a new report, none of these sightings were of alien spacecraft. The new congressionally mandated Pentagon report found no evidence that the government was covering up knowledge of extraterrestrial technology and said there was no evidence that any U.F.O. sightings represented alien visitation to Earth. \n\nThe 63-page document is the most sweeping rebuttal the Pentagon has issued in recent years to counter claims that it has information on extraterrestrial visits or technology. But amid widespread distrust of the government, the report is unlikely to calm a growing obsession with aliens. Maj. Gen. Patrick Ryder, a Defense Department spokesman, said the Pentagon approached the repo", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T18:24:40.826398+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://news.slashdot.org/story/24/03/08/1714210/pentagon-review-finds-no-evidence-of-alien-cover-up?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Pentagon Review Finds No Evidence of Alien Cover-Up", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "A United Airlines Holdings aircraft ran off the taxiway into a grassy area after landing at Houston Friday, the third incident this week involving the airline's Boeing planes. From a report: United Flight 2477, with 160 passengers and six crew, had just landed at George Bush Intercontinental Airport about 8 a.m. local time Friday when it veered into the grass on a turn. No one was injured, and passengers left the plane on a set of stairs before being bused to the terminal, the airline said. \n\nThe incident follows the mid-air loss of a tire from a United Boeing 777-200 Thursday, just after the plane took off from San Francisco on a flight to Osaka, Japan, and an engine fire on a United flight from Houston to Fort Myers, Florida, earlier this week. The plane in the Houston-to-Florida flight had to make an emergency landing after one of its engines burst into flames 10 minutes after takeoff. The 21-year-old aircraft was also a 737 -- but an earlier version than the Max, accordin", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T18:24:39.306601+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://news.slashdot.org/story/24/03/08/1720226/united-plane-veers-off-runway-in-third-boeing-incident-this-week?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "United Plane Veers Off Runway in Third Boeing Incident This Week", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "Astra Space, a California-based rocket company, has announced it will go private at a valuation significantly lower than its $2.1 billion debut in 2021. The company's market value is about $13 million at current levels. The company's co-founders, Chris Kemp and Adam London, will acquire all outstanding shares at $0.50 each, well below the current trading price of $0.80. Astra has faced challenges, with only two successful launches out of seven attempts of its Rocket 3 vehicle. The company pivoted to the larger Rocket 4 in 2022 but has yet to conduct test launches. \n\nAstra faces competition from established players like Rocket Lab and Firefly, as well as new entrants such as ABL Space and Stoke Space. The company's future remains uncertain as it navigates a competitive small launch market, with SpaceX's Transporter missions offering lower prices by launching dozens of satellites simultaneously on its Falcon 9 booster.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T17:20:02.558864+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://slashdot.org/story/24/03/08/1528226/after-astra-loses-99-of-its-value-founders-take-rocket-firm-private?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "After Astra Loses 99% of Its Value, Founders Take Rocket Firm Private", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "President Biden included a nod to a rising issue in the entertainment and tech industries during his State of the Union address Thursday evening, calling for a ban on AI voice impersonations. From a report: \"Here at home, I have signed over 400 bipartisan bills. There's more to pass my unity agenda,\" President Biden said, beginning to list off a series of different proposals that he hopes to address if elected to a second term. \"Strengthen penalties on fentanyl trafficking, pass bipartisan privacy legislation to protect our children online, harness the promise of AI to protect us from peril, ban AI voice impersonations and more.\" \n\nThe president did not elaborate on the types of guardrails or penalties that he would plan to institute around the rising technology, or if it would extend to the entertainment industry. AI was a peak concern for SAG-AFTRA during the actors union's negotiations with and strike against the major studios last year.<p><div class=\"share_submission\">\n<a", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T16:14:22.896916+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://news.slashdot.org/story/24/03/08/1432203/president-biden-calls-for-ban-on-ai-voice-impersonations?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "President Biden Calls for Ban on AI Voice Impersonations", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "Microsoft revealed earlier this year that Russian state-sponsored hackers had been spying on the email accounts of some members of its senior leadership team. Now, Microsoft is disclosing that the attack, from the same group behind the SolarWinds attack, has also led to some source code being stolen in what Microsoft describes as an ongoing attack. From a report: \"In recent weeks, we have seen evidence that Midnight Blizzard [Nobelium] is using information initially exfiltrated from our corporate email systems to gain, or attempt to gain, unauthorized access,\" explains Microsoft in a blog post. \"This has included access to some of the company's source code repositories and internal systems. To date we have found no evidence that Microsoft-hosted customer-facing systems have been compromised.\" \n\nIt's not clear what source code was accessed, but Microsoft warns that the Nobelium group, or \"Midnight Blizzard,\" as Microsoft refers to them, is now attempting to use \"secrets of dif", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T16:14:21.408714+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://it.slashdot.org/story/24/03/08/1514205/microsoft-says-russian-hackers-stole-source-code-after-spying-on-its-executives?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Microsoft Says Russian Hackers Stole Source Code After Spying On Its Executives", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "China is in the process of raising more than $27 billion for its largest chip fund to date, accelerating the development of cutting-edge technologies to counter a US campaign to thwart its rise. From a report: The National Integrated Circuit Industry Investment Fund is amassing a pool of capital from local governments and state enterprises for its third vehicle that should exceed the 200 billion yuan of its second fund, according to people familiar with the matter. Known as the Big Fund, the state-backed firm is expanding its remit just as the US prepares to sharply escalate technology curbs designed to curtail Chinese chip and artificial intelligence progress. \n\nThe establishment of a much larger third fund -- directly overseen by China's powerful tech ministry -- signals a resurgent effort to harness the world's largest semiconductor market after years of mixed success with central stewardship. Huawei and its partner Semiconductor Manufacturing International Corp. still had", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T15:09:39.173862+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://news.slashdot.org/story/24/03/08/1320208/china-readies-27-billion-chip-fund-to-counter-growing-us-curbs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "China Readies $27 Billion Chip Fund To Counter Growing US Curbs", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "An anonymous reader quotes a report from MacRumors: Apple today released visionOS 1.1, marking the first major update to the visionOS operating system that was launched alongside the Vision Pro in February. visionOS updates can be installed by going to the Settings app on the Vision Pro, selecting the General section, and choosing Software Update. The Vision Pro headset will need to be removed to install new software, with a progress bar available on the front EyeSight display.\n \nApple is making several improvements to the Vision Pro with the visionOS update. Mobile Device Management is available for businesses, and Persona and EyeSight look better than before. The virtual keyboard has been updated to address bugs and make cursor positioning more accurate, and there are also bug fixes for the Mac Virtual Display. Here's a summary of visionOS 1.1 from the release notes: \"This update introduces MDM features that enable deployment, device configuration, and management for enterp", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T14:05:27.139002+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://tech.slashdot.org/story/24/03/08/0141206/apple-releases-visionos-11-with-improvements-to-persona-eyesight-virtual-keyboard-and-more?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Apple Releases visionOS 1.1 With Improvements To Persona, EyeSight, Virtual Keyboard and More", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "An anonymous reader shares a report: For the past 10 years it has remained one of the modern era's greatest mysteries. A commercial airliner with a strong safety record carrying 239 people vanishing from the map, spawning a wide variety of competing theories, books and documentaries and leaving the families of those left behind asking themselves every March 8 -- what happened to those aboard Malaysia Airlines flight 370? \n\nIn an era when black boxes have been successfully hauled up from the very depths of the ocean and whole chunks of a downed airliner painstakingly pieced back together to determine what caused a catastrophe, the fate of MH370 remains infuriatingly elusive. It is a plane crash without a plane. A disaster without conclusive proof of what happened to its victims. A story that anyone who embarks on a commercial flight can instantly relate to but one that, for now at least, doesn't have a closing chapter. \n\n[...] This week, many loved ones of those missing return", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T14:05:25.640284+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://news.slashdot.org/story/24/03/08/1314203/10-years-on-is-the-world-any-closer-to-finding-mh370?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "10 Years On, Is the World Any Closer To Finding MH370?", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "innocent_white_lamb shares a report from CBC News: In June, a Court of King's Bench judge ordered Swift Current farmer Chris Achter to pay more than $82,000 to a grain buyer with South West Terminal (SWT). The ruling stems from a text message when the buyer, Kent Mickleborough, asked Achter to confirm a flax contract that requested more than 85 tons of flax to be delivered in the fall at about $670 per ton. Achter responded with a thumbs-up emoji. The case hinges on whether the emoji confirmed the contract, or only confirmed receipt of it -- and whether an emoji can ever be used as a signature.\n \nIn his June decision ruling in SWT's favor, Justice Timothy Keene wrote, \"This court readily acknowledges that a [thumbs-up] emoji is a non-traditional means to 'sign' a document but nevertheless under these circumstances this was a valid way to convey the two purposes of a 'signature.'\" Achter is now appealing that ruling.\n \n\"Our position is that the emoji cannot be a signature, bas", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T10:57:41.397022+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://yro.slashdot.org/story/24/03/08/0126236/should-an-emoji-count-as-confirmation-of-a-contract?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Should an Emoji Count As Confirmation of a Contract?", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "Mexico is waiting for the United States to provide evidence that shows imported genetically modified corn is safe for human consumption. \"In a written submission to a panel of the United States-Mexico-Canada Agreement, Mexico, the top buyer of U.S. corn, argued that science proves GM corn and the herbicide glyphosate are harmful to human health and its native varieties, and that its decree to ban GM corn for human consumption is within its right,\" reports Reuters. From the report: [Deputy Agriculture Secretary Victor Suarez] said the onus is now on the United States to show GM corn is not harming Mexico's population, which consumes a higher amount of corn than many countries through daily diet staples like nixtamalized dough and tortilla. The United States \"argues that the decisions in Mexico are not based on science and that their decisions are,\" Suarez told Reuters in an interview. \"But we still haven't seen the science of the United States or the companies. We are looking ", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T07:42:42.140422+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://science.slashdot.org/story/24/03/08/0137200/mexico-argues-glyphosate-in-gm-corn-is-unsafe-for-human-consumption?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Mexico Argues Glyphosate In GM Corn Is Unsafe For Human Consumption", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "An anonymous reader quotes a report from The Guardian: Doctors have warned of potentially life-threatening effects from plastic pollution after finding a substantially raised risk of stroke, heart attack and earlier death in people whose blood vessels were contaminated with microscopic plastics. Researchers in Naples examined fatty plaques removed from the blood vessels of patients with arterial disease and found that more than half had deposits contaminated with tiny particles of polyethylene or polyvinyl chloride (PVC). Those whose plaques contained microplastics or nanoplastics were nearly five times more likely to suffer a stroke, heart attack or death from any cause over the following 34 months, compared with those whose plaques were free from plastic contamination. The findings do not prove that plastic particles drive strokes and heart attacks -- people who are more exposed to the pollution may be at greater risk for other reasons -- but research on animals and human c", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T04:27:43.781421+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://science.slashdot.org/story/24/03/07/2243222/microscopic-plastics-could-raise-risk-of-stroke-and-heart-attack-study-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Microscopic Plastics Could Raise Risk of Stroke and Heart Attack, Study Says", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "An APK teardown performed by Android Authority has revealed that Reddit is now using a Large Language Model (LLM) to detect harassment on the platform. From the report: Reddit also updated its support page a week ago to mention the use of an AI model as part of its harassment filter. \"The filter is powered by a Large Language Model (LLM) that's trained on moderator actions and content removed by Reddit's internal tools and enforcement teams,\" reads an excerpt from the page. The Register reports: The filter can be enabled in a Reddit community's mod tools, but individual moderators will need to have permissions to change subreddit settings to enable it. The harassment filter can be set to low (\"filters the least content but with the most accurate results\") and high (\"filters the most content but may be less accurate\"), and also includes an explicit allow list to force the AI to ignore certain keywords, up to 15 of which can be added. Once enabled, the filter creates a new tag ", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T02:17:39.477921+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://tech.slashdot.org/story/24/03/07/2213245/reddit-will-now-use-an-ai-model-to-fight-harassment?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Reddit Will Now Use an AI Model To Fight Harassment", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "John Timmer reports via Ars Technica: A company called Colossal plans to pioneer the de-extinction business, taking species that have died within the past few thousand years and restoring them through the use of DNA editing and stem cells. It's grabbed headlines recently by announcing some compelling targets: the thylacine, an extinct marsupial predator, and an icon of human carelessness, the dodo. But the company was formed to tackle an even more audacious target: the mammoth, which hasn't roamed the Northern Hemisphere for thousands of years. Obviously, there are a host of ethical and conservation issues that would need to be worked out before Colossal's plans go forward. But there are some major practical hurdles as well, most of them the product of the distinct and extremely slow reproductive biology of the mammoth's closest living relatives, the elephants. At least one of those has now been cleared, as the company is announcing the production of the first elephant stem c", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T02:17:37.438790+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://science.slashdot.org/story/24/03/07/2255224/company-that-plans-to-bring-back-the-mammoth-takes-a-key-step?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Company That Plans To Bring Back the Mammoth Takes a Key Step", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "Michael Larabel writes via Phoronix: Fedora Workstation has long defaulted to using GNOME's Wayland session by default, but it has continued to install the GNOME X.Org session for fallback purposes or those opting to use it instead. But for the Fedora Workstation 41 release later in the year, there is a newly-approved plan to no longer have that GNOME X.Org session installed by default. Recently there was a Fedora Workstation ticket opened to no longer install the GNOME X.Org session by default. This is just about whether the X.Org session is pre-installed but would continue to live in the repository for those wanting to explicitly install it.\n \nThe Fedora Workstation working group decided to go ahead with this change for the Fedora 41 cycle, not the upcoming Fedora 40 release. So pending any obstacles by FESCo, which is unlikely. Fedora Workstation 41 will not be installing the GNOME X.Org session by default. Long live Wayland.<p><div class=\"share_submission\">\n<a class=\"slas", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T01:12:24.366340+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://news.slashdot.org/story/24/03/07/2157258/fedora-workstation-41-to-no-longer-install-gnome-xorg-session-by-default?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Fedora Workstation 41 To No Longer Install GNOME X.Org Session By Default", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "In an updated support page, Apple says it won't let your iPhone update software installed by third-party app stores if you leave the European Union for more than 30 days. The Verge reports: Shortly after the EU's Digital Markets Act (DMA) went into effect on Wednesday, users noticed an Apple support page stating users would \"lose access to some features\" when leaving the EU \"for short-term travel.\" But now, Apple has made this policy more specific by carving out a 30-day grace period, which could be inconvenient for frequent travelers. This doesn't change your ability to use alternative app marketplaces, however, as Apple says you can still use third-party stores to manage apps you've already installed. Further reading: Apple is Working To Make It Easier To Switch From iPhone To Android Because of the EU<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Will+Cut+Off+Third-Party+App+Store+Updates+If+Your+iPhone+Leaves+the+EU+For+a+", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T00:08:17.259055+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://mobile.slashdot.org/story/24/03/07/2142227/apple-will-cut-off-third-party-app-store-updates-if-your-iphone-leaves-the-eu-for-a-month?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Apple Will Cut Off Third-Party App Store Updates If Your iPhone Leaves the EU For a Month", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}, {"language": "en-us", "page_rating_visits": 0, "page_rating_contents": 0, "description": "An anonymous reader quotes a report from The Week Magazine: The advancement of new technologies appears to have given rise to a new problem across the United States: a crippling power shortage on the horizon. The advent of these technologies, such as eco-friendly factories and data centers, has renewed concerns that America could run out of electrical power. These worries also come at a time when the United States' aging power grid is in desperate need of repair. Heavily publicized incidents such as the 2021 Texas power outage, which was partially blamed on crypto-farming, exposed how vulnerable the nation's power supply is, especially during emergencies. There have also been warnings from tech moguls such as Elon Musk, who has stated that the United States is primed to run out of electricity and transformers for artificial intelligence in 2025. But the push to extend the life of the nation's power grid, while also maintaining eco-friendly sustainability, begs the question: I", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T00:08:15.064990+00:00", "permanent": false, "source_obj__id": 306, "page_rating": 0, "link": "https://hardware.slashdot.org/story/24/03/07/2150234/is-america-running-out-of-electrical-power?utm_source=rss1.0mainlinkanon&utm_medium=feed", "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "title": "Is America Running Out of Electrical Power?", "artist": "help@slashdot.org", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": null, "album": "", "user": null}]