[{"language": null, "page_rating_visits": 0, "page_rating_contents": 0, "description": "Expeditions: A MudRunner Game puts you in the shoes of an expert off-road driver that sets off to some of the most remote yet beautiful places in the world. Along the way, you’ll take on various missions that help you earn money, allowing you to upgrade your vehicles, buy new trucks, and maybe even build up some amenities in your home base. The core challenge, however, comes from the sheer difficulty in planning an off-road route.\n\nWhat makes Expeditions: A MudRunner Game especially fun is the fact that, while there are several small things to pay attention to, like AWD and differential locks, and even just a fuel gauge, things never really get overwhelming. Instead, you’re encouraged to plan your routes out, and take just about everything you think you might need for a long drive, because if you get stuck in the middle of nowhere without any fuel, well, that’s your fault.", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T21:00:26+00:00", "permanent": false, "source_obj__id": 129, "page_rating": 0, "link": "https://www.youtube.com/watch?v=n6MIVzzpD30", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Expeditions: A MudRunner Game Review - The Final Verdict", "artist": "GamingBolt", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": "https://i3.ytimg.com/vi/n6MIVzzpD30/hqdefault.jpg", "album": "", "user": null}, {"language": null, "page_rating_visits": 0, "page_rating_contents": 0, "description": "Amid the hype for titles like Team Ninja's Rise of the Ronin and the announcement of Ghost of Tsushima Director's Cut for PC, one has to wonder about the status of Ghost of Tsushima 2. The original launched in 2020, and there's been no indication of a sequel in development.\n\nSome job listings have emerged over the years hinting at the same, but an official announcement has yet to be made. Sony has confirmed it won't launch any major titles in existing PlayStation franchises until April 2025, making the outlook bleaker.\n\nWe could get an announcement sometime this year, possibly at the next PlayStation Showcase. Whatever the case, Ghost of Tsushima is perhaps the most deserving of a sequel out of PlayStation Studios' first-party efforts. Join us as we discuss why.", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T17:00:21+00:00", "permanent": false, "source_obj__id": 129, "page_rating": 0, "link": "https://www.youtube.com/watch?v=VD9ZfJDG8MA", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Where The Heck Is GHOST OF TSUSHIMA 2?", "artist": "GamingBolt", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": "https://i3.ytimg.com/vi/VD9ZfJDG8MA/hqdefault.jpg", "album": "", "user": null}, {"language": null, "page_rating_visits": 0, "page_rating_contents": 0, "description": "Well, here we are 4 years into the current console generation’s lifecycle still debating the pros and cons of cross-generational releases. It was to be expected that Microsoft and Sony would extend their grace period for players still playing on aging hardware given the early supply issues both companies endured for their current-gen consoles, but this long into the lifecycle with new games releasing on decade-old hardware there’re accusations floating around that developers simply don’t care about current-gen. \n\nOf course, this isn’t true. Fact is, there is still substantial player bases for both Microsoft and Sony’s older generation consoles – we’re talking millions – so it’d make terrible business sense for both tech giants to abandon these players. The question isn’t so much are PS4 and Xbox One obsolete, more, is their substantial player bases stifling creativity in the industry?", "bookmarked": false, "tags": [], "age": null, "comments": [], "date_published": "2024-03-08T09:30:10+00:00", "permanent": false, "source_obj__id": 129, "page_rating": 0, "link": "https://www.youtube.com/watch?v=VxX25unblNY", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "Are PS4 And Xbox One Finally Obsolete?", "artist": "GamingBolt", "vote": 0, "page_rating_votes": 0, "dead": false, "thumbnail": "https://i3.ytimg.com/vi/VxX25unblNY/hqdefault.jpg", "album": "", "user": null}]