[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-06T15:30:25+00:00", "description": "Nexon's The First Descendant has been causing a stir since its launch, and for good reason. In an industry where looter shooters come and go, often failing to meet expectations, it's one of the few to enjoy sustained popularity from its player base. Perhaps it's the appeal of the gameplay and visuals or simply because of how robust some systems can be.\n\nRegardless, there are several issues that the free-to-play title currently has. Some bosses need further tuning to make them less frustrating to fight. The melee combat requires improvements and could benefit from some dedicated weapons. \n\nCheck out our ten picks for things that need fixing. Even if Nexon wants to continue with this live service gameplay model, these could use fixing sooner rather than later.", "id": 819619, "language": null, "link": "https://www.youtube.com/watch?v=rVY0NyUhEBw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/rVY0NyUhEBw/hqdefault.jpg", "title": "The First Descendant - 10 Things That NEED TO BE FIXED", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-06T10:00:41+00:00", "description": "2023 was a marquee year for video games, with the glut of amazing experiences released making last year one of the best ever for gamers. 2024 probably won’t reach those heights, but there’s been some fantastic games released thus far. \n\nOf course, this year also has its fair share of disappointments too; games with tons of expectation either from being long- awaited, coming from an esteemed studio, or releasing in a lackluster state that requires more work from the developer to get it serviceable. \n\nThis feature highlights 15 such games, ordered from bad to worst. The order might be subjective, but we’d wager few will be surprised by our pick of the most disappointing game of the year so far.", "id": 817902, "language": null, "link": "https://www.youtube.com/watch?v=lWtlDlNwXMw", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/lWtlDlNwXMw/hqdefault.jpg", "title": "Top 15 MOST DISAPPOINTING Games of 2024 So Far", "user": null, "vote": 0}]