[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-12T17:30:03+00:00", "description": "Just because a game offers up a large open space to explore, doesn’t mean you can do much in it. Games are more than their size, and these 10 games offer a vast breadth of activities to engage with the world, no matter how big. Of particular note are the 100s of controllable NPCs within Watch Dogs Legion’s London map, which gets even more fun when playing with friends. \n\nMods also help elevate an open world game to new heights with creative new modes and features. Skyrim’s Enderal mod contains a 100 hour story with new characters and locations, extending Skyrim’s lifespan and usability extensively. Whether or not you enjoy exploring, crafting, or fighting, these 10 open world games allow you to tailor the experience how you want.", "id": 1501776, "language": null, "link": "https://www.youtube.com/watch?v=QHnhopQi2lk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/QHnhopQi2lk/hqdefault.jpg", "title": "10 Open World Games That Let You CONTROL ALMOST EVERYTHING", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-11-12T13:30:07+00:00", "description": "MachineGames has earned a good deal of love and trust from fans with its Wolfenstein games, and even though the studio’s next project isn’t a new Wolfenstein entry, it is one that has turned its fair share of heads. \n\nIndiana Jones and the Great Circle not only has the advantage of carrying an established IP name, the game itself has also looked really good in all that we have seen of it so far. Bethesda, Microsoft, and MachineGames have shown quite a bit of the upcoming first-person action-adventure experience, and from its hand-to-hand combat and its immersive sim elements to its focus on puzzles and more, there’s plenty about it that has caught the eye. Here, we discuss all of that and more.", "id": 1500277, "language": null, "link": "https://www.youtube.com/watch?v=BeMwxuw4lw0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/BeMwxuw4lw0/hqdefault.jpg", "title": "Indiana Jones And The Great Circle - 15 Things YOU NEED TO KNOW Before You Buy", "vote": 0}]