[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "15 MOST UNDERRATED SINGLE PLAYER GAMES You Didn't Play", "description": "There's never enough time to play the games you want, and there are more now than ever. Some titles inevitably go unnoticed by the general public due to niche genres or not being appreciated enough by critics (and companies) despite being beloved by fans or breaking even financially.\n\nRegardless, it's always fun to go off the beaten path and see what some underrated titles can offer with their gameplay. Whether it's the joys of climbing in Jusant, slaying tons of zombies in Days Gone, struggling with cosmic horrors in Eternal Darkness, rocket-sliding around in Vanquish or deciphering whatever is happening in Stories Untold, these titles offer something unique that's worth checking out.\n\nCheck out 15 of the most underrated titles available and what makes them stand out.", "link": "https://www.youtube.com/watch?v=ugDKlg3kniA", "date_published": "2024-01-03T15:30:29+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/ugDKlg3kniA/hqdefault.jpg", "age": null, "page_rating_contents": 52, "page_rating_votes": 0, "page_rating_visits": 1, "page_rating": 52, "tags": [], "comments": [], "vote": 0}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "title": "TEKKEN 8 - 15 Things You ABSOLUTELY NEED TO KNOW Before You Buy", "description": "There’s no shortage of excitement about the upcoming launch of Tekken 8. It helps, of course, that the sequel is promising a number of intriguing improvements and evolutions for the series’ formula. \n\nFrom updated visuals courtesy of Unreal Engine 5 to new fighting mechanics in the form of the Heat system to a healthy roster of fighters packed full of both new and returning characters, there’s no shortage of reasons to be excited about Tekken 8. As such, ahead of is release, here, we’re going to talk about a few of its headlining details and features.", "link": "https://www.youtube.com/watch?v=-sya2yN3cow", "date_published": "2024-01-03T09:30:00+00:00", "permanent": false, "bookmarked": false, "dead": false, "artist": "GamingBolt", "album": "GamingBolt", "user": null, "language": "en-US", "thumbnail": "https://i2.ytimg.com/vi/-sya2yN3cow/hqdefault.jpg", "age": null, "page_rating_contents": 0, "page_rating_votes": 0, "page_rating_visits": 0, "page_rating": 0, "tags": [], "comments": [], "vote": 0}]