[{"page_rating_votes": 0, "thumbnail": "https://i3.ytimg.com/vi/vwUMV2MDM_E/hqdefault.jpg", "bookmarked": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_contents": 0, "comments": [], "vote": 0, "permanent": false, "user": null, "source_obj__id": 208, "date_published": "2024-02-08T16:15:03+00:00", "language": null, "link": "https://www.youtube.com/watch?v=vwUMV2MDM_E", "title": "Why Dragon's Dogma 2 is Set to Be One of the Biggest Games of the Year", "album": "", "page_rating": 0, "description": "Destined to be the standout fantasy action RPG of 2024, if not one of the biggest games of the year, Dragon's Dogma 2 promises a vast, immersive world with a glut of unique playstyles and distinct experiences. \n\nA player’s approach to different situations is up for choice too. Dragon’s Dogma 2 is a single player narrative adventure, but along the way there’re accompanying PAWN’s that’ll elicit intelligence and experience that it’s hoped the game will feel multi-player.", "page_rating_visits": 0, "artist": "GamingBolt", "tags": [], "dead": false, "age": null}, {"page_rating_votes": 0, "thumbnail": "https://i1.ytimg.com/vi/hOhTSZtSY70/hqdefault.jpg", "bookmarked": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "page_rating_contents": 0, "comments": [], "vote": 0, "permanent": false, "user": null, "source_obj__id": 208, "date_published": "2024-02-08T10:30:13+00:00", "language": null, "link": "https://www.youtube.com/watch?v=hOhTSZtSY70", "title": "What WENT WRONG With Rocksteady?", "album": "", "page_rating": 0, "description": "Suicide Squad: Kill the Justice League finally launched worldwide last week, and to say the reception is mixed would be underselling it. Some love the combat, visuals and humor but acknowledge that the end-game, mission variety and overall story-telling leave them wanting.\n\nThis pattern isn't new with live service titles, but it especially pains fans of Rocksteady Studios. It's a developer that went from relative obscurity to near-legendary status with the Batman: Arkham series. From Batman: Arkham Asylum to the expansive Batman: Arkham City and gorgeous Batman: Arkham Knight, it's difficult to believe that the studio could fall this far.\n\nIs it a case of the development team undergoing significant revamps, or was it simply ill-equipped to handle a genre outside its usual comfort zone? Join us as we ask what happened to Rocksteady.", "page_rating_visits": 0, "artist": "GamingBolt", "tags": [], "dead": false, "age": null}]