[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T23:01:55.012060+00:00", "description": "Intel on Tuesday unveiled its new \"Gaudi 3\" AI chip that the company claims is over twice as power-efficient and can run AI models one-and-a-half times faster than Nvidia's H100 GPU. \"It also comes in different configurations like a bundle of eight Gaudi 3 chips on one motherboard or a card that can slot into existing systems,\" adds CNBC. From the report: Intel tested the chip on models like Meta's open-source Llama and the Abu Dhabi-backed Falcon. It said Gaudi 3 can help train or deploy models, including Stable Diffusion or OpenAI's Whisper model for speech recognition. Intel says its chips use less power than Nvidia's. Intel said that the new Gaudi 3 chips would be available to customers in the third quarter, and companies including Dell, HP and Supermicro will build systems with the chips. Intel didn't provide a price range for Gaudi 3.\n \nGaudi 3 is built on a five nanometer process, a relatively recent manufacturing technique, suggesting that the company is using an outside found", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/09/2030216/intel-says-new-gaudi-3-ai-chips-top-nvidia-h100s-in-speed-and-cost?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Says New Gaudi 3 AI Chips Top Nvidia H100s in Speed and Cost", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T23:01:53.499072+00:00", "description": "An anonymous reader quotes a report from Wired: Congress may be closer than ever to passing a comprehensive data privacy framework after key House and Senate committee leaders released a new proposal on Sunday. The bipartisan proposal, titled the American Privacy Rights Act, or APRA, would limit the types of consumer data that companies can collect, retain, and use, allowing solely what they'd need to operate their services. Users would also be allowed to opt out of targeted advertising, and have the ability to view, correct, delete, and download their data from online services. The proposal would also create a national registry of data brokers, and force those companies to allow users to opt out of having their data sold. [...] In an interview with The Spokesman Review on Sunday, [Cathy McMorris Rodgers, House Energy and Commerce Committee chair] claimed that the draft's language is stronger than any active laws, seemingly as an attempt to assuage the concerns of Democrats who have l", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/09/2039226/a-breakthrough-online-privacy-proposal-hits-congress?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "A Breakthrough Online Privacy Proposal Hits Congress", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T21:57:34.793303+00:00", "description": "Fairphone, the Dutch smartphone maker known for its user-repairable smartphones, is bringing its ultra-repairable design philosophy to their \"Fairbuds\" wireless earbuds. Liliputing reports: The Fairbuds have the sort of features we've come to expect from premium earbuds. They're noise-cancelling Bluetooth 5.3 earbuds with support for wind noise reduction and an environmental noise-cancelling feature that sets noise reduction depending on your environment. Fairphone's earbuds have six microphones, 11mm drivers, and an IP54 rating for water (and sweat) resistance. They also support multipoint connectivity, which means you can connect the earbuds to two different devices at the same time (like your phone and your laptop).\n \nThe earbuds offer up to 6 hours of battery life and they come with a charging case that gives you another 20 hours of use between charges. And Fairphone offers iOS and Android apps that let you adjust EQ, install firmware updates, and make other changes. Other feature", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/09/2016226/fairphones-fairbuds-are-true-wireless-earbuds-with-repairable-design-user-replaceable-batteries?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Fairphone's Fairbuds Are True Wireless Earbuds With Repairable Design, User-Replaceable Batteries", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T20:52:04.278958+00:00", "description": "We're seeing a boom in journaling apps as safer, easier ways to ease us back into posting everything online. From a report: Last year, Apple released a journal app with iOS 17. Former Yahoo CEO Marissa Mayer just unveiled a photo app called Shine, which is made to share photos and memories with a select group of people. Today, Retro -- a startup that we called \"the new Instagram\" -- is launching a feature called Journals within the app, which lets you record both photos and notes for a select group of people. \n\nAs a lifelong journaler, it's hard to forget that I already have an intimate, safe space to record my life and share memories. It is a notebook. I don't have to worry about marketers selling my information, because it's not accessible. What if creating a safe space all of your own means just getting off the internet altogether? Most of these apps are based on the central premise that most of us would rather talk to family or close friends than with a pretty stranger shilling sn", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/09/1847208/the-world-doesnt-need-more-journal-apps?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The World Doesn't Need More Journal Apps", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T20:52:02.688324+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Owners of Intel's latest 13th and 14th Gen Core i9 desktop processors have been noticing an increase in game crashes in recent months. It's happening in games like The Finals, Fortnite, and Tekken 8, and has even led Epic Games to issue a support notice to encourage Intel Core i9 13900K and 14900K owners to adjust BIOS settings. Now, Intel says it's investigating the reports. \"Intel is aware of problems that occur when executing certain tasks on 13th and 14th generation core processors for desktop PCs, and is analyzing them with major affiliates,\" says an Intel spokesperson in a statement to ZDNet Korea.\n \nThe crashes vary in severity depending on the game, with some titles producing an \"out of memory\" error, others simply exiting out to the desktop, and some locking up a machine entirely. Most of the games affected seem to be based on the Unreal Engine, which could point to a stability issue that Intel needs to address. The only ", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/04/09/204216/intel-investigating-games-crashing-on-13th-and-14th-gen-core-i9-processors?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Investigating Games Crashing On 13th and 14th Gen Core i9 Processors", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T19:49:33.355828+00:00", "description": "England could produce 13 times more renewable energy than it does now, while using less than 3% of its land, analysis has found. The Guardian: Onshore wind and solar projects could provide enough electricity to power all the households in England two and a half times over, the research by Exeter University, commissioned by Friends of the Earth (FoE), suggested. Currently, about 17 terawatt hours of electricity a year comes from homegrown renewables on land. But there is potential for 130TWh to come from solar panels, and 96TWh from onshore wind. These figures are reached by only taking into account the most suitable sites, excluding national parks, areas of outstanding natural beauty, higher grade agricultural land and heritage sites. \n\nSome commentators have argued that solar farms will reduce the UK's ability to grow its own food, but the new analysis suggests there is plenty of land that can be used without impairing agricultural production. More land is now taken up by golf course", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/09/1720212/england-could-produce-13-times-more-renewable-energy-using-less-than-3-of-land?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "England Could Produce 13 Times More Renewable Energy, Using Less Than 3% of Land", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T18:43:41.510270+00:00", "description": "Cruise is redeploying robotaxis in Phoenix after nearly five months of paused operations, the company said in a blog post. The catch? The cars will be in so-called \"manual mode,\" so they won't be driving themselves. From a report: Cruise will resume manual driving of its autonomous vehicles to create maps and gather road information in certain cities, starting with Phoenix, the company said Tuesday. The General Motors subsidiary already had a presence in Phoenix before it pulled its entire U.S.-based fleet last year following an incident in San Francisco that left a pedestrian stuck under and dragged by a Cruise robotaxi. Prior to that incident, Cruise had been announcing launches in new cities -- including Dallas, Houston and Miami -- at a startling pace. Critics accused the company of expanding too fast and cutting corners on safety.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Cruise+Robotaxis+Are+Back+in+Phoenix+-+But+People+Are+Driving", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/09/1825233/cruise-robotaxis-are-back-in-phoenix---but-people-are-driving-them?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Cruise Robotaxis Are Back in Phoenix - But People Are Driving Them", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T17:39:33.510655+00:00", "description": "Meta Platforms is planning to launch two small versions of its forthcoming Llama 3 large-language model next week, The Information has reported [non-paywalled link]. From the report: The models will serve as a precursor to the launch of the biggest version of Llama 3, expected this summer. Release of the two small models will likely help spark excitement for the forthcoming Llama 3, which will be coming out roughly a year after Llama 2 launched last July. \n\nIt comes as several companies, including Google, Elon Musk's xAI and Mistral, have released open-source LLMs. Meta hopes Llama 3 will catch up with OpenAI's GPT-4, which can answer questions based on images users upload to the chatbot. The biggest version will be multimodal, which means it will be capable of understanding and generating both texts and images. In contrast, the two small models to be released next week won't be multimodal, the employee said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.co", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/09/1546228/meta-platforms-to-launch-small-versions-of-llama-3-next-week?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Meta Platforms To Launch Small Versions of Llama 3 Next Week", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T17:39:31.652069+00:00", "description": "As the moon blocked the view of the sun across parts of Mexico, the United States and Canada on Monday, the celestial event managed another magnificent feat: It got people offline. From a report: According to Cloudflare, a cloud-computing service used by about 20 percent of websites globally, internet traffic dipped along the path of totality as spellbound viewers took a break from their phones and computers to catch a glimpse of the real-life spectacle. \n\nThe places with the most dramatic views saw the biggest dips in traffic compared with the previous week. In Vermont, Arkansas, Indiana, Maine, New Hampshire and Ohio -- states that were in the path of totality, meaning the moon completely blocked out the sun -- internet traffic dropped by 40 percent to 60 percent around the time of the eclipse, Cloudflare said. States that had partial views also saw drops in internet activity, but to a much lesser extent. At 3:25 p.m. Eastern time, internet traffic in New York dropped by 29 percent ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/09/1637217/internet-traffic-dipped-as-viewers-took-in-the-eclipse?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Internet Traffic Dipped as Viewers Took in the Eclipse", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T17:39:30.154109+00:00", "description": "jd shares a report: Peter Higgs, the Nobel prize-winning physicist who discovered a new particle known as the Higgs boson, has died. Higgs, 94, who was awarded the Nobel prize for physics in 2013 for his work in 1964 showing how the boson helped bind the universe together by giving particles their mass, died at home in Edinburgh on Monday. After a series of experiments, which began in earnest in 2008, his theory was proven by physicists working at the Large Hadron Collider at Cern in Switzerland in 2012; the Nobel prize was shared with Fran&#195;ois Englert, a Belgian theoretical physicist whose work in 1964 also contributed directly to the discovery. A member of the Royal Society and a Companion of Honour, Higgs spent the bulk of his professional life at Edinburgh University, which set up the Higgs centre for theoretical physics in his honour in 2012. \n\nProf Peter Mathieson, the university's principal, said: \"Peter Higgs was a remarkable individual -- a truly gifted scientist whose v", "language": "en-us", "link": "https://science.slashdot.org/story/24/04/09/1729220/peter-higgs-physicist-who-discovered-higgs-boson-dies-aged-94?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Peter Higgs, Physicist Who Discovered Higgs Boson, Dies Aged 94", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T16:34:38.233100+00:00", "description": "Across the U.S., insurance companies are using aerial images of homes as a tool to ditch properties seen as higher risk [non-paywalled link]. From a report: Nearly every building in the country is being photographed, often without the owner's knowledge. Companies are deploying drones, manned airplanes and high-altitude balloons to take images of properties. No place is shielded: The industry-funded Geospatial Insurance Consortium has an airplane imagery program it says covers 99% of the U.S. population. The array of photos is being sorted by computer models to spy out underwriting no-nos, such as damaged roof shingles, yard debris, overhanging tree branches and undeclared swimming pools or trampolines. The red-flagged images are providing insurers with ammunition for nonrenewal notices nationwide.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Insurers+Are+Spying+on+Your+Home+From+the+Sky%3A+https%3A%2F%2Fyro.slashdot.org%2Fstory%2F24%2F04%2F", "language": "en-us", "link": "https://yro.slashdot.org/story/24/04/09/158218/insurers-are-spying-on-your-home-from-the-sky?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Insurers Are Spying on Your Home From the Sky", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T15:29:24.535929+00:00", "description": "More than 200 chemical plants across the country will be required to curb the toxic pollutants they release into the air [non-paywalled link] under a regulation announced by the Biden administration on Tuesday. From a report: The regulation is aimed at reducing the risk of cancer for people living near industrial sites. This is the first time in nearly two decades that the government has tightened limits on pollution from chemical plants. The new rule, from the Environmental Protection Agency, specifically targets ethylene oxide, which is used to sterilize medical devices, and chloroprene, which is used to make rubber in footwear. \n\nThe E.P.A. has classified the two chemicals as likely carcinogens. They are considered a top health concern in an area of Louisiana so dense with petrochemical and refinery plants that it is known as Cancer Alley. Most of the facilities affected by the rule are in Texas, Louisiana and elsewhere along the Gulf Coast as well as in the Ohio River Valley and W", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/09/1442228/epa-limits-pollution-from-chemical-plants?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EPA Limits Pollution From Chemical Plants", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T15:29:23.017375+00:00", "description": "Late last year the messaging app Beeper raised the ire of Apple when it found a way to recreate Apple's infamous \"blue bubble\" messaging on Android. Apple later hobbled Beeper, but it's not an entirely unhappy ending: The startup has been acquired in a deal valued at $125 million. From a report: Founded three years ago, Beeper is being snapped up by Automattic, the respected parent company of WordPress, the blogging and content management platform, as well as Tumblr, which it acquired in 2019. Beeper cofounder Eric Migicovsky said that the company will continue to exist as a stand-alone product within Automattic, and that all of Beeper's 27 employees -- who, like Automattic's employees, are entirely remote -- will be absorbed into the larger entity. \n\nExact financial terms of the acquisition weren't disclosed. According to Migicovsky, Beeper will be part of Automattic's broader strategy to offer more messaging features. Automattic first invested in Beeper in 2022, and late last year s", "language": "en-us", "link": "https://apple.slashdot.org/story/24/04/09/1520243/beeper-took-on-apples-imessage-dominance-now-its-been-acquired?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Beeper Took On Apple's iMessage Dominance. Now It's Been Acquired", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T14:24:07.830595+00:00", "description": "Google Cloud on Tuesday joined AWS and Azure in announcing its first custom-built Arm processor, dubbed Axion. From a report: Based on Arm's Neoverse 2 designs, Google says its Axion instances offer 30% better performance than other Arm-based instances from competitors like AWS and Microsoft and up to 50% better performance and 60% better energy efficiency than comparable X86-based instances. [...] \"Technical documentation, including benchmarking and architecture details, will be available later this year,\" Google spokesperson Amanda Lam said. Maybe the chips aren't even ready yet? After all, it took Google a while to announce Arm-chips in the cloud, especially considering that Google has long built its in-house TPU AI chips and, more recently, custom Arm-based mobile chips for its Pixel phones. AWS launched its Graviton chips back in 2018.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Announces+Axion%2C+Its+First+Custom+Arm-based+Dat", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/09/1245244/google-announces-axion-its-first-custom-arm-based-data-center-processor?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Announces Axion, Its First Custom Arm-based Data Center Processor", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T14:24:05.846153+00:00", "description": "Gemini 1.5 Pro, Google's most capable generative AI model, is now available in public preview on Vertex AI, Google's enterprise-focused AI development platform. From a report: The company announced the news during its annual Cloud Next conference, which is taking place in Las Vegas this week. Gemini 1.5 Pro launched in February, joining Google's Gemini family of generative AI models. Undoubtedly its headlining feature is the amount of context that it can process: between 128,000 tokens to up to 1 million tokens, where \"tokens\" refers to subdivided bits of raw data (like the syllables \"fan,\" \"tas\" and \"tic\" in the word \"fantastic\"). \n\nOne million tokens is equivalent to around 700,000 words or around 30,000 lines of code. It's about four times the amount of data that Anthropic's flagship model, Claude 3, can take as input and about eight times as high as OpenAI's GPT-4 Turbo max context. A model's context, or context window, refers to the initial set of data (e.g. text) the model consi", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/09/1332218/googles-gemini-pro-15-enters-public-preview-on-vertex-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's Gemini Pro 1.5 Enters Public Preview on Vertex AI", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T13:19:24.172449+00:00", "description": "For decades, work has revolved around documents, spreadsheets, and slide decks. Word, Excel, PowerPoint; Pages, Numbers, Keynote; Docs, Sheets, Slides. Now Google is proposing to add another to that triumvirate: an app called Vids that aims to help companies and consumers make collaborative, shareable video more easily than ever. From a report: Google Vids is very much not an app for making beautiful movies... or even not-that-beautiful movies. It's meant more for the sorts of things people do at work: make a pitch, update the team, explain a complicated concept. The main goal is to make everything as easy as possible, says Kristina Behr, Google's VP of product management for the Workspace collaboration apps. \"The ethos that we have is, if you can make a slide, you can make a video in Vids,\" she says. \"No video production is required.\" \n\nBased on what I've seen of Vids so far, it appears to be roughly what you'd get if you transformed Google Slides into a video app. You collect assets", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/09/1229209/with-vids-google-thinks-it-has-the-next-big-productivity-tool-for-work?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "With Vids, Google Thinks It Has the Next Big Productivity Tool For Work", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T11:09:08.698769+00:00", "description": "The Biden administration plans to announce it is awarding more than $6 billion to South Korea's Samsung next week to expand its chip output in Taylor, Texas, as it seeks to ramp up chipmaking in the U.S., Reuters reported Tuesday, citing sources. From the report: The subsidy, which will be unveiled by Commerce Department Secretary Gina Raimondo, will go toward construction of four facilities in Taylor, including one $17 billion chipmaking plant that Samsung announced in 2021, another factory, an advanced packaging facility and a research and development center, one of the sources said. \n\nIt will also include an investment in another undisclosed location, the source said, adding that Samsung will more than double its U.S. investment to over $44 billion as part of the deal. One of the sources said it would be the third largest of the program, just behind Taiwan's TSMC, which was awarded $6.6 billion on Monday and agreed to expand its investment by $25 billion to $65 billion and to add a", "language": "en-us", "link": "https://news.slashdot.org/story/24/04/09/1035210/us-to-award-samsung-up-to-66-billion-chip-subsidy-for-texas-expansion?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US To Award Samsung Up To $6.6 Billion Chip Subsidy For Texas Expansion", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T08:59:40.929211+00:00", "description": "Those taking public transport in the tech hub of San Francisco may be reassured to know that their rides will soon no longer be dependent on floppy disks. From a report: San Francisco Municipal Transportation Agency's director of transportation Jeffrey Tumlin told ABC that the city's automatic light-rail control system is running on outdated tech and \"relies on three five-inch floppy disks\" to boot up. The reporter was holding a 3.5-inch disk in the broadcast, so may have just skipped the word \"point.\" \n\n\"It's a question of risk,\" Tumlin explained in a three-minute segment about the floppy replacement project. \"The system is currently working just fine, but we know that with each increasing year the risk of data degradation on the floppy disks increases and that at some point there will be a catastrophic failure.\" The agency noted that its system was installed in 1998, when floppies were still in common use and, er, \"computers didn't have hard drives.\"<p><div class=\"share_submission\">", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/09/0751247/san-franciscos-light-rail-to-upgrade-from-floppy-disks?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "San Francisco's Light Rail To Upgrade From Floppy Disks", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T06:48:48.695315+00:00", "description": "By becoming the official custodian of an entire nation's history for the first time, the Internet Archive is expanding its already outsize role in preserving the digital world for posterity. From a report: Aruba has long been a special place for Stacy Argondizzo. For years, her family has vacationed on the tiny Caribbean Island every July. More recently it's been more than just a place to take a break from her work as a digital archivist -- becoming wholly a part of that work. \n\nA project Argondizzo galvanized comes to full fruition this week. The Internet Archive is now home to the Aruba Collection, which hosts digitized versions of Aruba's National Library, National Archives, and other institutions including an archaeology museum and the University of Aruba. The collection comprises 101,376 items so far -- roughly one for each person who lives on the Island -- including 40,000 documents, 60,000 images, and seven 3D objects. \n\nThe Internet Archive is mostly known for trying to back u", "language": "en-us", "link": "https://tech.slashdot.org/story/24/04/09/0613204/the-internet-archive-just-backed-up-an-entire-caribbean-island?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Internet Archive Just Backed Up an Entire Caribbean Island", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T03:33:40.125808+00:00", "description": "Magnetic switches are emerging as a potential game-changer for mechanical keyboards. By using magnets instead of physical contacts, these switches allow users to adjust the actuation point of each key. While still a nascent technology lacking standardization, magnetic switches could bring a new level of customization to keyboards, TechCrunch writes.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Magnets+Are+Switching+Up+the+Keyboard+Game%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F04%2F08%2F2111257%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F04%2F08%2F2111257%2Fmagnets-are-switching-up-the-keyboard-game%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://it.slashdot.org/st", "language": "en-us", "link": "https://it.slashdot.org/story/24/04/08/2111257/magnets-are-switching-up-the-keyboard-game?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Magnets Are Switching Up the Keyboard Game", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T01:24:55.476960+00:00", "description": "Japan's largest telecommunications company and the country's biggest newspaper called for speedy legislation to restrain generative AI, saying democracy and social order could collapse if AI is left unchecked. From a report: Nippon Telegraph and Telephone, or NTT, and Yomiuri Shimbun Group Holdings made the proposal in an AI manifesto to be released Monday. Combined with a law passed in March by the European Parliament restricting some uses of AI, the manifesto points to rising concern among American allies about the AI programs U.S.-based companies have been at the forefront of developing. \n\nThe Japanese companies' manifesto, while pointing to the potential benefits of generative AI in improving productivity, took a generally skeptical view of the technology. Without giving specifics, it said AI tools have already begun to damage human dignity because the tools are sometimes designed to seize users' attention without regard to morals or accuracy. Unless AI is restrained, \"in the wors", "language": "en-us", "link": "https://slashdot.org/story/24/04/08/2119229/social-order-could-collapse-in-ai-era-two-top-japan-companies-say?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'Social Order Could Collapse' in AI Era, Two Top Japan Companies Say", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T00:08:42.161911+00:00", "description": "Despite investing billions in new streaming services, media giants have failed to dethrone old favorites, according to Nielsen data. The 21-year-old legal drama \"NCIS\" tops the list, with viewers streaming 11.4 million episodes per week. Netflix dominates the top 10, with eight shows owing most of their viewership to the platform. Reruns from CBS and other networks make up the majority of the list, with \"Stranger Things\" being the only original series. \n\n\"Nine of the 10 most-watched streaming programs are reruns. In addition to the three from CBS, there is one from YouTube (CoComelon), one from Canada (Heartland), one from Australia (Bluey) and Suits. The only original series to crack the list is Stranger Things,\" Bloomberg writes. However: \"While reruns dominate the top 10, that is not the case overall. Most of the 100 most popular titles of the last three years are original series,\" it added.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=N", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/04/08/2133254/nine-of-the-10-most-watched-streaming-programs-are-reruns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Nine of the 10 Most-Watched Streaming Programs Are Reruns", "user": null, "vote": 0}]