[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T15:30:10+00:00", "description": "It almost feels like the games industry has collectively chosen to use the live service model in the worst ways possible. With some very rare exceptions, the vast majority of times a game chooses to be an ongoing experience, that decision is made first and foremost (if not even entirely) for monetary reasons. \n\nVery rarely do we see games adopting that model for the good of their actual playing experience- but that is exactly what Helldivers 2 has done, and done it in a way that many may not even have believed could be done anymore. \n\nFrom how it collaborates with the entire community to tell its story, to the unique ways in which it keeps rolling out new content and features, Helldivers 2 has established an incredible live service blueprint that everyone else in the industry needs to study extensively.", "language": null, "link": "https://www.youtube.com/watch?v=ihlEozLOUhE", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/ihlEozLOUhE/hqdefault.jpg", "title": "So Far, Helldivers 2 Is A MASTERCLASS In Live Service Support And Ongoing Storytelling", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-04-09T10:00:34+00:00", "description": "Incoming is a PlayStation 5 exclusive which might just go down as one of the console’s biggest games of the year. Stellar Blade, from Korean developer Shift Up, is an action-adventure game. \n\nThe methodical pacing, enemy attack studying, and deep, nuanced combat mechanics put Stellar Blade in league with FromSoftware’s Soulsborne titles, particularly Sekiro: Shadows Die Twice.", "language": null, "link": "https://www.youtube.com/watch?v=bdzGZ584AeI", "manual_status_code": 0, "page_rating": 100, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/bdzGZ584AeI/hqdefault.jpg", "title": "Why Stellar Blade Will Be One of the BIGGEST PS5 GAMES of 2024", "user": null, "vote": 0}]