[
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-25T22:00:21+00:00",
        "description": "Nick and Noah are back and more in love than ever. Culpa Tuya hits Prime Video December 27.\n \n» Watch Culpa Tuya on Prime Video: https://bit.ly/41qlmwI\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n \nAbout Culpa Tuya: A sequel to the global hit My Fault; the love between Noah and Nick seems unwavering despite their parents’ attempts to separate them. But his job and her entry into college open up their lives to new relationships that will shake the foundations of both their relationship and the Leister family itself. When so many people are ready to destroy a relationship, can it really end well?\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Prime Video offers a variety of unique and captivating entertainment, including original series “The Boys,” “Invincible,” “Hazbin Hotel,” “The Summer I Turned Pretty,” ",
        "id": 1780113,
        "language": null,
        "link": "https://www.youtube.com/watch?v=nuPjieeswM4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i3.ytimg.com/vi/nuPjieeswM4/hqdefault.jpg",
        "title": "Culpa Tuya Sneak Peek: Nick and Noah are Back | Prime Video",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-25T19:00:19+00:00",
        "description": "Community is available to rent on Prime Video.\n\nAbout Community: When fast-talking lawyer Jeff Winger (Joel McHale) finds his degree has been revoked, he is forced to go back to school at Greendale Community College. Hoping to score points with a pretty coed, he invents a study group and invites her to join it. Imagine his surprise when she's not the only one who shows up for help with Spanish from the \"board-certified tutor\" he proclaims himself to be. Though his command of the language is anything but good, the members continue to meet and end up learning a lot about themselves.\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Prime Video offers a variety of unique and captivating entertainment, including original series “The Boys,” “Invincible,” “Hazbin Hotel,” “The Summer I Turned Pretty,” and more.\n \n#Comm",
        "id": 1779497,
        "language": null,
        "link": "https://www.youtube.com/watch?v=LRKy7m3RRxg",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/LRKy7m3RRxg/hqdefault.jpg",
        "title": "Holiday dinners be like. | Community",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-25T18:00:06+00:00",
        "description": "Happy holidays! Here is one more gift for you... the first 15 minutes of Candy Cane Lane! Catch Eddie Murphy, Jillian Bell, Tracee Ellis Ross and more in this instant holiday classic and then watch the rest only on Prime Video.\n \n» Watch Candy Cane Lane on Prime Video: https://amzn.to/3uGNxcy\n» SUBSCRIBE: http://bit.ly/PrimeVideoSubscribe\n \nAbout Candy Cane Lane: Eddie Murphy stars in this holiday comedy adventure about a man on a mission to win his neighborhood’s annual Christmas home decoration contest and inadvertently makes a deal with a mischievous elf that brings the 12 Days of Christmas to life.\n \nAbout Prime Video:\nWant to watch it now? We’ve got it. This week’s newest movies, last night’s TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Prime Video offers a variety of unique and captivating entertainment, including original series “The Boys,” “Invincible,” “Hazbin Hotel,” “The Summer I Turned Pret",
        "id": 1779246,
        "language": null,
        "link": "https://www.youtube.com/watch?v=Es8mUF8qUJk",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/Es8mUF8qUJk/hqdefault.jpg",
        "title": "First 15 Minutes of Candy Cane Lane | Prime Video",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "Prime Video",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-25T17:00:55+00:00",
        "description": "Step back into the fabulous world of Midge Maisel and friends - The Marvelous Mrs. Maisel is now streaming on Prime Video! \n\nAbout The Marvelous Mrs. Maisel: In 1958 New York, Midge Maisel’s life is on track– husband, kids, and elegant Yom Kippur dinners in their Upper West Side apartment. But when her life takes a surprise turn, she has to quickly decide what else she’s good at – and going from housewife to stand-up comic is a wild choice to everyone but her. The Marvelous Mrs. Maisel is written and directed by Amy Sherman-Palladino (Gilmore Girls).\n \nAbout Prime Video:\nWant to watch it now? We've got it. This week's newest movies, last night's TV shows, classic favorites, and more are available to stream instantly, plus all your videos are stored in Your Video Library. Over 150,000 movies and TV episodes, including thousands for Amazon Prime members at no additional cost.\n\n#TheMarvelousMrsMaisel #PrimeVideo #Shorts",
        "id": 1779019,
        "language": null,
        "link": "https://www.youtube.com/watch?v=meM11bQkEX4",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 454,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQJWtTnAHhEG5w4uN0udnUQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/meM11bQkEX4/hqdefault.jpg",
        "title": "White Christmas | The Marvelous Mrs. Maisel",
        "vote": 0
    }
]