[
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-25T15:30:21+00:00",
        "description": "Games have come a long way from the early days when limited screen and memory space was an issue. Huge open worlds and even life-sized galaxies are touted as a major selling point for many games. Yet, players are desiring a return to the glory days of more streamlined, curated experiences. \n\nLinear games were back and better than ever in 2024. Some of this year’s best overall titles were linear in nature. From the PlayStation platformer Astro Bot to Princess Peach Showtime, a bevy of this year’s games displayed excellent design within a tightly packaged frame. \n\nSome games on this list do contain some open-ended areas in between more linear stages, while some have a hub area for your meandering needs. If you wanted the best of the best linear games of the year, you’ve come to the right place with these 15 picks.",
        "id": 1778769,
        "language": null,
        "link": "https://www.youtube.com/watch?v=it1iv_8g3vI",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i2.ytimg.com/vi/it1iv_8g3vI/hqdefault.jpg",
        "title": "15 AMAZING Linear Games of 2024 You Definitely NEED To Play",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": "GamingBolt",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-25T09:30:05+00:00",
        "description": "It’s more apparent than ever that publishers are patiently waiting for Rockstar to cement a solid release date or delay GTA 6 before they make a move. The industry seems to be on pins and needles avoiding stepping on the toes of GTA 6 and its Fall release date. In this video, we outline Rockstar’s release history and explore other examples where publishers avoided another big game’s release. \n\nThere’s precedent for Rockstar to delay GTA 6, and other studios know this. Every GTA since GTA 3 has been delayed, so why would GTA 6 buck that trend? This likelihood of a delay in tandem with games overshadowing smaller projects in the past lead to the conclusion that the industry is hesitant to announce stuff at the moment. And while it may seem like an overtly obvious conclusion at first glance, there have been exceptions to the rule. In GTA 6’s case though, other games would be wise to steer clear of its giant release footprint.",
        "id": 1777353,
        "language": null,
        "link": "https://www.youtube.com/watch?v=8ukykxQRnok",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 129,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i1.ytimg.com/vi/8ukykxQRnok/hqdefault.jpg",
        "title": "Is GTA 6 All Set To TOPPLE THE GAMES INDUSTRY!?",
        "vote": 0
    }
]