[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-03T19:30:00+00:00", "description": "Where MotoGP 24 shines is where it has always shined: its tight, satisfying racing gameplay on beautiful, diverse tracks. That has rung true for years now, and this year’s entry does little to stray from the franchise’s strengths. \n\nIts Career mode is slightly improved with some off-track refinements, and the additions to the difficulty options make it an easier sell for newcomers to the franchise, but few other improvements mean this is a game that’s better for players who have been away from the franchise for a couple of years. Come for the racing and stay for the beautiful visuals, but don’t expect any major updates over previous games.", "language": null, "link": "https://www.youtube.com/watch?v=-bJpJsTmN8E", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/-bJpJsTmN8E/hqdefault.jpg", "title": "MotoGP 24 Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-03T15:30:00+00:00", "description": "Fallout games’ track record with main stories has been inconsistent over the years, but one area where the franchise has never failed to knock it out of the park is the multitude of short, one-off stories that it crams its world full of- the overwhelming majority of which end up being exactly as bizarre, unsettling, and weirdly funny as you would expect from Fallout. \n\nAnd of course, many of these stories are tied deeply to the many, many Vault-Tec vaults that are scattered throughout Fallout’s post-apocalyptic America. Over the years, across many Fallout games, exploring these vaults and learning about their twisted and often horrifying histories has made for unforgettable experiences. Here, we’re going to talk about a few Fallout vaults that did just that.", "language": null, "link": "https://www.youtube.com/watch?v=-Ty6UnpFCcM", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/-Ty6UnpFCcM/hqdefault.jpg", "title": "Fallout - 5 MOST DISTURBING Vault Stories", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-03T13:30:21+00:00", "description": "While there's no shortage of extraction shooters (and they're not quite everyone's cup of tea), there's something special about Madfinger Games' Gray Zone Warfare. Maybe it's because of the realistic gunplay and how every action, whether checking your ammo, measuring your shots or conserving stamina, matters.\n\nIt could also be due to the vibrant yet mysterious setting and the realistic injury system, which requires treating broken bones and regaining lost blood. Though it isn't without issues and is far from feature-complete, Gray Zone Warfare is successful, with 400,000 copies sold in two days of early access. The question is: How should new players approach it, and what are some tips to get started?\n\nHere are ten tips and tricks for the title, ranging from survival and retrieving loot to the benefits of stamina management.", "language": null, "link": "https://www.youtube.com/watch?v=U_ybKmzEJ1c", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/U_ybKmzEJ1c/hqdefault.jpg", "title": "Gray Zone Warfare - 10 Beginners Tips And Tricks You Need To Know", "user": null, "vote": 0}]