[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T17:30:05+00:00", "description": "Remnant 2's third post-launch DLC, The Dark Horizon, is available now, and while not the end of the shooter's support, it is the final paid content drop. After feeling disappointed by The Awakened King and The Forgotten Kingdom, The Dark Horizon fares slightly better. \n\nThis new sector offers several vast canyons which require a glider to traverse. There are tough but fair new foes to tackle and challenging yet enjoyable enemies to beat. Of course, new rings, amulets, and weapons also await.\n\nIt still has shortcomings, such as the odd narrative, sometimes tedious exploration, lack of unique enemies, and one of the worst dungeon events ever. Nevertheless, it ends the DLC trilogy on a decent note while offering plenty to keep players grinding for a long while.", "id": 1219060, "language": null, "link": "https://www.youtube.com/watch?v=c6JDMzKKcG4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/c6JDMzKKcG4/hqdefault.jpg", "title": "Remnant 2: The Dark Horizon Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T17:30:04+00:00", "description": "Mortal Kombat 1: Khaos Reigns features a decent but one of the weakest campaigns in the entire franchise. Featuring rich visuals and solid performances, Mortal Kombat 1: Khaos Reigns' campaign struggles with weird plot choices and pacing issues.\n\nAlong with Khaos Reigns, we also get access to six playable characters out of which only three are playable at launch. Sektor and Cyrax are great additions but the real star of the show is Noob Saibot.\n\nBesides the story expansion and characters, animalities are also back after almost three decades and they are every bit awesome as you remember them.", "id": 1219061, "language": null, "link": "https://www.youtube.com/watch?v=Hg-gKXRAg0s", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/Hg-gKXRAg0s/hqdefault.jpg", "title": "Mortal Kombat 1: Khaos Reigns DLC Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T15:30:07+00:00", "description": "Khaos Reigns in Mortal Kombat 1's new expansion, though \"chaos is present\" would perhaps be more apropos. Taking place after the base game, it sees Havik attacking the current timeline and causing havoc for Liu Kang and his warriors. But that's not all.\n\nBi Han has gone to the dark side as Noob Saibot; Sektor will follow her Grandmaster down whatever path; and Cyrax is conflicted about her involvement with the Lin Kuei. The multiverse shenanigans seen in the base game aren't as overt here, though players will encounter other variants that may need assistance.\n\nBut enough about the set-up - how does it all end? How does Liu Kang thwart the latest threat to Earthrealm? What does Havik even want? Do the Kamidogu, which haven't been seen since Mortal Kombat X, play a significant role in the current timeline? Find out all of this and more here.", "id": 1218244, "language": null, "link": "https://www.youtube.com/watch?v=PKzPLwPcxI8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/PKzPLwPcxI8/hqdefault.jpg", "title": "Mortal Kombat 1: Khaos Reigns Ending Explained And What The Hell Will Happen Next?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T13:30:02+00:00", "description": "It’s been over a decade and a half since the release of Dragon Ball: Budokai Tenkaichi 3, but fans of the 3D arena fighting series have been pining for its return pretty much nonstop. \n\nAnd though there were times when it seemed like that would never happen, it finally is. The Budokai Tenkaichi series is returning soon with its fourth instalment in Dragon Ball: Sparking! ZERO, and understandably enough, there are plenty of fans who are quite excited about its release. \n\nAs such, ahead of its approaching launch, here, we are going to go over a few key things that you should know about the game, from its roster and its modes to its core gameplay mechanics, multiplayer offerings, and more.", "id": 1216983, "language": null, "link": "https://www.youtube.com/watch?v=4phDMIBjrRo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/4phDMIBjrRo/hqdefault.jpg", "title": "Dragon Ball Sparking! Zero - 15 Things You Need To Know Before You Buy", "vote": 0}]