[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T23:56:28.740483+00:00", "description": "An anonymous reader quotes a report from 404 Media: After a horseback riding accident left him paralyzed from the waist down in 2009, former jockey Michael Straight learned to walk again with the help of a $100,000 ReWalk Personal exoskeleton. Earlier this month, that exoskeleton broke because of a malfunctioning piece of wiring in an accompanying watch that makes the exoskeleton work. The manufacturer refused to fix it, saying the machine was now too old to be serviced, and Straight once again couldn't walk anymore. \"After 371,091 steps my exoskeleton is being retired after 10 years of unbelievable physical therapy,\" Straight posted on Facebook on September 16. \"The reasons [sic] why it has stopped is a pathetic excuse for a bad company to try and make more money. The reason it stopped is because of a battery in the watch I wear to operate the machine. I called thinking it was no big deal, yet I was told they stopped working on any machine that was 5 years or older. I find it very ha", "id": 1221093, "language": null, "link": "https://hardware.slashdot.org/story/24/09/26/2113232/paralyzed-jockey-loses-ability-to-walk-after-manufacturer-refuses-to-fix-battery-for-his-100000-exoskeleton?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Paralyzed Jockey Loses Ability To Walk After Manufacturer Refuses To Fix Battery For His $100,000 Exoskeleton", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T22:52:12.998475+00:00", "description": "According to the Wall Street Journal, the U.S. Department of Justice is investigating Super Micro Computer after short-seller Hindenburg Research alleged \"accounting manipulation\" at the AI server maker. Super Micro's shares fell about 12% following the report. Reuters reports: The WSJ report, which cited people familiar with the matter, said the probe was at an early stage and that a prosecutor at a U.S. attorney's office recently contacted people who may be holding relevant information. The prosecutor has asked for information that appeared to be connected to a former employee who accused the company of accounting violations, the report added.\n \nSuper Micro had late last month delayed filing its annual report, citing a need to assess \"its internal controls over financial reporting,\" a day after Hindenburg disclosed a short position and made claims of \"accounting manipulation.\" The short-seller had cited a three-month investigation that included interviews with former senior employee", "id": 1220817, "language": null, "link": "https://yro.slashdot.org/story/24/09/26/211247/us-justice-department-probes-super-micro-computer?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Justice Department Probes Super Micro Computer", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T22:52:12.800470+00:00", "description": "The Verge's Emma Roth reports: NotebookLM, Google's AI note-taking app, can now summarize and help you dig deeper into YouTube videos. The new capability works by analyzing the text in a YouTube video's transcript, including autogenerated ones. Once you add a YouTube link to NotebookLM, it will use AI to provide a brief summary of key topics discussed in the transcript. You can then click on these topics to get more detailed information as well as ask questions. (If you're struggling to come up with something to ask, NotebookLM will suggest some questions.)\n \nAfter clicking on some of the topics, I found that NotebookLM backs up the information provided in its chat window with a citation that links you directly to the point in the transcript where it's mentioned. You can also create an Audio Overview based on the content, which is a podcast-style discussion hosted by AI. I found that the feature worked on most of the videos I tried, except for ones published within the past two days o", "id": 1220816, "language": null, "link": "https://news.slashdot.org/story/24/09/26/217228/googles-notebooklm-can-help-you-dive-deeper-into-youtube-videos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's NotebookLM Can Help You Dive Deeper Into YouTube Videos", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T21:47:03.447462+00:00", "description": "Apple has pulled 60 VPNs from its App Store in Russia, according to research from anti-censorship org GreatFire. From a report: The iThing-maker's action comes amid a Kremlin crackdown on VPNs that has already seen a ban on privacy-related extensions to the open source Firefox browser. The software's developer, Mozilla, defied that ban and allowed the extensions back into its web store. In July, Apple removed at least one VPN from its Russian App Store. Cupertino removed at least 60 more between early July and September 18, according to research by GreatFire posted to its site that tracks Apple censorship. The org's research asserts that 98 VPNs are now unavailable in Russia -- but doesn't specify if the removals were made in the iOS or macOS app stores.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Quietly+Removed+60+More+VPNs+From+Russian+App+Store%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F09%2F26%", "id": 1220509, "language": null, "link": "https://apple.slashdot.org/story/24/09/26/1927250/apple-quietly-removed-60-more-vpns-from-russian-app-store?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Quietly Removed 60 More VPNs From Russian App Store", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T21:47:03.228531+00:00", "description": "A New York federal court has ordered (PDF) the operators of shadow library LibGen to pay $30 million in copyright damages to publishers. The default judgment also comes with a broad injunction that affects third-party services including domain registries, browser extensions, CDN providers, IPFS gateways, advertisers, and more. These parties must restrict access to the pirate site. An anonymous reader quotes a report from TorrentFreak: Yesterday, U.S. District Court Judge Colleen McMahon granted the default judgment without any changes. The anonymous LibGen defendants are responsible for willful copyright infringement and their activities should be stopped. \"Plaintiffs have been irreparably harmed as a result of Defendants' unlawful conduct and will continue to be irreparably harmed should Defendants be allowed to continue operating the Libgen Sites,\" the order reads. The order requires the defendants to pay the maximum statutory damages of $150,000 per work, a total of $30 million, fo", "id": 1220508, "language": null, "link": "https://yro.slashdot.org/story/24/09/26/2052249/us-court-orders-libgen-to-pay-30-million-to-publishers-issues-broad-injunction?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "US Court Orders LibGen To Pay $30 Million To Publishers, Issues Broad Injunction", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T20:42:44.498227+00:00", "description": "Cybersecurity firm Kaspersky has defended its decision to automatically replace its antivirus software on U.S. customers' computers with UltraAV, a product from American company Pango, without explicit user consent. The forced switch, affecting nearly one million users, occurred as a result of a U.S. government ban on Kaspersky software. \n\nKaspersky spokesperson Francesco Tius told TechCrunch that the company informed eligible U.S. customers via email about the migration, which began in early September. Windows users experienced an automatic transition to ensure continuous protection, while Mac and mobile users were instructed to manually install UltraAV. Some customers expressed alarm at the unannounced software swap. Kaspersky blamed missed notifications on unregistered email addresses, directing users to in-app messages and an online FAQ. The abrupt change raises concerns about user autonomy and privacy in software updates, particularly as UltraAV lacks an established security trac", "id": 1220089, "language": null, "link": "https://it.slashdot.org/story/24/09/26/1825249/kaspersky-defends-stealth-swap-of-antivirus-software-on-us-computers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Kaspersky Defends Stealth Swap of Antivirus Software on US Computers", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T20:42:44.403240+00:00", "description": "An anonymous reader shares a report: In the decade-long fight to control CRISPR, the super-tool for modifying DNA, it's been common for lawyers to try to overturn patents held by competitors by pointing out errors or inconsistencies. But now, in a surprise twist, the team that earned the Nobel Prize in chemistry for developing CRISPR is asking to cancel two of their own seminal patents, MIT Technology Review has learned. \n\nThe decision could affect who gets to collect the lucrative licensing fees on using the technology. The request to withdraw the pair of European patents, by lawyers for Nobelists Emmanuelle Charpentier and Jennifer Doudna, comes after a damaging August opinion from a European technical appeals board, which ruled that the duo's earliest patent filing didn't explain CRISPR well enough for other scientists to use it and doesn't count as a proper invention. The Nobel laureates' lawyers say the decision is so wrong and unfair that they have no choice but to preemptively ", "id": 1220088, "language": null, "link": "https://science.slashdot.org/story/24/09/26/190227/two-nobel-prize-winners-want-to-cancel-their-own-crispr-patents-in-europe?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Two Nobel Prize Winners Want To Cancel Their Own CRISPR Patents in Europe", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T20:42:44.306683+00:00", "description": "Google has restricted the creation of new accounts for Russian users, state news agencies cited Russia's digital ministry as saying on Thursday. Reuters: Google has been under pressure in Russia for several years, particularly for not taking down content Moscow considers illegal and for blocking the YouTube channels of Russian media and public figures since Moscow's invasion of Ukraine. \"The ministry confirms that Google has restricted the creation of new accounts,\" Interfax quoted the digital ministry as saying. \"Telecom operators have also recorded a significant reduction in the number of SMS messages sent by the company to Russian users.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Restricts+Creation+of+New+Accounts+in+Russia%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F09%2F26%2F1918250%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<", "id": 1220087, "language": null, "link": "https://tech.slashdot.org/story/24/09/26/1918250/google-restricts-creation-of-new-accounts-in-russia?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Restricts Creation of New Accounts in Russia", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T18:18:06.895948+00:00", "description": "A year-long test of Apple's 80% charge limit feature on the iPhone 15 Pro Max has revealed only marginal benefits to battery health. MacRumors editor Juli Clover reported her device maintained 94% battery capacity after 299 charge cycles, compared to 87-90% capacity for iPhones without the limit. The opt-in setting, introduced with iPhone 15 models, aims to extend battery longevity by restricting maximum charge. \n\nClover adhered strictly to the 80% limit for 12 months, noting occasional inconveniences like depleted batteries during long days. While the test showed slightly better battery health retention, Clover questioned whether the trade-off in daily usability was worthwhile. She adds: I don't have a lot of data points for comparison, but it does seem that limiting the charge to 80 percent kept my maximum battery capacity higher than what my co-workers are seeing, but there isn't a major difference. I have four percent more battery at 28 more cycles, and I'm not sure suffering thro", "id": 1219254, "language": null, "link": "https://mobile.slashdot.org/story/24/09/26/1724238/iphones-80-charge-cap-barely-boosts-battery-life-year-long-test-reveals?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "iPhone's 80% Charge Cap Barely Boosts Battery Life, Year-Long Test Reveals", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T18:18:06.415764+00:00", "description": "An anonymous reader shares a New Yorker story: Ultimately, the iPhone 16 does little to meaningfully improve on the experience I had with the 12, besides, perhaps, charging with a USB-C, as my laptop does, cutting down on the number of cords I have to keep track of. Instead, the greatest leaps in Apple's hardware are largely directed at those niche users who are already invested in using tools such as artificial intelligence and virtual reality. The company has announced that, within a month or so, the new phones will be able to operate its proprietary artificial-intelligence system, which means that users may soon be relying on A.I. to perform daily personal tasks, like navigating their calendars or responding to e-mails. The 15 and 16 Pros can take three-dimensional photos, designed for V.R., using the Apple Vision Pro. Thus far, I don't use A.I. tools or V.R. with any frequency and have no intention of doing so on my iPhone. \n\nThe fact that I do not need an iPhone 16 is a testament", "id": 1219253, "language": null, "link": "https://mobile.slashdot.org/story/24/09/26/1713242/the-end-of-the-iphone-upgrade?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The End of the iPhone Upgrade?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T17:12:56.929259+00:00", "description": "An anonymous reader shares a report: Google Maps is reeling in business pages engaging in fake reviews, and highlighting such activity to its users. Google will now impose restrictions against business profiles that violate the search giant's Fake Engagement policy, such as temporarily removing reviews, blocking new reviews or ratings, and displaying a warning message on profiles that have had fake reviews deleted. \n\nThe business profile restrictions were introduced in the UK earlier this year, but Search Engine Roundtable notes that the support page was updated in mid-September to seemingly apply globally. For the moment, however, only users in the UK are seeing the business warnings.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Maps+is+Cracking+Down+on+Fake+Reviews%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F09%2F26%2F1540200%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn", "id": 1218864, "language": null, "link": "https://tech.slashdot.org/story/24/09/26/1540200/google-maps-is-cracking-down-on-fake-reviews?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Maps is Cracking Down on Fake Reviews", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T17:12:56.704287+00:00", "description": "California Governor Gavin Newsom has signed a law (AB 2426) to combat \"disappearing\" purchases of digital games, movies, music, and ebooks. The legislation will force digital storefronts to tell customers they're just getting a license to use the digital media, rather than suggesting they actually own it. From a report: When the law comes into effect next year, it will ban digital storefronts from using terms like \"buy\" or \"purchase,\" unless they inform customers that they're not getting unrestricted access to whatever they're buying. Storefronts will have to tell customers they're getting a license that can be revoked as well as provide a list of all the restrictions that come along with it. Companies that break the rule could be fined for false advertising.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=California's+New+Law+Forces+Digital+Stores+To+Admit+You're+Just+Licensing+Content%2C+Not+Buying+It%3A+https%3A%2", "id": 1218863, "language": null, "link": "https://news.slashdot.org/story/24/09/26/1645241/californias-new-law-forces-digital-stores-to-admit-youre-just-licensing-content-not-buying-it?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "California's New Law Forces Digital Stores To Admit You're Just Licensing Content, Not Buying It", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T15:57:24.970227+00:00", "description": "Intel has released microcode update 0x12B for its 13th and 14th generation Core processors, addressing persistent stability issues stemming from voltage irregularities. The update targets a specific clock tree circuit within the CPU's IA core that was causing elevated voltage requests during idle and light workloads. \n\nThe company identified four key factors contributing to voltage instability: motherboards exceeding Intel's power specifications, an Enhanced Thermal Velocity Boost algorithm allowing sustained high performance at elevated temperatures, frequent high voltage requests from the processor, and problematic microcode demanding elevated core voltages during low-activity periods. While previous update 0x129 addressed some concerns, the new 0x12B update aims to resolve the root cause of the \"Vmin shift\" problem, where voltage spikes lead to increased power requirements and potential degradation over time. Intel is working with motherboard manufacturers to roll out BIOS updates ", "id": 1218307, "language": null, "link": "https://it.slashdot.org/story/24/09/26/1535236/intel-releases-critical-microcode-fix-for-13th-and-14th-gen-cpu-voltage-issues?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel Releases Critical Microcode Fix for 13th and 14th Gen CPU Voltage Issues", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T14:51:48.894992+00:00", "description": "WordPress has escalated its feud with WP Engine, a hosting provider, by blocking the latter's servers from accessing WordPress.org resources -- and therefore from potentially vital software updates. From a report: WordPress is an open source CMS which is extensible using plugins. Its home is WordPress.org, which also hosts resources such as themes and plugins for the CMS. A vast ecosystem of plugins exists from numerous suppliers, but WordPress.org is the main source. Many WordPress users rely on several plugins. Preventing WP Engine users from accessing plugin updates is therefore serious, as it could mean users can't update plugins that have security issues, or other fixes. \n\nWordPress co-founder and CEO Matt Mullenweg recently called WP Engine a \"cancer\" and accused it of profiting from WordPress without contributing to development of the CMS. Mullenweg has sought to have WP Engine pay trademark license fees -- a move he feels would represent a financial contribution commensurate w", "id": 1217736, "language": null, "link": "https://tech.slashdot.org/story/24/09/26/147236/wordpressorg-denies-service-to-wp-engine?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "WordPress.org Denies Service To WP Engine", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T14:51:48.667946+00:00", "description": "The Tor Project: Today the Tor Project, a global non-profit developing tools for online privacy and anonymity, and Tails, a portable operating system that uses Tor to protect users from digital surveillance, have joined forces and merged operations. Incorporating Tails into the Tor Project's structure allows for easier collaboration, better sustainability, reduced overhead, and expanded training and outreach programs to counter a larger number of digital threats. In short, coming together will strengthen both organizations' ability to protect people worldwide from surveillance and censorship. \n\nCountering the threat of global mass surveillance and censorship to a free Internet, Tor and Tails provide essential tools to help people around the world stay safe online. By joining forces, these two privacy advocates will pool their resources to focus on what matters most: ensuring that activists, journalists, other at-risk and everyday users will have access to improved digital security too", "id": 1217735, "language": null, "link": "https://yro.slashdot.org/story/24/09/26/1431201/tor-project-merges-with-tails?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Tor Project Merges With Tails", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T13:44:17.086936+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Among the first AI companies that the Federal Trade Commission has exposed as deceiving consumers is DoNotPay -- which initially was advertised as \"the world's first robot lawyer\" with the ability to \"sue anyone with the click of a button.\" On Wednesday, the FTC announced that it took action to stop DoNotPay from making bogus claims after learning that the AI startup conducted no testing \"to determine whether its AI chatbot's output was equal to the level of a human lawyer.\" DoNotPay also did not \"hire or retain any attorneys\" to help verify AI outputs or validate DoNotPay's legal claims.\n \nDoNotPay accepted no liability. But to settle the charges that DoNotPay violated the FTC Act, the AI startup agreed to pay $193,000, if the FTC's consent agreement is confirmed following a 30-day public comment period. Additionally, DoNotPay agreed to warn \"consumers who subscribed to the service between 2021 and 2023\" about the \"limitations of", "id": 1217169, "language": null, "link": "https://yro.slashdot.org/story/24/09/25/2241246/donotpay-has-to-pay-193k-for-falsely-touting-untested-ai-lawyer-ftc-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "DoNotPay Has To Pay $193K For Falsely Touting Untested AI Lawyer, FTC Says", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T11:25:29.022971+00:00", "description": "\"The New York Times reports that astronomers have discovered a black hole spitting energy across 23 million light-years of intergalactic space (source paywalled; alternative source),\" writes longtime Slashdot reader fahrbot-bot. From the report: Two jets, shooting in opposite directions, compose the biggest lightning bolt ever seen in the sky -- about 140 times as long as our own Milky Way galaxy is wide, and more than 10 times the distance from Earth to Andromeda, the nearest large spiral galaxy. Follow-up observations with optical telescopes traced the eruption to a galaxy 7.5 billion light-years away that existed when the universe was less than half its current age of 14 billion years. At the heart of that galaxy was a black hole spewing energy equivalent to the output of more than a trillion stars.\n \n\"The Milky Way would be a little dot in these two giant eruptions,\" said Martijn Oei, a postdoctoral researcher at the California Institute of Technology. Dr. Oei led the team that ma", "id": 1216315, "language": null, "link": "https://science.slashdot.org/story/24/09/25/2223236/astronomers-discover-black-hole-with-energy-jets-spanning-23-million-light-years?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Astronomers Discover Black Hole With Energy Jets Spanning 23 Million Light Years", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T07:53:49.191263+00:00", "description": "New research suggests that Mars' missing atmosphere may have been absorbed by minerals in the planet's clays, in a process similar to geological reactions on Earth. It may explain Mars' loss of its atmosphere and potential to support life, with methane possibly still present and usable as an energy source. Longtime Slashdot reader Baron_Yam writes: Conditions on early Mars were highly likely to have had CO2 carried down into the ground by water, where reactions with rock resulted in iron oxide (and Mars' rust-red surface) and released hydrogen, which in turn reacted with the water to form methane that was bound in smectite clays. It's all still there, just under the surface. The research has been published in the journal Science Advances.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ancient+Martian+Atmosphere+May+Be+Sequestered+In+Clay%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F09%2F25%2F2215228%2F%3Futm", "id": 1215262, "language": null, "link": "https://science.slashdot.org/story/24/09/25/2215228/ancient-martian-atmosphere-may-be-sequestered-in-clay?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Ancient Martian Atmosphere May Be Sequestered In Clay", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T03:33:20.312162+00:00", "description": "An anonymous reader quotes a report from CNN: Some McDonald's franchisees -- which own and operate 95% of McDonald's in the United States -- are now rolling out kiosks that can take cash and accept change. But even in these locations, McDonald's is reassigning cashiers to other roles, including new \"guest experience lead\" jobs that help customers use the kiosks and assist with any issues. \"In theory, kiosks should help save on labor, but in reality, restaurants have added complexity due to mobile ordering and delivery, and the labor saved from kiosks is often reallocated for these efforts,\" said RJ Hottovy, an analyst who covers the restaurant and retail industries at data analytics firm Placer.ai. Kiosks \"have created a restaurant within a restaurant.\" And in some cases, kiosks have even been a flop. Bowling ally chain Bowlero added kiosks in lanes for customers to order food and drinks, but they went unused because staff and customers weren't fully trained on using them. \"The uninte", "id": 1214480, "language": null, "link": "https://hardware.slashdot.org/story/24/09/25/220217/mcdonalds-touchscreen-kiosks-feared-as-job-killers-created-more-jobs-instead?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "McDonald's Touchscreen Kiosks, Feared As Job Killers, Created More Jobs Instead", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T02:28:48.272347+00:00", "description": "\"Looks like there's a storm brewing, and it's not good news,\" writes ancient Slashdot reader jd. \"Whether or not the bugs are classically security defects or not, this is extremely bad PR for the Linux and Open Source community. It's not clear from the article whether this affects other Open Source projects, such as FreeBSD.\" From a report: A critical unauthenticated Remote Code Execution (RCE) vulnerability has been discovered, impacting all GNU/Linux systems. As per agreements with developers, the flaw, which has existed for over a decade, will be fully disclosed in less than two weeks. Despite the severity of the issue, no Common Vulnerabilities and Exposures (CVE) identifiers have been assigned yet, although experts suggest there should be at least three to six. Leading Linux distributors such as Canonical and RedHat have confirmed the flaw's severity, rating it 9.9 out of 10. This indicates the potential for catastrophic damage if exploited. However, despite this acknowledgment, ", "id": 1214341, "language": null, "link": "https://it.slashdot.org/story/24/09/25/2150210/critical-unauthenticated-rce-flaw-impacts-all-gnulinux-systems?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Critical Unauthenticated RCE Flaw Impacts All GNU/Linux Systems", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T01:23:57.170660+00:00", "description": "An anonymous reader shares a report: Some Amazon workers are refusing to \"disagree and commit,\" as one of the company's famed leadership principles requires of those who aren't on board with a decision. Instead, hundreds of the online retailing giant's employees are complaining that CEO Andy Jassy's five-days-per-week return-to-office mandate, announced last week, will negatively impact their lives -- and productivity at work -- and how they hope the company will reverse course. \n\nThe feedback is from an anonymous survey created by Amazon employees that was viewed by Fortune on Tuesday. Corporate employees have shared it widely via the messaging app Slack, including in one \"remote advocacy\" Slack channel with more than 30,000 members that a former employee created when Amazon first announced a three-day return-to-office mandate last year. As a result, employees who are in favor of remote or hybrid work may have been more likely to respond to the survey and therefore skew the findings.", "id": 1214142, "language": null, "link": "https://slashdot.org/story/24/09/25/1941205/amazon-employees-plead-for-reversal-of-5-day-rto-mandate-in-anonymous-survey?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Employees Plead For Reversal of 5-Day RTO Mandate in Anonymous Survey", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T01:23:56.935787+00:00", "description": "Disney has officially launched its password and account-sharing crackdown, rolling out what it is calling its \"paid sharing program\" to users in the U.S. and in many regions around the world this week. The rollout follows the company sharing plans to crackdown on unauthorized usage on its streaming service earlier this year. From a report: The paid sharing program has a couple of options for users, per a blog post published Wednesday: People sharing an account with someone outside their household can add that person as an \"Extra Member\" for $6.99 per month for Disney+ Basic, or $9.99 for Disney+ Premium, both discounts to the normal retail price. Only one Extra Member will be allowed per account, and it is not available as part of the Disney Bundle. In addition, users sharing an account can also subscribe to Disney+ themselves, and can transfer an eligible profile to the new account to keep their watch history and settings. The password-cracking effort has helped Netflix boost its sub", "id": 1214141, "language": null, "link": "https://entertainment.slashdot.org/story/24/09/25/1927210/disney-officially-launches-password-sharing-crackdown-with-paid-sharing-program?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Disney Officially Launches Password-Sharing Crackdown With Paid Sharing Program", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T00:18:57.526423+00:00", "description": "An anonymous reader shares a report: IBM's plan to replace thousands of roles with AI presently looks more like outsourcing jobs to India, at the expense of organizational competency. That view of Big Blue was offered to The Register after our report on the IT giant's latest layoffs, which resonated so strongly with several IBM employees that they contacted The Register with thoughts on the job cuts. Our sources have asked not to be identified to protect their ongoing relationships with Big Blue. Suffice to say they were or are employed as senior technologists in business units that span multiple locations and were privy to company communications: These are not views from the narrow entrance to a single cubicle. We're going to refer to three by the pseudonyms Alex, Blake, and Casey. \n\n\"I always make this joke about IBM,\" said Alex. \"It is: 'IBM doesn't want people to work for them.' Every six months or so they are doing rounds of [Resource Actions -- IBM-speak for layoffs] or forcing ", "id": 1213902, "language": null, "link": "https://slashdot.org/story/24/09/25/1935231/as-ibm-pushes-for-more-automation-its-ai-simply-not-up-to-the-job-of-replacing-staff?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "As IBM Pushes For More Automation, Its AI Simply Not Up To the Job of Replacing Staff", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-26T00:18:57.174807+00:00", "description": "Winamp, the iconic media player from the late 1990s, has released its complete source code on GitHub, fulfilling a promise made in May. The move aims to modernize the player by inviting developers to collaborate on the project. \n\nThe source code release includes build tools and associated libraries for the Windows app, allowing developers to provide bug fixes and new features. However, the license prohibits distribution of modified software created from this code.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Winamp+Releases+Source+Code%2C+Asks+For+Help+Modernizing+the+Player%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F09%2F25%2F1854228%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F09%2F25%2F1854228%2Fwinamp-releases-source-code-asks-for-hel", "id": 1213901, "language": null, "link": "https://it.slashdot.org/story/24/09/25/1854228/winamp-releases-source-code-asks-for-help-modernizing-the-player?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Winamp Releases Source Code, Asks For Help Modernizing the Player", "vote": 0}]