[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-25T14:30:11+00:00", "description": "Black Myth: Wukong is a game that sparks conversation for a multitude of reasons, and that remains true even as you zoom into the moment-to-moment gameplay experience that it has on offer. \n\nThough uneven in some specific areas (such as, say, performance), Black Myth: Wukong has no shortage of things to be impressed by, from its gorgeous visuals and impeccable production values to, of course, its incredible combat. \n\nThe latter, in fact, is the area where it shines the brightest, without a shadow of doubt. That is exactly what we’ll be talking about here, as we discuss some of the biggest strengths that contribute to making Black Myth’s combat as memorable as it is- from boss fights to the progression mechanics and more.", "id": 1056153, "language": null, "link": "https://www.youtube.com/watch?v=SiHr4INnXto", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/SiHr4INnXto/hqdefault.jpg", "title": "Black Myth: Wukong Is DESTROYING Its Competition With Its Stunning Combat", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-08-25T06:30:12+00:00", "description": "If it had launched before Overwatch 2, Firewalk Studios' Concord may have served as a decent alternative in the hero shooter genre. Unfortunately, it's available in 2024 and demands $40, while other competitive multiplayer options are free-to-play.\n\nIt wouldn't be that big of a deal if Concord's gameplay offered something unique and compelling, be it in the Freegunners and their kits, the modes, or the progression. Instead, it opts to play things relatively safe, leaning into mostly generic hero abilities while introducing Crew Bonuses for character-switching (though you don't have to).\n\nThis is on top of lore revealed through the Galactic Guide and weekly vignettes meant to endear its characters to players, but it just doesn't resonate enough with what Concord is going for. Even if it eventually went free-to-play, Concord's gameplay systems, characters and content have a way to go from simply average to genuinely enticing.", "id": 1056154, "language": null, "link": "https://www.youtube.com/watch?v=Mp_AmK8FDu0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/Mp_AmK8FDu0/hqdefault.jpg", "title": "Concord Review - The Final Verdict", "user": null, "vote": 0}]