[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T17:30:02+00:00", "description": "Diablo 4 has been out for over a year and was less than endearing at launch. However, Blizzard listened to feedback and set about improving its systems, from crafting and loot to combat. We've now finally arrived at Vessel of Hatred, its first paid expansion.\n\nThe premise starts well enough as players unwittingly venture to a new region, Nahantu, to find Neyrelle. While the characters seem promising, they ultimately feel one-note. The plot culminates in some inane twists and a disappointing ending that's more of a \"to be continued.\"  You'd think that would be the end of it.\n\nHowever, Vessel of Hatred offers a compelling post-game with Kurast Undercity and the new Dark Citadel. It also expands on the base game's combat systems with Runewords and the Mercenaries, while the Spiritborn class feels great. While it's not the best that Blizzard has offered, the expansion solidifies an already strong base.", "id": 1313583, "language": null, "link": "https://www.youtube.com/watch?v=IQBAa7NwQu8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/IQBAa7NwQu8/hqdefault.jpg", "title": "Diablo 4: Vessel of Hatred Review - The Final Verdict", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T15:30:16+00:00", "description": "Spike Chunsoft's Dragon Ball: Sparking! ZERO has done exceptionally well, at least in terms of acclaim. It's received positive reviews from critics, while its peak concurrent player count on Steam has beaten out some top-tier fighting games. The latter also has a \"Very Positive\" rating, with 94 percent of its +16,000 user reviews positive.\n\nNevertheless, there are some problems, mostly centering around Episode Battle. The new story mode starts from the Raditz Saga and ends with the Tournament of Power. Other characters don't get nearly as much coverage, and that's not even getting into some important fights that are straight-up missing.\n\nEpisode Battle also has other issues, from some slideshow cutscenes to the lack of voiceover narration. Then you have Custom Battle, which has a way to go in UI quality-of-life features. What other things do players dislike about the title? Find out here.", "id": 1313154, "language": null, "link": "https://www.youtube.com/watch?v=v7i6Isx7T94", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/v7i6Isx7T94/hqdefault.jpg", "title": "Dragon Ball: Sparking! ZERO - 10 Things HARDCORE Fans Hate About It", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T13:30:11+00:00", "description": "Silent Hill 2 is a known quantity, to say the very least, which means it being as scary and atmospheric as it is shouldn't come as a surprise, but though a lot of the game's scares obviously come from things that were a big part of the experience in the original as well, the remake does do quite a bit to elevate those strengths in a multitude of different ways. \n\nPeople often underestimate how important it can be for a horror game to be able to make players feel on edge in a variety of ways, and Silent Hill 2 certainly knows how to keep things from getting monotonous on that front.", "id": 1312546, "language": null, "link": "https://www.youtube.com/watch?v=JI5sI1Jrws0", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 129, "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/JI5sI1Jrws0/hqdefault.jpg", "title": "Silent Hill 2 Remake Is One of the Most Unsettling Games I've Played In Years", "vote": 0}]