[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T23:41:10.152869+00:00", "description": "After nearly 30 years of covering Kamala Harris, the San Francisco Chronicle is now letting ChatGPT do it. Sort of... \n\n\"We're introducing a new way to engage with our decades of coverage: an AI-powered tool designed to answer your questions about Harris' life, her journey through public service and her presidential campaign,\" they announced this week:\n\nDrawing from thousands of articles written, edited and published by Chronicle journalists since 1995, this tool aims to give readers informed answers about a politician who rose from the East Bay and is now campaigning to become one of the world's most powerful people. \n\nWhy don't we have a similar tool for Donald Trump, the Republican nominee for president? The answer isn't political. It's because we've been covering Harris since her career began in the Bay Area and have an archive of vetted articles to draw from. Our newsroom can't offer the same level of expertise when it comes to the former president. \n\nThe tool's answers are \"draw", "id": 1314359, "language": null, "link": "https://politics.slashdot.org/story/24/10/12/1823237/california-newspaper-creates-ai-powered-news-assistant-for-kamala-harris-info?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "California Newspaper Creates AI-Powered 'News Assistant' for Kamala Harris Info", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T22:35:09.093431+00:00", "description": "wiredmikey writes: As the dust settles following the massive Windows BSOD tech outages caused by CrowdStrike in July 2024, the question is now, how do we prevent this happening again? While there was no current way Microsoft could have prevented this incident, the OS firm is obviously keen to prevent anything similar happening in the future. SecurityWeek talked to David Weston, VP enterprise and OS security at Microsoft, to discuss Windows kernel access and safe deployment practices (or SDP). \n\n Former Ukranian officer Serhii \"Flash\" Beskrestnov created a Signal channel where military communications specialists could talk with civilian radio experts, reports MIT's Technology Review. But radio communications are crucial for drones, so...\n\nAbout once a month, he drives hundreds of kilometers east in a homemade mobile intelligence center: a black VW van in which stacks of radio hardware connect to an array of antennas on the roof that stand like porcupine quills when in use. Two small de", "id": 1314237, "language": null, "link": "https://it.slashdot.org/story/24/10/12/1943206/microsofts-take-on-kernel-access-and-safe-deployment-after-crowdstrike-incident?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft's Take On Kernel Access and Safe Deployment After CrowdStrike Incident", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T21:27:35.159340+00:00", "description": "In mid-2021 Ameria's National Security Advisor set up a new directorate focused on \"advanced chips, quantum computing, and other cutting-edge tech,\" reports Wired. And the next year as Congress was working on boosting America's semiconductor sector, he was \"closing in on a plan to cripple China's... In October 2022, the Commerce Department forged ahead with its new export controls.\" \nSo what happened next?\n\nIn a phone call with President Biden this past spring, Xi Jinping warned that if the US continued trying to stall China's technological development, he would not \"sit back and watch.\" And he hasn't. Already, China has answered the US export controls &mdash; and its corresponding deals with other countries &mdash; by imposing its own restrictions on critical minerals used to make semiconductors and by hoovering up older chips and manufacturing equipment it is still allowed to buy. For the past several quarters, in fact, China was the top customer for ASML and a number of Japanese ch", "id": 1314090, "language": null, "link": "https://hardware.slashdot.org/story/24/10/12/1755254/whos-winning-americas-tech-war-with-china?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Who's Winning America's 'Tech War' With China?", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T20:23:53.603330+00:00", "description": " Former Ukranian officer Serhii \"Flash\" Beskrestnov created a Signal channel where military communications specialists could talk with civilian radio experts, reports MIT's Technology Review. But radio communications are crucial for drones, so...\n\nAbout once a month, he drives hundreds of kilometers east in a homemade mobile intelligence center: a black VW van in which stacks of radio hardware connect to an array of antennas on the roof that stand like porcupine quills when in use. Two small devices on the dash monitor for nearby drones. Over several days at a time, Flash studies the skies for Russian radio transmissions and tries to learn about the problems facing troops in the fields and in the trenches. \nHe is, at least in an unofficial capacity, a spy. But unlike other spies, Flash does not keep his work secret. In fact, he shares the results of these missions with more than 127,000 followers &mdash; including many soldiers and government officials &mdash; on several public social", "id": 1313902, "language": null, "link": "https://tech.slashdot.org/story/24/10/12/190222/the-radio-obsessed-civilian-shaping-ukraines-drone-defense?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Radio-Obsessed Civilian Shaping Ukraine's Drone Defense", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T19:19:35.265810+00:00", "description": "Many U.S. states now require candidates to disclose when political ads used generative AI, reports the Washington Post. \n\n\nUnfortunately, researchers at New York University's Center on Technology Policy \"found that people rated candidates 'less trustworthy and less appealing' when their ads featured AI disclaimers...\"\n\nIn the study, researchers asked more than 1,000 participants to watch political ads by fictional candidates &mdash; some containing AI disclaimers, some not &mdash; and then rate how trustworthy they found the would-be officeholders, how likely they were to vote for them and how truthful their ads were. Ads containing AI labels largely hurt candidates across the board, with the pattern holding true for \"both deceptive and more harmless uses of generative AI,\" the researchers wrote. Notably, researchers also found that AI labels were more harmful for candidates running attack ads than those being attacked, something they called the \"backfire effect\". \n\n\"The candidate who", "id": 1313773, "language": null, "link": "https://politics.slashdot.org/story/24/10/12/0445226/ai-disclaimers-in-political-ads-backfire-on-candidates-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "AI Disclaimers in Political Ads Backfire on Candidates, Study Finds", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T18:01:43.315290+00:00", "description": "Formed in 2021 by cybersecurity professionals (and backed by high-powered VCs including Dell Technologies Capital), Halcyon sells an enterprise-grade anti-ransomware platform. \n\nAnd this month they announced they're offering protection against ransomware attacks targeting Linux systems, according to Linux magazine:\n\n According to Cynet, Linux ransomware attacks increased by 75 percent in 2023 and are expected to continue to climb as more bad actors target Linux deployments... \"While Windows is the favorite for desktops, Linux dominates the market for supercomputers and servers.\" \n\nHere's how Halcyon's announcement made their pitch:\n\n\"When it comes to ransomware protection, organizations typically prioritize securing Windows environments because that's where the ransomware operators were focusing most of their attacks. However, Linux-based systems are at the core of most any organization's infrastructure, and protecting these systems is often an afterthought,\" said Jon Miller, CEO &amp", "id": 1313536, "language": null, "link": "https://it.slashdot.org/story/24/10/12/0555205/halcyon-announces-anti-ransomware-protection-for-enterprise-linux-environments?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Halcyon Announces Anti-Ransomware Protection for Enterprise Linux Environments", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T16:56:32.425736+00:00", "description": "Amazon is \"embedding pharmacies in same-day delivery facilities often clustered around major metro areas,\" reports CNBC. \n\n\nThis will enable \"a coming expansion of its same-day prescription delivery service,\" according to Engadget, \"with 20 more cities and affiliated metro areas entering the program next year. This expansion will open up the feature to nearly half of US residents.\" \n\n\n\n\"In most cases, that means a customer can order medication by 4 p.m. and receive it at home by 10 p.m.,\" Amazon said in their announcement &mdash; making the case that their service (and its 24/7 pharmacists) \"ensures customers can get care within hours, bridging health care accessibility divides...\"\n\nA recent study found nearly half of U.S. counties have communities over 10 miles from the nearest pharmacy, limiting their access to medications and pharmacist care. Traditional mail-order prescriptions can take up to 10 days to arrive, leaving many underserved... As of 2019, seven in 10 hospitals relied o", "id": 1313309, "language": null, "link": "https://slashdot.org/story/24/10/12/0410203/amazon-expands-same-day-prescription-delivery-to-nearly-half-the-us-next-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Expands Same-Day Prescription Delivery to Nearly Half the US Next Year", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T15:51:49.411520+00:00", "description": "This week (MIT-licensed) WebAssembly runtime Wasmer announced \"a major milestone in making any software run with WebAssembly.\" \n\nThe announcement's headline? Running Clang in the browser using WebAssembly...\n\nThanks to the newest release of Wasmer (4.4) and the Wasmer JS SDK (0.8.0) you can now run [compiler front-end] clang anywhere Wasmer runs! This allows compiling C programs from virtually anywhere. Including Javascript and your preferred browser! (we tested Chrome, Safari and Firefox and everything is working like a charm)... \n\n- You can compile C code to WebAssembly easily just using the Wasmer CLI: no toolchains or complex installations needed, install Wasmer and you are ready to go...! \n\n- You can compile C projects directly from JavaScript...! \n\n- We expect online IDEs to start adopting the SDK to allow their users compile and run C programs in the browser.... \n\n\n\nDo you want to use clang in your Javascript project? Thanks to our newly released Wasmer JS SDK you can do it eas", "id": 1313100, "language": null, "link": "https://developers.slashdot.org/story/24/10/12/0519256/running-clang-in-the-browser-using-webassembly?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "'Running Clang in the Browser Using WebAssembly'", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T14:50:23.814505+00:00", "description": "\"Boeing said Friday it will cull 10 percent of its workforce &mdash; roughly 17,000 jobs,\" reports the Washington Post, \"as the aviation giant grapples with mounting losses and manufacturing disruptions amid a machinists strike that has dragged into a fifth week.\"\n\nExecutives, managers and production employees will be affected by the cuts, chief executive Kelly Ortberg informed employees Friday in a memo. Boeing will also delay the launch of its 777X plane until 2026 due to ongoing challenges, Ortberg wrote... The layoffs add to the pain at Boeing, where a stalemate between the company's largest employee union dovetails with ongoing legal troubles and safety woes. The strike has halted production of some of the company's best-selling jets, further adding to its financial troubles. In the past five years, Boeing has lost more than $25 billion... \n\n\"Our business is in a difficult position, and it is hard to overstate the challenges we face together,\" Ortberg said in the memo. \"The state", "id": 1312790, "language": null, "link": "https://tech.slashdot.org/story/24/10/12/0311232/boeing-plans-to-cut-17000-jobs---10-of-its-workforce?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Boeing Plans to Cut 17,000 Jobs - 10% of Its Workforce", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T12:27:05.334396+00:00", "description": "The PC market is not showing many signs of a rebound, despite the hype around AI PCs, with market watchers split over whether unit shipments are up or down slightly. From a report: Those magical AI PC boxes were supposed to fire up buyer enthusiasm and spur the somewhat listless market for desktop and laptop systems into significant growth territory, but that doesn't appear to be happening. According to the latest figures from Gartner, global PC shipments totaled 62.9 million units during Q3 of this year, representing a 1.3 percent decline compared with the same period last year. However, this does follow three consecutive quarters of modest growth. \n\n\"Even with a full line-up of Windows-based AI PCs for both Arm and x86 in the third quarter of 2024, AI PCs did not boost the demand for PCs since buyers have yet to see their clear benefits or business value,\" commented Gartner Director Analyst Mikako Kitagawa. This is perhaps understandable when AI PCs are largely just a marketing conc", "id": 1312192, "language": null, "link": "https://hardware.slashdot.org/story/24/10/12/0311250/pc-shipments-stuck-in-neutral-despite-ai-buzz?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "PC Shipments Stuck in Neutral Despite AI Buzz", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T10:02:16.614977+00:00", "description": "Imgur announced changes to its content moderation policies, no longer classifying memes with adult humor as mature. Going forward, only memes with sexualized or lewd content will receive the mature tag. The Verge reports: Imgur is making the changes after it collected feedback about its content moderation over the course of this year, including that its policies, \"especially surrounding mature content, feel inconsistently applied, too subjective, or just rather confusing as a whole,\" according to a post from Imgur product manager Martyn O'Neill. Now, mature content consists \"solely of sexualized or 'lewd'\" content.\n \nFollowing the adjustments, O'Neill says that \"warnings / post removals\" are down nearly 35 percent month over month. Far fewer posts are being marked as mature as well; that stat has declined by almost 50 percent.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Imgur+Is+No+Longer+Classifying+Memes+With+A", "id": 1311654, "language": null, "link": "https://entertainment.slashdot.org/story/24/10/11/2226243/imgur-is-no-longer-classifying-memes-with-adult-humor-as-mature?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Imgur Is No Longer Classifying Memes With Adult Humor As Mature", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T07:42:11.430911+00:00", "description": "NASA confirmed that it's working with international partners and standards organizations to create a Coordinated Lunar Time (LTC) for future lunar exploration. This time standard will account for relativity and be scalable for other celestial bodies, supporting long-term missions like Artemis and commercial space activities. From the report: The lunar time will be determined by a weighted average of atomic clocks at the Moon, similar to how scientists calculate Earth's globally recognized Coordinated Universal Time (UTC). Exactly where at the Moon is still to be determined, since current analysis indicates that atomic clocks placed at the Moon's surface will appear to 'tick' faster by microseconds per day. A microsecond is one millionth of a second. NASA and its partners are currently researching which mathematical models will be best for establishing a lunar time.\n \nTo put these numbers into perspective, a hummingbird's wings flap about 50 times per second. Each flap is about .02 sec", "id": 1311287, "language": null, "link": "https://science.slashdot.org/story/24/10/11/2234258/nasa-confirms-plans-to-develop-lunar-time-standard?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA Confirms Plans To Develop Lunar Time Standard", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T05:50:40.687650+00:00", "description": "Eli Lilly and Novo Nordisk are leading efforts to curb the sale of compounded GLP-1 medications. Lilly has issued hundreds of cease-and-desist letters to entities selling compounded tirzepatide, following the end of its FDA-declared shortage. Novo Nordisk, whose semaglutide drugs remain in shortage, is taking a different approach. The company published a peer-reviewed study in Pharmaceutical Research, highlighting quality concerns in compounded semaglutide samples, including lower-than-claimed strength and banned ingredients. These actions signal a broader industry pushback against compounders who entered the market during drug shortages. Wired adds: With mounting evidence that GLP-1s like tirzepatide are an effective treatment for other ailments beyond obesity and diabetes -- including addiction and Parkinson's disease -- demand is only expected to increase. It remains to be seen whether the pharmaceutical companies will be able to keep pace with the demand or if the meds will go bac", "id": 1311085, "language": null, "link": "https://science.slashdot.org/story/24/10/12/0320240/the-crackdown-on-compounded-glp-1-meds-has-begun?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "The Crackdown on Compounded GLP-1 Meds Has Begun", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T03:40:46.021457+00:00", "description": "An anonymous reader quotes a report from ScienceAlert: Imagine three people huddled in a circle so when one speaks, only one other hears. Scientists have created a device that works like that, ensuring sound waves ripple in one direction only. The device, developed by scientists at ETH Zurich and the Swiss Federal Institute of Technology Lausanne, is made up of a disk-shaped cavity with three equally-spaced ports that can each send or receive sound. In an inactive state, sound transmitted from port 1 is audible to ports 2 and 3 at equal volumes. Sound waves bounce back to port 1 as an echo as well. When the system is running, however, only port 2 hears port 1's sounds.\n \nThe trick is to blow swirling air into the cavity at a specific speed and intensity, which allows the sound waves to synchronize in a repeating pattern. That not only guides the sound waves in a single direction, but gives more energy to those oscillations so they don't dissipate. It's kind of like a roundabout for so", "id": 1310844, "language": null, "link": "https://science.slashdot.org/story/24/10/11/2230246/physicists-generated-sound-waves-that-travel-in-one-direction-only?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Physicists Generated Sound Waves That Travel In One Direction Only", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T00:26:29.518676+00:00", "description": "The Fifth Circuit Court of Appeals has affirmed a copyright infringement verdict against Internet provider Grande, which failed to take action against allegedly pirating subscribers. The jury's $47 million damages award in favor of the major music label plaintiffs is vacated. According to the Court (PDF), individual tracks that are part of an album, should not be counted as separate works. TorrentFreak reports: After hearing both sides, the Fifth Circuit Court of Appeals affirmed the jury verdict yesterday. Grande's arguments, suggesting that the district court mistakenly upheld the verdict earlier, were rejected. \"The district court did not err in upholding the jury's unanimous liability verdict because Plaintiffs satisfied each element legally and factually,\" the decision reads. \"The court correctly interpreted the law and instructed the jury on the relevant legal standards in light of the factual issues disputed by the parties, and Plaintiffs introduced ample evidence from which a ", "id": 1310437, "language": null, "link": "https://yro.slashdot.org/story/24/10/11/2054240/appeal-court-affirms-verdict-against-isp-grande-for-failing-to-terminate-pirates?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Appeal Court Affirms Verdict Against ISP Grande For Failing To Terminate Pirates", "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-10-12T00:26:29.290180+00:00", "description": "Bluesky, the decentralized social network cofounded by Jack Dorsey, created a Threads account to court users frustrated by Meta's moderation issues. Thurrott reports: This week, the Bluesky team also used Threads to share some tips on how to get started on Bluesky, how to get more engagement, and more. The company also emphasized its decentralized structure and more extensive customization options, with the app recently introducing a new theme font, adjustable font sizing, and the ability to pin posts on top of profiles.\n \nBluesky also couldn't resist to engage in some strange trolling this week. \"We're not like the other girls ... we're not owned by a billionaire,\" the team wrote on Threads yesterday. Of course, this the post that got the most engagement on the Bluesky Threads account with close to 500 comments as of this writing.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bluesky+Is+Now+Courting+Threads+Users%", "id": 1310436, "language": null, "link": "https://tech.slashdot.org/story/24/10/11/2221242/bluesky-is-now-courting-threads-users?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source__id": 306, "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain", "status_code": 0, "tags": [], "thumbnail": null, "title": "Bluesky Is Now Courting Threads Users", "vote": 0}]