[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T23:28:15.874354+00:00", "description": "An anonymous reader shares a report: While the latest update to Windows 11 makes it look like the upcoming Recall feature can be easily removed by users, Microsoft tells us it's just a bug and a fix is coming. Deskmodder spotted the change last week in the latest 24H2 version of Windows 11, with KB5041865 seemingly delivering the ability to uninstall Recall from the Windows Features section. \"We are aware of an issue where Recall is incorrectly listed as an option under the 'Turn Windows features on or off' dialog in Control Panel,\" says Windows senior product manager Brandon LeBlanc in a statement to The Verge. \"This will be fixed in an upcoming update.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Says+Its+Recall+Uninstall+Option+in+Windows+11+is+Just+a+Bug%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F09%2F02%2F2241242%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd", "id": 1071185, "language": null, "link": "https://it.slashdot.org/story/24/09/02/2241242/microsoft-says-its-recall-uninstall-option-in-windows-11-is-just-a-bug?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Says Its Recall Uninstall Option in Windows 11 is Just a Bug", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T20:55:08.764467+00:00", "description": "A former executive of smartphone startup OSOM Products has filed a lawsuit alleging the company's founder misused funds for personal expenses, including two Lamborghinis and a lavish lifestyle. Mary Ross, OSOM's ex-Chief Privacy Officer, is seeking access to company records in a Delaware court filing. \n\nOSOM, founded in 2020 by former Essential employees, launched two products: the Solana-backed Saga smartphone and a privacy cable. Android founder Andy Rubin founded Essential, which sought to compete with Apple and Android-makers on a smartphone, but later shutdown after not find many takers for its phone. The lawsuit claims OSOM founder Jason Keats used company money for racing hobbies, first-class travel, and mortgage payments.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=OSOM%2C+the+Company+Formed+From+Essential's+Ashes%2C+is+Apparently+in+Shambles%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F09%2F02%2F1910237%", "id": 1070721, "language": null, "link": "https://slashdot.org/story/24/09/02/1910237/osom-the-company-formed-from-essentials-ashes-is-apparently-in-shambles?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OSOM, the Company Formed From Essential's Ashes, is Apparently in Shambles", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T19:37:53.162419+00:00", "description": "Efforts to add Rust code to the Linux kernel has suffered a setback as one of the maintainers of the Rust for Linux project has stepped down -- citing frustration with \"nontechnical nonsense.\" The Register: Wedson Almeida Filho, a software engineer at Microsoft who has overseen the Rust for Linux project, announced his resignation in a message to the Linux kernel development mailing list. \"I am retiring from the project,\" Filho declared. \"After almost four years, I find myself lacking the energy and enthusiasm I once had to respond to some of the nontechnical nonsense, so it's best to leave it up to those who still have it in them.\" \n\n[...] Memory safety bugs are regularly cited as the major source of serious software vulnerabilities by organizations overseeing large projects written in C and C++. So in recent years there's been a concerted push from large developers like Microsoft and Google, and well as from government entities like the US Cybersecurity and Infrastructure Security A", "id": 1070415, "language": null, "link": "https://linux.slashdot.org/story/24/09/02/194205/rust-for-linux-maintainer-steps-down-in-frustration-with-nontechnical-nonsense?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Rust for Linux Maintainer Steps Down in Frustration With 'Nontechnical Nonsense'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T18:20:48.404425+00:00", "description": "Google executive James Manyika has warned that AI's impact on productivity is not guaranteed [Editor's note: the link may be paywalled], despite predictions of trillion-dollar economic potential. From the report: \"Right now, everyone from my old colleagues at McKinsey Global Institute to Goldman Sachs are putting out these extraordinary economic potential numbers -- in the trillions -- [but] it's going to take a whole bunch of actions, innovations, investments, even enabling policy ...The productivity gains are not guaranteed. They're going to take a lot of work.\" In 1987 economist Robert Solow remarked that the computer age was visible everywhere except in the productivity statistics. \"We could have a version of that -- where we see this technology everywhere, on our phones, in all these chatbots, but it's done nothing to transform the economy in that real fundamental way.\" \n\nThe use of generative AI to draft software code is not enough. \"In the US, the tech sector is about 4 per cen", "id": 1070022, "language": null, "link": "https://tech.slashdot.org/story/24/09/02/1633202/googles-james-manyika-the-productivity-gains-from-ai-are-not-guaranteed?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's James Manyika: 'The Productivity Gains From AI Are Not Guaranteed'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T18:20:48.312382+00:00", "description": "Notorious for a hardworking culture, Japan launched an initiative to help people cut back. But three years into the effort, the country is having a hard time coaxing people to take a four-day workweek. From a report: Japanese lawmakers first proposed a shorter work week in 2021. The guidelines aimed to encourage staff retention and cut the number of workers falling ill or dying from overwork in an economy already suffering from a huge labor shortage. The guidelines also included overtime limits and paid annual leave. However, the initiative has had a slow start: According to the Ministry of Health, Labor, and Welfare, only about 8% of companies in Japan allow employees to take three or more days off a week. \n\nIt's not just companies -- employees are hesitant, too. Electronics manufacturer Panasonic, one of Japan's largest companies, opted into the effort in early 2022. Over two years in, only 150 of its 63,000 eligible employees have chosen to take up four-day schedules, a representat", "id": 1070021, "language": null, "link": "https://slashdot.org/story/24/09/02/1810207/japan-struggles-to-popularize-a-four-day-workweek?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Japan Struggles To Popularize a Four-Day Workweek", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T15:43:54.073912+00:00", "description": "Microsoft's Windows 11 operating system has surpassed Windows 10 usage for Steam users for the first time since its launch in 2021. From a report: Windows 10 has been holding strong in recent years, despite Microsoft's plans to end support for Windows 10 in October 2025. There are now signs that Windows 11 adoption is finally heading in the right direction for Microsoft. Steam hardware survey data for August puts Windows 11 usage at 49 percent, an increase of more than 3 percent over the previous figure in July of nearly 46 percent. Windows 10 usage has dipped by around 3 percent to 47 percent, while macOS and Linux Steam usage has largely remained the same during August.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Windows+11+is+Now+the+Most+Popular+OS+For+PC+Gaming%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F09%2F02%2F1510212%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd", "id": 1069200, "language": null, "link": "https://tech.slashdot.org/story/24/09/02/1510212/windows-11-is-now-the-most-popular-os-for-pc-gaming?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Windows 11 is Now the Most Popular OS For PC Gaming", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T15:43:53.830439+00:00", "description": "schwit1 shares a report: If you are reading this and live in America, or used to live in America, or maybe just went to America one time many years ago, then you are almost certainly performing unpaid labor for the U.S. government and have been for years. How? By storing some of the billions of pennies the U.S. Mint makes every year that virtually no one uses. \n\nWhy are we still making tons (many thousands of tons) of pennies if no one uses them? That's a sensible question with a psychotic answer: We have to keep making all these pennies -- over $45 million worth last year -- because no one uses them. In fact, it could be very bad if we did. \n\nWhen you insert a quarter into a soda machine, that quarter eventually finds its way back to a bank, from which it can be redistributed to a store's cash register and handed out as change -- maybe even to you, who can put it into a soda machine again and start the whole process over. That's beautiful. (Please be mindful of your soft drink consum", "id": 1069199, "language": null, "link": "https://news.slashdot.org/story/24/09/02/1539211/abolish-the-penny?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Abolish the Penny?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T14:29:19.670713+00:00", "description": "An anonymous reader shares a report: Intel CEO Pat Gelsinger and key executives are expected to present a plan later this month to the company's board of directors to slice off unnecessary businesses and revamp capital spending, according to a source familiar with the matter, as they try to revive the once-dominant chipmaker's fortunes. The plan will include ideas on how to shave overall costs by selling businesses, including its programmable chip unit Altera, that Intel can no longer afford to fund from the company's once-sizeable profit. \n\nGelsinger and other high-ranking executives at Intel are expected to present the plan at a mid-September board meeting, the same source said. The proposal does not yet include plans to split Intel and sell off its contract manufacturing operation, or foundry, to a buyer such as Taiwan Semiconductor Manufacturing Co., according to the source and another person familiar with the matter.\nThe presentation, including the plans around its manufacturing ", "id": 1068696, "language": null, "link": "https://slashdot.org/story/24/09/02/1353217/intel-ceo-to-pitch-board-on-plans-to-shed-assets-cut-costs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Intel CEO To Pitch Board on Plans To Shed Assets, Cut Costs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T12:04:19.476638+00:00", "description": "\"Let's get one thing out of the way,\" writes the Verge's transportation editor. Contrary to what you may have heard about U.S. sales of electric vehicles &mdash; sales are up.\n\n[Consumer insights company] JD Power is projecting that 1.2 million EVs will be sold in the US by the end of 2024, an increase over 1 million sold last year. That's 9 percent of total vehicles sold, which has been revised down from a previous prediction of 12 percent... Overall, an additional 35,000 battery-electric vehicles were sold in the first seven months of 2024 as compared to last year, JD Power says. \n\nThat includes hybrids and PHEVs, which I think gets at the root of the problem. Those who were expecting an even swap &mdash; battery-electric for internal combustion &mdash; didn't anticipate the popularity of hybrids in the market. If anything, hybrids are cannibalizing EV sales, giving the pure-battery electric vehicles more competition than anticipated. But in retrospect, it makes sense. What better r", "id": 1067646, "language": null, "link": "https://tech.slashdot.org/story/24/09/02/0237206/whats-holding-back-americas-move-to-electric-cars?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "What's Holding Back America's Move to Electric Cars?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T08:19:24.249690+00:00", "description": "\"Houston resident Brandy Deason put an Apple AirTag in her recycling to see where her plastic trash was going,\" writes Tom's Hardware. \n\n\"While many might expect the city would drop the recyclables off at a recycling center, Deason instead found her trash sitting in an open-air lot alongside millions of other pieces of trash at Wright Waste Management.\"\n\nWright Waste Management did not allow CBS News to enter and inspect its premises. Still, the news team's drone camera discovered that all the trash picked up from the Houston Recycling Collaboration (HRC) was apparently just sitting there on its premises, stacked more than 10 feet high. This came as a shock, as the HRC was meant to revolutionize the city's recycling program, allowing it to process all kinds of plastic. Instead, we see all the collected waste sitting idle in open-air lots waiting for the right technology to appear. \n\nThat's because [Exxon-funded] Cyclix International, one of the partners in the HRC, has yet to open its", "id": 1066670, "language": null, "link": "https://news.slashdot.org/story/24/09/02/0423221/apple-airtags-track-recycled-plastic-to-unprocessed-piles-in-an-open-air-lot?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple AirTags Track 'Recycled' Plastic to Unprocessed Piles in an Open-Air Lot", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T06:09:27.204077+00:00", "description": "Slashdot covered shrinkwrap licenses on software back in 2000 and 2002. But now ewhac (Slashdot reader #5,844) writes:\n\n\nThe user Wraithe on the Mastodon network is reporting that a bottle of Vital Proteins(TM) collagen peptides purchased at Costco came with a shrinkwrap contract. Collagen peptides are often used as an anti-aging nutritional supplement. The top of the Vital Proteins bottle has a pull-to-open seal. Printed on the seal is the following: \"Read This: By opening and using this product, you agree to be bound by our Terms and Conditions, fully set forth at vitalproteins.com/tc, which includes a mandatory arbitration agreement. If you do not agree to be bound, please return this product immediately.\"\n\n So-called \"shrinkwrap contracts\" have been the subject of controversy and derision for decades since their first widespread appearance in the 1970's, attempting to alter the terms of sale after the fact, impose unethical and onerous restrictions on the purchaser, and absolving ", "id": 1066275, "language": null, "link": "https://yro.slashdot.org/story/24/09/02/038254/shrinkwrap-contract-found-at-costco-on-collagen-peptides?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Shrinkwrap 'Contract' Found At Costco On... Collagen Peptides", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T02:54:33.339970+00:00", "description": "1.9 million solar panels began operating this year in California &mdash; at a Mortenson facility with 120,000 installed batteries that give it a storage capacity of 3,280 megawatts. An article in El Pais notes that this helped California pass 10,000 megawatts of photovoltaic storage in April &mdash; enough to meet 20% of demand &mdash; for the first time ever. (In 2019, the state had just 770 megawatts of storage capacity.) \n\nMark Rothleder, the vice president of the independent grid operator, California ISO (CAISO), said earlier this year that they will add another 1,134 megawatts in the first eight months of 2024. This is growth on top of the leap made last year. \"In 2023 alone, the ISO successfully onboarded 5,660 megawatts of new power to the grid,\" Rothleder said at a conference in San Diego... \n\nRenewable production was enough to supply the grid on 40 out of 48 days this spring, compared to seven days in the whole of last year. Lithium batteries appear to be undercutting the use", "id": 1065824, "language": null, "link": "https://hardware.slashdot.org/story/24/09/02/0117259/green-energy-from-storage-batteries-are-replacing-fossil-fuels-in-california---and-texas?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Green Energy from Storage Batteries are Replacing Fossil Fuels in California - and Texas", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T00:40:31.855801+00:00", "description": "Pundits aggregate results from multiple pollsters to minimize biases. So ZDNet tried the same approach, but aggregating rankings for the popularity of 19 top programming languages. Senior contributing editor David Gewirtz combined results from nine popularity rankings, including PYPL, the Tiobe index, GitHub's Usage 2023 summary report, and several rankings from Stack Overflow and from IEEE Spectrum. \nThe results?\nThe top cluster contains Python, JavaScript, and Java. These are all very representative in the world of AI coding... \nThe next cluster contains the classic C-based languages [C++, C#, C], plus TypeScript (which is a more robust JavaScript variant) and SQL. \nBelow that are languages that were dominant a while ago, the web languages used to build and operate websites [HTML/CSS, PHP, Shell], followed by a range of other languages that are either growing in popularity (R, Dart) or dropping in popularity (Ruby). [Just above Ruby are Go, Rust, Kotlin, and Lua.] \nFinally, at the b", "id": 1065524, "language": null, "link": "https://developers.slashdot.org/story/24/09/02/007200/python-javascript-java-zdnet-calculates-the-most-popular-programming-languages?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 85, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Python, JavaScript, Java: ZDNet Calculates The Most Popular Programming Languages", "user": null, "vote": 0}]