[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T20:30:04+00:00", "description": "When you look at the sandbox genre and the sheer number of survival titles it's received, Pugstorm's Core Keeper may seem innocuous. Nevertheless, it's built a following since early access, and with its 1.0 release, the 2D top-down aesthetic and enjoyable gameplay loop make it worth picking up.\n\nSet in a subterranean world with multiple biomes, hostile Cavelings, and a strange Core at the center, players must survive while crafting better weapons and armor. Hostile bosses must be slain to progress, with the title's responsive combat shining well, but even just exploring the world, discovering what awaits around every corner, and soaking in the atmosphere can be enjoyable.\n\nIt doesn't hurt that there's plenty to do, from base-building, cooking and fishing to farming and even building Go-Karts. Though it invites comparisons to Terraria, Core Keeper is a compelling, addictive sandbox experience.", "id": 1070737, "language": null, "link": "https://www.youtube.com/watch?v=oJ8BiQDoFsM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/oJ8BiQDoFsM/hqdefault.jpg", "title": "Core Keeper Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T16:00:02+00:00", "description": "Star Wars Jedi: Survivor had more than a few technical issues holding it back from hitting its potential when it launched for current-gen machines and PC last year, but now, the action-adventure title is also headed to PS4 and Xbox One. \n\nThere is, of course, some healthy skepticism over how well the game will manage to run and look on the significantly weaker hardware of last-gen machines, given how it ran on their successors, but the fact remains that an excellent game is becoming available to a larger audience soon, and that’s always cause for celebration. \n\nAhead of Star Wars Jedi: Survivor’s upcoming last-gen launch, then, here, we’re going to go over some crucial details that you should know about the game, before talking about some specifics related to its last-gen release.", "id": 1069457, "language": null, "link": "https://www.youtube.com/watch?v=0sQCwKtgsKE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/0sQCwKtgsKE/hqdefault.jpg", "title": "Star Wars Jedi Survivor PS4 And Xbox One - 13 THINGS YOU NEED TO KNOW Before You Buy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-09-02T09:45:00+00:00", "description": "Black Myth: Wukong has garnered praise for many things, from its gorgeous visuals and compelling combat to the detailed environments. However, one element that isn't discussed enough is how easy it is for players to jump into it.\n\nCompared to your average Dark Souls title, Wukong facilitates all kinds of players thanks to an accessible and balanced difficulty from the outset. The first three chapters do an excellent job of easing players into the experience, teaching them all the different techniques and systems while encouraging them to experiment and find their playstyle. The difficulty is a steady curve, with some of the toughest encounters optional.\n\nSo, while there are many things that Black Myth: Wukong can be appreciated for, helping to bring players into the experience without overwhelming them is easily one of its biggest strengths.", "id": 1067083, "language": null, "link": "https://www.youtube.com/watch?v=97UHns2WFOc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/97UHns2WFOc/hqdefault.jpg", "title": "Black Myth: Wukong's Biggest Strength IS NOT WHAT YOU THINK IT IS", "user": null, "vote": 0}]