[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T19:30:03+00:00", "description": "After delivering one of the best games of 2023 in Alan Wake 2, Remedy Entertainment is now back with more new content for the fans of the long awaited survival horror sequel in the form of Night Springs, the first of the game’s two planned post launch expansions. \n\nSplit across three episodes that each tell a “what if?” story centered around a different character, Night Springs is built as a fun, quirky side adventure for fans to dive into, which obviously means that it’s not exactly an essential part of the Alan Wake 2 experience. \n\nBut though it’s not a pivotal piece of the narrative puzzle, its funny writing, unique tone, and action-packed gunplay makes it a ride worth taking nonetheless.", "language": null, "link": "https://www.youtube.com/watch?v=oedJzTPjl60", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/oedJzTPjl60/hqdefault.jpg", "title": "Alan Wake 2: Night Springs DLC Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T15:30:01+00:00", "description": "A decade has passed since the last Dragon Age game released, and it’s been more than half as long since its successor was officially confirmed to be in development. It’s fair to say, then, that the wait for the fourth mainline Dragon Age game has been a long one- though at long last, it looks like it’s finally coming to an end. \n\nEA and BioWare have finally officially unveiled Dragon Age: The Veilguard, and fans’ patience has certainly been rewarded, with a host of promising new details and gameplay footage being shared. From the game’s characters and its new and improved combat mechanics to how it will be structured and more, there’s plenty that we’ve learned about Dragon Age: The Veilguard of late. Here, we talk about all of that and more.", "language": null, "link": "https://www.youtube.com/watch?v=7KvW-kYho3U", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/7KvW-kYho3U/hqdefault.jpg", "title": "Dragon Age: The Veilguard - 15 NEW THINGS YOU MISSED", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T09:45:02+00:00", "description": "As renowned as the Metal Gear Solid series can be, Metal Gear Solid 3: Snake Eater is in a class of its own. The prequel to the entire saga tells the origins of Big Boss and how his journey towards becoming a legendary soldier began. \n\nSo, when Konami announced a remake (developed with Virtuos), there was extensive hype, especially as more details have been revealed. While a release date has yet to be confirmed, Metal Gear Solid Delta: Snake Eater has received new gameplay, highlighting how faithful it remains to the original. \n\nWhile the story, characters and performances aren't changing, several new additions and features make for a more compelling remake. Here are ten new things you need to know, from the control and camera options to the updated battle damage system and how Unreal Engine 5 brings the characters closer to realism.", "language": null, "link": "https://www.youtube.com/watch?v=k09Op7AW8uI", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/k09Op7AW8uI/hqdefault.jpg", "title": "Metal Gear Solid Delta: Snake Eater - 10 NEW Things You NEED TO KNOW", "user": null, "vote": 0}]