[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T23:18:46.150699+00:00", "description": "An anonymous reader quotes a report from Ars Technica: On Wednesday, Stability AI released weights for Stable Diffusion 3 Medium, an AI image-synthesis model that turns text prompts into AI-generated images. Its arrival has been ridiculed online, however, because it generate images of humans in a way that seems like a step backward from other state-of-the-art image-synthesis models like Midjourney or DALL-E 3. As a result, it can churn out wild anatomically incorrect visual abominations with ease. A thread on Reddit, titled, \"Is this release supposed to be a joke? [SD3-2B]\" details the spectacular failures of SD3 Medium at rendering humans, especially human limbs like hands and feet. Another thread titled, \"Why is SD3 so bad at generating girls lying on the grass?\" shows similar issues, but for entire human bodies.\n \nAI image fans are so far blaming the Stable Diffusion 3's anatomy fails on Stability's insistence on filtering out adult content (often called \"NSFW\" content) from the SD", "language": "en-us", "link": "https://slashdot.org/story/24/06/12/2047240/stable-diffusion-3-mangles-human-bodies-due-to-nudity-filters?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Stable Diffusion 3 Mangles Human Bodies Due To Nudity Filters", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T22:13:53.296235+00:00", "description": "The European Union on Wednesday said it would impose higher tariffs on Chinese electric vehicle imports, which it found benefit \"heavily from unfair subsidies\" and pose a \"threat of economic injury\" to EV producers in Europe. CNBC reports: On a preliminary basis, the European Commission, the executive arm of the EU, concluded that the battery-electric vehicles value chain in China \"benefits from unfair subsidization\" and pronounced that it is in the EU's interest to impose \"provisional countervailing duties\" on BEV imports from China. The additional tariffs are the result of an EU probe that began in October. The duties are currently provisional, but will be introduced from July 4 in the event of unfruitful talks with Chinese authorities to reach a resolution, the commission said in a statement. Definitive measures will be placed within four months of the imposition of provisional duties. [...]\n \nThe bloc is imposing a 38.1% tariff on battery-electric vehicle producers who did not coo", "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/12/2014235/eu-announces-higher-tariffs-of-up-to-38-on-chinese-evs?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EU Announces Higher Tariffs of Up To 38% On Chinese EVs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T22:13:51.611407+00:00", "description": "In a new blog post, Adobe said it has updated its terms of service to clarify that it won't train AI on customers' work. The move comes after a week of backlash from users who feared that an update to Adobe's ToS would permit such actions. The clause was included in ToS sent to Creative Cloud Suite users, which claimed that Adobe \"may access, view, or listen to your Content through both automated and manual methods -- using techniques such as machine learning in order to improve our Services and Software and the user experience.\" The Verge reports: The new terms of service are expected to roll out on June 18th and aim to better clarify what Adobe is permitted to do with its customers' work, according to Adobe's president of digital media, David Wadhwani. \"We have never trained generative AI on our customer's content, we have never taken ownership of a customer's work, and we have never allowed access to customer content beyond what's legally required,\" Wadhwani said to The Verge. [...", "language": "en-us", "link": "https://slashdot.org/story/24/06/12/2031210/adobe-says-it-wont-train-ai-on-customers-work-in-overhauled-tos?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Adobe Says It Won't Train AI On Customers' Work In Overhauled ToS", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T21:09:40.968682+00:00", "description": "An anonymous reader shares a report: Google's continued abuse of the Fitbit brand is continuing with the shutdown of the web dashboard;. Fitbit.com used to be both a storefront and a way for users to get a big-screen UI to sift through reams of fitness data. The store closed up shop in April, and now the web dashboard is dying in July. \n\nIn a post on the \"Fitbit Community\" forums, the company said: \"Next month, we&#226;(TM)re consolidating the Fitbit.com dashboard into the Fitbit app. The web browser will no longer offer access to the Fitbit.com dashboard after July 8, 2024.\" That's it. There's no replacement and no new Fitness thing Google is more interested in; web functionality is just being removed. Google, we'll remind you, used to be a web company. Now it's a phone app or nothing. Google did the same thing to its own Google Fit product in 2019, killing off the more powerful website in favor of an app focus.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitte", "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/12/1939226/googles-abuse-of-fitbit-continues-with-web-app-shutdown?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's Abuse of Fitbit Continues With Web App Shutdown", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T21:09:38.910930+00:00", "description": "An anonymous reader quotes a report from The Record: The revelation earlier this year that General Motors had been selling driver behavior patterns to data brokers -- who in turn packaged and resold it to insurers -- has led at least one of two major data brokers to shut down its related product. That data broker, Verisk, disclosed last month that it has stopped accepting data from car makers and no longer sells the information to insurers, according to the organization Privacy4Cars, which received the response after sending the data broker an inquiry.\n \n\"Verisk received driving data from vehicles manufactured by General Motors, Honda, and Hyundai and may have provided a Driving Behavior Data History Report (\"Report\") to insurers upon request, as a service provider to such insurers, that included certain data provided by these manufacturers,\" the Verisk response to Privacy4Cars said. \"Please note that Verisk no longer receives this data from these automakers to generate Reports and al", "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/12/1958229/one-of-two-major-data-brokers-shuts-down-product-related-to-driver-behavior-patterns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "One of Two Major Data Brokers Shuts Down Product Related To Driver Behavior Patterns", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T20:03:52.699243+00:00", "description": "Qualcomm faces potential disruption to its Windows on Arm laptops due to a legal battle with Arm, while MediaTek prepares to enter the market. Qualcomm's exclusivity deal with Microsoft for Copilot+ PCs, based on its Snapdragon SoCs, is set to expire this year. \n\nMediaTek plans to launch its own Windows on Arm chip in late 2024, though it's unclear if it has Microsoft's approval. The legal dispute stems from Qualcomm's acquisition of Nuvia, with Arm claiming Nuvia's licenses are non-transferable without permission. Arm terminated the licenses, requiring Qualcomm to stop using processor designs developed under those agreements. Arm asserts current Copilot+ SoCs descend from Nuvia's chips, potentially subjecting them to an injunction if Arm prevails in court. Qualcomm maintains its existing Arm license rights cover its custom CPUs. Both companies declined to comment on the ongoing legal matter.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Riv", "language": "en-us", "link": "https://it.slashdot.org/story/24/06/12/1933242/rivals-and-legal-action-cast-shadows-over-windows-on-arm-market?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Rivals and Legal Action Cast Shadows Over Windows on Arm Market", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T18:59:00.959052+00:00", "description": "Activision has clarified Call of Duty: Black Ops 6 isn't 309GB after all -- or at least, you can download the core of it for less. From a report: This is despite Xbox's store page for the game stating that Call of Duty: Black Ops 6's install size is a rather chunky 309.85 GB. This made many heads turn, because that seemed excessive. The Call of Duty team has now issued a correction with more detail. Writing on social media platform X, Activision stated the file size currently listed for Black Ops 6 \"does not represent the download size or disk footprint\" for its upcoming Call of Duty game. \n\n\"The sizes as shown include the full installations of Modern Warfare 2, Modern Warfare 3, Warzone and all relevant content packs, including all localised languages combined which is not representative of a typical player install experience,\" it explained, before adding: \"Players will be able to download Black Ops 6 at launch without downloading any other Call of Duty titles or all of the language ", "language": "en-us", "link": "https://games.slashdot.org/story/24/06/12/1810200/call-of-duty-black-ops-6s-enormous-309gb-download-not-representative-of-a-typical-player-install-experience?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Call of Duty: Black Ops 6's Enormous 309GB Download 'Not Representative of a Typical Player Install Experience'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T18:58:59.002173+00:00", "description": "A hacker has gained access to internal tools used by the location tracking company Tile, including one that processes location data requests for law enforcement, and stolen a large amount of customer data, such as their names, physical addresses, email addresses, and phone numbers, 404 Media reports. From the report: The stolen data itself does not include the location of Tile devices, which are small pieces of hardware users attach to their keys or other items to monitor remotely. But it is still a significant breach that shows how tools intended for internal use by company workers can be accessed and then leveraged by hackers to collect sensitive data en masse. It also shows that this type of company, one which tracks peoples' locations, can become a target for hackers. \"Basically I had access to everything,\" the hacker told 404 Media in an online chat. The hacker says they also demanded payment from Tile but did not receive a response. \n\nTile sells various tracking devices which ca", "language": "en-us", "link": "https://it.slashdot.org/story/24/06/12/1825259/hacker-accesses-internal-tile-tool-that-provides-location-data-to-cops?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Hacker Accesses Internal 'Tile' Tool That Provides Location Data To Cops", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T17:53:45.500937+00:00", "description": "An anonymous reader shares a report An unofficial site tracking titles in the Epic Games library may have just leaked a ton of upcoming games, as reported earlier by Wccftech. The site, called EpicDB, was taken offline shortly after it posted information scraped from the Epic Games Store catalog on Monday, but that didn't stop people from scanning the list and posting their findings. You can see the list of games from publishers like Bethesda, Sega, Sony, Square Enix, and others in a series of screenshots posted by a user on a ResetEra forum. While some, like Turok, are easy to spot, others are listed under previously rumored codenames, such as \"Parkside\" or BioShock 4. There are still other titles under codenames we haven't heard about. Some users speculate that \"Momo\" could point to a Final Fantasy 9 remake, while \"Selma\" may be the PC port of Red Dead Redemption 1. The codename \"Utah\" could also hint at the PC version of The Last of Us Part 2, which is rumored to be almost ready to", "language": "en-us", "link": "https://games.slashdot.org/story/24/06/12/1649238/epic-games-database-leak-hints-at-a-trove-of-unannounced-games?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Epic Games Database Leak Hints At a Trove of Unannounced Games", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T17:53:43.356384+00:00", "description": "The U.S. Federal Trade Commission is prioritizing enforcement actions against major technology companies that cause the most harm, FTC Chair Lina Khan said at an event. Khan emphasized the importance of targeting \"mob bosses\" rather than lower-level offenders to effectively address illegal behaviors in the industry. The FTC has recently launched antitrust probes into Microsoft, Open AI, and Nvidia, and has taken legal action against Meta, Amazon, Google, and Apple in recent years. TechCrunch adds: Khan said that in any given year, the FTC sees up to 3,000 merger filings reported to the agency and that around 2% of those deals get a second look by the government. \"So you have 98% of deals that, for the most part, are going through,\" she said. \"If you are a startup or a founder that is eager for an acquisition as an exit, a world in which you have five or six or seven or eight potential suitors, I would think, is a better world in which you just have one or two, right? And so, actually ", "language": "en-us", "link": "https://news.slashdot.org/story/24/06/12/1715200/ftc-chair-lina-khan-says-agency-pursuing-mob-bosses-in-big-tech?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FTC Chair Lina Khan Says Agency Pursuing 'Mob Bosses' in Big Tech", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T16:48:54.515881+00:00", "description": "T-Mobile's recent price hikes of up to $5 per line on older smartphone plans have left many customers shocked due to the company's previous \"Un-contract\" promise. Announced in 2017, T-Mobile pledged never to change the price customers pay for their plans. However, a now-removed FAQ revealed that the guarantee only ensured T-Mobile would pay the final month's charges if prices increased and customers chose to leave within 60 days. The price increases affect various plans, despite T-Mobile's earlier promises of \"no crazy strings, no hoops to jump through, no hidden fees, no BS.\"<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=T-Mobile's+'Un-contract'+Promise+Unravels+as+Price+Hikes+Shock+Customers%3A+https%3A%2F%2Fslashdot.org%2Fstory%2F24%2F06%2F12%2F1616228%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2", "language": "en-us", "link": "https://slashdot.org/story/24/06/12/1616228/t-mobiles-un-contract-promise-unravels-as-price-hikes-shock-customers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "T-Mobile's 'Un-contract' Promise Unravels as Price Hikes Shock Customers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T15:33:38.758467+00:00", "description": "Waymo is issuing a voluntary software recall after one of its driverless vehicles collided with a telephone pole in Phoenix, Arizona, last month, the company said. The vehicle was damaged, but no passengers or bystanders were hurt in the incident. From a report: The company is filing the recall with the National Highway Traffic Safety Administration (NHTSA) after completing a software update to 672 vehicles -- the total number of driverless-capable vehicles in Waymo's fleet. The update corrects an error in the software that \"assigned a low damage score\" to the telephone pole, and updates its map to account for the hard road edge in the alleyway that was not previously included. This is Waymo's second recall ever, after two minor collisions prompted a recall of 444 vehicles last February. And it comes at a time of increased regulatory scrutiny of the driverless vehicle industry, in which federal investigators are probing almost all the major companies operating autonomous vehicles in t", "language": "en-us", "link": "https://tech.slashdot.org/story/24/06/12/1436231/waymo-issues-software-and-mapping-recall-after-robotaxi-crashes-into-a-telephone-pole?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Waymo Issues Software and Mapping Recall After Robotaxi Crashes Into a Telephone Pole", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T15:33:36.763537+00:00", "description": "Apple's upcoming macOS 15 Sequoia will allow users to sign into iCloud and other Apple ID-related services from within virtual machines. This feature will be available for VMs running macOS 15 or newer, hosted on a Mac with macOS 15 or newer. ArsTechnica adds: But up until now, you haven't been able to sign into iCloud using macOS on a VM. This made the feature less useful for developers or users hoping to test iCloud features in macOS, or whose apps rely on some kind of syncing with iCloud, or people who just wanted easy access to their iCloud data from within a VM.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Quietly+Improves+Mac+Virtualization+in+macOS+15+Sequoia%3A+https%3A%2F%2Fapple.slashdot.org%2Fstory%2F24%2F06%2F12%2F1525255%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fapple.slashdot", "language": "en-us", "link": "https://apple.slashdot.org/story/24/06/12/1525255/apple-quietly-improves-mac-virtualization-in-macos-15-sequoia?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Quietly Improves Mac Virtualization in macOS 15 Sequoia", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T14:29:18.506086+00:00", "description": "An anonymous reader quotes a report from Ars Technica: Hackers working for the Chinese government gained access to more than 20,000 VPN appliances sold by Fortinet using a critical vulnerability that the company failed to disclose for two weeks after fixing it, Netherlands government officials said. The vulnerability, tracked as CVE-2022-42475, is a heap-based buffer overflow that allows hackers to remotely execute malicious code. It carries a severity rating of 9.8 out of 10. A maker of network security software, Fortinet silently fixed the vulnerability on November 28, 2022, but failed to mention the threat until December 12 of that year, when the company said it became aware of an \"instance where this vulnerability was exploited in the wild.\" On January 11, 2023 -- more than six weeks after the vulnerability was fixed -- Fortinet warned a threat actor was exploiting it to infect government and government-related organizations with advanced custom-made malware. Netherlands governmen", "language": "en-us", "link": "https://it.slashdot.org/story/24/06/12/0446240/china-state-hackers-infected-20000-fortinet-vpns-dutch-spy-service-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China State Hackers Infected 20,000 Fortinet VPNs, Dutch Spy Service Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T14:29:16.608327+00:00", "description": "Morgan Stanley, in a note -- seen by Slashdot -- sent to its clients on Wednesday: From our continuing discussions with automotive management teams and industry experts, the car is an extension of the phone. The phone is an extension of the car. The lines between car and phone are truly blurring. \n\nFor years, we have been writing about the potential for Tesla to expand into edge compute domains beyond the car, including last October where we described a mobile AI assistant as a 'heavy key.' Following Apple's WWDC, Tesla CEO Elon Musk re-ignited the topic by saying that making such a device is 'not out of the question.' As Mr. Musk continues to invest further into his own LLM/genAI efforts, such as 'Grok,' the potential strategic and userexperience overlap becomes more obvious. \n\nFrom an automotive perspective, the topic of supercomputing at both the datacenter level and at the edge are highly relevant given the incremental global unit sold is a car that can perform OTA updates of firm", "language": "en-us", "link": "https://hardware.slashdot.org/story/24/06/12/132225/will-tesla-do-a-phone-yes-says-morgan-stanley?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Will Tesla Do a Phone? Yes, Says Morgan Stanley", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T10:51:27.647285+00:00", "description": "SoftBank has developed AI voice-conversion technology aimed at reducing the psychological stress on call center operators by altering the voices of angry customers to sound calmer. Japan's The Asahi Shimbun reports: The company launched a study on \"emotion canceling\" three years ago, which uses AI voice-processing technology to change the voice of a person over a phone call. Toshiyuki Nakatani, a SoftBank employee, came up with the idea after watching a TV program about customer harassment. \"If the customers' yelling voice sounded like Kitaro's Eyeball Dad, it would be less scary,\" he said, referring to a character in the popular anime series \"Gegege no Kitaro.\"\n \nThe voice-altering AI learned many expressions, including yelling and accusatory tones, to improve vocal conversions. Ten actors were hired to perform more than 100 phrases with various emotions, training the AI with more than 10,000 pieces of voice data. The technology does not change the wording, but the pitch and inflecti", "language": "en-us", "link": "https://slashdot.org/story/24/06/12/0438231/softbanks-new-ai-makes-angry-customers-sound-calm-on-phone?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "SoftBank's New AI Makes Angry Customers Sound Calm On Phone", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T08:01:31.346570+00:00", "description": "Lynn Conway, a pioneering computer scientist who made significant contributions to VLSI design and microelectronics, and a prominent advocate for transgender rights, died Sunday from a heart condition. She was 85. Pulitzer Prize-winning journalist Michael Hiltzik remembers Conway in a column for the Los Angeles Times: As I recounted in 2020, I first met Conway when I was working on my 1999 book about Xerox PARC, Dealers of Lightning, for which she was a uniquely valuable source. In 2000, when she decided to come out as transgender, she allowed me to chronicle her life in a cover story for the Los Angeles Times Magazine titled \"Through the Gender Labyrinth.\" That article traced her journey from childhood as a male in New York's strait-laced Westchester County to her decision to transition. Years of emotional and psychological turmoil followed, even as he excelled in academic studies. [Conway earned bachelor's and master's degrees in electrical engineering from Columbia University in 19", "language": "en-us", "link": "https://slashdot.org/story/24/06/12/0414248/lynn-conway-leading-computer-scientist-and-transgender-pioneer-dies-at-85?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Lynn Conway, Leading Computer Scientist and Transgender Pioneer, Dies At 85", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T04:14:01.192808+00:00", "description": "An anonymous reader quotes a report from the New York Times: The news was featured on MSN.com: \"Prominent Irish broadcaster faces trial over alleged sexual misconduct.\" At the top of the story was a photo of Dave Fanning. But Mr. Fanning, an Irish D.J. and talk-show host famed for his discovery of the rock band U2, was not the broadcaster in question. \"You wouldn't believe the amount of people who got in touch,\" said Mr. Fanning, who called the error \"outrageous.\" The falsehood, visible for hours on the default homepage for anyone in Ireland who used Microsoft Edge as a browser, was the result of an artificial intelligence snafu. A fly-by-night journalism outlet called BNN Breaking had used an A.I. chatbot to paraphrase an article from another news site, according to a BNN employee. BNN added Mr. Fanning to the mix by including a photo of a \"prominent Irish broadcaster.\" The story was then promoted by MSN, a web portal owned by Microsoft. The story was deleted from the internet a day ", "language": "en-us", "link": "https://news.slashdot.org/story/24/06/11/2231220/the-rise-and-fall-of-bnn-breaking-an-ai-generated-news-outlet?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Rise and Fall of BNN Breaking, an AI-Generated News Outlet", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T01:00:05.770389+00:00", "description": "Brazil's government is partnering with OpenAI to use AI for expediting the screening and analysis of thousands of lawsuits to reduce costly court losses impacting the federal budget. Reuters reports: The AI service will flag to government the need to act on lawsuits before final decisions, mapping trends and potential action areas for the solicitor general's office (AGU). AGU told Reuters that Microsoft would provide the artificial intelligence services from ChatGPT creator OpenAI through its Azure cloud-computing platform. It did not say how much Brazil will pay for the services. AGU said the AI project would not replace the work of its members and employees. \"It will help them gain efficiency and accuracy, with all activities fully supervised by humans,\" it said.\n \nCourt-ordered debt payments have consumed a growing share of Brazil's federal budget. The government estimated it would spend 70.7 billion reais ($13.2 billion) next year on judicial decisions where it can no longer appea", "language": "en-us", "link": "https://yro.slashdot.org/story/24/06/11/2237241/brazil-hires-openai-to-cut-costs-of-court-battles?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Brazil Hires OpenAI To Cut Costs of Court Battles", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-12T01:00:03.915032+00:00", "description": "According to The Verge, Best Buy conducted another round of layoffs and job restructurings to \"right size\" the business in response to declining sales post-pandemic. Further layoffs and changes are expected throughout the year. From the report: The layoffs appeared to have mostly targeted in-home sales roles called designers, who would go to customers' homes to help identify products that would work in their space. It's not clear how many were let go, but designers who weren't laid off have been moved into a different, largely in-store role. Also, pay scales for a similar, existing in-store \"consultant\" position were revamped. Best Buy confirmed the layoffs in an email to The Verge but declined to share how many people were let go or how pay was changing. \"Many of our team members were moved to new areas or roles where our customers need it most,\" Best Buy spokesperson Ryan Furlong told The Verge. He said some employees in Best Buy's \"Design and Consult workforce\" -- the collection of", "language": "en-us", "link": "https://news.slashdot.org/story/24/06/11/2245204/best-buy-is-laying-off-more-employees-as-it-reckons-with-falling-sales?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Best Buy Is Laying Off More Employees As It Reckons With Falling Sales", "user": null, "vote": 0}]