[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T23:18:21.954758+00:00", "description": "The Rabbit R1 is one of the first standalone AI companion devices to hit the market, offering the ability to translate languages, identify objects in your environment, and order DoorDash, among other things. It's been in the news last week for its all around poor reviews that cite poor battery life, painfully slow responses, and missing features (sound familiar?). Now, it's been confirmed that the Rabbit R1 is powered by an Android app that can run on existing Android phones. Android Authority reports: What ended up souring a lot of people's opinions on the product was the revelation -- in an Android Authority original report -- that the R1 is basically an Android app in a box. Many consumers who believed that the product would be better suited as a mobile app felt validated after our report, but there was one stickler in it that we needed to address: how we got the R1 launcher up and running on an Android phone. See, in our preliminary report, we mentioned that the Rabbit R1's launch", "language": "en-us", "link": "https://slashdot.org/story/24/05/06/2151226/the-rabbit-r1-couldve-just-been-a-mobile-app?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Rabbit R1 Could've Just Been a Mobile App", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T22:13:23.111428+00:00", "description": "OpenAI and the developer platform Stack Overflow have announced a partnership that could potentially improve the performance of AI models and bring more technical information into ChatGPT. From a report: OpenAI will have access to Stack Overflow's API and will receive feedback from the developer community to improve the performance of AI models. OpenAI, in turn, will give Stack Overflow attribution -- aka link to its contents -- in ChatGPT. Users of the chatbot will see more information from Stack Overflow's knowledge archive if they ask ChatGPT coding or technical questions. The companies write in the press release that this will \"foster deeper engagement with content.\" Stack Overflow will use OpenAI's large language models to expand its Overflow AI, the generative AI application it announced last year. Further reading: Stack Overflow Cuts 28% Workforce as the AI Coding Boom Continues (October 2023).<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?s", "language": "en-us", "link": "https://developers.slashdot.org/story/24/05/06/2025215/openai-and-stack-overflow-partner-to-bring-more-technical-knowledge-into-chatgpt?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OpenAI and Stack Overflow Partner To Bring More Technical Knowledge Into ChatGPT", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T22:13:21.094953+00:00", "description": "An anonymous reader quotes a report from TechCrunch: CoreWeave, the GPU infrastructure provider that began life as a cryptocurrency mining operation, this week raised $1.1 billion in new funding from investors, including Coatue, Fidelity and Altimeter Capital. The round brings its valuation to $19 billion post-money and its total raised to $5 billion in debt and equity -- a remarkable figure for a company that's less than 10 years old. It's not just CoreWeave. Lambda Labs, which also offers an array of cloud-hosted GPU instances, in early April secured a \"special purpose financing vehicle\" of up to $500 million, months after closing a $320 million Series C round. The nonprofit Voltage Park, backed by crypto billionaire Jed McCaleb, last October announced that it's investing $500 million in GPU-backed data centers. And Together AI, a cloud GPU host that also conducts generative AI research, in March landed $106 million in a Salesforce-led round.\n \nSo why all the enthusiasm for -- and c", "language": "en-us", "link": "https://slashdot.org/story/24/05/06/2122229/alternative-clouds-are-booming-as-companies-seek-cheaper-access-to-gpus?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Alternative Clouds Are Booming As Companies Seek Cheaper Access To GPUs", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T21:07:31.904225+00:00", "description": "Shell sold millions of carbon credits tied to CO2 removal that never took place [non-paywalled link] to Canada's largest oil sands companies, raising new doubts about a technology seen as crucial to mitigating greenhouse gas emissions. FT: As part of a subsidy scheme to boost the industry, the Alberta provincial government allowed Shell to register and sell carbon credits equivalent to twice the volume of emissions avoided by its Quest carbon capture facility between 2015 and 2021, the province's registry shows. The subsidy was reduced and then ended in 2022. \n\nAs a result of the scheme, Shell was able to register 5.7mn credits that had no equivalent CO2 reductions, selling these to top oil sands producers and some of its own subsidiaries. Credits are typically equivalent to one tonne of CO2. Some of the largest buyers of the credits were Chevron, Canadian Natural Resources, ConocoPhillips, Imperial Oil and Suncor Energy. Keith Stewart, a senior energy strategist with Greenpeace Canad", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/06/204257/shell-sold-millions-of-phantom-carbon-credits?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Shell Sold Millions of 'Phantom' Carbon Credits", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T21:07:30.406144+00:00", "description": "An anonymous reader shares an essay: Software designers refer to \"the good enough principle.\" It means, simply put, that sometimes you should prioritise functionality over perfection. As a relentless imperfectionist, I'm inclined to embrace this idea. I gave this newsletter its name to encourage myself to post rough versions of my pieces rather than not to write them at all. When it comes to parenting, I'm a Winnicottian: I believe you shouldn't try to be the perfect mum or dad because there's no such thing. At work and in life, it's often true that the optimal strategy is not to strive for the optimal result, but to aim for what works and hope for the best. \n\nThe good enough can be a staging post to the perfect. The iPhone's camera was a \"good enough\" substitute for a compact camera. It did the job, but it wasn't as good as a Kodak or a Fuji. Until it was. Technological innovation often works like this, but the improvement curve isn't always as steep as with the smartphone camera. So", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/06/2014239/the-good-enough-trap?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "'The Good Enough Trap'", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T20:03:07.974849+00:00", "description": "A council has provoked the wrath of residents and linguists alike after announcing it would ban apostrophes on street signs to avoid problems with computer systems. From a report: North Yorkshire council is ditching the punctuation point after careful consideration, saying it can affect geographical databases. The council said all new street signs would be produced without one, regardless of whether they were used in the past. Some residents expressed reservations about removing the apostrophes, and said it risked \"everything going downhill.\" They urged the authority to retain them. \n\nSam, a postal worker in Harrogate, a spa town in North Yorkshire, told the BBC that signs missing an apostrophe -- such as the nearby St Mary's Walk sign that had been erected in the town without it -- infuriated her. \"I walk past the sign every day and it riles my blood to see inappropriate grammar or punctuation,\" she said. Though the updated St Mary's sign had no apostrophe, someone had graffitied an ", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/06/1932203/north-yorkshire-apostrophe-fans-demand-road-signs-with-nowt-taken-out?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "North Yorkshire Apostrophe Fans Demand Road Signs With Nowt Taken Out", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T18:58:47.091892+00:00", "description": "Google is streamlining the process of setting up two-factor authentication (2FA). From a report: Instead of entering your phone number first to enable 2FA, you can now add a \"second step method\" to your account such as an authenticator app or a hardware security key to get things set up. This should make it safer to turn on 2FA, as it lets you avoid using less secure SMS verification. You can choose to enter a time-based one-time passcode through apps like Google Authenticator, or you can follow the steps to link a hardware security key.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+is+Changing+How+You+Set+Up+2FA%3A+https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F05%2F06%2F1841237%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fit.slashdot.org%2Fstory%2F24%2F05%2F06%2F1841237%2Fgoogle-is-changing-h", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/06/1841237/google-is-changing-how-you-set-up-2fa?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google is Changing How You Set Up 2FA", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T17:52:45.236690+00:00", "description": "A new breed of audiobook is taking over digital bookshelves -- ones narrated not by professional voice actors, but by artificial intelligence voices. It's an AI audiobook revolution that has been turbo-charged by Amazon. From a report: Since announcing a beta tool last year allowing self-published authors to generate AI \"virtual voice\" narrations for their ebooks, over 40,000 AI-narrated titles have flooded onto Audible, Amazon's audiobook platform. The eye-popping stat, revealed in a recent Bloomberg report, has many authors celebrating but is also raising red flags for human narrators. \n\nFor indie writers wanting to crack the lucrative audiobook market without paying hefty professional voiceover fees, Amazon's free virtual narration tool is a game-changer. One blogger cited in the report claimed converting an ebook to audio using the AI narration took just 52 minutes, bypassing the expensive studio recording route. Others have mixed reactions. Last month, an author named George Stef", "language": "en-us", "link": "https://slashdot.org/story/24/05/06/1720210/40000-ai-narrated-audiobooks-flood-audible?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "40,000 AI-Narrated Audiobooks Flood Audible", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T16:48:43.944599+00:00", "description": "An international coalition of police agencies have resurrected the dark web site of the notorious LockBit ransomware gang, which they had seized earlier this year, teasing new revelations about the group. From a report: On Sunday, what was once LockBit's official darknet site reappeared online with new posts that suggest the authorities are planning to release new information about the hackers in the next 24 hours, as of this writing. The posts have titles such as \"Who is LockBitSupp?,\" \"What have we learnt,\" \"More LB hackers exposed,\" and \"What have we been doing?\" \n\nIn February, a law enforcement coalition that included the U.K.'s National Crime Agency, the U.S. Federal Bureau of Investigation, as well as forces from Germany, Finland, France, Japan and others announced that they had infiltrated LockBit's official site. The coalition seized the site and replaced information on it with their own press release and other information in a clear attempt to troll and warn the hackers that ", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/06/1546218/police-resurrect-lockbits-site-and-troll-the-ransomware-gang?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Police Resurrect Lockbit's Site and Troll the Ransomware Gang", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T16:48:42.012308+00:00", "description": "Poor countries must demonstrate clearer accounting and transparency to back up their calls for trillions of dollars of climate finance, the president of global climate negotiations has said. From a report: Mukhtar Babayev, the ecology minister of Azerbaijan, who will lead the Cop29 UN climate summit in November, urged governments in developing countries to draw up reports showing their progress on cutting greenhouse gas emissions, and their spending on the climate crisis. \"It's very important to build this correct, good and honest trust between the parties,\" he said in an interview in Baku, the capital of Azerbaijan. \"It's a very, very important step, the creation of a transparency mechanism between the countries.\" \n\nAt Cop29 in Baku, countries will be expected to come up with a new global goal on supplying climate finance to poorer countries, to help them cut their greenhouse gas emissions and adapt to the impacts of extreme weather. Some governments from the global south are calling", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/06/1536206/poorer-nations-must-be-transparent-over-climate-spending-says-cop29-leader?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Poorer Nations Must Be Transparent Over Climate Spending, Says Cop29 Leader", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T15:42:47.856579+00:00", "description": "For the first time since it invested more than $10 billion into OpenAI in exchange for the rights to reuse the startup's AI models, Microsoft is training a new, in-house AI model large enough to compete with state-of-the-art models from Google, Anthropic and OpenAI itself. The Information: The new model, internally referred to as MAI-1, is being overseen by Mustafa Suleyman, the ex-Google AI leader who most recently served as CEO of the AI startup Inflection before Microsoft hired the majority of the startup's staff and paid $650 million for the rights to its intellectual property in March. But this is a Microsoft model, not one carried over from Inflection, although it may build on training data and other tech from the startup. It is separate from the Pi models that Inflection previously released, according to two Microsoft employees with knowledge of the effort. \n\nMAI-1 will be far larger than any of the smaller, open source models that Microsoft has previously trained, meaning it w", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/06/1437231/microsoft-readies-new-ai-model-to-compete-with-google-openai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Readies New AI Model To Compete With Google, OpenAI", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T15:42:45.810165+00:00", "description": "PlayStation has reversed course on the Helldivers 2 PSN account requirement, walking back the unpopular policy after a weekend long backlash that included tens of thousands of negative reviews, some of which spread to Sony's other Steam games. From a report: \"Helldivers fans -- we've heard your feedback on the Helldivers 2 account linking update. The May 6 update, which would have required Steam and PlayStation Network account linking for new players and for current players beginning May 30, will not be moving forward,\" PlayStation wrote on its official account. \n\n\"We're still learning what is best for PC players and your feedback has been invaluable. Thanks again for your continued support of Helldivers 2 and we'll keep you updated on future plans.\" PlayStation's decision means that Helldivers 2 players on Steam won't have to link a PSN account in order to play. The unpopular policy, which would have seen new players confronted with a mandatory login beginning this week, resulted in ", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/06/1515220/playstation-reverses-course-on-helldivers-2-psn-account-requirement?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "PlayStation Reverses Course on Helldivers 2 PSN Account Requirement", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T14:38:01.271587+00:00", "description": "More than 90% of stablecoin transaction volumes aren't coming from genuine users, according to a new metric co-developed by Visa, suggesting such crypto tokens may be far away from becoming a commonly used means of payment. Bloomberg: The dashboard from Visa and Allium Labs is designed to strip out transactions initiated by bots and large-scale traders to isolate those made by real people. Out of about $2.2 trillion in total transactions in April, just $149 billion originated from \"organic payments activity,\" according to Visa. \n\nVisa's finding challenges stablecoin proponents' argument that the tokens, pegged to an asset like the dollar, are poised to revolutionize the $150 trillion payments industry. PayPal and Stripe are among the fintech giants making inroads into stablecoins, with Stripe co-founder John Collison in April citing \"technical improvements\" for being bullish on the tokens. [...] Visa itself, which handled more than $12 trillion worth of transactions last year, is amon", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/06/048208/more-than-90-of-stablecoin-transactions-arent-from-real-users-visa-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "More Than 90% of Stablecoin Transactions Aren't From Real Users, Visa Study Finds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T12:28:45.912238+00:00", "description": "Wednesday Rest of World noticed an overlooked tech story in Argentina:\n\nOlga de Le&oacute;n looked confused as she walked out of a nightclub on the edge of Buenos Aires on a recent Tuesday afternoon. She had just had her iris scanned. \"No one told me what they'll do with my eye,\" de Le&oacute;n, 57, told Rest of World. \"But I did this out of need.\" De Le&oacute;n, who lives off the $95 pension she receives from the state, had been desperate for money. Persuaded by her nephew, she agreed to have one of her irises scanned by Worldcoin, Sam Altman's blockchain project. In exchange, she received nearly $50 worth of WLD, the company's cryptocurrency. \n\nDe Le&oacute;n is one of about half a million Argentines who have handed their biometric data over to Worldcoin. Beaten down by the country's 288% inflation rate and growing unemployment, they have flocked to Worldcoin Orb verification hubs, eager to get the sign-up crypto bonus offered by the company. A network of intermediaries &mdash; who", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/06/0140229/in-argentina-facing-surging-inflation-500k-accept-worldcoins-offer-of-50-for-iris-scanning?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "In Argentina, Facing Surging Inflation, 500K  Accept Worldcoin's Offer of $50 for Iris-Scanning", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T08:36:24.236566+00:00", "description": "An anonymous reader shared this report from Mint:\n\nElon Musk-owned social media platform X (formerly Twitter) has launched a new Grok AI-powered feature called 'Stories', which allows users to read summaries of a trending post on the social media platform. The feature is currently only available to X Premium subscribers on the iOS and web versions, and hasn't found its way to the Android application just yet... instead of reading the whole post, they'll have Grok AI summarise it to get the gist of those big news stories. However, since Grok, like other AI chatbots on the market, is prone to hallucination (making things up), X provides a warning at the end of these stories that says: \"Grok can make mistakes, verify its outputs.\" \n\n\n\"Access to xAI's chatbot Grok is meant to be a selling point to push users to buy premium subscriptions,\" reports TechCrunch:\nA snarky and \"rebellious\" AI, Grok's differentiator from other AI chatbots like ChatGPT is its exclusive and real-time access to X d", "language": "en-us", "link": "https://slashdot.org/story/24/05/06/0028235/elon-musks-x-launches-grok-ai-powered-stories-feature?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Elon Musk's X Launches Grok AI-Powered 'Stories' Feature", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T04:38:53.763988+00:00", "description": "\"Without San Francisco, Star Wars wouldn't exist,\" says David Reat, the culture studies director of the architecture department at Glasgow's University of Strathclyde. \n\nSFGate reports:\n\nLucas was born and raised in Modesto, where his father expected him to run the family stationery store once he turned 18, but Lucas instead left for Los Angeles, where he studied film production at the University of Southern California, before moving to San Francisco. Despite all that these cities had to offer, Lucas constantly found himself conflicted over his feelings toward them. \"The battle of living in the country versus living in the city is huge with Lucas,\" says Reat, who notes that this theme runs throughout the likes of \"THX 1138,\" \"American Graffiti\" and the \"Star Wars\" series. \"He sees cities as the givers and takers of things. He's fascinated by cities. He doesn't actually want to live in one. He now lives in a ranch near one. He wants to orbit them. He's a paradox.\" \n\nWhen Lucas moved to", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/05/05/1715226/how-star-wars-was-influenced-by-san-francisco---and-architecture?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "How 'Star Wars' was Influenced by San Francisco - and Architecture", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T02:27:59.514169+00:00", "description": "Science Alert reports that a team of researchers found \"that changes in glucose metabolism could help cancer grow by temporarily disabling a gene that protects us from tumors called BRCA2.\"\n\nThe team first examined people who inherited one faulty copy of BRCA2. They found that cells from these people were more sensitive to methylglyoxal (MGO), which is produced when cells break down glucose for energy in the process of glycolysis. Glycolysis generates over 90 percent of the MGO in cells, which a pair of enzymes typically keep to minimal levels. In the event they can't keep up, high MGO levels can lead to the formation of harmful compounds that damage DNA and proteins. In conditions like diabetes, where MGO levels are elevated due to high blood sugar, these harmful compounds contribute to disease complications. \n\nThe researchers discovered that MGO can temporarily disable the tumor-suppressing functions of the BRCA2 protein, resulting in mutations linked to cancer development... \n\n\n\nAs", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/05/2333251/scientists-find-a-missing-link-between-poor-diet-and-higher-cancer-risk?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Scientists Find a 'Missing Link' Between Poor Diet and Higher Cancer Risk", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T00:19:08.994174+00:00", "description": "From the Washington Post's \"Technology 202\" newsletter:\n\nAs tech giants move toward a world in which chatbots supplement, and perhaps supplant, search engines, the Microsoft executive assigned to make sure AI is used responsibly said the industry has to be careful not to break the business model of the wider web. Search engines citing and linking to the websites they draw from is \"part of the core bargain of search,\" [Microsoft's chief Responsible AI officer] said in an interview Monday.... \n\n\"It's really important to maintain a healthy information ecosystem and recognize it is an ecosystem. And so part of what I will continue to guide our Microsoft teams toward is making sure that we are citing back to the core webpages from which the content is sourced. Making sure that we've got that feedback loop happening. Because that is part of the core bargain of search, right? And I think it's critical to make sure that we are both providing users with new engaging ways to interact, to explor", "language": "en-us", "link": "https://slashdot.org/story/24/05/05/0527224/microsofts-responsible-ai-chief-worries-about-the-open-web?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft's 'Responsible AI' Chief Worries About the Open Web", "user": null, "vote": 0}]