[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T20:30:02+00:00", "description": "No, it's not Pac-Man 99, but you can be forgiven for thinking that PAC-MAN Mega Tunnel Battle: Chomp Champs is familiar. After all, it launched as PAC-MAN Mega Tunnel Battle in 2020 - a Google Stadia exclusive that would subsequently go down with the platform.\n\nNow that it's back on multiple platforms, complete with cross-platform play and minor changes, it offers an altogether different battle royale approach. You now directly invade other players' mazes during matches, consuming their dots and Power Pellets, leveraging Power-ups and causing chaos. It's a novel approach that can be fun for a few hours.\n\nBandai Namco still needs to build on it, offering more content, a proper Ranked experience that makes wins and losses matter, offline options and much more. Whether PAC-MAN Mega Tunnel Battle: Chomp Champs will get that is unknown, but it's a decent experience.", "language": null, "link": "https://www.youtube.com/watch?v=WSMW6BypJJk", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/WSMW6BypJJk/hqdefault.jpg", "title": "PAC-MAN Mega Tunnel Battle: Chomp Champs Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T17:30:05+00:00", "description": "An Oculus Studios first party Batman game developed for the Quest 3 by a studio as talented as Camouflaj should spark nothing but excitement, but when Batman: Arkham Shadow was recently announced, the general response was one of disappointment. \n\nWhile there’s every chance that the VR game will actually turn out to be good, its announcement has served as a stark reminder for how poorly WB Games has treater the Batman: Arkham series. \n\nNot only has it’s been nearly a decade since the series’ last entry, the way WB Games chose to follow up on it was with the hugely disappointing live service failure Suicide Squad: Kill the Justice League. Amidst all of that, the company’s decision to license out the Arkham series for a VR spinoff, even as cries for a new mainline instalment go unheard, is one that it’s hard not to get frustrated with.", "language": null, "link": "https://www.youtube.com/watch?v=qnY1HZa0Ahs", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qnY1HZa0Ahs/hqdefault.jpg", "title": "The NEW Batman Game Feels Like A SLAP IN THE FACE For Arkham Fans", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-06T07:00:39+00:00", "description": "Helldivers 2 has been on a fantastic run since launching in February, setting sales records and earning acclaim from fans and critics alike. Unfortunately, Sony decided to move ahead with mandatory PSN account linking for PC players.\n\nNot only did this raise concerns, given the company's history with security, but caused issues for about 177 regions and countries where the game is sold but the PlayStation Network isn't available. Sony would delist the title from these locations and reportedly offer full refunds, which only caused the backlash to grow.\n\nIt's now walked back plans for the account linking, as Helldivers 2 sits at a \"Mixed\" rating on Steam with over 200,000 recent negative reviews. Whether this is the end of such plans for the title or future published titles remains to be seen.", "language": null, "link": "https://www.youtube.com/watch?v=PoIUfK8EmK4", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/PoIUfK8EmK4/hqdefault.jpg", "title": "Helldivers 2 PSN Linking Fiasco - Sony ALMOST SHOT Itself In The Foot", "user": null, "vote": 0}]