[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T22:13:28.195349+00:00", "description": "\"The TIOBE Index sets out to reflect the relative popularity of computer languages,\" writes i-Programmer, \"so it comes as something of a surprise to see two languages dating from the 1950's in this month's Top 20.\n\nHaving broken into the the Top 20 in April 2021 Fortran has continued to rise and has now risen to it's highest ever position at #10... The headline for this month's report by Paul Jansen on the TIOBE index is: \nFortran in the top 10, what is going on? \nJansen's explanation points to the fact that there are more than 1,000 hits on Amazon for \"Fortran Programming\" while languages such as Kotlin and Rust, barely hit 300 books for the same search query. He also explains that Fortran is still evolving with the new ISO Fortran 2023 definition published less than half a year ago.... \n\nThe other legacy language that is on the rise in the TIOBE index is COBOL. We noticed it re-enter the Top 20 in January 2024 and, having dropped out in the interim, it is there again this month. \n\n\n", "language": "en-us", "link": "https://developers.slashdot.org/story/24/05/19/2159214/fortran-and-cobol-re-enter-tiobes-ranking-of-programming-language-popularity?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FORTRAN and COBOL Re-enter TIOBE's Ranking of Programming Language Popularity", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T21:08:26.626709+00:00", "description": "\"Blue Origin's tourism rocket has launched passengers to the edge of space for the first time in nearly two years,\" reports CNN, \"ending a hiatus prompted by a failed uncrewed test flight.\"\n\n\n The New Shepard rocket and capsule lifted off at 9:36 a.m. CT (10:36 a.m. ET) from Blue Origin's facilities on a private ranch in West Texas. \n\nNS-25, Blue Origin's seventh crewed flight to date, carried six customers aboard the capsule: venture capitalist Mason Angel; Sylvain Chiron, founder of the French craft brewery Brasserie Mont-Blanc; software engineer and entrepreneur Kenneth L. Hess; retired accountant Carol Schaller; aviator Gopi Thotakura; and Ed Dwight, a retired US Air Force captain selected by President John F. Kennedy in 1961 to be the nation's first Black astronaut candidate... Dwight completed that challenge and reached the edge of space at the age of 90, making him the oldest person to venture to such heights, according to a spokesperson from Blue Origin... \n\n\"It's a life-chang", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/19/2037247/blue-origin-successfully-launches-six-passengers-to-the-edge-of-space?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Blue Origin Successfully Launches Six Passengers to the Edge of Space", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T18:59:31.315790+00:00", "description": "\"China's navy has apparently tested out a hypersonic rail gun,\" reports Futurism, describing it as \"basically a device that uses a series of electromagnets to accelerate a projectile to incredible speeds.\" \n\nBut \"during a demonstration of its power, things didn't go quite as planned.\"\nAs the South China Morning Post reports, the rail gun test lobbed a precision-guided projectile &mdash; or smart bomb &mdash; nine miles into the stratosphere. But because it apparently didn't go up as high as it was supposed to, the test was ultimately declared unsuccessful. This conclusion came after an analysis led by Naval Engineering University professor Lu Junyong, whose team found with the help of AI that even though the winged smart bomb exceeded Mach 5 speeds, it didn't perform as well as it could have. This occurred, as Lu's team found, because the projectile was spinning too fast during its ascent, resulting in an \"undesirable tilt.\" \nBut what's more interesting is the project itself. \"Success", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/19/1842230/china-uses-giant-rail-gun-to-shoot-a-smart-bomb-nine-miles-into-the-sky?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "China Uses Giant Rail Gun to Shoot a Smart Bomb Nine Miles Into the Sky", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T17:54:40.759474+00:00", "description": "\"The computer scientist regarded as the 'godfather of artificial intelligence' says the government will have to establish a universal basic income to deal with the impact of AI on inequality,\" reports the BBC:\n\nProfessor Geoffrey Hinton told BBC Newsnight that a benefits reform giving fixed amounts of cash to every citizen would be needed because he was \"very worried about AI taking lots of mundane jobs\". \n\n\"I was consulted by people in Downing Street and I advised them that universal basic income was a good idea,\" he said. He said while he felt AI would increase productivity and wealth, the money would go to the rich \"and not the people whose jobs get lost and that's going to be very bad for society\". \n\n\"Until last year he worked at Google, but left the tech giant so he could talk more freely about the dangers from unregulated AI,\" according to the article. Professor Hinton also made this predicction to the BBC. \"My guess is in between five and 20 years from now there's a probability", "language": "en-us", "link": "https://slashdot.org/story/24/05/19/1713226/ai-godfather-geoffrey-hinton-if-ai-takes-jobs-well-need-universal-basic-income?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "AI 'Godfather' Geoffrey Hinton:  If AI Takes Jobs We'll Need Universal Basic Income", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T16:49:26.838490+00:00", "description": "Earlier this week the Washington Post reported that America's Defense department \"is growing concerned that the United Launch Alliance, one of its key partners in launching national security satellites to space, will not be able to meet its needs to counter China and build its arsenal in orbit with a new rocket that ULA has been developing for years.\"\n\nIn a letter sent Friday to the heads of Boeing's and Lockheed Martin's space divisions, Air Force Assistant Secretary Frank Calvelli used unusually blunt terms to say he was growing \"concerned\" with the development of the Vulcan rocket, which the Pentagon intends to use to launch critical national security payloads but which has been delayed for years. ULA, a joint venture of Boeing and Lockheed Martin, was formed nearly 20 years ago to provide the Defense Department with \"assured access\" to space. \"I am growing concerned with ULA's ability to scale manufacturing of its Vulcan rocket and scale its launch cadence to meet our needs,\" he w", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/18/0619212/us-defense-department-concerned-about-ulas-slow-progress-on-satellite-launches?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "US Defense Department 'Concerned' About ULA's Slow Progress on Satellite Launches", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T15:44:24.207660+00:00", "description": "America's Federal Trade Commission and 17 states filed an antitrust suit against Amazon in September. This week Amazon responded in court about its usage of Signal's \"disappearing messages\" feature. \n\nLong-time Slashdot reader theodp shares GeekWire's report:\n\n\nAt a company known for putting its most important ideas and strategies into comprehensive six-page memos, quick messages between executives aren't the place for meaningful business discussions. That's one of the points made by Amazon in its response Monday to the Federal Trade Commission's allegations about executives' use of the Signal encrypted communications app, known for its \"disappearing messages\" feature. \"For these individuals, just like other short-form messaging, Signal was not a means to send 'structured, narrative text'; it was a way to get someone's attention or have quick exchanges on sensitive topics like public relations or human resources,\" the company says as part of its response, filed Monday in U.S. District", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/18/1920226/amazon-defends-its-use-of-signal-messages-in-court?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Defends Its Use of Signal Messages in Court", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T14:39:23.340166+00:00", "description": "In an elaborate scam in January, \"a finance worker, was duped into attending a video call with people he believed were the chief financial officer and other members of staff,\" remembers CNN. But Hong Kong police later said that all of them turned out to be deepfake re-creations which duped the employee into transferring $25 million.\n According to police, the worker had initially suspected he had received a phishing email from the company's UK office, as it specified the need for a secret transaction to be carried out. However, the worker put aside his doubts after the video call because other people in attendance had looked and sounded just like colleagues he recognized. \n\nNow the targeted company has been revealed: a major engineering consulting firm, with 18,500 employees across 34 offices:\n\n A spokesperson for London-based Arup told CNN on Friday that it notified Hong Kong police in January about the fraud incident, and confirmed that fake voices and images were used. \"Unfortunatel", "language": "en-us", "link": "https://yro.slashdot.org/story/24/05/18/2248237/deep-fake-scams-growing-in-global-frequency-and-sophistication-victim-warns?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Deep Fake Scams Growing in Global Frequency and Sophistication, Victim Warns", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T12:29:18.242493+00:00", "description": "The thinktank InfluenceMap produces \"data-driven analysis on how business and finance are impacting the climate crisis.\" Their web site says their newest report documents \"How automaker lobbying threatens the global transition to electric vehicles.\"\n\nThis report analyses the climate policy engagement strategies of fifteen of the largest global automakers in seven key regions (Australia, EU, Japan, India, South Korea, UK, US). It shows how even in countries where major climate legislation has recently passed, such as the US and Australia, the ambition of these policies has been weakened due to industry pressure. All fifteen automakers, except Tesla, have actively advocated against at least one policy promoting electric vehicles. Ten of the fifteen showed a particularly high intensity of negative engagement and scored a final grade of D or D+ by InfluenceMap's methodology. Toyota is the lowest-scoring company in this analysis, driving opposition to climate regulations promoting battery ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/18/1624241/are-car-companies-sabotaging-the-transition-to-electric-vehicles?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Are Car Companies Sabotaging the Transition to Electric Vehicles?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T08:09:50.928490+00:00", "description": "The Washington Post reports that America took \"one of its biggest steps yet to keep fossil fuels in the ground,\" announcing Thursday that it will end new coal leasing in the Powder River Basin, \"which produces nearly half the coal in the United States... \n\n\"It could prevent billions of tons of coal from being extracted from more than 13 million acres across Montana and Wyoming, with major implications for U.S. climate goals.\"\n A significant share of the nation's fossil fuels come from federal lands and waters. The extraction and combustion of these fuels accounted for nearly a quarter of U.S. carbon dioxide emissions between 2005 and 2014, according to a study by the U.S. Geological Survey. In a final environmental impact statement released Thursday, Interior's Bureau of Land Management found that continued coal leasing in the Powder River Basin would harm the climate and public health. The bureau determined that no future coal leasing should happen in the basin, and it estimated that", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/18/2235223/america-takes-its-biggest-step-yet-to-end-coal-mining?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "America Takes Its Biggest Step Yet to End Coal Mining", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T04:54:03.759546+00:00", "description": "Long-time Slashdot reader SonicSpike shared this report from Ars Technica:\n\nThe United States Marine Forces Special Operations Command (MARSOC) is currently evaluating a new generation of robotic \"dogs\" developed by Ghost Robotics, with the potential to be equipped with gun systems from defense tech company Onyx Industries, reports The War Zone. \n\n\nWhile MARSOC is testing Ghost Robotics' quadrupedal unmanned ground vehicles (called \"Q-UGVs\" for short) for various applications, including reconnaissance and surveillance, it's the possibility of arming them with weapons for remote engagement that may draw the most attention. But it's not unprecedented: The US Marine Corps has also tested robotic dogs armed with rocket launchers in the past. \n\n MARSOC is currently in possession of two armed Q-UGVs undergoing testing, as confirmed by Onyx Industries staff, and their gun systems are based on Onyx's SENTRY remote weapon system (RWS), which features an AI-enabled digital imaging system and ca", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/19/0042219/robot-dogs-armed-with-ai-aimed-rifles-undergo-us-marines-special-ops-evaluation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Robot Dogs Armed With AI-aimed Rifles Undergo US Marines Special Ops Evaluation", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T01:38:57.745668+00:00", "description": "Jeremy Allison &mdash; Sam (Slashdot reader #8,157) is a Distinguished Engineer at Rocky Linux creator CIQ. This week he published a blog post responding to promises of Linux distros \"carefully selecting only the most polished and pristine open source patches from the raw upstream open source Linux kernel in order to create the secure distribution kernel you depend on in your business.\" \n\nBut do carefully curated software patches (applied to a known \"frozen\" Linux kernel) really bring greater security? \"After a lot of hard work and data analysis by my CIQ kernel engineering colleagues Ronnie Sahlberg and Jonathan Maple, we finally have an answer to this question. It's no.\"\n\nThe data shows that \"frozen\" vendor Linux kernels, created by branching off a release point and then using a team of engineers to select specific patches to back-port to that branch, are buggier than the upstream \"stable\" Linux kernel created by Greg Kroah-Hartman. How can this be? If you want the full details the ", "language": "en-us", "link": "https://linux.slashdot.org/story/24/05/19/0030248/why-a-frozen-distribution-linux-kernel-isnt-the-safest-choice-for-security?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Why a 'Frozen' Distribution Linux Kernel Isn't the Safest Choice for Security", "user": null, "vote": 0}]