[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T15:30:24+00:00", "description": "Take a look at the original teaser trailer for Star Wars: The Phantom Menace to celebrate its 25th anniversary. \n\nTwo Jedi escape a hostile blockade to find allies and come across a young boy who may bring balance to the Force, but the long-dormant Sith resurface to claim their original glory.\n\nStar Wars: The Phantom Menace stars Ewan McGregor, Liam Nesson, Natalie Portman, Jake Lloyd, Ian McDiarmid, and more. \n\nStar Wars: The Phantom Menace is in theaters now.\n\n#StarWarsThePhantomMenace #StarWars #IGN", "language": null, "link": "https://www.youtube.com/watch?v=88dKco7IG_k", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/88dKco7IG_k/hqdefault.jpg", "title": "Star Wars: The Phantom Menace - Official Remastered Trailer (2024) Liam Nesson, Natalie Portman", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T15:01:01+00:00", "description": "A Better Paradise Volume One: An Aftermath is an audio fiction series created by Absurd Ventures, the new company founded by storytellers behind Red Dead Redemption and Grand Theft Auto. The series is also developed in partnership with QCODE Media.\n\nSet in the near future, A Better Paradise tells the story of the ill-fated development of an ambitious but addictive digital game-world project led by inventor and psychologist, Dr. Mark Tyburn.\n\nAs the advanced software they developed began delivering unexpected and disturbing results, the team fell apart under strange circumstances and the project was abandoned. The game world and the super-intelligence within were discarded, left dormant, and undiscovered. Until now.  \n\nA Better Paradise Volume One: An Aftermath stars Andrew Lincoln, Shamier Anderson, Paterson Joseph, Rain Spencer, and more. \n\nThe 12-episode original audio fiction series launches on June 10 on Apple Podcasts, Spotify, Amazon Music, and wherever podcasts are available.\n\n", "language": null, "link": "https://www.youtube.com/watch?v=bVNnb-CubRY", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/bVNnb-CubRY/hqdefault.jpg", "title": "A Better Paradise Volume One: An Aftermath - Official Visual Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T13:39:20+00:00", "description": "Black Myth: WuKong is a third-person action RPG developed by Game Science. Take a look at the latest trailer revealed at the WeGame Event showing off some new visuals, cutscenes, and gameplay from the upcoming Chinese mythology-rooted epic developed entirely in Unreal Engine 5. Black Myth: WuKong is launching on August 20 for PlayStation 5 (PS5), Xbox Series S|X, and PC.\n\n#BlackMythWuKong #IGN #Gaming", "language": null, "link": "https://www.youtube.com/watch?v=F6yfej-uzYI", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/F6yfej-uzYI/hqdefault.jpg", "title": "Black Myth: WuKong - Official WeGame Event Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T13:17:24+00:00", "description": "Sins of a Solar Empire 2 reviewed by Will Borger on PC.\n\nIn its current state, Sins of a Solar Empire 2 is hard to recommend. On the one hand, it’s clearly not ready for prime time, despite what its Epic Game Store page and post-1.0 version number would want you to believe. It’s buggy, makes no effort to teach you how to use its huge number of very complex systems, its menus are weirdly and counter-intuitively arranged, and there isn’t even a server browser. On the other hand, all of this confusion comes on top of what is a very faithful follow-up to a beloved real-time 4X game, and developer Ironclad Games has added some cool new ideas to it on top of the under-the-hood and graphical improvements. Sins 2 can be pretty fun with a friend once you figure out how most things work and your massive fleet is blowing some poor guy’s home planet to Kingdom Come, but man, does it take a long time to get there. Maybe when it arrives on Steam with the features we’ve been promised, Ironclad will ", "language": null, "link": "https://www.youtube.com/watch?v=aYhujIk99vY", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/aYhujIk99vY/hqdefault.jpg", "title": "Sins of a Solar Empire 2 Review", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T13:00:59+00:00", "description": "In this episode, we explore a variety of PC cases suited for any budget, from the affordable Cooler Master Q300L series to the elegant Fractal North and the high-end Hyte Y70 Touch. Whether you're a first-time builder or an experienced PC enthusiast, these cases offer unique features, excellent value, and standout designs. Join us as we review the specs, options, and what makes each case special.\nWe start with the Cooler Master Q300L and its variations, known for their modular I/O panels and customizable options. Next, we look at the Fractal North, with its stylish wood paneling and versatile cooling options. Finally, we showcase the Hyte Y70 and Y70Touch, featuring a 14.1” integrated touchscreen and innovative design. Find the perfect case for your build and get inspired to create your dream PC.\n\nLinks:\nCoolerMaster Q300L -  https://a.co/d/baftfVD\nFractal North -  https://a.co/d/6kQw2iu\nHyte Y70 -  https://a.co/d/d3R3WRZ\n\n#GamingPCCases #PCCases #IGN", "language": null, "link": "https://www.youtube.com/watch?v=xqyNo_Moj1w", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/xqyNo_Moj1w/hqdefault.jpg", "title": "The Best Gaming PC Cases for Beginners and Enthusiasts - Budget to Best", "user": null, "vote": 0}]