[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T15:30:16+00:00", "description": "Resident Evil is a name that has become synonymous with survival horror, and a lot of that can be credited to the developer's consistent efforts to innovate on the series formula in new and interesting ways.\n\nOf course, it’s not possible that experimentation always yields results - but there have been times when even the most outrageous of ideas birthed amazing experiences that have etched their names in the history books. \n\nOne such instance was Resident Evil Outbreak which was released in 2003, and combined the thrill of survival horror with the camaraderie that stems from co-operative experiences. It was well and truly one-of-a-kind experience that was very much a product of its time.", "language": null, "link": "https://www.youtube.com/watch?v=XC3ghOVuKnc", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/XC3ghOVuKnc/hqdefault.jpg", "title": "Games Like This Are No Longer Made...", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-19T13:30:07+00:00", "description": "Watch_Dogs was unveiled  in 2012, providing a glimpse into the power of next-gen tech via graphics arguably stealing the show in its E3 presentation. The hype ended up a disservice to the finished game, with players and reviewers disappointed at the visual downgrade alongside the relatively cookie-cut gameplay, middling characters, and generic revenge plot. \n\nThing is, upon reflection a decade later, standing the test of time is the prescience of Watch_Dogs’ themes. The game provided a new spin on contemporary concerns: privacy in a digital age, corruption, data responsibility, surveillance, and the moral responsibility of those with the power to access said data. \n\nWorryingly, much of the tech on display in Watch_Dogs wasn’t far removed from the real world. This feature highlights the themes of Watch_Dogs and discusses whether they were indeed ahead of their time.", "language": null, "link": "https://www.youtube.com/watch?v=JMjyXv6oVpg", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/JMjyXv6oVpg/hqdefault.jpg", "title": "10 Years Later, WATCH_DOGS Feels Like A Game Way Ahead of Its Time", "user": null, "vote": 0}]