[
    {
        "age": null,
        "album": "",
        "author": "Ku Bogu",
        "bookmarked": false,
        "comments": [],
        "date_dead_since": null,
        "date_published": "2024-12-16T06:38:53+00:00",
        "description": "„Mistyczne Miasto Boże” to fascynująca podróż przez odwieczną walkę dobra ze złem, przedstawioną za pomocą potężnych metafor i głębokiej symboliki. Autorka, Maria z Agredy, z niezwykłą pasją opisuje, jak legiony anielskie walczą, aby obronić Niebiańskie Jeruzalem – miejsce nie do zdobycia, gdzie dobry Bóg zawsze zwycięża. Książka z głębią podchodzi do tematów wiary, przedstawiając świętość Jezusa i Maryi jako wzór doskonałości. Autorka z wnikliwością przytacza „Pieśń nad pieśniami”, by ukazać niezrównaną miłość matki do syna i vice versa, oferując czytelnikom unikalne spojrzenie na znane i mniej znane aspekty ich życia. Maria z Agredy, mistyczka i wizjonera, swoimi przeżyciami duchowymi wnosi do książki niezwykły wymiar. Jej życie, pełne duchowych doświadczeń i wizji, staje się mostem łączącym historię z duchowością, wzbogacając narrację o biograficzne i mistyczne elementy.\n\nAudiobook na podstawie tego wyjątkowego dzieła mistyki katolickiej publikujemy po wielomiesięcznym przygotowan",
        "id": 1717551,
        "language": null,
        "link": "https://www.youtube.com/watch?v=WQPHygBekxE",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 86,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 178,
        "source_url": "https://www.youtube.com/feeds/videos.xml?channel_id=UCL0WiIwugwTXU5YBFvatbNg",
        "status_code": 0,
        "tags": [],
        "thumbnail": "https://i4.ytimg.com/vi/WQPHygBekxE/hqdefault.jpg",
        "title": "Mistyczne Miasto Boże. Czcigodna sb María z Ágredy. Cały audiobook.",
        "vote": 0
    }
]