[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-23T15:30:04+00:00", "description": "Crown Wars: The Black Prince is a turn-based strategy game that melds combat and management into a game about the Hundred Years’ War. There is corruption afoot, and the highest reaches of society have been infiltrated by wielders of the occult. The game puts players in the shoes of the head of a great house, and they are tasked with rooting out this corruption and saving medieval Europe in the process. \n\nThe core gameplay loop of Crown Wars: The Black Prince is simple: you kit out a small squad of your soldiers and set them out on missions. These missions are tactical in nature, and if all goes well, your soldiers can come back home with little to no casualties, and new resources, which can in turn be used to get stronger gear for tougher missions. This gameplay loop is interspersed with a story that takes too long to get going, and along the way, players will also have to deal with bland visuals and terrible audio. But at least the game is fun.", "language": null, "link": "https://www.youtube.com/watch?v=GdiSeqBWgqY", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/GdiSeqBWgqY/hqdefault.jpg", "title": "Is This Medieval-XCOM Style Game Worth Your Time?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-23T13:30:09+00:00", "description": "Six years ago, Microsoft announced the acquisition of Ninja Theory, and a year later, the company unveiled Senua's Saga: Hellblade 2, positioning it at the time as a showcase title for newly revealed next-gen Xbox hardware. When the sequel was first announced, given how well received the first game was and the impressive track record that Ninja Theory boasted, expectations were high that it would be a statement first-party release for the Xbox Game Studios umbrella, and in the years following the game's announcement, that belief only grew.\n\nAfter years of development, Hellblade 2 is finally out now, and where its visuals, storytelling, and technical accomplishments are concerned, there's absolutely no doubt whatsoever that the action-adventure game is an experience worth celebrating. At the same time, however, the game has legitimate issues, which means that though it's a genuinely well-made game that I personally would recommend to many (as would many others, based on the overall pos", "language": null, "link": "https://www.youtube.com/watch?v=NYDfpiGTsmI", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NYDfpiGTsmI/hqdefault.jpg", "title": "Senua’s Saga: Hellblade 2 Is Amazing, But It's NOT The Big Flagship Win For Xbox", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-23T09:30:03+00:00", "description": "Though it's yet to be officially announced, it's looking likely (based on multiple recent leaks from generally credible sources, at least) that Sony is soon going to host a PlayStation-focused event. Whether its a PlayStation Showcase or a State of Play presentation (or perhaps something else entirely) is what there isn't much clarity on, but that the company will soon have a big event to present with multiple new announcements and updates is something that everyone seems to be taken granted at this point.\n\nSo assuming that this event is indeed happening, what exactly could we hope to see it bring to the table? Thanks to a combination of leaks, educated guesses, and just pure hope, here, we're going to speak about a number of announcements that we think have a pretty good chance of being given a slot at the event.", "language": null, "link": "https://www.youtube.com/watch?v=8F5G2Oeg_sg", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/8F5G2Oeg_sg/hqdefault.jpg", "title": "15 MASSIVE PS5 Announcements That May Happen At The Next PlayStation Showcase", "user": null, "vote": 0}]