[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-03T18:30:02+00:00", "description": "Crafting a good video game is a daunting task, and not all promising roads lead to a beautiful destination. It’s pretty commonplace to see video games showcasing immense potential with initial showings, generating enormous hype and anticipation only to fail when they release to the public. \n\nTo that end, here are 15 instances of such games that you probably wanted to get, but now are glad that you didn’t get them.", "language": null, "link": "https://www.youtube.com/watch?v=aXUdCzGp7hk", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/aXUdCzGp7hk/hqdefault.jpg", "title": "15 Games You've Wanted To Get, But Now Are Glad You Didn't Get Them", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-03T15:30:12+00:00", "description": "The Elder Scrolls Online: Gold Road is shaping up to be one of the very best expansions Bethesda has put out yet for the 10-year-old MMO. The new zone will be familiar to Oblivion fans, as it comprises The West Weald region just west of Cyrodiil. \n\nWest Weald is comparable in size to Vvardenfell and Craglorn, and there’s loads of content to fill in that space and then some. In addition to the autumnal tones of The West Weald’s Gold Road region, players will be able to finally explore the mysterious emergent jungle of Dawnwood, as well as the northern Colovian Highlands home to Ayleid Ruins.\n\nESO is newbie-friendly with its open-ended quest progression and open zones, but the story of Gold Road carries on from Necrom’s cliffhanger, bringing complexity to its overall plot. The new Scribing system is a game-changer that allows skill customization finally, and the new 12-player Trial\nlooks to be the team’s most creative yet.", "language": null, "link": "https://www.youtube.com/watch?v=QcD5WxOFaEE", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/QcD5WxOFaEE/hqdefault.jpg", "title": "The Elder Scrolls Online: Gold Road - 15 Things You Need To Know BEFORE YOU BUY", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-06-03T13:30:17+00:00", "description": "More than a few times now, we've all had discussions about how 2024 is looking like an uncharacteristically dry year for PlayStation. The juggernaut that typically packs its years full of major, tentpole first-party releases has looked to be headed towards a relatively uneventful year, while in the early months of 2024, the company even outright confirmed that it wouldn't be releasing any new instalments in flagship first-party franchises until at least April 2025. In the first half of this year, then, it's been hard not to be disappointed in how things are turning out for PlayStation.\n\nSuddenly, however, things are starting to look up. Sure, we're not getting a big blockbuster PlayStation Studios release this year along the lines of something like a Spider-Man, Horizon, or what have you, but from smaller first-party games to externally developed titles being published under the PlayStation Studios umbrella to major third-party exclusives, all things considered, the PlayStation 5 has ", "language": null, "link": "https://www.youtube.com/watch?v=jh359QTHQu0", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/jh359QTHQu0/hqdefault.jpg", "title": "Despite A Slow Year, PS5 GAMERS Have Some Great EXCLUSIVES To Look Forward To", "user": null, "vote": 0}]