[{"description": "Roman Sterlingov, the founder of a $400 million crypto-mixing service called Bitcoin Fog, has been convicted of money laundering in a United State District Court on Tuesday. Other charges include money laundering conspiracy, operating an unlicensed money-transmitting business, and violations of the D.C. Money Transmitters Act. CoinTelegraph reports: Sterlingov, however, had argued throughout the trial that he was only a user of the service, and not its operator. His attorney, Tok Ekeland said in a March 12 X post that his team will appeal the verdict. According to evidence presented at the trial, Sterlingov operated Bitcoin Fog from October 2011 to April 2021, which acted as a money laundering service for \"criminals seeking to hide their illicit proceeds from law enforcement.\"\n \nThe service moved over 1.2 million Bitcoin over the decade-long operation -- worth $400 million at the time of the transactions -- with the bulk of cryptocurrency coming from darknet marketplaces tied", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://yro.slashdot.org/story/24/03/13/2112246/bitcoin-fog-crypto-mixer-found-guilty-of-money-laundering-jury-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Bitcoin Fog Crypto Mixer Found Guilty of Money Laundering, Jury Finds", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T23:38:20.722542+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "An anonymous reader quotes a report from Fortune: We are often told that setting the bar high is key to success. After all, if you shoot for the moon and miss, at least you'll land with the stars. But Nvidia's CEO Jensen Huang wants privileged Gen Z grads to lower their expectations. \"People with very high expectations have very low resilience -- and unfortunately, resilience matters in success,\" Huang said during a recent interview with the Stanford Graduate School of Business. \"One of my great advantages is that I have very low expectations.\"\n \nIndeed, as the billionaire boss pointed out, those at elite institutions like Stanford probably have higher expectations for their future than your average Joe. The university is one of the most selective in the United States -- it ranks third best in the country, according to the QS World University Rankings, and the few students who get picked to study there are charged $62,484 in tuition fees for the premium, compared to the avera", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://news.slashdot.org/story/24/03/13/2240229/nvidia-founder-tells-stanford-students-their-high-expectations-may-make-it-hard-for-them-to-succeed?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Nvidia Founder Tells Stanford Students Their High Expectations May Make It Hard For Them To Succeed", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T23:38:19.214038+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Connor Jones reports via The Register: Stanford University says the cybersecurity incident it dealt with last year was indeed ransomware, which it failed to spot for more than four months. Keen readers of El Reg may remember the story breaking toward the end of October 2023 after Akira posted Stanford to its shame site, with the university subsequently issuing a statement simply explaining that it was investigating an incident, avoiding the dreaded R word. Well, surprise, surprise, ransomware was involved, according to a data breach notice sent out to the 27,000 people affected by the attack.\n \nAkira targeted the university's Department of Public Safety (DPS) and this week's filing with the Office of the Maine Attorney General indicates that Stanford became aware of the incident on September 27, more than four months after the initial breach took place. According to Monday's filing, the data breach occurred on May 12 2023 but was only discovered on September 27 of last year, ", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://yro.slashdot.org/story/24/03/13/2053224/stanford-university-failed-to-detect-ransomware-intruders-for-4-months?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Stanford University Failed To Detect Ransomware Intruders For 4 Months", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T22:33:11.983367+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Following the U.S. Supreme Court's decision to end affirmative action in college admissions, there has been increased scrutiny on legacy admissions -- the practice of giving special considerations to the relatives of alumni. Critics say this practice disproportionately benefits white students from wealthy backgrounds. Much of the discussion and research on legacy admissions focuses on Ivy League and other highly selective schools, but these colleges enroll only a small share of students. How widespread is the practice of legacy admissions? Is it common among public colleges? Brookings: In this report, we document the prevalence of legacy admissions, as reported by colleges, across higher education around the time of the SFFA decision. Legacy admissions were more often used at selective and private institutions, but a substantial minority of public and less selective institutions also considered legacy status in admissions. The use of legacy preferences appears to have been mo", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://news.slashdot.org/story/24/03/13/207225/who-uses-legacy-admissions?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Who Uses Legacy Admissions?", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T21:28:16.997920+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "An anonymous reader shares an excerpt from a Wired article: The U.S. economy is showing remarkable health, but in the tech industry, layoffs keep coming. For those out of work, finding a new position can become a full-time job. And in tech -- a sector notoriously always looking for the next hot, new thing -- some people whose days as fresh-faced coders are long gone say that having decades of experience can feel like a disadvantage. Ageism is a longtime problem in the tech industry. Database startup RelevantDB went viral in 2021 after it posted a job listing bragging, \"We hire old people,\" which played off industry stereotypes. In 2020, the US Equal Employment Opportunity Commission found that IBMhad engaged in age discrimination, pushing out older workers to make room for younger ones. (The company has denied engaging in \"systemic age discrimination.\") A recent LinkedIn ad that shows an older woman unfamiliar with tech jargon saying her son sells invisible clouds triggered a", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://tech.slashdot.org/story/24/03/13/2047216/ageism-haunts-some-tech-workers-in-the-race-to-get-hired?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Ageism Haunts Some Tech Workers In the Race To Get Hired", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T21:28:15.486665+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Epic Games, which makes the popular video game \"Fortnite,\" on Wednesday accused Apple of violating an injunction governing its lucrative App Store, and asked a U.S. judge to hold Apple in contempt and end its \"sham\" compliance. From a report: A September 2021 injunction by U.S. District Judge Yvonne Gonzalez Rogers in Oakland, California, let developers provide links and buttons that direct consumers to other means to pay for digital content. \n\nIn a filing with the California court, Epic alleged that Apple is in \"blatant violation\" of that injunction, despite the Cupertino, California-based company's assurance in a Jan. 16 court notice that it had \"fully complied.\" Epic said Apple has imposed new rules and a new 27% fee on developers for some purchases, which taken together make the links \"commercially unusable.\" The Cary, North Carolina-based developer also said Apple continues to \"categorically prohibit\" buttons, and still forbids some apps from telling users they have othe", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://apple.slashdot.org/story/24/03/13/1854220/epic-says-apple-violated-app-store-injunction-seeks-contempt-order?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Epic Says Apple Violated App Store Injunction, Seeks Contempt Order", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T20:23:14.450002+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "For decades, U.S. inventors sent in models with their patent applications -- gizmos that reveal a secret history of unmet needs and relentless innovation. The New Yorker: The ruins of American invention have been recently resurrected in a former textile mill in Wilmington, Delaware. The Henry Clay Mill, now better known as Hagley Museum and Library Visitor Center, is perched on the banks of Brandywine Creek, at the southern edge of a sprawling estate once owned by the du Pont family; just upstream lies the oldest of the dynasty's several stately homes in the region, as well as the remains of the gunpowder works upon which its fortune was built. One morning, Chris Cascio, a curator, welcomed me into the mill, where the space once occupied by cotton-picking and carding machines now houses a curious exhibit: the scavenged remainders of a much larger, long-lost museum. \n\nFrom 1790 to 1880, Cascio explained, the U.S. Patent Office first encouraged and then required an inventor to ", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://yro.slashdot.org/story/24/03/13/1959225/americas-last-top-models?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "America's Last Top Models", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T20:23:12.951544+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Waymo will begin offering a robotaxi service to the public in Los Angeles this week and in Austin by the end of the year, the company's co-CEO Tekedra Mawakana said Wednesday at SXSW. From a report: The Alphabet company has been testing and validating its driverless vehicles across about 43 square miles around downtown, Barton Hills, Riverside, East Austin and Hyde Park neighborhoods. The announcement comes about a week after Waymo started letting its autonomous vehicles traverse Austin without a safety operator behind the wheel, a critical step before the company opens the program up to the public. \n\nOpening up a robotaxi service means the public will be able to hail a ride in a driverless car via the Waymo One app. Importantly, Waymo will be able to charge for those rides. Austin will become the fourth city where Waymo operates a commercial driverless service. Waymo also operates a robotaxi service in Phoenix, San Francisco and soon Los Angeles.<p><div class=\"share_submissi", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://tech.slashdot.org/story/24/03/13/1823251/waymo-to-launch-commercial-robotaxi-service-in-austin-by-end-of-the-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Waymo To Launch Commercial Robotaxi Service in Austin By End of the Year", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T19:18:18.575284+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "You'll soon get to try out OpenAI's buzzy text-to-video generator for yourself. From a report: In an interview with The Wall Street Journal, OpenAI chief technology officer Mira Murati says Sora will be available \"this year\" and that it \"could be a few months.\" OpenAI first showed off Sora, which is capable of generating hyperrealistic scenes based on a text prompt, in February. The company only made the tool available for visual artists, designers, and filmmakers to start, but that didn't stop some Sora-generated videos from making their way onto platforms like X. \n\nIn addition to making the tool available to the public, Murati says OpenAI has plans to \"eventually\" incorporate audio, which has the potential to make the scenes even more realistic. The company also wants to allow users to edit the content in the videos Sora produces, as AI tools don't always create accurate images. \"We're trying to figure out how to use this technology as a tool that people can edit and create", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://slashdot.org/story/24/03/13/1732217/openais-sora-text-to-video-generator-will-be-publicly-available-later-this-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "OpenAI's Sora Text-to-Video Generator Will Be Publicly Available Later This Year", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T18:13:13.371065+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Ethereum has successfully completed a major software upgrade that should make using the blockchain network ecosystem cheaper. The update enables transactions that previously cost $1 on linked Layer 2 networks such as Arbitrum, Polygon, and Coinbase's Base to be executed for just a cent. \n\nThe Dencun upgrade, a combination of the \"Deneb\" and \"Cancun\" portions of the update, introduces a new data storage system for Ethereum. Currently, most Layer 2 blockchains store data on Ethereum, and because this data is stored permanently on every Ethereum node, storage costs often account for around 90% of Layer 2 expenses. These costs are typically passed on to applications, which in turn charge consumers. With Dencun, Layer 2s can now store data in a new type of repository called blobs, which will be cheaper as the data will only be stored for approximately 18 days.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Ethereum+Network+Completes+Cost-", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://tech.slashdot.org/story/24/03/13/189209/ethereum-network-completes-cost-cutting-dencun-software-upgrade?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Ethereum Network Completes Cost-Cutting 'Dencun' Software Upgrade", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T18:13:11.532486+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Rates of more than a dozen cancers are increasing among adults under 50 worldwide, with the number of early-onset cancer cases predicted to rise by around 30% between 2019 and 2030. Investigators are searching for explanations, considering factors such as obesity, early-cancer screening, gut microbiome, and tumor genomes. Despite increased screening and awareness, mortality from early-onset cancers has risen by nearly 28% between 1990 and 2019 globally.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Why+Are+So+Many+Young+People+Getting+Cancer%3F+What+the+Data+Say%3A+https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F03%2F13%2F1559238%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fscience.slashdot.org%2Fstory%2F24%2F03%2F13%2F1559238%2Fwhy-are-so-many-young-people-getting-cancer-what-the-data-sa", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://science.slashdot.org/story/24/03/13/1559238/why-are-so-many-young-people-getting-cancer-what-the-data-say?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Why Are So Many Young People Getting Cancer? What the Data Say", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T17:08:13.533210+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Will Knight, writing for Wired: Goat Simulator 3 is a surreal video game in which players take domesticated ungulates on a series of implausible adventures, sometimes involving jetpacks. That might seem an unlikely venue for the next big leap in artificial intelligence, but Google DeepMind today revealed an AI program capable of learning how to complete tasks in a number of games, including Goat Simulator 3. Most impressively, when the program encounters a game for the first time, it can reliably perform tasks by adapting what it learned from playing other games. The program is called SIMA, for Scalable Instructable Multiworld Agent, and it builds upon recent AI advances that have seen large language models produce remarkably capable chabots like ChatGPT. \n\n[...] DeepMind's latest video game project hints at how AI systems like OpenAI's ChatGPT and Google's Gemini could soon do more than just chat and generate images or video, by taking control of computers and performing com", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://tech.slashdot.org/story/24/03/13/1628218/google-deepminds-latest-ai-agent-learned-to-play-goat-simulator-3?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Google DeepMind's Latest AI Agent Learned To Play Goat Simulator 3", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T17:08:12.021891+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Swedish music streaming company Spotify is rolling out full-length music videos in a limited beta launch for premium subscribers, venturing into an arena that YouTube has dominated for nearly two decades. From a report: Music videos will be available to premium users in the UK, Germany, Italy, Netherlands, Poland, Sweden, Brazil, Colombia, Philippines, Indonesia, and Kenya, in beta starting on Wednesday, the company said, as it attempts to grow its user base. While it aims to reach 1 billion users by 2030, Spotify's new plan faces competition from Apple Music and Alphabet's YouTube, which allows users to watch music videos for free.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Spotify+To+Test+Full+Music+Videos+in+Potential+YouTube+Faceoff%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F03%2F13%2F1417234%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slash", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://news.slashdot.org/story/24/03/13/1417234/spotify-to-test-full-music-videos-in-potential-youtube-faceoff?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "Spotify To Test Full Music Videos in Potential YouTube Faceoff", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T14:58:00.114807+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "European lawmakers approved the world's most comprehensive legislation yet on AI (non-paywalled link), setting out sweeping rules for developers of AI systems and new restrictions on how the technology can be used. From a report: The European Parliament on Wednesday voted to give final approval to the law after reaching a political agreement last December with European Union member states. The rules, which are set to take effect gradually over several years, ban certain AI uses, introduce new transparency rules and require risk assessments for AI systems that are deemed high-risk. The law comes amid a broader global debate about the future of AI and its potential risks and benefits as the technology is increasingly adopted by companies and consumers. Elon Musk recently sued OpenAI and its chief executive Sam Altman for allegedly breaking the company's founding agreement by prioritizing profit over AI's benefits for humanity. Altman has said AI should be developed with great c", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://slashdot.org/story/24/03/13/1439235/european-lawmakers-approve-landmark-ai-legislation?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "European Lawmakers Approve Landmark AI Legislation", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T14:57:58.630359+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "The U.S. House of Representatives overwhelmingly passed a bill on Wednesday that would give TikTok's Chinese owner ByteDance about six months to divest the U.S. assets of the short-video app used by about 170 million Americans or face a ban. From a report: The bill passed 352-65, with bipartisan support, but it faces a more uncertain path in the Senate where some favor a different approach to regulating foreign-owned apps that could pose security concerns. Democratic Senate Majority Leader Chuck Schumer has not indicated how he plans to proceed. \n\nTikTok's fate has become a major issue in Washington. Democratic and Republican lawmakers said their offices had received large volumes of calls from teenaged TikTok users who oppose the legislation, with the volume of complaints at times exceeding the number of calls seeking a ceasefire between Israel and Hamas in Gaza. \n\nThe measure is also the latest in a series of moves in Washington to respond to U.S. national security concerns", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://yro.slashdot.org/story/24/03/13/1448216/us-house-passes-bill-to-force-bytedance-to-divest-tiktok-or-face-ban?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 94, "title": "US House Passes Bill To Force ByteDance To Divest TikTok or Face Ban", "album": "", "page_rating": 94, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T14:57:57.118207+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Jason Rainbow reports via SpaceNews: SpaceX has secured conditional approval to use extremely high-frequency E-band radio waves to improve the capacity of its low Earth orbit Starlink broadband constellation. The Federal Communications Commission said March 8 it is allowing SpaceX to use E-band frequencies between second-generation Starlink satellites and gateways on the ground, alongside already approved spectrum in the Ka and Ku bands. Specifically, SpaceX is now also permitted to communicate between 71 and 76 gigahertz from space to Earth, and 81-86 GHz Earth-to-space, using the up to 7,500 Gen2 satellites SpaceX is allowed to deploy.\n \nSpaceX has plans for 30,000 Gen2 satellites, on top of the 4,400 Gen1 satellites already authorized by the FCC. However, the FCC deferred action in December 2022 on whether to allow SpaceX to deploy the other three-quarters of its Gen2 constellation, which includes spacecraft closer to Earth to improve broadband speeds. The regulator also d", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://mobile.slashdot.org/story/24/03/13/0057239/spacex-gets-e-band-radio-waves-to-boost-starlink-broadband?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 0, "title": "SpaceX Gets E-Band Radio Waves To Boost Starlink Broadband", "album": "", "page_rating": 0, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T10:24:48.569930+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "12P/Pons-Brooks, a Halley-type comet larger than Mount Everest and with a 71.3-year orbit, is expected to become visible to the naked eye in the coming weeks as it makes its closest approach to the sun on April 21. The Guardian reports: While some reports suggest 12P/Pons-Brooks was spotted as far back as the 14th century, it is named after the French astronomer Jean-Louis Pons who discovered it in 1812 and the British-American astronomer William Robert Brooks who observed it on its next orbit in 1883. Thought to have a nucleus about 30km (20 miles) in diameter, it is classed as a cryovolcanic comet, meaning it erupts with dust, gases and ice when pressure builds inside as it is heated. One such outburst last year caused it to brighten a hundredfold and garnered it the sobriquet of \"the Devil Comet\" after the haze that surrounds it formed a horned shape.\n \nWhile the comet -- and its green tinge -- has already been spotted in the night sky, experts say it is expected to become", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://science.slashdot.org/story/24/03/13/0044222/larger-than-everest-comet-could-become-visible-to-naked-eye-this-month?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 0, "title": "'Larger Than Everest' Comet Could Become Visible To Naked Eye This Month", "album": "", "page_rating": 0, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T07:09:05.648229+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "An anonymous reader quotes a report from Inside Climate News: Months in jail and thousands of dollars in fines and legal fees -- those are the consequences Alabamians and Arizonans could soon face for selling cell-cultured meat products that could cut into the profits of ranchers, farmers and meatpackers in each state. State legislators from Florida to Arizona are seeking to ban meat grown from animal cells in labs, citing a \"war on our ranching\" and a need to protect the agriculture industry from efforts to reduce the consumption of animal protein, thereby reducing the high volume of climate-warming methane emissions the sector emits. Agriculture accounts for about 11 percent of the country's greenhouse gas emissions, according to federal data, with livestock such as cattle making up a quarter of those emissions, predominantly from their burps, which release methane -- a potent greenhouse gas that's roughly 80 times more effective at warming the atmosphere than carbon dioxid", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://science.slashdot.org/story/24/03/12/2226224/across-the-nation-lawmakers-aim-to-ban-lab-grown-meat?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 0, "title": "Across the Nation, Lawmakers Aim To Ban Lab-Grown Meat", "album": "", "page_rating": 0, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T03:53:53.662274+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Bill Toulas reports via BleepingComputer: Google awarded $10 million to 632 researchers from 68 countries in 2023 for finding and responsibly reporting security flaws in the company's products and services. Though this is lower than the $12 million Google's Vulnerability Reward Program paid to researchers in 2022, the amount is still significant, showcasing a high level of community participation in Google's security efforts.\n \nThe highest reward for a vulnerability report in 2023 was $113,337, while the total tally since the program's launch in 2010 has reached $59 million. For Android, the world's most popular and widely used mobile operating system, the program awarded over $3.4 million. Google also increased the maximum reward amount for critical vulnerabilities concerning Android to $15,000, driving increased community reports. During security conferences like ESCAL8 and hardwea.io, Google awarded $70,000 for 20 critical discoveries in Wear OS and Android Automotive OS a", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://it.slashdot.org/story/24/03/12/2246256/google-paid-10-million-in-bug-bounty-rewards-last-year?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 0, "title": "Google Paid $10 Million In Bug Bounty Rewards Last Year", "album": "", "page_rating": 0, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T02:49:00.119468+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "According to Bloomberg (paywalled), the Pentagon has reportedly scrapped its plan to allocate $2.5 billion in grants to Intel, causing the firm's stock to slip in extended-hours trading. From a report: The decision now leaves the U.S. Commerce Department, which is responsible for doling out the funds from the U.S. CHIPs and Science Act, to make up the shortfall, the news outlet said. The Commerce Dept. was initially only supposed to cover $1B of the $3.5B that Intel is slated to receive for advanced defense and intelligence-related semiconductors. The deal is slated to position Intel as the dedicated supplier for processors used for military and intelligence applications and could result in a Secure Enclave inside Intel's chip factory, the news outlet said. With the Pentagon reportedly pulling out, it could alter how much Intel and other companies receive from the CHIPs Act, the news outlet said.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/ho", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://hardware.slashdot.org/story/24/03/12/226209/pentagon-scraps-25-billion-grant-to-intel?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 0, "title": "Pentagon Scraps $2.5 Billion Grant To Intel", "album": "", "page_rating": 0, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T01:43:55.455682+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "Two top executives from the crypto exchange Binance have been arrested in Nigeria for allegedly destabilizing the national currency. Quartz reports: According to a Wall Street Journal report, Tigran Gambaryan, head of financial-crime compliance at Binance who previously worked at the U.S. Internal Revenue Service (IRS), and Nadeem Anjarwalla, a British-Kenyan national and Binance's regional manager for Africa, have been held against their will for the past two weeks in the country. As per reports, Nigerian government officials invited Binance executives to discuss an ongoing dispute about the world's largest crypto exchange allegedly driving down the value of their national currency. Gambaryan and Anjarwalla arrived in Nigeria on February 25th; after their meeting with government officials, both were taken to their hotels. Later, they were instructed to pack their belongings and move to a guesthouse run by Nigeria's National Security Agency, as stated by their families, per r", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://slashdot.org/story/24/03/12/2217207/binance-executives-were-arrested-in-nigeria-for-allegedly-destabilizing-its-currency?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 0, "title": "Binance Executives Were Arrested In Nigeria For Allegedly Destabilizing Its Currency", "album": "", "page_rating": 0, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T01:43:53.968071+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}, {"description": "An anonymous reader quotes a report from Wired: Arkady Volozh, the billionaire cofounder of Russia's biggest internet company, was removed from the EU sanctions list today, clearing the way for his return to the world of international tech. On Tuesday a spokesperson for the European Council confirmed to WIRED that the Yandex cofounder was among three people whose sanctions were lifted this week. Volozh, 60, was initially included on the EU sanctions list in June 2023, following Russia's full-scale invasion of Ukraine in February 2022. \"Volozh is a leading businessperson involved in economic sectors providing a substantial source of revenue to the Government of the Russian Federation,\" the blocsaidlast year to justify its decision. \"As founder and CEO of Yandex, he is supporting, materially or financially, the Government of the Russian Federation.\" In response, Volozh stepped down from his position as Yandex CEO, calling the sanctions \"misguided.\" [...]\n \nThe removal of sancti", "thumbnail": null, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "link": "https://slashdot.org/story/24/03/12/2157247/europe-lifts-sanctions-on-yandex-cofounder-arkady-volozh?utm_source=rss1.0mainlinkanon&utm_medium=feed", "permanent": false, "page_rating_contents": 0, "title": "Europe Lifts Sanctions On Yandex Cofounder Arkady Volozh", "album": "", "page_rating": 0, "language": "en-us", "page_rating_visits": 0, "tags": [], "date_published": "2024-03-13T00:38:47.423987+00:00", "user": null, "vote": 0, "artist": "help@slashdot.org", "dead": false, "comments": [], "bookmarked": false, "age": null, "source_obj__id": 306, "page_rating_votes": 0}]