[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T19:58:59.344000+00:00", "description": "The number of tornadoes so far in the United States this year is just above average. But their distribution is changing. From a report: Tornadoes tend to travel in packs these days, often with a dozen or more forming in the same region on the same day. On the worst days, hundreds can form at once. More than a dozen tornadoes were reported on both Monday and Tuesday this week across the Great Plains and the Midwest, according to the Storm Prediction Center run by the National Oceanic and Atmospheric Administration. Two weeks ago, on the most active day in April, 105 tornadoes were reported. While outbreaks like these have always happened, they have become more common in recent decades. \n\nThe total number of tornadoes in the United States each year has stayed relatively consistent over the last several decades, but they now happen in more concentrated bursts over fewer days during the year. In the 1950s through the 1970s, on average about 69 percent of tornadoes in the United States hap", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/10/1747239/tornadoes-are-coming-in-bunches-scientists-are-trying-to-figure-out-why?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Tornadoes Are Coming in Bunches. Scientists Are Trying To Figure Out Why.", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T18:54:20.696249+00:00", "description": "The head of the world's biggest advertising group was the target of an elaborate deepfake scam that involved an AI voice clone. From a report: The CEO of WPP, Mark Read, detailed the attempted fraud in a recent email to leadership, warning others at the company to look out for calls claiming to be from top executives. Fraudsters created a WhatsApp account with a publicly available image of Read and used it to set up a Microsoft Teams meeting that appeared to be with him and another senior WPP executive, according to the email obtained by the Guardian. \n\nDuring the meeting, the impostors deployed a voice clone of the executive as well as YouTube footage of them. The scammers impersonated Read off-camera using the meeting's chat window. The scam, which was unsuccessful, targeted an \"agency leader,\" asking them to set up a new business in an attempt to solicit money and personal details. \"Fortunately the attackers were not successful,\" Read wrote in the email. \"We all need to be vigilant", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/10/1725235/ceo-of-worlds-biggest-ad-firm-targeted-by-deepfake-scam?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "CEO of World's Biggest Ad Firm Targeted By Deepfake Scam", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T18:54:19.212063+00:00", "description": "Apple's plans for AI on the iPhone could bring real-time transcription to its Voice Memos and Notes apps, according to a report from AppleInsider. The Verge: The new feature is expected to arrive with iOS 18 and will reportedly let you see a running transcription of your audio recordings in either app. While Notes currently doesn't let you record audio, a separate rumor from AppleInsider suggests Apple plans on adding this capability in iOS 18 as well. Audio transcription in either app sounds especially handy for students or journalists, who can save time transcribing a lengthy lecture or interview. It should also be helpful for anyone who just wants to take a quick look at their Voice Memos without having to listen to their recordings. As for Notes, Apple reportedly plans to go beyond transcriptions by adding AI-powered summaries.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Apple+Might+Bring+AI+Transcription+To+Voice+Memos+and+Notes%3A+ht", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/10/1740214/apple-might-bring-ai-transcription-to-voice-memos-and-notes?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Might Bring AI Transcription To Voice Memos and Notes", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T17:48:31.528697+00:00", "description": "Electronic Arts CEO Andrew Wilson confirmed the company is considering putting ads in traditional AAA games, which players purchase for around $70 apiece. During EA's latest earnings call, Wilson said, \"Advertising has an opportunity to be a meaningful driver of growth for us,\" and that teams are looking at how to thoughtfully implement ads within game experiences. \n\nIn-game advertising is not new, with the first recorded instance dating back to 1978. As the gaming industry is expected to grow to $583 billion by 2030, in-game ads are seen as a natural progression. However, player reception depends on the placement and unobtrusiveness of the ads. EA has faced backlash in the past for poorly placed ads, such as full-screen promotions for a TV show in UFC 4, which disrupted gameplay. The company has been experimenting with dynamic ads since 2006, with titles like Need for Speed Carbon and Battlefield 2142 among the first to feature them.<p><div class=\"share_submission\">\n<a class=\"slashpo", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/10/1720238/ea-weighs-putting-in-game-ads-in-aaa-games?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "EA Weighs Putting In-game Ads in AAA Games", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T16:45:39.162591+00:00", "description": "The U.K. economy has emerged from recession as gross domestic product rose 0.6% in the first quarter, official figures showed Friday, beating expectations. From a report: Economists polled by Reuters had forecast growth of 0.4% on the previous three months of the year. The U.K. entered a shallow recession in the second half of 2023, as persistent inflation continued to hurt the economy. \n\nAlthough there is no official definition of a recession, two straight quarters of negative growth is widely considered a technical recession. The U.K.'s production sector expanded by 0.8% in the period from January to March, while construction fell by 0.9%. On a monthly basis, the economy grew by 0.4% in March, following 0.2% expansion in February. In output terms, the services sector -- crucial to the U.K. economy -- grew for the first time since the first quarter in 2023, the Office for National Statistics said. The 0.7% growth was mainly driven by the transport services industry which saw its high", "language": "en-us", "link": "https://news.slashdot.org/story/24/05/10/1551209/uk-economy-emerges-from-recession?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "UK Economy Emerges From Recession", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T16:45:37.301944+00:00", "description": "An anonymous reader shares a report: Japan's Ministry of Finance spent nearly $50 billion on April 29 and May 1 trying to prop up the value of the currency by selling US dollars and buying yen. Who was on the other side of this trade? Data from Deutsche Bank's foreign exchange trading platform suggests: literally everyone. \"Nearly all client categories saw record USD/JPY buying during the assumed intervention days,\" writes George Saravelos, global head of FX research at the German bank, in a note to clients on Thursday. \n\n\"That absorption of USD/JPY selling from the Japanese Ministry of Finance was so broad-based continues to point to the lack of effectiveness of this policy.\" The Japanese yen is the weakest G10 currency in trading on Thursday, deepening its decline relative to the US dollar to nearly 10% so far this year. Very low rates in Japan increase the appeal of holding other currencies where investors can earn more interest. Strategists have warned that action from the Bank of", "language": "en-us", "link": "https://slashdot.org/story/24/05/10/1632231/japan-is-fighting-against-the-entire-investing-world-in-the-currency-market?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Japan is Fighting Against the Entire Investing World in the Currency Market", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T15:40:38.933498+00:00", "description": "Economist: What is the ideal job to outsource to AI? Today's AIs, in particular the Chatgpt-like generative sort, have a leaky memory, cannot handle physical objects and are worse than humans at interacting with humans. Where they excel is in manipulating numbers and symbols, especially within well-defined tasks such as writing bits of computer code. This happens to be the forte of giant existing outsourcing businesses -- India's information-technology companies. Seven of them, including the two biggest, Tata Consultancy Services (TCS) and Infosys, collectively laid off 75,000 employees last year. The firms say this reduction, equivalent to about 4% of their combined workforce, has nothing to do with ai and reflects the broader slowdown in the tech sector. In reality, they say, ai is an opportunity, not a threat. \n\nBusiness services are critical to India's economy. The sector employs 5m people, or less than 1% of Indian workers, but contributes 7% of GDP and nearly a quarter of total ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/10/1442244/will-chatbots-eat-indias-it-industry?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Will Chatbots Eat India's IT Industry?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T15:40:36.903978+00:00", "description": "The U.S. FBI is working towards charging hackers from the aggressive Scattered Spider criminal gang who are largely based in the U.S. and western countries and have breached dozens of American organisations, a senior official said. From a report: The young hackers grabbed headlines last year when they broke into the systems of casino-operators MGM Resorts International and Caesars Entertainment locking up the companies' systems and demanding hefty ransom payments. From health and telecom companies to financial services, they have hacked a range of organisations over two years, piling pressure on law enforcement agencies to thwart them. \n\n\"We are working towards charging individuals where we can with criminal conduct, in this case, largely around the Computer Fraud and Abuse Act,\" Brett Leatherman, the FBI's cyber deputy assistant director, told Reuters in an interview. The group was a rare alliance of hackers in Western countries with veteran cybercriminals from eastern Europe, he sai", "language": "en-us", "link": "https://it.slashdot.org/story/24/05/10/1522256/fbi-working-towards-nabbing-scattered-spider-hackers-official-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "FBI Working Towards Nabbing Scattered Spider Hackers, Official Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T14:36:11.574999+00:00", "description": "An anonymous reader shares a report: Disney Plus, Hulu, and Max are teaming up for a new bundle this summer, Netflix is focused on the WWE and celebrity boxing, Disney Plus is getting ESPN, and Bloomberg reported earlier this week that Max could get a price hike. A familiar refrain emerged around all this news: streaming is becoming cable TV all over again and getting crummier in the process. \n\nAnd it's true! When streaming first emerged, it was a beautiful alternative to piracy, which was very convenient and very illegal, and cable, which was festooned with ads and weighed down by channels you were paying for and didn't want. Streaming gave you a world of content on demand for a fraction of the cost of cable. But that experience was never sustainable. Content costs money to make, and companies are apparently obligated to \"increase revenue\" and \"make profit.\" This means Netflix spending billions of dollars a year on content isn't necessarily sustainable unless it's adding new users an", "language": "en-us", "link": "https://entertainment.slashdot.org/story/24/05/10/1357258/streaming-is-cable-now?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Streaming is Cable Now", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T13:31:11.190511+00:00", "description": "An anonymous reader quotes a report from Interesting Engineering: Imagine exploring the intricate world within a single cubic millimeter of human brain tissue. It might seem insignificant, but within that tiny space lies a universe of complexity -- 57,000 individual cells, 230 millimeters of blood vessels, and a staggering 150 million synapses, the junctions where neurons communicate. All this information translates to a mind-boggling 1,400 terabytes of data. That's the kind of groundbreaking achievement researchers from Harvard and Google have just accomplished.\n \nLeading the charge at Harvard is Professor Jeff Lichtman, a renowned expert in brain structure. Partnering with Google AI, Lichtman's team has co-created the most detailed 3D reconstruction of a human brain fragment to date. This intricate map, published in Science, offers an unprecedented view of the human temporal cortex, the region responsible for memory and other higher functions. Envision a piece of brain tissue roughl", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/10/0110234/the-most-detailed-3d-reconstruction-of-human-brain-tissue?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "The Most Detailed 3D Reconstruction of Human Brain Tissue", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T08:05:19.289069+00:00", "description": "Last week, NASA announced it is working with a technology development company on a new propulsion system that could transport humans to Mars in only two months -- down from the current nine month journey required to reach the Red Planet. Gizmodo reports: NASA's Innovative Advanced Concepts (NIAC) program recently selected six promising projects for additional funding and development, allowing them to graduate to the second stage of development. The new \"science fiction-like concepts,\" as described by John Nelson, NIAC program executive at NASA, include a lunar railway system and fluid-based telescopes, as well as a pulsed plasma rocket.\n \nThe potentially groundbreaking propulsion system is being developed by Arizona-based Howe Industries. To reach high velocities within a shorter period of time, the pulsed plasma rocket would use nuclear fission -- the release of energy from atoms splitting apart -- to generate packets of plasma for thrust. It would essentially produce a controlled je", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/09/2152221/nasas-proposed-plasma-rocket-would-get-us-to-mars-in-2-months?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA's Proposed Plasma Rocket Would Get Us to Mars in 2 Months", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T05:55:11.367269+00:00", "description": "Apple has apologized for its tone-deaf \"Crush!\" ad that sparked a furious backlash with artists, musicians and other creators. AdAge reports that Apple said the video \"missed the mark\" and has scrapped plans to run the cutesy-turned-cringey commercial on TV. From a report: It's clear that Apple intended for the ad to serve as a metaphor for all the myriad creative tools one has when they throw down $1,000 or more for a new iPad Pro. Run during Tuesday's event, the video shows a series of musical instruments and other tools for human expression, including a guitar, drums, trumpet, amplifiers, record player, TV and much more. \"All I Ever Need Is You\" by Sonny &amp; Cher soundtracks the clip. \n\nSoon, it's revealed that the objects are all sitting on an industrial crusher, which descends upon the scattered creative instruments, exploding in plumes of satisfyingly colorful smoke. But when the crusher pulls back up, we see that everything was transformed into a shiny new iPad Pro.<p><div cl", "language": "en-us", "link": "https://apple.slashdot.org/story/24/05/10/0448231/apple-apologizes-for-tone-deaf-ad-that-crushed-human-creativity-to-make-an-ipad?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple Apologizes For Tone-Deaf Ad That Crushed Human Creativity To Make an iPad", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T03:45:06.535535+00:00", "description": "An anonymous reader quotes a report from The Hill: Tens of millions of Americans each day breathe in carcinogenic chemicals that are woven into the interiors of their cars, a new study has found. While opening a window can help reduce the risk, only reforms can keep people safe, researchers wrote in a study in Environmental Science and Technology. Approximately 124 million Americans commute each day, spending an average of an hour in their cars. By federal law, the interior of these vehicles are required to contain flame retardants, or chemicals that make it harder for them to combust in a crash. These chemicals have been a legally mandated part of modern cars since the 1970s, when the National Highway Traffic Safety Administration (NHTSA) passed a law requiring their use.\n \nIt's arguable how effective this protection is. Patrick Morrison, of the International Association of Firefighters, said in a statement on the study that these chemicals do little to prevent blazes -- but instead ", "language": "en-us", "link": "https://tech.slashdot.org/story/24/05/09/2142259/chemicals-in-car-interiors-may-cause-cancer-and-theyre-required-by-us-law?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Chemicals In Car Interiors May Cause Cancer, and They're Required By US Law", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T01:35:01.858124+00:00", "description": "During a Bloomberg event today, Xbox president Sarah Bond said the company plans to launch a mobile gaming store to rival Apple and Google. \"According to Bond, the as-yet-unnamed store will launch in July on web browsers, rather than a designated app, with Microsoft's recently-acquired Candy Crush Saga serving as a day-one tentpole franchise,\" reports GeekWire. From the report: Microsoft's entry into the mobile gaming market -- the most lucrative arm of the games industry -- has been anticipated, particularly since the company's recent $69 billion acquisition of California-based mega-developer Activision Blizzard King. In November, Xbox head Phil Spencer that the company was \"talking to other partners\" to potentially launch a mobile store.\n \nThe move sets the stage for a new competition between Microsoft and both Google and Apple, since most mobile games are sold and downloaded through their respective app stores. Bond told Bloomberg that the new Microsoft mobile store \"goes truly acr", "language": "en-us", "link": "https://games.slashdot.org/story/24/05/10/0055200/microsoft-is-launching-a-mobile-game-store?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Is Launching a Mobile Game Store", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T00:31:48.981766+00:00", "description": "Ancient Slashdot reader jd shares a report from The Guardian: Neuralink's first attempt at implanting its chip in a human being's skull hit an unexpected setback after the device began to detach from the patient's brain, the company revealed on Wednesday. The patient, Noland Arbaugh, underwent surgery in February to attach a Neuralink chip to his brain, but the device's functionality began to decrease within the month after his implant. Some of the device's threads, which connect the miniature computer to the brain, had begun to retract. Neuralink did not disclose why the device partly retracted from Arbaugh's brain, but stated in a blog post that its engineers had refined the implant and restored functionality.\n \nThe decreased capabilities did not appear to endanger Arbaugh, and he could still use the implant to play a game of chess on a computer using his thoughts, according to the Wall Street Journal, which first broke the news of the issue with the chip. The possibility of removin", "language": "en-us", "link": "https://science.slashdot.org/story/24/05/09/2133246/neuralinks-first-implant-partly-detached-from-patients-brain?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Neuralink's First Implant Partly Detached From Patient's Brain", "user": null, "vote": 0}]