[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T18:45:00+00:00", "description": "As the long-awaited mainline sequel in the sci-fi RTS series, Homeworld 3 is finally upon us. While offering exceptional production values, including sharp visuals, there's enough strategic depth to satisfy long-standing fans of the series.\n\nThankfully, Homeworld 3 brings some new elements to the franchise, from cover mechanics and derelict structures that require their use to new tactics. While some mechanics, like the new ship abilities, can tend to overcomplicate encounters. Some additional polish is also welcome when it comes to unit pathfinding and specific bugs.\n\nNevertheless, if you're looking for a solid sci-fi RTS with a strong campaign and some interesting new modes like the rogue-like War Games, Homeworld 3 is worth a look.", "language": null, "link": "https://www.youtube.com/watch?v=Gs2zlVv4w_E", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/Gs2zlVv4w_E/hqdefault.jpg", "title": "Homeworld 3 Review - Was It Worth Waiting For 21 Years?", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T16:30:02+00:00", "description": "Art is subjective in nature, and video games being a form of art - their public reception can’t always be unanimously positive or negative. There have been many times when games have received polarizing reviews from fans, with some absolutely loving the experience while others expressing feelings of dislike and frustration. \n\nThese feelings can arise from a multitude of reasons ranging from radical changes to a franchise’s identity to gameplay mechanics or even certain narrative choices among others. \n\nOver the years, we have seen plenty of such instances where highly anticipated games ended up being divisive releases that continue to be a major point of contention between fans. To that end, we present 30 of the biggest divisive games of all time.", "language": null, "link": "https://www.youtube.com/watch?v=CnDA5SGcf8M", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/CnDA5SGcf8M/hqdefault.jpg", "title": "30 Games That DIVIDED PLAYERS", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-10T09:45:04+00:00", "description": "Appetite for Fallout is at an all-time high given the whirlwind success of Prime Video’s TV adaption, a show which has amassed an audience of 65 million. Understandably, players have flocked towards the games, with Bethesda reckoning they’ve seen an influx of 5 million to their post-apocalyptic RPG series. \n\nFallout 4 is currently the cream of the crop but given rumors circulating since less than a year ago of Fallout 3’s remaster, attention is starting to turn to Bethesda’s radically re-worked RPG from isometric role player to open world FPS. As much as Fallout 3 is loved by those who’ve played it, there’re plenty of imperfections. This video will explore the reasons why Fallout 3 is so revered and argue that it should be remade rather than simply remastered.", "language": null, "link": "https://www.youtube.com/watch?v=ta1dju1xBBw", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/ta1dju1xBBw/hqdefault.jpg", "title": "Why Fallout 3 Should Be REMADE Instead of A Mere Remaster", "user": null, "vote": 0}]