[
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T23:08:50.488220+00:00",
        "description": "America's next president \"announced Wednesday he has selected Jared Isaacman, a billionaire businessman and space enthusiast who twice flew to orbit with SpaceX, to become the next NASA administrator,\" reports Ars Technica:\n\n\nIn a post on X, Isaacman said he was \"honored\" to receive Trump's nomination. \"Having been fortunate to see our amazing planet from space, I am passionate about America leading the most incredible adventure in human history,\" Isaacman wrote. \"On my last mission to space, my crew and I traveled farther from Earth than anyone in over half a century. I can confidently say this second space age has only just begun....\" \n\n\"Jared Isaacman will be an outstanding NASA Administrator and leader of the NASA family,\" said Jim Bridenstine, who led NASA as administrator during Trump's first term in the White House. \"Jared's vision for pushing boundaries, paired with his proven track record of success in private industry, positions him as an ideal candidate to lead NASA into a",
        "id": 1645541,
        "language": null,
        "link": "https://science.slashdot.org/story/24/12/04/2148204/americas-next-nasa-administrator-may-be-former-spacex-astronaut-jared-isaacman?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "America's Next NASA Administrator May Be Former SpaceX Astronaut Jared Isaacman",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T22:03:49.681878+00:00",
        "description": "\"$15.8 million every 60 seconds. That's how much US consumers spent in two hours on Monday night,\" reports CNN, \"capping off a five-day spending spree that smashed previous records.\"\n\n\nU.S. consumers spent a total of $13.3 billion on Cyber Monday, up 7.3% from the previous year, according to Adobe Analytics... Consumers spent a record $41.1 billion across the five days beginning Thanksgiving Day, according to Adobe. \"While Cyber Monday remained the season's and year's biggest online shopping day, year-over-year growth was stronger on both Thanksgiving and Black Friday,\" Vivek Pandya, lead analyst at Adobe Digital Insights, said in a statement... The company's data projects that holiday spending from November 1 to December 31 will surpass $240 billion, up 8.4% from the previous year. \n\nThe record sales on Cyber Monday were boosted by US consumers shopping on their mobile devices, which accounted for $7.6 billion in spending. This year, 57% of online sales came through a mobile device,",
        "id": 1645177,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/24/12/04/2037252/monday-americans-spent-133-billion-in-biggest-cyber-monday-ever?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Monday Americans Spent $13.3 Billion in Biggest Cyber Monday Ever",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T20:58:46.570500+00:00",
        "description": "Have you been to Enron.com lately? \n\"It's the comeback story no one asked for,\" reports CNN, \"the resurrection of a brand so toxic it remains synonymous with corporate fraud more than two decades after it collapsed in bankruptcy. \n\n\"That's right, folks: Enron is back. But only kind of.\"\n\n\n\nTL;DR: A company that makes T-shirts bought the Enron trademark and appears to be trying to sell some merch on behalf of the guy behind the satirical conspiracy theory \"Birds Aren't Real....\" \n\n\n\nOn Monday, the 23rd anniversary of Enron's filing for bankruptcy, rumors began to spread that the former Texas energy giant had come back from the dead. A sleek new website, enron.com, appeared to show that the company had done some serious soul-searching and, inexplicably, reincorporated under its original brand. As a modern energy company, it would be dedicated to \"solving the global energy crisis,\" its press statement reads. The site is packed with the kind of stock art and benign corporate platitudes t",
        "id": 1644739,
        "language": null,
        "link": "https://idle.slashdot.org/story/24/12/04/1924209/enron-has-been-resurrected-in-what-appears-to-be-an-elaborate-joke?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Enron has Been Resurrected in What Appears to Be an Elaborate Joke",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T19:54:45.608906+00:00",
        "description": "59-year-old Alex Mashinsky, the founder/former CEO of cryptocurrency lender Celsius Network, \"pleaded guilty on Tuesday to two counts of fraud,\" reports Reuters. \n\nHe'd been indicted in July on seven counts of fraud, conspiracy and market manipulation charges, according to the article, and federal prosecutors in Manhattan \"said he misled customers of Celsius to persuade them to invest, and artificially inflated the value of his company's proprietary crypto token.\"\n\nOn Tuesday, during a hearing before U.S. District Judge John Koeltl, Mashinsky said he pleaded guilty to two out of the seven counts he was initially charged with: commodities fraud, and a fraudulent scheme to manipulate the price of CEL, Celsius' in-house token. In court, Mashinsky admitted to giving Celsius customers \"false comfort\" by giving an interview in 2021 in which he said Celsius had received approval from regulators for its \"Earn\" program, which it had not. That program offered to deploy customers' cryptocurrenc",
        "id": 1644303,
        "language": null,
        "link": "https://yro.slashdot.org/story/24/12/04/185235/founder-of-cryptocurrency-lender-celsius-network-pleads-guilty-to-fraud?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Founder of Cryptocurrency Lender 'Celsius Network' Pleads Guilty to Fraud",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T18:48:38.387987+00:00",
        "description": "A ransomware attack on the multinational Stoli Group in August helped push two of the vodka-maker's U.S. subsidiaries into bankruptcy, according to the company's CEO. From a report: In a Texas bankruptcy court filing on November 29, CEO Chris Caldwell attributed a range of external factors to the financial woes of Stoli Group USA and Kentucky Owl (KO) -- which are facing $84 million in debt. But one of the most prominent was a ransomware attack this year that damaged the parent company's IT system. \n\n\"In August 2024, the Stoli Group's IT infrastructure suffered severe disruption in the wake of a data breach and ransomware attack,\" Caldwell said in the filing. \"The attack caused substantial operational issues throughout all companies within the Stoli Group, including Stoli USA and KO, due to the Stoli Group's enterprise resource planning (ERP) system being disabled and most of the Stoli Group's internal processes (including accounting functions) being forced into a manual entry mode.\"",
        "id": 1643839,
        "language": null,
        "link": "https://it.slashdot.org/story/24/12/04/0037242/vodka-maker-stoli-says-august-ransomware-attack-contributed-to-bankruptcy-filing?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Vodka Maker Stoli Says August Ransomware Attack Contributed To Bankruptcy Filing",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T17:44:04.646847+00:00",
        "description": "Hyundai \"just had its best sales month ever in the U.S.,\" reports Electrek\n\n\nHyundai's impressive EV lineup is charging up demand, with its best-selling Hyundai IONIQ 5 SUV also setting a new U.S. record after sales more than doubled in November. With 76,008 vehicles sold in November, Hyundai's record-breaking U.S. sales streak is not slowing down. Hyundai Motor America CEO Randy Parker credited the growing demand for EVs and hybrid vehicles to the growth. \nHyundai's EV sales rose 77% from last year, while hybrid sales surged 104%. Electrified retail sales (EV, PHEV, and hybrid models) climbed 92% in total last month. Several vehicles, including the Santa Fe HEV, Tucson PHEV, Tucson HEV, and IONIQ 5, had their best-ever sales month. \n\nThe article also notes increasing sales for Hyundai's electric SUV, the IONIQ 5. Starting at $43,975 &mdash; and recently upgraded to a range of 245 miles (or 318 miles for the $46,550 extended-range model) &mdash; it features an NACS port for accessing",
        "id": 1643298,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/04/0515221/hyundai-has-best-month-ever-in-us-electric-suv-sales-suddenly-double?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Hyundai Has Best Month Ever in U.S.  Electric SUV Sales Suddenly Double",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T17:44:04.366543+00:00",
        "description": "Meta is using OpenAI's GPT-4 alongside its own Llama AI model in Metamate, an internal coding assistance tool, Fortune reported Tuesday. The dual-model approach has been in place since early 2024, despite CEO Mark Zuckerberg's public promotion of Llama as a leading AI model. \n\nMetamate, previously known as Code Compose, serves Meta's developers and employees with coding support. The Chan Zuckerberg Initiative, Zuckerberg's philanthropic organization, is separately developing an educational AI tool using OpenAI's technology, with OpenAI CEO Sam Altman joining CZI's AI advisory board.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Meta+Using+OpenAI's+GPT-4+in+Internal+Coding+Tool+Despite+Llama+Push%3A+https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F24%2F12%2F04%2F0033227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.",
        "id": 1643297,
        "language": null,
        "link": "https://developers.slashdot.org/story/24/12/04/0033227/meta-using-openais-gpt-4-in-internal-coding-tool-despite-llama-push?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Using OpenAI's GPT-4 in Internal Coding Tool Despite Llama Push",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T16:38:36.971372+00:00",
        "description": "The long-running Advent of Code site just entered its 10th year, with 162,809 people completing both of its Day One puzzles (which involve a hunt for the missing historian of the North Pole).\n\nBut its not the only site offering Christmas-themed programming puzzles:\n\n\nHundreds of SQL lovers are trying the daily challenges from the \"Advent of SQL\" site.\n\nYou can sign up for daily emails with webdev challenges from the Advent of JavaScript and Advent of CSS sites. \nThe \"Advent of No-Code\" site challenges you to build something new every day using no-code tools like AI-powered dev environments or the social coding site Val Town.\n TryHackMe.com is publishing \"beginner-friendly, daily gamified cyber security challenges\" in an event they're calling the \"Advent of Cyber.\"\n\nAnd Norway's biggest chess club (founded by world champion Magnus Carlsen) has even launched a site with daily chess puzzles called &mdash; what else? &mdash; Advent of Chess. (It promises at the end of the event someone w",
        "id": 1642785,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/24/12/04/0132245/2024s-geek-advent-calendars-offer-challenges---and-a-magnus-carlsen-signed-chessboard?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "2024's Geek 'Advent Calendar's Offer Challenges - and a Magnus Carlsen-Signed Chessboard",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T13:23:38.671855+00:00",
        "description": "Tuesday the Wikimedia Foundation released its annual list of the most-visited Wikipedia pages. (Scroll down to where it says \"The full top 25\"...) \n\nBut while the top subjects seem to be politics and pop culture, CNN reports that in the end \"a list of deaths in 2024 was the most visited page, garnering over 44 million views.\"\n\n A page about deaths in a given year has ranked at the top of the list five times since 2015, when the Wikimedia Foundation began releasing the data. The topic has never fallen below third place on the list. \nPeople also searched for U.S. political figures... [The #2, #3, #5, #7, and #9 most-visited pages were, respectively, for Kamala Harris, the 2024 United States presidential election, Donald Trump, J.D. Vance, and Project 2025.] While U.S. politics was a notable search subject, popular culture had the largest share of the top 25. The fourth most-visited page was about Lyle and Erik Menendez, the brothers who were sentenced to life in prison for the 1989 mur",
        "id": 1641276,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/04/0648205/wikipedia-announces-the-most-popular-articles-of-2024?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Wikipedia Announces the Most Popular Articles of 2024",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T12:18:28.211733+00:00",
        "description": "A handful of countries should be held legally responsible for the ongoing impacts of climate change, representatives of vulnerable states have told judges at the international court of justice (ICJ). From a report: During a hearing at the Peace Palace in The Hague, which began on Monday, Ralph Regenvanu, Vanuatu's special envoy for climate change and environment, said responsibility for the climate crisis lay squarely with \"a handful of readily identifiable states\" that had produced the vast majority of greenhouse gas emissions but stood to lose the least from the impacts. \n\nThe court heard how Pacific island states such as Vanuatu were bearing the brunt of rising sea levels and increasingly frequent and severe disasters. \"We find ourselves on the frontlines of a crisis we did not create,\" Regenvanu said. The hearing is the culmination of years of campaigning by a group of Pacific island law students and diplomacy spearheaded by Vanuatu. In March last year the UN general assembly una",
        "id": 1640888,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/04/0047257/handful-of-countries-responsible-for-climate-crisis-top-court-told?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Handful of Countries Responsible For Climate Crisis, Top Court Told",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T09:03:18.047993+00:00",
        "description": "An anonymous reader shared this report from NBC News:\n\nAmid an unprecedented cyberattack on telecommunications companies such as AT&amp;T and Verizon, U.S. officials have recommended that Americans use encrypted messaging apps to ensure their communications stay hidden from foreign hackers... \n\nIn the call Tuesday, two officials &mdash; a senior FBI official who asked not to be named and Jeff Greene, executive assistant director for cybersecurity at the Cybersecurity and Infrastructure Security Agency &mdash; both recommended using encrypted messaging apps to Americans who want to minimize the chances of China's intercepting their communications. \"Our suggestion, what we have told folks internally, is not new here: Encryption is your friend, whether it's on text messaging or if you have the capacity to use encrypted voice communication. Even if the adversary is able to intercept the data, if it is encrypted, it will make it impossible,\" Greene said. The FBI official said, \"People loo",
        "id": 1639918,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/04/0550254/us-officials-urge-americans-to-use-encrypted-apps-amid-unprecedented-cyberattack?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "US Officials Urge Americans to Use Encrypted Apps Amid Unprecedented Cyberattack",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T07:58:07.848563+00:00",
        "description": "The Department of Government Efficiency, headed by Elon Musk and Vivek Ramaswamy, appears to be signaling its intention to tackle daylight saving time. Musk has indicated support for ending biannual clock changes in recent days on his social media platform X, sharing a poll showing majority opposition to the practice. \n\nDOGE co-head Ramaswamy also backed the stance, calling time changes \"inefficient and easy to change.\" \n\nThe initiative follows a failed 2022 legislative attempt, the Sunshine Protection Act, which passed the Senate but stalled in the House. The Department of Transportation, which oversees time changes, cannot alter the system without congressional action. \n\nPublic sentiment appears to favor reform, with a 2022 YouGov poll showing two-thirds of Americans support ending time changes. Studies have linked the switches to increased rates of heart attacks and traffic accidents, while JPMorgan Chase research found the return to standard time reduces consumer spending by up t",
        "id": 1639714,
        "language": null,
        "link": "https://news.slashdot.org/story/24/12/04/0352238/musk-signals-fresh-push-to-end-us-daylight-saving-time?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Musk Signals Fresh Push To End US Daylight Saving Time",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T05:48:00.096958+00:00",
        "description": "An anonymous reader shares a report: Meta is mistakenly removing too much content across its apps, according to a top executive. Nick Clegg, Meta's president of global affairs, told reporters on Monday that the company's moderation \"error rates are still too high\" and pledged to \"improve the precision and accuracy with which we act on our rules.\" \n\n\"We know that when enforcing our policies, our error rates are still too high, which gets in the way of the free expression that we set out to enable,\" Clegg said during a press call I attended. \"Too often, harmless content gets taken down, or restricted, and too many people get penalized unfairly.\" He said the company regrets aggressively removing posts about the covid-19 pandemic. CEO Mark Zuckerberg recently told the Republican-led House Judiciary Committee the decision was influenced by pressure from the Biden administration. \n\n\"We had very stringent rules removing very large volumes of content through the pandemic,\" Clegg said. \"No on",
        "id": 1639273,
        "language": null,
        "link": "https://tech.slashdot.org/story/24/12/04/0023207/meta-says-its-mistakenly-moderating-too-much?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Meta Says It's Mistakenly Moderating Too Much",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T03:38:11.372255+00:00",
        "description": "An anonymous reader shares a report: A new report suggests South Korea is the first country to have replaced 10% of its workforce with robots to tackle its shrinking population due to its low birth rate, reports Independent. \n\nFor every 10,000 employees, South Korea now has 1,102 robots, making the country number one in the world in using technology instead of human labour to do tasks, according to the annual survey by World Robotics 2024. \n\nSouth Korea now has twice the number of robots working in its factories than any other country in the world. Only Singapore has been close to South Korea regarding robots, with 770 of such technology per 10,000 workers.<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=South+Korea+Becomes+First+Country+To+Replace+10%25+of+Its+Workforce+With+Robots%3A+https%3A%2F%2Fhardware.slashdot.org%2Fstory%2F24%2F12%2F04%2F003227%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"http",
        "id": 1638891,
        "language": null,
        "link": "https://hardware.slashdot.org/story/24/12/04/003227/south-korea-becomes-first-country-to-replace-10-of-its-workforce-with-robots?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "South Korea Becomes First Country To Replace 10% of Its Workforce With Robots",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T01:28:33.797037+00:00",
        "description": "Intel's board of directors ousted CEO Pat Gelsinger after losing confidence in his ambitious turnaround strategy. The move comes as Intel posted significant losses, including $16.6 billion in Q3 2024, its worst quarterly result ever. Under Gelsinger's leadership, Intel struggled to compete in the AI chip market dominated by Nvidia, while facing manufacturing challenges and declining data center revenue. \n\nAnalysts suggest the board may be considering splitting off Intel's foundry business, though such a move could face scrutiny from the U.S. Commerce Department due to $8 billion in CHIPS Act funding. The Verge adds: But Moorhead and Creative Strategies analyst Ben Bajarin both believe Gelsinger's departure was so sudden, it can't simply have been the straw that broke the camel's back. \"There must have been a decision the board made that he was not going to stick around for,\" Moorhead tells me. \n\nHis hunch: Intel's board may want to split off its foundry business entirely, above and b",
        "id": 1638452,
        "language": null,
        "link": "https://ask.slashdot.org/story/24/12/04/0016257/slashdot-asks-what-happened-to-intel?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Slashdot Asks: What Happened To Intel?",
        "vote": 0
    },
    {
        "age": null,
        "album": "",
        "author": null,
        "bookmarked": false,
        "comments": [],
        "date_published": "2024-12-04T00:21:24.865320+00:00",
        "description": "Walmart said Tuesday it had completed its $2.3 billion all-cash acquisition of TV maker Vizio, a move by the retailing giant to expand its advertising business. From a report: The closing of the deal follows the expiration of the waiting period under federal regulations. Walmart announced the deal to buy Vizio in February 2024. Walmart said the acquisition of Vizio will let it \"bring to market new and differentiated ways for advertisers to meaningfully connect with customers at scale and boost product discovery\" through Walmart Connect, the company's U.S. retail media business. \n\nWalmart and Vizio will continue to operate separately \"for the foreseeable future,\" according to the announcement. William Wang will continue to lead Vizio as CEO, reporting to Seth Dallaire, executive VP and chief growth officer of Walmart U.S. Vizio, founded in 2002, is a leading vendor of value-priced HDTVs. Its device ecosystem and its smart TV operating system, SmartCast, provide free, ad-supported acce",
        "id": 1638171,
        "language": null,
        "link": "https://entertainment.slashdot.org/story/24/12/03/2328236/walmart-closes-23-billion-acquisition-of-vizio?utm_source=rss1.0mainlinkanon&utm_medium=feed",
        "manual_status_code": 0,
        "page_rating": 27,
        "page_rating_contents": 85,
        "page_rating_visits": 0,
        "page_rating_votes": 0,
        "permanent": false,
        "source__id": 306,
        "source_url": "https://rss.slashdot.org/Slashdot/slashdotMain",
        "status_code": 0,
        "tags": [],
        "thumbnail": null,
        "title": "Walmart Closes $2.3 Billion Acquisition of Vizio",
        "vote": 0
    }
]