[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T19:30:04+00:00", "description": "EvilVEvil is a 3-player co-op shooter that puts players in the shoes of vampires that have been awoken after a deep slumber in the year 2099. \nPlayers must go through 12 missions as they shoot, blow up, and feed their way through hordes of enemies, both humans and demons, as they take on this cult. \n\nUltimately, EvilVEvil ends up feeling like a relatively bland game. Its visuals are dull, and its progression systems are quite shallow, with poor choices like locking weapon unlocks behind individual character progression.", "id": 876145, "language": null, "link": "https://www.youtube.com/watch?v=loaIwgp-RuU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/loaIwgp-RuU/hqdefault.jpg", "title": "EvilVEvil Review - The Final Verdict", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T15:30:19+00:00", "description": "Star Wars Outlaws is making many bold promises, but the most mouthwatering of them all is its promise of the ultimate Star Wars scoundrel fantasy in a large and dense open world interstellar setting. Navigating the ]criminal underbelly as protagonist Kay Vess is shaping up to be an exciting experience, and as we’re doing so, we are, of course, also going to be crossing paths and locking horns with a variety of different factions. \n\nFrom familiar criminal organizations that have been involved in past Star Wars stories to entirely new creations that are going to make their introductions with this game, Kay’s story will see many factions playing significant roles, and ahead of Star Wars Outlaws’ approaching release, here, we’re going to go over everything that we know about all of those factions.", "id": 874595, "language": null, "link": "https://www.youtube.com/watch?v=j_gdTlwXBio", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/j_gdTlwXBio/hqdefault.jpg", "title": "Star Wars Outlaws - All Factions And Everything You Need To Know About Them", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T09:45:00+00:00", "description": "Among the many releases this month - and even this year - Critical  Hit Games' Nobody Wants to Die is one of the lesser-marketed titles. However, it's notched up hundreds of thousands of views on its trailers before launching on July 17th for Xbox Series X/S, PS5 and  PC.\n\nSet in 2329, in New York City, humanity has found the key to eternal life by storing its consciousness in memory banks and transferring it to other bodies. The process has been capitalized, and those who can pay the subscription enjoy a long life. Nevertheless, the city has stagnated; trapped in a bygone era, with nature and culture dying out.\n\nAs detective James Karra, one must investigate a series of murders about the city's wealthier class with time manipulation. Here's what you should know about the Unreal Engine 5 title before its release.", "id": 872194, "language": null, "link": "https://www.youtube.com/watch?v=B4ZZPh-byOY", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/B4ZZPh-byOY/hqdefault.jpg", "title": "Nobody Wants To Die - 10 Things You Need To Know Before You Buy This Graphically Stunning Game (UE5)", "user": null, "vote": 0}]