[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T16:15:26+00:00", "description": "<p>The Boys are back and this season is as brilliant, disgusting, and insane as the previous seasons – perhaps more disgusting in places and that is certainly a high bar to reach. Based on the Garth Ennis comic of the same name, The Boys S4 continues the adventures of Billy Butcher (Karl Urban – Dredd, Lord of the Rings, Star Trek) and his team of misfits as they plot to take down the increasingly unhinged Homelander (Anthony Starr – give the man all the awards). In The Boys S4, Butcher seems to be on his last legs. Given months to live following his abuse of compound V in the previous season, he’s still intent on taking down Homelander and other supes and saving his late wife’s son, Ryan, who he wants to protect from Homelander’s corruption. His illness has him seeing his dead wife and he also spends a lot of time with an old friend, played by the always amazing Jeffrey Dean Morgan (Watchmen, The Walking Dead) but he still has enough about him to take on supes and so he teams up with", "id": 874859, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-the-boys-season-4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: The Boys Season 4", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T04:25:12+00:00", "description": "<p>Zammar Ahmer pushes boundaries and takes the concept of grey morality to a whole new level in Sundered Moon, the deliciously dark and exquisitely bittersweet finale to The Book of Astea duology. Full of both devastating losses and small hopeful victories, this exceptional story offers an altogether more nuanced, satisfying, and emotional twist on the grimdark genre. Picking up seconds after the earth-shattering ending of Riven Earth, Sundered Moon reunites us with our compelling cast of deeply flawed (anti-)heroes as they have to grapple with the brutal consequences of their questionable actions. Nature’s threat to humanity grows ever more dire, a possible cure for the blood plague comes at a terrible price, dangerous revolts are brewing, and the wrath of the gods grows inescapable. Though even when faced with impossible odds and devastating moral dilemmas, the relentless fight for peace and balance continues, no matter how high the cost. Now, as much as I love the satisfaction of ", "id": 870950, "language": "en-AU", "link": "https://www.grimdarkmagazine.com/review-sundered-moon-by-zammar-ahmer", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.grimdarkmagazine.com/feed", "source_obj__id": 137, "status_code": 0, "tags": [], "thumbnail": null, "title": "REVIEW: Sundered Moon by Zammar Ahmer", "user": null, "vote": 0}]