[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T23:04:45.535798+00:00", "description": "In a post on X today, Andrej Karpathy announced that he is \"starting an AI+Education company called Eureka Labs.\" Karpathy taught deep learning for computer vision at Stanford University, left to co-found OpenAI in 2015 and then moved on to direct artificial intelligence for Tesla Autopilot until 2022. He then migrated back to OpenAI to lead a small team related to ChatGPT. CoinTelegraph reports: Eureka is creating virtual teaching assistants powered by generative AI to bring top courses to vastly more students without sacrificing the personalized interactions typical of in-person learning. The startup's ultimate goal is to bring elite educators and coursework to students throughout the world, regardless of barriers such as geography and language. [...] Eureka's first product will be an undergraduate AI course called LLM101n. The course will guide students through the process of training an AI similar to the AI Teaching Assistant. Materials will be available online but will also inclu", "id": 877347, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/16/2039236/former-tesla-openai-exec-andrej-karpathy-founds-ai-native-education-startup?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Former Tesla, OpenAI Exec Andrej Karpathy Founds 'AI Native' Education Startup", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T23:04:43.305703+00:00", "description": "Ashley Belanger reports via Ars Technica: Google tried to derail a Microsoft antitrust settlement over anticompetitive software licensing in the European Union by offering a $500 million alternative deal to the group of cloud providers behind the EU complaint, Bloomberg reported. According to Bloomberg, Google's offer to the Cloud Infrastructure Services Providers in Europe (CISPE) required that the group maintain its EU antitrust complaint. It came \"just days\" before CISPE settled with Microsoft, and it was apparently not compelling enough to stop CISPE from inking a deal with the software giant that TechCrunch noted forced CISPE to accept several compromises.\n \nBloomberg uncovered Google's attempted counteroffer after reviewing confidential documents and speaking to \"people familiar with the matter.\" Apparently, Google sought to sway CISPE with a package worth nearly $500 million for more than five years of software licenses and about $15 million in cash. But CISPE did not take the ", "id": 877346, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/16/2054210/googles-500-million-effort-to-wreck-microsoft-eu-cloud-deal-failed-report-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google's $500 Million Effort To Wreck Microsoft EU Cloud Deal Failed, Report Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T22:00:40.732252+00:00", "description": "An anonymous reader quotes a report from TechCrunch: Apple's practice of leveraging ideas from its third-party developer community to become new iOS and Mac features and apps has a hefty price tag, a new report indicates. Ahead of its fall release, you can download the public beta for iOS 18 right now to get a firsthand look at Apple's changes, which may affect apps that today have an estimated $393 million in revenue and have been downloaded roughly 58 million times over the past year, according to an analysis by app intelligence firm Appfigures. Every June at Apple's Worldwide Developers Conference, the iPhone maker teases the upcoming releases of its software and operating systems, which often include features previously only available through third-party apps. The practice is so common now it's even been given a name: \"sherlocking\" -- a reference to a 1990s search app for Mac that borrowed features from a third-party app known as Watson. Now when Apple launches a new feature that ", "id": 877067, "language": "en-us", "link": "https://apple.slashdot.org/story/24/07/16/2027240/ios-18-could-sherlock-400-million-in-app-revenue?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "iOS 18 Could 'Sherlock' $400 Million In App Revenue", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T20:54:55.079173+00:00", "description": "Delta Air Lines CEO Ed Bastian had stark words for competing airlines that depend on selling low-priced tickets to stay alive. From a report: \"You cannot, if you are on the lower end of the industry's food chain, continue to post losses, particularly given the health of the demand set we've seen over these last couple of years,\" Bastian said as Delta reported disappointing second-quarter financials and warned things could get even worse. \n\nAirlines that can't break even \"will not be given the opportunity to continue to run business models they have,\" he added. Bastian's comments came in response to a question about the potential for structural changes within the industry as many airlines struggle to remain profitable. [...] A big contributor to the lower profits was lower airfares and extra capacity, especially in economy class,<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Delta+Air+Lines+CEO+Questions+Financial+Strategy+of+Low-Cost+Carrier", "id": 876596, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/16/1851246/delta-air-lines-ceo-questions-financial-strategy-of-low-cost-carriers?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Delta Air Lines CEO Questions Financial Strategy of Low-Cost Carriers", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T20:54:53.201491+00:00", "description": "Google is discontinuing its experimental Notes feature in Search Labs, the company confirmed on Wednesday. The feature, launched in November, allowed users to add comments and tips to search results and Discover content. It aimed to create a community-driven platform within Google's ecosystem, similar to social media forums.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Google+Search+Ending+'Notes'+Experiment+%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F16%2F1849215%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F16%2F1849215%2Fgoogle-search-ending-notes-experiment%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\" /></a>\n\n\n\n</div></p><p><a href=\"https://tech.slashdot.org/story/24/07/16/1849215/googl", "id": 876595, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/16/1849215/google-search-ending-notes-experiment?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Search Ending 'Notes' Experiment", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T19:49:44.151003+00:00", "description": "A group calling itself \"NullBulge\" published a 1.1-TB trove of data late last week that it claims is a dump of Disney's internal Slack archive. From a report: The data allegedly includes every message and file from nearly 10,000 channels, including unreleased projects, code, images, login credentials, and links to internal websites and APIs. The hackers claim they got access to the data from a Disney insider and named the alleged collaborator. \n\nWhether the hackers actually had inside help remains unconfirmed; they could also have plausibly used info-stealing malware to compromise an employee's account. Disney did not confirm the breach or return multiple requests for comment about the legitimacy of the stolen data. A Disney spokesperson told the Wall Street Journal that the company \"is investigating this matter.\" The data, which appears to have been first published on Thursday, was posted on BreachForums and later taken down, but it is still live on mirror sites. The hacker said they", "id": 876151, "language": "en-us", "link": "https://it.slashdot.org/story/24/07/16/1832237/hackers-claim-to-have-leaked-11-tb-of-disney-slack-messages?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Hackers Claim To Have Leaked 1.1 TB of Disney Slack Messages", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T19:49:42.190539+00:00", "description": "An anonymous reader a report:Google is no longer trying to index the entire web. In fact, it's become extremely selective, refusing to index most content. This isn't about content creators failing to meet some arbitrary standard of quality. Rather, it's a fundamental change in how Google approaches its role as a search engine. \n\nFrom my experience, Google now seems to operate on a \"default to not index\" basis. It only includes content in its index when it perceives a genuine need. This decision appears to be based on various factors:\nExtreme content uniqueness: It's not enough to write about something that isn't extensively covered. Google seems to require content to be genuinely novel or fill a significant gap in its index.\nPerceived authority: Sites that Google considers highly authoritative in their niche may have more content indexed, but even then, it's not guaranteed.\nBrand recognition: Well-known brands often see most of their content indexed, while small or unknown bloggers fa", "id": 876150, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/16/1843240/google-now-defaults-to-not-indexing-your-content?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Google Now Defaults To Not Indexing Your Content", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T18:44:37.647433+00:00", "description": "Amazon is now monitoring the hours corporate employees spend in the office. From a report: This move is intended to crack down on people who are trying to skirt the company's return-to-office policy, Business Insider has learned. Several teams across Amazon, including the retail and cloud-computing units, were told in recent months that a minimum of two hours per visit is required to count as office attendance, according to multiple screenshots of internal Slack messages obtained by BI and people familiar with the matter. Some teams have been told to stay at least six hours per visit. \n\nAmazon's goal is to ramp up scrutiny of \"coffee badging,\" some of the Slack messages said. Coffee badging refers to employees who badge in, get coffee, and leave the office shortly to satisfy their return-to-office mandate. Amazon started requiring office attendance for most corporate staffers three times a week last year, but it didn't have a minimum-hour obligation for each visit.<p><div class=\"share", "id": 875819, "language": "en-us", "link": "https://slashdot.org/story/24/07/16/1817230/amazon-enforces-new-office-hours-rule?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Amazon Enforces New Office Hours Rule", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T17:39:59.489298+00:00", "description": "A judge in the UK High Court has directed prosecutors to consider bringing criminal charges against computer scientist Craig Wright, after ruling that he lied \"extensively and repeatedly\" and committed forgery \"on a grand scale\" in service of his quest to prove he is Satoshi Nakamoto, creator of bitcoin. From a report: In a judgment published Tuesday, Justice James Mellor outlined various injunctions to be imposed upon Wright, after finding in May that he had \"engaged in the deliberate production of false documents to support false claims [to be Satoshi] and use the Courts as a vehicle for fraud.\" \n\nBy order of the judge, Wright will be prevented from claiming publicly that he is Satoshi and from bringing or threatening legal action in any jurisdiction on that basis. He will be required to pin a notice to the front page of his personal website and X feed detailing the findings against him. The matter, Mellor writes, will also be referred to the Crown Prosecution Service (CPS), the bod", "id": 875326, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/16/1649235/craig-wright-faces-perjury-investigation-over-claims-he-created-bitcoin?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Craig Wright Faces Perjury Investigation Over Claims He Created Bitcoin", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T17:39:56.766630+00:00", "description": "Speaking of crypto, BlackRock's co-founder and CEO Larry Fink is now embracing crypto more than ever. From a report: In an interview with CNBC on Monday, he mentioned that he had abandoned his initial skepticism of cryptocurrencies like Bitcoin. He now firmly believes that there is a place for crypto in the average investor's portfolio. \"I believe Bitcoin is legitimate. I'm not saying there aren't misuses like everything else, but it is a legitimate financial instrument that allows you to have uncorrelated returns,\" Fink told CNBC host Jim Cramer. \n\nWhen asked whether the U.S. budget deficit makes a case for investing in crypto, Fink responded, \"absolutely.\" He added that crypto can help buyers hedge against countries that are devaluing their currencies.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Bitcoin+is+Legit%2C+BlackRock's+Larry+Fink+Says%3A+https%3A%2F%2Ftech.slashdot.org%2Fstory%2F24%2F07%2F16%2F1712202%2F%3Futm_source%3Dtwitter%26", "id": 875325, "language": "en-us", "link": "https://tech.slashdot.org/story/24/07/16/1712202/bitcoin-is-legit-blackrocks-larry-fink-says?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Bitcoin is Legit, BlackRock's Larry Fink Says", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T16:34:50.837263+00:00", "description": "NASA: The stars above and on Earth aligned as an inspirational message and lyrics from the song \"The Rain (Supa Dupa Fly)\" by hip-hop artist Missy Elliott were beamed to Venus via NASA's DSN (Deep Space Network). The agency's Jet Propulsion Laboratory in Southern California sent the transmission at 10:05 a.m. PDT on Friday, July 12. As the largest and most sensitive telecommunication service of NASA's Space Communications and Navigation (SCaN) program, the DSN has an array of giant radio antennas that allow missions to track, send commands, and receive scientific data from spacecraft venturing to the Moon and beyond. To date, the system has transmitted only one other song into space, making the transmission of Elliott's song a first for hip-hop and NASA. \n\n\"Both space exploration and Missy Elliott's art have been about pushing boundaries,\" said Brittany Brown, director, Digital and Technology Division, Office of Communications at NASA Headquarters in Washington, who initially pitched ", "id": 874788, "language": "en-us", "link": "https://science.slashdot.org/story/24/07/16/1526220/nasa-transmits-hip-hop-song-to-deep-space-for-first-time?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "NASA Transmits Hip-Hop Song To Deep Space for First Time", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T16:34:48.747476+00:00", "description": "The latest release of MySQL has underwhelmed some commentators who fear Oracle -- the custodian of the open source database -- may have other priorities. From a report: Earlier this month, Oracle -- which has long marketed its range of proprietary database systems -- published the 9.0 version as an \"Innovation Release\" of MySQL. MySQL 9.0 is now among the three iterations Oracle supports. The others include 8.0 (8.0.38) and the first update of the 8.4 LTS (8.4.1). \n\n[...] In June, Peter Zaitsev, an early MySQL engineer and founder of open source consultancy Percona, said he feared the lack of features in MySQL was a result of Oracle's focus on Heatwave, a proprietary analytics database built on MySQL. He had previously defended Oracle's stewardship of the open source database. The release of MySQL 9.0 has not assuaged those concerns, said colleague Dave Stokes, Percona technology evangelist. It had not lived up to the previous 8.0 release, which arrived with many new features.\n\n\"MySQL", "id": 874787, "language": "en-us", "link": "https://developers.slashdot.org/story/24/07/16/1535251/latest-mysql-release-is-underwhelming-say-some-db-experts?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Latest MySQL Release is Underwhelming, Say Some DB Experts", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T15:22:11.756886+00:00", "description": "AI companies are generally secretive about their sources of training data, but an investigation by Proof News found some of the wealthiest AI companies in the world have used material from thousands of YouTube videos to train AI. Companies did so despite YouTube's rules against harvesting materials from the platform without permission. From a report: Our investigation found that subtitles from 173,536 YouTube videos, siphoned from more than 48,000 channels, were used by Silicon Valley heavyweights, including Anthropic, Nvidia, Apple, and Salesforce. The dataset, called YouTube Subtitles, contains video transcripts from educational and online learning channels like Khan Academy, MIT, and Harvard. The Wall Street Journal, NPR, and the BBC also had their videos used to train AI, as did The Late Show With Stephen Colbert, Last Week Tonight With John Oliver, and Jimmy Kimmel Live. \n\nProof News also found material from YouTube megastars, including MrBeast (289 million subscribers, two video", "id": 874361, "language": "en-us", "link": "https://apple.slashdot.org/story/24/07/16/1443251/apple-nvidia-anthropic-used-thousands-of-swiped-youtube-videos-to-train-ai?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Apple, Nvidia, Anthropic Used Thousands of Swiped YouTube Videos To Train AI", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T14:17:23.794303+00:00", "description": "The climate crisis is causing the length of each day to get longer, analysis shows, as the mass melting of polar ice reshapes the planet. From a report: The phenomenon is a striking demonstration of how humanity's actions are transforming the Earth, scientists said, rivalling natural processes that have existed for billions of years. The change in the length of the day is on the scale of milliseconds but this is enough to potentially disrupt internet traffic, financial transactions and GPS navigation, all of which rely on precise timekeeping. \n\nThe length of the Earth's day has been steadily increasing over geological time due to the gravitational drag of the moon on the planet's oceans and land. However, the melting of the Greenland and Antarctic ice sheets due to human-caused global heating has been redistributing water stored at high latitudes into the world's oceans, leading to more water in the seas nearer the equator. This makes the Earth more oblate -- or fatter -- slowing the ", "id": 873821, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/16/147249/climate-crisis-is-making-days-longer-study-finds?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Climate Crisis is Making Days Longer, Study Finds", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T13:12:32.865840+00:00", "description": "Microsoft's investment into Inflection AI will get a full-blown UK antitrust probe, after the watchdog said it needed to take a closer look at the hiring of former employees from the artificial intelligence startup. From a report: The Competition and Markets Authority said Tuesday it was opening the formal phase one merger probe into the partnership, setting a Sept. 11 deadline on whether to escalate it to an in-depth investigation. The agency has been swift to act against big tech's AI startup investments after it found a pattern of large tech firms piling money into start ups.<p><div class=\"share_submission\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft+Investigated+by+UK+Over+Ex-Inflection+Staff+Hires%3A+https%3A%2F%2Fnews.slashdot.org%2Fstory%2F24%2F07%2F16%2F137247%2F%3Futm_source%3Dtwitter%26utm_medium%3Dtwitter\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\" /></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fnews.s", "id": 873281, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/16/137247/microsoft-investigated-by-uk-over-ex-inflection-staff-hires?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Investigated by UK Over Ex-Inflection Staff Hires", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T11:02:30.524144+00:00", "description": "Last week, the U.S. Senate introduced a new bill to outlaw the unethical use of AI-generated content and deepfake technology. Called the Content Origin Protection and Integrity from Edited and Deepfaked Media Act (COPIED Act), the bill would \"set new federal transparency guidelines for marking, authenticating and detecting AI-generated content, protect journalists, actors and artists against AI-driven theft, and hold violators accountable for abuses.\" TechSpot reports: Proposed and sponsored by Democrats Maria Cantwell of Washington and Martin Heinrich of New Mexico, along with Republican Marsha Blackburn of Tennessee, the aims to establish enforceable transparency standards in AI development [such a through watermarking]. The legislation also wants to curb unauthorized data use in training models. The senators intend to task the National Institutes of Standards and Technology with developing sensible transparency guidelines should the bill pass. [...] The senators feel that clarifyin", "id": 872463, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/16/0056221/senate-introduces-bill-to-setup-legal-framework-for-ethical-ai-development?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Senate Introduces Bill To Setup Legal Framework For Ethical AI Development", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T07:47:02.046626+00:00", "description": "Longtime Slashdot reader fahrbot-bot shares a report from Gizmodo: A team of researchers think they've discovered a cave on the Moon in radar images of the lunar surface, which they posit could be a future site for an established human presence on our rocky satellite. The tunnel is in the Mare Tranquillitatis (Sea of Tranquility) pit, the deepest known pit on the Moon. (If the name is familiar to you, the Sea of Tranquility is where the Apollo 11 mission landed in 1969.) The pit formed due to a lava tube's roof collapse or a collapse of a void structure created by tectonic processes. To look for potential cave structures within the pit, the researchers studied side-looking radar images taken by the Lunar Reconnaissance Orbiter's Mini-RF instrument between 2009 and 2011. The team then conducted 3D radar simulations of potential geometries of the pit and its cave, to determine that the brightness they saw in radar images could be due to subsurface features. Ultimately, the team determin", "id": 871535, "language": "en-us", "link": "https://science.slashdot.org/story/24/07/16/0032209/radar-images-suggest-theres-a-tunnel-on-the-moon?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Radar Images Suggest There's a Tunnel On the Moon", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T04:31:56.391956+00:00", "description": "An anonymous reader quotes a report from TorrentFreak: Just before the weekend, dozens of record labels including UMG, Warner, and Sony, filed a massive copyright infringement lawsuit against Verizon at a New York federal court. In common with previous lawsuits that accused rivals of similar inaction, Verizon Communications Inc., Verizon Services Corp., and Cellco Partnership (dba Verizon Wireless), stand accused of assisting subscribers to download and share pirated music, by not doing enough to stop them. The labels' complaint introduces Verizon as one of the largest ISPs in the country, one that \"knowingly provides its high-speed service to a massive community of online pirates.\"\n \nKnowledge of infringement, the labels say, was established at Verizon over a period of several years during which it received \"hundreds of thousands\" of copyright notices, referencing instances of infringement allegedly carried out by its subscribers. The complaint cites Verizon subscribers' persistent u", "id": 870939, "language": "en-us", "link": "https://yro.slashdot.org/story/24/07/15/2342211/record-labels-sue-verizon-after-isp-buried-head-in-sand-over-subscribers-piracy?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Record Labels Sue Verizon After ISP 'Buried Head In Sand' Over Subscribers' Piracy", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T02:22:30.027392+00:00", "description": "Italian Prime Minister Giorgia Meloni plans to revive Italy's nuclear energy sector, focusing on small modular reactors to be operational within a decade. He said that nuclear energy could constitute at least 11% of the country's electricity mix by 2050. Semafor reports: Italy's energy minister told the Financial Times that the government would introduce legislation to support investment in small modular reactors, which could be operational within 10 years. [...] In Italy, concerns about energy security since Russia's invasion of Ukraine have pushed the government to reconsider nuclear power, Bloomberg wrote. Energy minister Pichetto Fratin told the Financial Times he was confident that Italians' historic \"aversion\" could be overcome, as nuclear technology now has \"different levels of safety and benefits families and businesses.\" In Italy, safety is also top of mind: The Chernobyl tragedy of 1986 was the trigger for it to cease nuclear production in the first place, and the 2011 Fukus", "id": 870538, "language": "en-us", "link": "https://hardware.slashdot.org/story/24/07/15/2348229/italy-reconsiders-nuclear-energy-35-years-after-shutting-down-last-reactor?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Italy Reconsiders Nuclear Energy 35 Years After Shutting Down Last Reactor", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T01:17:52.084888+00:00", "description": "Microsoft has quietly announced the first details of its new \"SpreadsheetLLM,\" claiming it has the \"potential to transform spreadsheet data management and analysis, paving the way for more intelligent and efficient user interactions.\" You can read more details about the model in a pre-print paper available here. Jasper Hamill reports via The Stack: One of the problems with using LLMs in spreadsheets is that they get bogged down by too many tokens (basic units of information the model processes). To tackle this, Microsoft developed SheetCompressor, an \"innovative encoding framework that compresses spreadsheets effectively for LLMs.\" \"It significantly improves performance in spreadsheet table detection tasks, outperforming the vanilla approach by 25.6% in GPT4's in-context learning setting,\" Microsoft added. The model is made of three modules: structural-anchor-based compression, inverse index translation, and data-format-aware aggregation.\n \nThe first of these modules involves placing ", "id": 870381, "language": "en-us", "link": "https://slashdot.org/story/24/07/15/2330243/microsoft-unveils-a-large-language-model-that-excels-at-encoding-spreadsheets?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft Unveils a Large Language Model That Excels At Encoding Spreadsheets", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T00:13:36.476066+00:00", "description": "An anonymous reader quotes a report from Ars Technica: During an interview with Sequoia Capital's Training Data podcast published last Tuesday, Microsoft CTO Kevin Scott doubled down on his belief that so-called large language model (LLM) \"scaling laws\" will continue to drive AI progress, despite some skepticism in the field that progress has leveled out. Scott played a key role in forging a $13 billion technology-sharing deal between Microsoft and OpenAI. \"Despite what other people think, we're not at diminishing marginal returns on scale-up,\" Scott said. \"And I try to help people understand there is an exponential here, and the unfortunate thing is you only get to sample it every couple of years because it just takes a while to build supercomputers and then train models on top of them.\"\n \nLLM scaling laws refer to patterns explored by OpenAI researchers in 2020 showing that the performance of language models tends to improve predictably as the models get larger (more parameters), ar", "id": 870164, "language": "en-us", "link": "https://slashdot.org/story/24/07/15/2032259/microsoft-cto-kevin-scott-thinks-llm-scaling-laws-will-hold-despite-criticism?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "Microsoft CTO Kevin Scott Thinks LLM 'Scaling Laws' Will Hold Despite Criticism", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-16T00:13:34.599704+00:00", "description": "OW2, the non-profit international consortium dedicated to developing open-source middleware, published an open letter to the European Commission today. They're urging the European Union to continue funding free software after noticing that the Next Generation Internet (NGI) programs were no longer mentioned in Cluster 4 of the 2025 Horizon Europe funding plans.\n \nOW2 argues that discontinuing NGI funding would weaken Europe's technological ecosystem, leaving many projects under-resourced and jeopardizing Europe's position in the global digital landscape. The letter reads, in part: NGI programs have shown their strength and importance to support the European software infrastructure, as a generic funding instrument to fund digital commons and ensure their long-term sustainability. We find this transformation incomprehensible, moreover when NGI has proven efficient and economical to support free software as a whole, from the smallest to the most established initiatives. This ecosystem di", "id": 870163, "language": "en-us", "link": "https://news.slashdot.org/story/24/07/15/237247/ow2-the-european-union-must-keep-funding-free-software?utm_source=rss1.0mainlinkanon&utm_medium=feed", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://rss.slashdot.org/Slashdot/slashdotMain", "source_obj__id": 306, "status_code": 0, "tags": [], "thumbnail": null, "title": "OW2: 'The European Union Must Keep Funding Free Software'", "user": null, "vote": 0}]