[{"tags": [], "user": null, "title": "Mario vs Donkey Kong Remake Review - Is It Worth It?", "vote": 0, "date_published": "2024-02-23T19:00:08+00:00", "dead": false, "description": "Mario vs Donkey Kong on the Switch is a satisfactory update of a great and often overlooked entry in the Mario vs Donkey Kong series Is all of this worth $50? The game is not full price, thankfully enough, because it’s a pretty straightforward translation of a quick, short, decades old handheld game.", "language": null, "link": "https://www.youtube.com/watch?v=B2kaZReewck", "age": null, "source_obj__id": 208, "album": "", "page_rating_contents": 0, "page_rating_visits": 0, "permanent": false, "artist": "GamingBolt", "bookmarked": false, "comments": [], "page_rating_votes": 0, "page_rating": 0, "thumbnail": "https://i3.ytimg.com/vi/B2kaZReewck/hqdefault.jpg", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ"}, {"tags": [], "user": null, "title": "14 Beginners Tips And Tricks Final Fantasy 7 Rebirth Doesn't Tell You", "vote": 0, "date_published": "2024-02-23T16:00:21+00:00", "dead": false, "description": "After laying down the foundations in Final Fantasy 7 Remake, with Final Fantasy 7 Rebirth, the developer has blown the gates wide open, and in the process delivered a game of staggering scope.\n\n As a massive open world RPG, Final Fantasy 7 Rebirth boasts an astounding amount of things to do and a web of interacting systems and mechanics to keep track of, and though the game does a great job of presenting it all in digestible and cohesive fashion, the first few hours of your journey may still see some growing pains here and there. \n\nTo make your introduction to the world of Final Fantasy 7 Rebirth a bit smoother, then, here, we’ve compiled a few handy pointers you should keep in mind as you dive into the game.", "language": null, "link": "https://www.youtube.com/watch?v=MORQLziZ_PI", "age": null, "source_obj__id": 208, "album": "", "page_rating_contents": 0, "page_rating_visits": 0, "permanent": false, "artist": "GamingBolt", "bookmarked": false, "comments": [], "page_rating_votes": 0, "page_rating": 0, "thumbnail": "https://i2.ytimg.com/vi/MORQLziZ_PI/hqdefault.jpg", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ"}, {"tags": [], "user": null, "title": "What The Hell Is Microsoft Doing With Senua's Saga: Hellblade 2?", "vote": 0, "date_published": "2024-02-23T14:00:07+00:00", "dead": false, "description": "The picture around Senua’s Saga: Hellblade 2 has started getting clearer, with Microsoft and Ninja Theory having confirmed that, rather than being a massive leap forward from its predecessor, it’s going to be another shorter, focused, smaller-scale experience. \n\nOn one hand, there’s every reason to be excited about that – from how good the first game was exactly for those reasons, to the fact that seeing a major first-party studio releasing a smaller game is a refreshing change of pace – but it’s undeniable that Microsoft’s messaging about the game has been mixed at best. Because though it’s clear now that Hellblade 2 was never meant to be a big, tentpole, blockbuster showpiece of the first-party Xbox Game Studios portfolio, for the longest that, that was what it was being positioned as.", "language": null, "link": "https://www.youtube.com/watch?v=6iZp62fBo1I", "age": null, "source_obj__id": 208, "album": "", "page_rating_contents": 0, "page_rating_visits": 0, "permanent": false, "artist": "GamingBolt", "bookmarked": false, "comments": [], "page_rating_votes": 0, "page_rating": 0, "thumbnail": "https://i3.ytimg.com/vi/6iZp62fBo1I/hqdefault.jpg", "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ"}]