[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T15:30:28+00:00", "description": "Starry Studio's Once Human can feel all over the place at times, both tonally and in terms of content. When you're not surviving against mutated buses with legs and other horrors, there are Pokemon-like Deviations to collect and do your bidding. One of these is a giant cat specifically meant to snuggle you at night. It's a lot.\n\nNevertheless, intriguing systems are at play, which aren't all fully explained or detailed. You can find plenty of loot out in the wild, and while it's possible to upgrade them, repairing them is impossible. Also, while the Wish Machine may annoy some with its gacha elements, there's the option to buy Blueprints directly with Starchrom.\n\nThis doesn't include everything you can do with your base, from cloning other people's designs (with their permission) to utilizing presets and even outright moving your base. Here are some other tips you should know.", "id": 881995, "language": null, "link": "https://www.youtube.com/watch?v=qO3WTVb9LAk", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qO3WTVb9LAk/hqdefault.jpg", "title": "Once Human - 14 THINGS IT DOESN'T TELL YOU", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T10:30:08+00:00", "description": "Black Myth: Wukong is similar to other soulslikes in its emphasis on challenging boss fights and its action gameplay, but the similarities stop there. I’m happy to try out something that eschews various staples of the genre in favor of a unique take. \n\nThe ability to transform into the bosses you defeat is one such innovation. I can’t wait to employ the diverse skillset of the wildly creative boss designs myself when the game comes out. \n\nSome other things that have me excited is the streamlined level design. The game looks fluid and very fast-paced too, so it’s not just relying on its stunning graphical laurels to get noticed. \n\nDodging in particular looks smooth and precise and is yet another aspect of the game that I wish I could try out for myself sooner rather than later.", "id": 879783, "language": null, "link": "https://www.youtube.com/watch?v=TGQ8Y23WmNo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/TGQ8Y23WmNo/hqdefault.jpg", "title": "Black Myth Wukong - 15 Things I CAN'T WAIT TO DO", "user": null, "vote": 0}]