[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T23:16:59+00:00", "description": "Once Human reviewed by Justin Koreis on PC.\n\nOnce Human is a lot of fun, with survival-crafting that is simple and accessible, but still rewarding to dig into. Building a house is amusing, even if pieces aren’t always cooperative about snapping together in the right orientation. And while the combat is generally pretty basic, the grotesque weirdness of the monsters more than makes up for that, especially when you get a menagerie of weird little creatures of your own to fight with. Once Human would benefit from more creative quests and a flatter difficulty curve, but I still had a great time, and I’m eager to continue my adventures in this twisted world as its first season progresses.\n\n#IGN #Gaming", "id": 884718, "language": null, "link": "https://www.youtube.com/watch?v=miirZQ9GLV8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/miirZQ9GLV8/hqdefault.jpg", "title": "Once Human Review", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T23:00:14+00:00", "description": "Concord is a team-based first-person action hero-shooter developed by Firewalk Studios. Take a look at the latest cinematic trailer as Lennox tells the legend of the first crew to establish the Freegunners by sacrificing their lives for a map that is given to all new Freegunner crews in the fight against the guild. Concord will feature ongoing narratives and premiere in-game each week, beginning at launch. Concord launches on August 23 for PlayStation 5 (PS5) and PC.", "id": 884719, "language": null, "link": "https://www.youtube.com/watch?v=Uiwdfw0b0R4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/Uiwdfw0b0R4/hqdefault.jpg", "title": "Concord - Official 'Vocal Cartographer' Cinematic Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T22:36:04+00:00", "description": "In today's Daily Fix:\nXbox revealed yet another extremely limited edition controller, this one with a very shapely backside. This Deadpool's ass-themed controller is the only one of its kind, so don't expect preorders to go up any time soon. And, of course, it comes just in time for Deadpool & Wolverine, out in theaters next week. In other news, No Man's Sky is getting yet another update, with the Worlds Part 1 update being touted as the biggest since 2020 and a near-complete overhaul of the game. Developer Hello Games is adding new weather effects, gameplay modes, and more. And finally, you can now live out your fantasy of being He-Man in Elden Ring by following this one player's specific build.\n\n#IGN #Gaming #Xbox", "id": 884720, "language": null, "link": "https://www.youtube.com/watch?v=qTNNotZr8-s", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/qTNNotZr8-s/hqdefault.jpg", "title": "Xbox Reveals Controller Shaped Like Deadpool's Ass - IGN Daily Fix", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T22:00:24+00:00", "description": "Enlisted is a free-to-play World War 2 first-person multiplayer shooter developed by Darkflow Software. Fight in key theaters of World War II ranging from the snowy outskirts of Moscow to the hot Pacific islands, from the beaches of Normandy to the deserts of Tunisia. Control a squad of infantrymen, or the crew of a military vehicle, switching between individual fighters at their discretion with plenty of weapons, vehicles, and gear to choose. Enlisted is available now for PC (Steam) alongside the release on PlayStation 4 (PS4), PlayStation 5 (PS5), Xbox One, and Xbox Series X|S.\n\n#IGN #Gaming", "id": 884476, "language": null, "link": "https://www.youtube.com/watch?v=jRY-cCSfbH4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/jRY-cCSfbH4/hqdefault.jpg", "title": "Enlisted - Official Steam Launch Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T21:48:16+00:00", "description": "From Peacock, IGN, and Realm, this is Rise or Die, the official companion podcast to the\nPeacock original series Those About To Die. Join host Dana Schwartz (Noble Blood) as she\ntakes an exclusive five episode behind the scenes look at how this stunning new series was\nmade. She talks craft with critically acclaimed director and executive producer Roland\nEmmerich, writer and producer Robert Rodat, series lead actor Iwan Rheon, and so many more.\nThose About to Die is an epic drama set in the corrupt world of the spectacle-driven gladiatorial\ncompetition, exploring a side of ancient Rome never before told — the dirty business of\nentertaining the masses, giving the mob what they want most…blood and sport. The series\nintroduces an ensemble of characters from all corners of the Roman Empire who collide at the\nexplosive intersection of sports, politics, and dynasties.\n\nWatch or listen to Rise or Die wherever you get your podcasts, and check out Those About To\nDie, streaming only on Peacock.\n", "id": 884477, "language": null, "link": "https://www.youtube.com/watch?v=nYl-Pwfb-G8", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/nYl-Pwfb-G8/hqdefault.jpg", "title": "Rise or Die! A \"Those About to Die\" Podcast - Official Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T21:06:01+00:00", "description": "Twisters, reviewed by Siddhant Adlakha. Narrated by Mark Medina.\nTwisters has charm for days, even if it doesn’t slow down long enough to let us get to know the characters better. Thankfully, stars Glen Powell, Daisy Edgar-Jones, and Anthony Ramos bring plenty of personality to the film through their performances. With scenes of natural disaster grounded in a human point of view, Lee Isaac Chung's spiritual sequel transcends its visual shortcomings, and proves to be a wildly fun and effective summer blockbuster worth watching on the biggest and loudest screen.", "id": 884478, "language": null, "link": "https://www.youtube.com/watch?v=PljPmrKmiLc", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/PljPmrKmiLc/hqdefault.jpg", "title": "Twisters Review", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T21:00:14+00:00", "description": "Check out the trailer for Season 2 of Star Wars: Young Jedi Adventures ahead of the animated series' new season's debut on Disney+ and Disney Jr. on August 14, 2024.\n\nSet 200 years before “The Phantom Menace,” during the High Republic era, “Star Wars: Young Jedi Adventures” follows Jedi younglings Kai Brightstar, Lys Solay, and Nubs as they study the ways of the Force, explore the galaxy, help citizens and creatures in need and learn valuable skills needed to become Jedi along the way.\n\nStar Wars: Young Jedi Adventures Season 2 follows the younglings as they continue their training and embark on even bigger missions across the galaxy. Helping to lead the younglings on these missions is Master Zia’s new Padawan, Wes Vinik, and his astromech RO-M1. As they continue their training and grow in the ways of the Force, the young Jedi will travel to new planets with new and old friends and encounter adversaries like The Ganguls, who are growing in their pirate ranks… \n\nStar Wars: Young Jedi A", "id": 884074, "language": null, "link": "https://www.youtube.com/watch?v=NnqTbTRncdI", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/NnqTbTRncdI/hqdefault.jpg", "title": "Star Wars: Young Jedi Adventures - Official Season 2 Trailer (2024) Jecobi Swain, Juliet Donenfeld", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T20:00:17+00:00", "description": "Here's the TMNT: Splintered Fate launch trailer! TMNT: Splintered Fate is an isometric action roguelike game developed by Super Evil Megacorp. Players will take full control over the crime-fighting Turtle brothers, each wielding their own unique powers suited for the action-packed combat. Utilize randomized power-ups, boss modifiers, and more offering an endless challenge for players to enjoy with a story written by legendary comic book author Tom Waltz and Kevin Michael Johnson. TMNT: Splintered Fate is available now for Nintendo Switch alongside the release on iOS and Apple TV.\n\n#TMNT #Gaming #Games", "id": 883680, "language": null, "link": "https://www.youtube.com/watch?v=znmtGG6UYh4", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/znmtGG6UYh4/hqdefault.jpg", "title": "TMNT: Splintered Fate - Official Nintendo Switch Launch Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T19:00:20+00:00", "description": "Concord is a team-based first-person action hero-shooter developed by Firewalk Studios. Take a look at the latest cinematic trailer that depicts the beginning of the Northstar crew’s story as they are officially indoctrinated into the Freegunner 414 frequency. Concord will feature ongoing narratives and premiere in-game each week, beginning at launch. Concord launches on August 23 for PlayStation 5 (PS5) and PC.", "id": 883681, "language": null, "link": "https://www.youtube.com/watch?v=j_yEvTrpgNE", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/j_yEvTrpgNE/hqdefault.jpg", "title": "Concord - Official 'The Stars Are Ours' Cinematic Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T18:00:00+00:00", "description": "Check out this Emio - The Smiling Man: Famicom Detective Club trailer. Emio - The Smiling Man: Famicom Detective Club is the third installment in the Famicom Detective Club adventure game series developed by Nintendo. Players will deal with the urban legend of The Smiling Man while solving complex puzzles and choosing dialogue choices to uncover the truth. Become a part of the Utsugi Detective Agency to solve a murder within a riveting adventure game plot for players to experience. Emio - The Smiling Man: Famicom Detective Club is launching on August 29 for Nintendo Switch.\n\n#Gaming #Nintendo #Emio", "id": 883363, "language": null, "link": "https://www.youtube.com/watch?v=-p6R35tNN7o", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/-p6R35tNN7o/hqdefault.jpg", "title": "Emio - The Smiling Man: Famicom Detective Club - Official Overview Trailer (ft. Yoshio Sakamoto)", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T17:30:05+00:00", "description": "Call of Duty: Modern Warfare 3 is the latest in the legendary first-person shooter series developed by Sledgehammer Games. Season 5 has arrived to both Call of Duty: Modern Warfare 3 and Warzone bringing WWE Superstar Operators, Superstore's return to Warzone, new Cel-shaded map variants, and more for players to enjoy. Season 5 for Call of Duty: Modern Warfare 3 and Warzone is available now for PlayStation 4 (PS4), PlayStation 5 (PS5), Xbox One, Xbox Series X|S, and PC.\n\n#IGN #Gaming #CallOfDuty", "id": 882877, "language": null, "link": "https://www.youtube.com/watch?v=fSSreX-s26E", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/fSSreX-s26E/hqdefault.jpg", "title": "Call of Duty: Modern Warfare 3 and Warzone - Official Season 5 Launch Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T17:00:26+00:00", "description": "This is the world in Peacock’s Those About To Die, where emperors, patricians, gladiators, and gamblers created the ultimate sports spectacle. While the show is set in Ancient Rome, it’s easy to see how the games and themes in this epic drama gave way to our modern sports stories.\n\nRoland Emmerich’s new gladiator series, “Those About to Die” (starring Anthony Hopkins), is a brand new epic series that explores the Roman Empire in 79 CE.  Streaming on Peacock (NBC) and inspired by the same book as “Gladiator”, “Those About to Die” delves into the life of the Flavian Dynasty, the Gladiator, the Chariot Races, the Patricians, and the Underbelly. From Gladiator 2 gladiator and chariot race to chariot race we discover how the bloody arena fueled the Roman Empire and the introduction of the new Flavian Amphitheatre or as we know it today, the Colosseum. \n\n“Those About to Die” premieres July 18 on Peacock.\n\n“Those About to Die” cast includes:\nAnthony Hopkins as Emperor Vespasian\nIwan Rheon as", "id": 882878, "language": null, "link": "https://www.youtube.com/watch?v=ggEsFczy9xM", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/ggEsFczy9xM/hqdefault.jpg", "title": "The Roman Empire’s Influence on Sports Through the Lens of “Those About to Die”", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T16:01:02+00:00", "description": "Watch the EA Sports FC 25 reveal trailer for the next instalment in the annual football game. The EA Sports FC 25 cover star is Real Madrid and England superstar, Jude Bellingham.\n\nEA Sports FC 25 will arrive with Rush, a new 5v5 experience coming to Football Ultimate Team (FUT), Clubs and Kick-Off. Rush lets you play with your friends in groups of four with an AI controlled goalkeeper. In addition, FC IQ overhauls 11v11 matches, offering greater strategic control, powered by real-world data from some of the greatest teams in football. Check out the trailer for a look at the game's official announcement.\n\nBellingham appears alongside Ballon d'Or Féminin winner Aitana Bonmatí, and football icons David Beckham, Zinedine Zidane, and Gianluigi Buffon for the EA Sports FC 25 Ultimate Edition cover.\n\nEA Sports FC 25 will be released on September 27, 2024 on PS5 (PlayStation 5), Xbox Series X/S, PS4 (PlayStation 4), Xbox One, PC, and Nintendo Switch, with early access through the Ultimate Ed", "id": 882341, "language": null, "link": "https://www.youtube.com/watch?v=vRj5GCDPv64", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/vRj5GCDPv64/hqdefault.jpg", "title": "EA Sports FC 25 - Official Reveal Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T16:00:06+00:00", "description": "A series of specially produced all-new episodes of SpongeBob SquarePants, with Easter eggs and nods to fan-favorite moments, will debut in July on Nickelodeon around the world and continue to roll out through the year. Viewers will catch up with former jellyfishing champion Kevin C. Cucumber, journey through different eras of Bikini Bottom, travel 2000 years into the future with Plankton, and more.\n\nIGN has this exclusive sneak peek at the episode “Hysterical History,” which premieres Thursday, July 18 at 5:00 p.m. ET/PT on Nickelodeon.\n\nThe episode goes through the different eras of Bikini Bottom, such as prehistoric and pioneer. All the eras shown reference previous episodes including “SpongeBob B.C. (Before Comedy)” and “Pest of the West.” \n\nThere’s also an Industrial Revolution era reference, which shows Mr. Puff running a car assembly line and gives a glimpse into the future ruled by Old Man Walker.", "id": 882342, "language": null, "link": "https://www.youtube.com/watch?v=5CON1oultzA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/5CON1oultzA/hqdefault.jpg", "title": "SpongeBob SquarePants - Exclusive Official Hysterical History Clip (2024) Tom Kenny", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T15:00:22+00:00", "description": "Welcome to the dystopian world of New York, 2329. Watch the Nobody Wants to Die launch trailer to learn more about the story and see more of the world of this narrative-driven adventure game inspired by neo-noir films. Playing as Detective James Karra, you investigate crime scenes using time manipulation and advanced technology to uncover clues and unmask a killer in an era where death is a thing of the past and the dangers of transhumanism are prevalent. Nobody Wants to Die is available now on Xbox Series X|S, PS5 (PlayStation 5), and PC via Steam.\n\n#Gaming #Games #IGN", "id": 881830, "language": null, "link": "https://www.youtube.com/watch?v=OTq0G3s8Bzg", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/OTq0G3s8Bzg/hqdefault.jpg", "title": "Nobody Wants to Die - Official Launch Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T14:44:18+00:00", "description": "", "id": 881831, "language": null, "link": "https://www.youtube.com/watch?v=H2jXw0xxE2c", "manual_status_code": 0, "page_rating": 26, "page_rating_contents": 82, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/H2jXw0xxE2c/hqdefault.jpg", "title": "The Xbox Deadpool “Cheeky Controller” has arrived! #xbox #deadpool #controller #mcu #movie #gaming", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T14:30:18+00:00", "description": "Check out this Deadpool Xbox controller trailer! In celebratory fashion for the release of the latest MCU title 'Deadpool & Wolverine' a brand-new Xbox controller has been designed by none other than Deadpool himself. The one-of-a-kind controller takes design cues from the fourth-wall-breaking hero with red textured stitching, a Deadpool logo, and some cushion in the back for those long gaming sessions. The Deadpool-designed controller is available for one lucky fan to enter for a chance to win via a global sweepstakes alongside other custom Xbox hardware.\n\n#Deadpool #Xbox #Gaming", "id": 881171, "language": null, "link": "https://www.youtube.com/watch?v=iJRXQvAQ44s", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/iJRXQvAQ44s/hqdefault.jpg", "title": "Xbox x Deadpool - Official 'Cheeky Controller' Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T14:00:02+00:00", "description": "When Halle Berry won an Oscar for Monster’s Ball it was an historic night. Less than 2 years later when she won a Razzie for Catwoman it was… well it was something else. Looking at Catwoman 20 years on, it’s hard to see anything other than the messy and confusing DC spin off, but the film of course didn’t set out to be bad. We talked to the face of the film, Halle Berry, along with a handful of the many, MANY writers that took a stab at adapting Catwoman for the big screen to find out just what went wrong, how the studio system is built and what development hell really looks like. This is the Inside Story of a solo Catwoman film that started with Michell Pfeiffer and Tim Burton, and ended over a decade later with Halle Berry on stage, Oscar in hand, accepting a Razzie (and giving an incredible speech, by the way).\n\nInside Stories was produced by Clint Gage and Scott Collura, written by Evan Gaustad and Scott Meslow (yes, just the two of them), edited by Justin Donaldson with graphics ", "id": 881172, "language": null, "link": "https://www.youtube.com/watch?v=2YvMXxtnM3w", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/2YvMXxtnM3w/hqdefault.jpg", "title": "The Night Catwoman Brought Her Oscar To The Razzies | IGN Inside Stories", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T13:00:56+00:00", "description": "Check out the trailer for Barbie Project Friendship, an upcoming adventure game that follows Barbie “Brooklyn” Roberts, Barbie “Malibu” Roberts, and friends as they restore a run-down community center. Explore new areas of the Malibu Waves Community Center, unlock awesome outfits, and take part in a number of fun activities with familiar faces, such as making ice cream with Ken and customizing scooters with Nikki.\n\nBarbie Project Friendship will be released on October 25, 2024 on PS5 (PlayStation 5), Xbox Series X/S, PS4 (PlayStation 4), Xbox One, Nintendo Switch, and PC via Steam and the Microsoft Store.\n\n#Barbie #Gaming #Games", "id": 880694, "language": null, "link": "https://www.youtube.com/watch?v=w0hpnQ7PE5g", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/w0hpnQ7PE5g/hqdefault.jpg", "title": "Barbie Project Friendship - Official Announcement Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T13:00:51+00:00", "description": "Get your first look at Robot Entertainment's just-announced Orcs Must Die! Deathtrap, the latest in the 10-million-unit-selling tower defense series. It promises four-player co-op, roguelite progression, crazier physics-based and destructive traps in bigger environments, and improved third-person combat – all rendered in Unreal Engine 5. It's in development for PC (via Steam and Epic Games Store) and Xbox Series X|S and due out in early 2025.\n\nMusic: \"Art History\"\nWriter/Artist: Chad Jewett and Chelsey Hahn of Perennial", "id": 880695, "language": null, "link": "https://www.youtube.com/watch?v=i2PNXZ_Ea7Y", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/i2PNXZ_Ea7Y/hqdefault.jpg", "title": "Orcs Must Die! Deathtrap - Official Reveal Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T13:00:47+00:00", "description": "Elsa (Megan Northam, in her debut feature starring role), who, along with her family, is struggling following the disappearance of her brother Franck, an astronaut who vanished during his first mission. While stargazing one night, Elsa is shocked to receive contact from Franck, but her joy is short-lived when she learns of the dark and troubling forces behind Franck’s reappearance, forcing her to confront the lengths she will go for the brother she once feared was gone forever. Written and directed by Jérémy Clapin, Metrograph Pictures will release the sci-fi thriller Meanwhile on Earth on September 13.", "id": 880696, "language": null, "link": "https://www.youtube.com/watch?v=luWZENFNxoU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/luWZENFNxoU/hqdefault.jpg", "title": "Meanwhile on Earth - Exclusive Official Trailer (2024) Megan Northam", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T13:00:24+00:00", "description": "Check out the No Man's Sky: Worlds Part 1 trailer for the new No Man's Sky update (version 5.0). No Man's Sky: Worlds Part I completely refreshes the universe and arrives with new creatures and biomes, solar ship crafting, a brand new flamethrower mech, a Starship Troopers-inspired Bug Hunt Expedition, and more.\n\nPlanets are now more varied, with enhanced weather conditions, detailed new cloud and water tech, and atmospherics. Don't miss this new No Man's Sky Worlds Part 1 gameplay for a look at what to expect next in this update for the action-adventure survival game.\n\n#NoMansSky #Gaming #Games", "id": 880697, "language": null, "link": "https://www.youtube.com/watch?v=SsX2hK6yBPU", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/SsX2hK6yBPU/hqdefault.jpg", "title": "No Man's Sky: Worlds Part 1 - Official Trailer", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T13:00:16+00:00", "description": "No Man's Sky creator Sean Murray explains everything new in No Man's Sky: Worlds Part 1, including new worlds, new weather, new creatures, a Starship Troopers-inspired expedition and more. Check out this new No Man's Sky update 2024 deep dive for a closer look at NMS Worlds Part I.\n\n#NoMansSky #Gaming #Games", "id": 880698, "language": null, "link": "https://www.youtube.com/watch?v=K2LQbhVLzIo", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i4.ytimg.com/vi/K2LQbhVLzIo/hqdefault.jpg", "title": "Sean Murray Explains No Man's Sky: Worlds Part 1", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T11:56:56+00:00", "description": "Star Wars Outlaws is this month’s IGN First and we’ve got a full mission of exclusive new Star Wars Outlaws gameplay to show you! Set on the classic desert planet of Tatooine, this expert mission takes Kay on a journey involving a Jawa and a Sarlacc pit as she journeys from the sand to the stars. Join us on July 17 at 9am PT/ 12pm ET/ 5pm BST/ July 18 at 2am AEST to check it out.\n\nExcited to learn more about Star Wars Outlaws? Catch up on our video exploring how Massive brought the cinematic spectacle of Star Wars to an “open galaxy” setting: https://www.youtube.com/watch?v=U6nCdIslajQ  \nMeet the game’s crime syndicates: https://www.youtube.com/watch?v=QGEx_BvhOVQ  \n\nStick with IGN throughout the rest of July as we’ll have more exclusive Star Wars Outlaws gameplay and behind-the-scenes looks. The Star Wars Outlaws release date is August 30, 2024 for PS5 (PlayStation 5), Xbox, and PC.\n\n#StarWars #StarWarsOutlaws #Gaming", "id": 880358, "language": null, "link": "https://www.youtube.com/watch?v=U-M1Lu6iVhg", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/U-M1Lu6iVhg/hqdefault.jpg", "title": "Star Wars Outlaws: 10 Minutes of Exclusive Gameplay - IGN First", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T01:18:41+00:00", "description": "", "id": 877893, "language": null, "link": "https://www.youtube.com/watch?v=XkAEwF2EI_U", "manual_status_code": 0, "page_rating": 26, "page_rating_contents": 82, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/XkAEwF2EI_U/hqdefault.jpg", "title": "The 4 Syndicates in Star Wars Outlaws! #starwars #outlaws #syndicate #starwarsoutlaws #ps5 #xbox #pc", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T00:41:24+00:00", "description": "", "id": 877894, "language": null, "link": "https://www.youtube.com/watch?v=JfWWZ5qcYtI", "manual_status_code": 0, "page_rating": 26, "page_rating_contents": 82, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCKy1dAqELo0zrOtPkf0eTMw", "source_obj__id": 149, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/JfWWZ5qcYtI/hqdefault.jpg", "title": "Who is playing Lady Deadpool & Cowboy Deadpool?! #marvel #teaser #mcu #deadpoolandwolverine #cameo", "user": null, "vote": 0}]