[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T13:00:44+00:00", "description": "ACCU Membership: https://tinyurl.com/ydnfkcyn\n---\n\nWork-Work Balance - Organisational Culture Matters - Will Woods - ACCU 2024\n---\n\nThe presentation will cover what organisational culture is, and its role in staff motivation and job satisfaction, exploring how it can either enhance or impede productivity and what makes it so important.\n\nIn any workplace, culture has a huge impact on people and how they work, but especially in software engineering, where the pressure to work long hours, the risk of burnout, and always reacting to problems can really change how employees feel and perform. Addressing this, the talk will cover, why a positive culture is important for the workplace, the impact that negative and positive cultures have on us at work, how we can work towards creating a positive culture, and ways that organisational cultures can be assessed.\n\nSlides: https://accu.org/conf-previous/accu2024/\nSponsored By think-cell\n---\n\nWill Woods\n\nWill is a Software Engineering student, but fo", "id": 881036, "language": null, "link": "https://www.youtube.com/watch?v=eJv0touFMgg", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJhay24LTpO1s4bIZxuIqKw", "source_obj__id": 421, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/eJv0touFMgg/hqdefault.jpg", "title": "Work-Work Balance - Organisational Culture Matters - Will Woods - ACCU 2024", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T12:30:25+00:00", "description": "ACCU Membership: https://tinyurl.com/ydnfkcyn\n---\n\nThe Fight for Right to Repair: From Seed to Sabotage - Joshua Webster - ACCU 2024\n---\n\nJoin us as we delve into the multifaceted issue of Right to Repair within the realm of software engineering. Right to Repair and its associated issues raise several legal, ethical, and practical questions about who truly owns and controls the technology we rely on in our day to day lives. We'll explore the challenges faced by individuals and businesses, specifically farmers, who more often than not find themselves locked out of repairing their own equipment due to the arbitrary software restrictions put in place by manufacturers. Software engineers have the skills to try and overcome these hurdles and are key figures in the Right to Repair movement – they have the potential to develop tools and solutions that allow users to fix the devices they own. Discover the legal battles between innovation and monopolistic control, and why a collaborative appro", "id": 881037, "language": null, "link": "https://www.youtube.com/watch?v=Znttrm2QQOA", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJhay24LTpO1s4bIZxuIqKw", "source_obj__id": 421, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/Znttrm2QQOA/hqdefault.jpg", "title": "The Fight for Right to Repair: From Seed to Sabotage - Joshua Webster - ACCU 2024", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-07-17T12:01:07+00:00", "description": "ACCU Membership: https://tinyurl.com/ydnfkcyn\n---\n\nNASA Apollo 11: To the Moon and Back With 4KB of RAM - Adam Smart - ACCU 2024\n---\n\nIn 1969 humankind did the unthinkable. We took our first steps on a celestial body other than our own, but to get to the moon and back you need a guidance system. Enter the Apollo Guidance Computer (AGC). What’s the catch? Well for a start in the 1960s computers were the size of a large room and had the computing power of a pocket calculator. How did NASA create one of the smallest and lightest computers ever made for the time? How did NASA develop the first set of software engineering principles? How did NASA’s Display and Keyboard Unit (DSKY) influence the future of human-computer interaction systems? In this talk we’ll discuss the challenges and solutions of guiding a spacecraft to the moon and back in the 1960s. We’ll also discuss the legacy of the Apollo Guidance Computer and how it influenced modern software development.\n\nSlides: https://accu.org/", "id": 881038, "language": null, "link": "https://www.youtube.com/watch?v=xxxB4sW8RYg", "manual_status_code": 0, "page_rating": 27, "page_rating_contents": 86, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCJhay24LTpO1s4bIZxuIqKw", "source_obj__id": 421, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/xxxB4sW8RYg/hqdefault.jpg", "title": "NASA Apollo 11: To the Moon and Back With 4KB of RAM - Adam Smart - ACCU 2024", "user": null, "vote": 0}]