[{"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-31T18:30:11+00:00", "description": "State of Play and Silent Hill Transmission are finally behind us, but the Summer of gaming is only getting started. There are still plenty of world premieres, big announcements and gameplay deep dives to look forward to from major game developers. \n\nHowever, there are also the rumored titles which are potentially much farther off and which we won't see for a while yet. Some have been reported on by various publications, while others have been cooking in the background for years, awaiting the right time for an announcement. \n\nNevertheless, all of them warrant some level of excitement and anticipation. Check out our picks for the 15 most exciting, rumored games.", "language": null, "link": "https://www.youtube.com/watch?v=MGEXdTrCT-g", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i2.ytimg.com/vi/MGEXdTrCT-g/hqdefault.jpg", "title": "15 BIGGEST Rumored Games We're Super Excited To See", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-31T15:30:19+00:00", "description": "Since announcing it in October of 2022, Konami has been awfully quiet about the Silent Hill 2 remake, and as time has gone on, with that silence stretching on, fans’ anxiousness to hear more about the game has only grown more intense. \n\nAfter multiple recent weeks, at long last, Konami recently finally broke its long silence, showcasing a new trailer of the Bloober Team-developed remake, and accompanying it with a host of new gameplay footage, details, and more, as well as a release date announcement. \n\nAfter what felt like an eternity of no details, we now suddenly have an abrupt barrage of them, so here, we are going to sift through all of them and go over the key points that you should know about the Silent Hill 2 remake.", "language": null, "link": "https://www.youtube.com/watch?v=nCY7tJ6LTf8", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i3.ytimg.com/vi/nCY7tJ6LTf8/hqdefault.jpg", "title": "Silent Hill 2 Remake - 10 NEW Things You NEED TO KNOW", "user": null, "vote": 0}, {"age": null, "album": "", "artist": null, "bookmarked": false, "comments": [], "date_published": "2024-05-31T03:45:01+00:00", "description": "At the latest PlayStation State of Play, Sony showcased a number of games that will be released for the PS5 in the future. These include the likes of Concord, Silent Hill 2 Remake, Until Dawn, Where Winds Meet along with some surprises such as Astro Bot and Dynasty Warriors Origins. \n\nLet's take a look at the 14 biggest announcements that happened at State of Play 2024.", "language": null, "link": "https://www.youtube.com/watch?v=8ZdHaswBl-8", "manual_status_code": 0, "page_rating": 32, "page_rating_contents": 100, "page_rating_visits": 0, "page_rating_votes": 0, "permanent": false, "source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCXa_bzvv7Oo1glaW9FldDhQ", "source_obj__id": 129, "status_code": 0, "tags": [], "thumbnail": "https://i1.ytimg.com/vi/8ZdHaswBl-8/hqdefault.jpg", "title": "14 NEW PS5 State of Play Game Announcements 2024", "user": null, "vote": 0}]